{
    "0": "It's a biopic of the relationship between Priscilla Beaulieu and Elvis Presley between 1959 and 1972 in West Germany, Memphis, Tennessee, Las Vegas, and California.In 1959, Priscilla (Cailee Spaeny) is the 14-year-old daughter of Ann (Dagmara Dominczyk) and her stepfather, Paul (Ari Cohen), a career military man. The family has recently been posted in West Germany, and Priscilla is lonely. 24-year-old Elvis Presley (Jacob Elordi) is serving his military time in Germany. His friend, Terry West (Luke Humphrey), notices Priscilla in a restaurant and asks if she wants to meet Elvis. Of course, she does, and her parents reluctantly allow them to meet.Elvis appears to fall for Priscilla, and they date for about six months until Elvis's tour of duty is complete, and he returns to the United States to resume his career. Three years later, in 1963, Elvis reconnects with Priscilla and invites her for a visit to Graceland. Her parents reluctantly agree. The film then follows the evolution of their relationship, including the fact that they lived together almost immediately, even as she was finishing grade 12 at a Catholic school. They finally marry in 1967, but the relationship continues downhill almost immediately.There are no good guys in this movie. Priscilla is the victim of a significant power imbalance; her primary role is to encourage the insecure ego of Elvis, who constantly needs to be surrounded by an entourage of fawning sycophants, and who introduces 17-year-old Priscilla to drugs on her first visit to Elvis in 1963. On the other hand, the movie portrays little genuine chemistry between Elvis and Priscilla except for pointless entertainment. They proclaim love for each other, but there never seems to be any depth to the relationship. And the music that shaped Elvis Presley is almost entirely absent.Cailee Spaeny does an excellent job with a mediocre story. Jacob Elordi mumbled enough to miss some of the dialogue. No one else has a personality.",
    "1": "Wow, this was an uncomfortable movie to watch. Priscilla invites inevitable comparisons to last year's \"Elvis,\" portraying an exact opposite narrative. Helmed by the talented Sophia Coppola, who commands great respect, and featuring Jacob Elordi, an actor I admire, the film falls short of expectations. Unfortunately, it presents a one-dimensional, flat perspective that left me somewhat disappointed.While the performances are strong, and the direction commendable, Priscilla's narrative feels tedious and slow at times. The harrowing depiction of power imbalances in the central relationship adds a layer of discomfort that makes the film hard to watch. Sophia Coppola's artistic choices unveil a side of the characters that, while impactful, renders the viewing experience challenging. Priscilla sheds light on the vulnerability of a young protagonist, emphasizing the discomfort of witnessing a story where she is just a child.",
    "2": "Discussing the loss of some brain cells while watching the film \"Priscilla\" is quite an accurate description. I had initially been eager to watch it due to my affinity for period pieces, especially those that depict real historical figures. However, this film proved to be an exercise in complete frustration within the first 15 minutes. It began with an excruciatingly slow pace, followed by a moody atmosphere that failed to captivate in a compelling manner. To make matters worse, it rapidly devolved into an incomprehensible and unpleasant production that relied on numerous quick cuts with reckless abandon.\"Priscilla\" made the unfortunate decision to hop between different time periods without delving into any of the characters in a meaningful way. None of them received the development they deserved, including the title character, Priscilla. What was particularly glaring was Sophia Coppola, who directed and wrote the script. Her portrayal of Elvis was nothing short of brutal, depicting him as a mumbling, shy individual with multiple personalities, a serial cheater, bad-tempered, controlling, sexually dysfunctional, stunted in his emotional development, and plagued by a Madonna Complex.No wonder right before she passed away, Lisa Marie Presley hated everything about this script and also thought that it was akin to being a hatchet-job. I'm beginning to have some questions about Priscilla Pressley. She's been involved in too many controversies regarding her daughter, grand-daughter, Elvis and that estate. Just sayin'.First and foremost, it's hard to fathom how a parent could permit a 14-year-old to associate with, and secretly date, a man 10 years older. Even more bewildering is the decision to let her relocate back to the United States, considering her father was stationed in Germany at the time, and reside at his estate. The only explanation that seems plausible is the overpowering influence of money. Given Elvis's wealth and fame, it appears that these factors overshadowed any morality her parents may have had.The film portrays Priscilla as a pampered and privileged young girl, essentially held captive within the opulent confines of Graceland. In one scene, she expresses her desire to secure a job while attending school, telling Elvis it would be fun. However, Elvis dismisses this idea by presenting her with an ultimatum: him or a career, all while he's away filming and allegedly screwing his leading ladies.Do any of us know if all of this is completely true...no, except the fact that her parents did hand her over to Elvis while she was underage. What we also know is that a child shouldn't be living with an adult man like this, and scenes like the one I described, without any context before enduring yet another quick cut time jump, is one of the many things that made this film extremely unbearable.Also, Coppola rushing through years of multiple betrayals, sadness and pleasure at a breakneck pace, made the film feel as if she was trying to check all of the boxes on her ridiculous timeline, rather than fully immersing us in Priscilla's early life and experiences with Elvis.Now let's get to the casting. Jacob Elordi as Elvis didn't strike me as authentic. There wasn't enough suspension of disbelief in the world to buy him as the titular 50s/60s heartthrob. The difference between his Elvis and Austin Butler's Elvis is simple: Elordi played Elvis and Butler became Elvis. That's what made Butler's portrayal more believable and real. Cailee Spaeny as Priscilla Presley was serviceable, though a bit stiff. She had 2 expressions in this film...wide-eyed, young and naive and sullen. That was about it. Even when it cut to her leaving Elvis after his Vegas show, there was nothing for the audience to get excited about. And by no means are either of these performances award-worthy, no matter what the Hollywood PR machine is spinning.In case you might be thinking about Col. Tom Parker, he never appeared in this film. You just heard Elvis on the phone with him. Even Priscilla's parents were in it sporadically. Elvis' mother was already dead and his father popped in and out with his now wife or girlfriend, that too wasn't fully explained. His grandmother, Black housekeeper and his so-called \"memphis mafia\" were seen here and there.\"Priscilla\" is a torturous, monotonous and melancholy story surrounding the relationship between Priscilla and Elvis....nothing more than that. It had the potential to be a seering and engrossing film because all of the elements were there, but the ball was badly dropped and much to this film's detriment, no one took the time to find it.I usually like Sophia Coppola's films, with the exception of that abysmal \"The Beguiled\", and I'm sure I'll end up in the minority with my take about this film, but none of it worked for me. From the beginning to the end, I kept wondering what in the Hell am I watching???",
    "3": "\"Maybe in another place, another time.\"Sofia Coppola's most recent film \"Priscilla\" sort of reminded me of Pablo Larrain's 2021 film \"Spencer\", which is an in-depth character study of the late Princess Diana. In fact, Elvis and Priscilla's marriage can be compared to Princess Diana's ill-fated marriage to Prince Charles. Princess Diana and Priscilla were both forced into royalty and had husbands who were absent in their lives. Priscilla's love for Elvis was never fully reciprocated, especially during the later years of their marriage. Elvis led a life of a rock and roll star filled with debauchery. At the beginning, his relationship with Priscilla was sweet and innocent, but later turned out to be uneasy and abusive. Priscilla had to abide to Elvis' regimen and needed to be at his beck and call whenever he wanted. She had little to no autonomy, which was one of the reasons her marriage to Elvis eventually fell apart. Unlike Princess Diana and Prince Charles, Elvis and Priscilla's relationship wasn't doomed from the start. At least, Elvis had true feelings for Priscilla, while Prince Charles was in love with someone else.After countless documentaries and feature films about Elvis Presley, Priscilla finally gets her time in the spotlight. The movie premiered at the Venice Film Festival in September and was released a little over a year after Baz Luhrmann's biopic of Elvis Presley. Unlike the 2022 adaptation, Sofia Coppola's film is told entirely from the point of view of Priscilla. It is based on Priscilla Presley's 1985 memoir \"Elvis and Me\". The film tells the heartwarming yet heartbreaking story of Priscilla's marriage to Elvis Presley with delicacy and the utmost sensitivity. Its lush cinematography, exquisite production- and costume design, retro soundtrack, and a beguiling Cailee Spaeny as Priscilla Presley makes the film worth a watch.*The inclusion of the late 1960s song \"Crimson and Clover\" by Tommy James & The Shondells and the early 1970s song \"I will always love you\" by the incomparable Whitney Houston was a nice touch and fit the overall mood of the film.Final verdict: 9.6/10.",
    "4": "Okay, we get it. Elvis was an immature guy with mommy issues, who lacked the real confidence everyone assumed he would have, and abused drugs. It's been 50 years of this. Not interesting.This is a grim, drab, one dimensional movie that offers nothing new to the Elvis/Elvis and Priscilla story. The actress playing Priscilla doesn't change one bit and in the last scene of the movie - a horrendous ending BTW - she still seems like the 14 year old girl at the start of the movie. Her and 'Elvis' seem like 2 kids in costumes playing grown ups rather than actors playing roles.There is not one character with any depth in the entire picture. This might as well have been filmed with just the 2 leads surrounded by cardboard cutouts. The fact that Priscilla cooperated with the production of this movie doesn't speak well about her.People in the media and movie makers should have this much energy looking into and tearing down people in our society that have real impact, like politicians, business leaders and religious leaders. Who really is shocked when a singer or actor is a bad person or a substance abuser? Who cares?Skip this movie.",
    "5": "As a lifelong Elvis fan, and have read many books, including Priscilla's things that had been named factual from many sources, or either overdramatized and exaggerated, or completely fictionalized. Also, the actor playing Elvis stood 6'5 and was as thin as a rail. And the wig he wore, didn't look right. So it was really hard to be involved in the story when playing such an iconic character didn't look believable. The actress that played Priscilla did a nice job, but the movie fell flat and didn't really have much of an ending, or finish the real life story.Certain things that were well known to be factual or left out. For example, Elvis did not smoke cigars every second of every day, including in his wedding. It was just hard to be believable. The recent Elvis movie with Austin Butler was so much better..",
    "6": "Definitely one of the worst films I've seen in a while. Absolutely atrocious casting. Elvis was so bad. Too skinny, too annoying. Priscilla constantly lacks any personality what so ever and looks about 12. Which in itself is very hard to watchThe script is so juvenile and not interesting on any level. The whole film is so unbelievableAlso, who thought it would be a great idea to add contemporary music, I mean that Spectrum / Spacemam 3 track is immense but doesn't belong in a movie about the 50's and early 60's.This film is a total mess.Quoits a people walked out, I almost did but wanted to see if Elvis actually put on any weight and tbe answer was no.",
    "7": "Though intrigued by the trailers and concepts for Priscilla, I was initially a little worried about the potential for high-handedness in the storytelling. Fortunately, my concerns were immediately allayed, as director Sofia Coppola crafts what I considered to be a very fair portrayal of all involved. If anything, the drama is a bit underplayed here.For a very basic overview, Priscilla tells the story of its titular character (played by Cailee Spaeny) meeting Elvis Presley (Jacob Elordi) while both are in Germany for military reasons--Elvis enlisted; Priscilla the daughter of a military man. At 14 years old (9th grade), Priscilla begins a whirlwind romance with the most renowned pop culture figure of the times. Initially exciting and seemingly full of potential, the relationship quickly turns sour when Elvis has more time for films, dalliances with other actresses, a quick temper, and fringe philosophical studies than he does for family.It would have been so easy for Priscilla to turn into little more than an \"Elvis was an abusive boyfriend/husband who preyed upon an underage girl\" movie, but Coppola does not take that route whatsoever. While those themes are certainly examined, they are never heavy-handed or overshadow the details of what is transpiring. There is much intrigue contemplating the weird romance (probably the hallmark of the film overall) and Elvis himself comes off more like a really strange weirdo than anything too over-the-top. I really appreciate this tack.That being said, ironically the reason I can't go any higher on rating Priscilla is because if anything it underplays the underpinning relationship of the whole piece. In the end, it is little more than \"woman leaves bad relationship with weirdo husband\", as nothing truly dramatic (short of an Elvis chair throw here or pathetic \"take me back\" monologue there) ever really transpires.I do think that Priscilla could take home some major hardware come awards season in Hollywood. It should factor prominently in the hair, makeup, costuming, and set design (it is an extraordinary period piece) categories, and I think Spaeny should get at least some consideration in the acting category.Truth be told, I liked this movie more than Baz Luhrmann's 2022 Elvis flick. Though both that one and Priscilla are trying to accomplish wildly different goals, I felt this one to be more coherent even if lacking in some of the pizzazz of the Austin Butler spectacle.",
    "8": "I love Priscilla. This movie is masterfully directed by Sofia Coppola. There are beautiful shots, excellent cinematography, impactful music choices, and unique editing techniques. The hair and makeup team were on another level in this movie. They make Cailee Spaeny look both 14 and 30, which is very impressive. The performances here are just fantastic. Cailee Spaeny gives an Oscar worthy portrayal of Priscilla Presley and Jacob Elordi did a great job showing us another side to Elvis. I think it's really interesting to watch this and last year's Elvis movie to see a lot of the same story beats from both the perspectives of Elvis and Priscilla. Elvis was a victim of the Hollywood machine and we get to see someone who is so desperate for love and connection. Even though he knows that he's wrong he pursues a relationship with Priscilla and we get to see her journey of self realization and self love. I thought this was an extremely interesting and informative take on one of history's most iconic couples. I highly recommend this movie. 9/10.",
    "9": "I'm still trying to quantify my disappointment. Let's start with the casting of a 6'5\" Elordi and 5'1\" Spaeny. Deliberately jarring and a distraction throughout. This is a snoozer with no depth, no story, no chemistry and no reason to keep watching. There was no arc or character development, just a series of tedious, choppy scenes and an abrupt, unsatisfying ending. Nothing new here. Let's not forget that her book has already had a moment on film. It turns out that once was more than enough. Seriously...why this? Why now? And for all of the Coppola hype, this is a dark, sad and forgettable waste of time and money. Don't waste yours. Some walked out. Wishing I would have.",
    "10": "I know Priscilla really wanted a movie about herself which is funny since a few years ago she was awarded something and she said she didn't know why as she didn't do anything.I realize they were in a different era and Priscilla says her and Elvis didn't make love until after they married, but folks legacies have been destroyed for less. Kinda ironic that Elvis was trying to impress Priscilla with a jerry lee Lewis song when they first met. This movie is boring and depressing. Jacob Elordi mumbles and stutters too much and he seemed like an Elvis parody. Priscilla seemed way too calm when Elvis (according to her) was making her angry by his alleged cheating and throwing things at her. I wish this film would have added to the scene where Pris was obviously interested in her karate instructor.I wouldn't pay money to see this film and I'm sure it will be on Tubi in a few months.",
    "11": "Priscilla is from her side, from her perspective, so it switches between times of quiet shyness and awkwardness to scenes of a lavish fun dream life. Anyone could see how it would be very easy to get carried away in the situation she found herself in. Visually the film was very dreamy and beautiful, I love the little clips and montages of fun nights out, reminded me of Goodfellas or Casino, and I was more than happy to watch Priscilla change amazing outfits like 100 times. Also relieved to report Jacob Elordi was a very convincing Elvis, not corny at all and nailed the voice. Also I loooved the choice to not use the real Elvis's face on records and merch in the movie, it all had Jacob Elordi as Elvis on it, it was such a charming detail and keeps you more in the world of the movie. Really fresh fun soundtrack too. I would say Priscilla is another recent example of a movie that's made like specifically for women, so men/male critics will friggin haaaate it. Like men really can't consider for a second that some things just literally aren't FOR them.",
    "12": "I saw Priscilla, starring Cailee Spaeny-Bad Times at the El Royale, Pacific Rim: Uprising; Jacob Elordi-Euphoria_tv, the Kissing Booth movies; Ari Cohen-the It movies, Molly's Game and Tim Post-Nightmare Alley_2021, X_Men: Days of Future Past.This is an Elvis movie told from Priscilla's perspective. It's based on her book Elvis and Me and it covers the years from when she met Elvis at the age of 14 in 1959 until their divorce in 1973. Cailee plays Priscilla and Jacob plays Elvis. Cailee first meets Jacob at a party when he is stationed in Germany. He was in the military and her father was stationed there. Ari plays her father. Jacob started dating Cailee after getting Ari's permission. Her parents were a little surprised by the 10 year difference in their ages but Jacob assured them he had good intentions. It covers their relationship as Cailee moves into Graceland at the age of 17 and their marriage in 1967. Tim plays Vernon Presley. All the insecurities are covered with Jacob making movies and his assumed affairs with his co_stars, her indiscretions are touched on and the movie ends on their eventual divorce in 1973. FYI: They couldn't get permission from the Presley Estate to use any Elvis songs in the movie but there is music from other performers covering those years.It's rated R for language, drug use and sexual content-no nudity-and has a running time of 1 hour & 53 minutes.If you are an Elvis fan, you might enjoy seeing the story from Priscilla's viewpoint and it would be a good one to stream.",
    "13": "Ok I've read a few reviews and have to respond. This is a subtle gentle film and I loved it. Yes, the heights of the main actors were different from the real humans portrayed and that was a creative artistic license choice. Suspend disbelief and live with it. Cailee Spaeny deserves an Oscar because every scene she delivered was heartfelt, honest, passionate, and filled with pure conviction. I had a couple minor issues with Jacob Elordi's performance as Elvis but thought he was great overall. And this is my second favorite of all of Sofia Coppola's films next to Lost In Translation. She is a force.",
    "14": "Same old boring story trying to keep Priscilla relevant. How many times can this be told??? We all get it, she married extremely young, has been in abusive relationships over and over and that's it. Starts slow and only gets slower. To much emphasis on trying to make Priscilla into a heroine. One thing you can say, she has milked every opportunity to make money. 45 minutes in and you're thinking this is deja-vu of all other violin string depictions. It is so old. The Elvis part of her life is a short blip in her nearly 80 years. Yet, still after all this time it's the only part she focuses on. Sad living in the past saga.",
    "15": "**SPOILERS** Expected more out of this movie. While it depicted Elvis as accurately as they probably could have, this movie lacked substance. In interviews I have seen Elvis in, I don't think he stuttered quite as much as they had him do in this movie. Jacob did a decent job, but he is by far the worst Elvis I have seen to date. Cailee did a great job, but didn't have much of a dialogue. I feel like any woman in this situation, would not have been as calm as they showed Priscilla to be. While I have read that Elvis was awful in real life, I don't see any woman would back down like they showed Priscilla to do. This movie left me feeling unsatisfied. It was boring and felt really no good conversations between the two characters or any characters for that matter. It showed Priscilla alone most of the time, which also was probably accurate, but so many scenes of her moving around the same room was a bit much. Literally just boring. The way this movie ended was awful. I would have liked to see how she reacted to his death and also how they interacted after the divorce. I expected more, especially considering who the director is. Just overall disappointing.",
    "16": "Although this movie is directed well by Sofia Coppola, the movie is written by a smart 3 year old who conveniently can write a script. It's terrible and the same bedroom scene about 9 times. It's sooo bad and I should have left the theater and I could have written a better movie and I don't even write that well. It's directed well but the script is a catastrophe. Elvis is portrayed as a bad guy and Pricilla is the most unlikable character ever. She sucks and is annoying but is also whining always and is super duper ultra acted out by a terrible actor. Please change this movie. It had potential but excited terribly.",
    "17": "I can't help comparing Sofia Coppola's PRISCILLA to last year's Baz Luhrmann epic, ELVIS. Whereas Luhrmann portrayed the King of Rock 'n' Roll as a larger-than-life, godlike figure, PRSCILLA serves him up as an emotionally insecure man-child with serious anger and control issues. I find Coppola's portrayal much more believable.ELVIS skirted a major issue: that when he and Priscilla me, he was grown man of 24 while she was a naive, impressionable child of 14. He must have been charming as hell to convince her parents to let her keep time with him, let alone move across the ocean to Graceland while she was still in high school!PRISCILLA explores that avenue in great--even harrowing--detail. Even though a decade separated them physically, his emotional maturity was no greater than hers. The stress of living with Elvis became so great, Priscilla took to popping pills along with him--and not one member of the man's sycophantic retinue thought to question it.In the film, Elvis is a good 18 inches taller than Priscilla. He towers over her the entire time, and not just physically. The real-life Elvis was indeed taller than his wife, but not by that much! So I'm guessing Coppola intended the height difference symbolically. If so, it worked.The acting is uniformly strong. Cailee Spaeny shows us a Priscilla who grows up from a doe-eyed kid into a confident, self-sufficient woman who finally works up the courage to end her suffocating marriage.Meanwhile, Jacob Elordi looks even more like Elvis than Austin Butler did. He delves so deeply into the character, I often forgot that I was seeing an actor play a part. Elordi's performance is every bit as strong as Butler's was. I wonder if he, too, will receive an Oscar nomination?Coincidentally, I read Priscilla's memoir, \"Elvis and Me,\" just last year. Based on my recall, this film is a pretty faithful adaptation of the book. However, unlike the book, it ends abruptly when she leaves him. I initially found it jarring; but in retrospect, the film ended exactly when it should have. There was no need to show the Presleys' divorce and subsequent friendship, let alone the man's premature death at age 42.If you're an Elvis worshipper, PRISCILLA's anything-but-reverent portrayal of the man could very well anger you. But if, like me, you're more of a reality-based Elvis fan, you might respect the film as much as I do.",
    "18": "It's an interesting story. Too bad it basically exhausts itself in one hour and leaves a viewer with an additional hour of the same repetitive torture.I mean, we got it. Elvis is toxic and abusive. Priscilla is a tragic victim living in a golden cage. Rich guy bought himself a toy-wife. That is the only theme of this movie and it was told loud and clear in, like, first 50 minutes.Don't get me wrong, it really is an interesting point of view on the Elvis mythos. Both Elvis and Priscilla are portrayed as pretty shallow human beings, but as characters they have real depth. That's cool. But it feels like one simple joke repeated again and again. And again. And again.And then the punchline falls absolutely flat.",
    "19": "What I can't understand is why they would hire an actor who's 6'5\" to play Elvis, when, in reality, he was 6 feet tall. Then they hire an actress who is 5'1\" to portray a living person who is 5'4\" tall. They look ridiculous next to each other! It's hard to equate that to our perception of Elvis and Priscilla. All I can think of is the casting was to assist with the portrayal of Elvis as an adult man and Priscilla being a young girl. The difference in their heights is distracting from what could've been a good story. Sofia Coppola is a talented director, but I think she missed the boat here. I'm disappointing because both my husband and I are huge Elvis fans.",
    "20": "This was the worst movie I saw this year. Shabbily thrown together little short vignettes aimed specifically to take pot shots at Elvis. The lead stars were not even compelling or believable. In real life, both people were stunningly gorgeous, but for some reason, these two unknown headliners were average in the looks department. The movie seemed hastily thrown together like a low budget B movie or spaghetti western. There was not plot or character development. Frankly, I almost fell asleep because the dialogue was insipid and predictable. The real question I have about this film is why? Why was it even made? Is Pricilla angry at her late - daughter and grand daughter for casting her aside within the Elvis empire? All in all, save your money, it stunk.",
    "21": "A terribly slow and boring movie. If this was their love story, I'm not surprised it ended so quickly. Priscilla wanders Graceland without soul or character. Elvis is only shown for his moments of intemperance. Could he have been just that? I hardly doubt, otherwise she wouldn't have married him. I found this movie useless, lacking in depth, cheap, with an unconvincing cast (especially Elordi who barely resembles Elvis) and a desire to exploit Elvis' name to make money from it showing mostly his dark side on purpose, than telling the real story between them. Apart from the parts with Elvis as the protagonist of the scenes, this film is completely flat. I am surprised by the judgment of some critics. I believe that Sofia Coppola chose the wrong subject, hoping to ride the wave of giving life to a female character who perhaps hadn't so much to say. And not Elvis' music in it....it says a lot. Skip it and save your money.",
    "22": "Really had a hard time with this movie which was probably Sophia Coppola's point. I wanted to like it. I was hoping it'd be like Marie Antoinette, but no amount of fun punk music could help this tragedy of a story.It was painful in so many places, watching this 14 year old girl (14!!!) crush hard on Elvis and him using her awe of him to make her his perfect wife. Seriously freaky. And abusive. And I suspect many Elvis fans will be upset that their guy was actually an abusive A-hole. It was really heartbreaking to watch this young girl go from being filled with innocence to being completely controlled by her husband, so much so that (SPOILER), when he tells her he needs to take a break from the marriage while she's happily decorating the nursery at full pregnancy, she numbly starts to pack her suitcase to leave. It's BIZARRE.While the actors were excellent, and the costuming and attention to detail for the period were quite good, I don't think I'd recommend this movie unless you want to live through someone else's heartbreak and abuse.It was a bummer.",
    "23": "It was ok. I had a hard time with the way the actors looked. The real Elvis and Priscilla were each unusually stunning. Actors portraying them are attractive... but to really capture the genuine essence of the true story...for me, actors should have been as stunning as the real people. Also Elvis 5' 11\" Priscilla 5' 4\"...Elvis actor 6' 5\" Priscilla 5' 1\"... just came across as peculiar.The acting was stellar, the story was...well it was Priscilla's story, and I believe, certainly worth telling. The actress playing Priscilla was superb, but I had a hard time getting past her diminutive stature, especially against a 6' 5\" Elvis...I felt like the movie was worth seeing, but felt like it was missing something. Left me feeling like I wanted more..more emotion, more details, more of the story.I prefer the 1988 TV \"Elvis & Me\".",
    "24": "Terrible, terrible, terrible!I Read the book many years ago and again a few months ago. Priscilla has changed her stories so many times from past interviews to current; you don't know what is fake or reality anymore! She is not a widow but an Ex who's pocketing on the image of her deceased ex husband! The movie was dull and nothing like the Bio Pic with Austin Butler! Waist of money to watch. I went in there very optimistic based on the director but Lisa Marie was right about this movie... she send a letter to Sofia trying to stop the production, Humiliating to her father and the story is missing parts! The acting was mediocre and the height difference was beyond bizarre! Priscilla should have stay on the shelves as a book not a movie. Smart to release the movie when there is a strike going on and there is not enough quality movies to watch which this makes them one of them.",
    "25": "The ambiance of the cinematography was grand but just~ the story was quite dull. The actors were wonderful but there wasn't much action. I felt like I was watching a possible music video. THIS elvis seemed more natural and not so forced with Hollywood acting. I loved Dodger actress. I think the only incident is that it was one vibe and one vibe only: lonely.A lonely girl in her teens gets in the mix of Elvis and is in the golden cage that is Graceland. The story didn't sugar coat Elvis's side and even~ his dad.I felt this story was close to home for myself as being stuck in a cage while being neglected from needs and desires. Like a fish in a fish bowl, all for show but no freedom. So I can give points to relatability.It was a soft core of cutting the edges of what the relationship was like. It gave mostly all the moments of neglect and nothing in between~ her being bored and just waiting on the couch, doing her homework while loud banter arises as she studies, being verbally assaulted and random bursts of rage from the king when she doesn't see eye to eye with him. It feels like she didn't marry out of love. Makes me wonder~ why did sue even marry him?",
    "26": "Atrociously bad. Based off a book Priscilla herself said was inaccurate and full of lies. Best described as a biopic of lies with sprinkles of truth. Surprised they didn't lie about elvis' name really being neil or something like that.Makes it worse that Elvis isn't even here to tell his side of the story. Instead we have an onslaught on young, nonsensical, lying young people who no nothing about Elvis spreading \"truths\". It's even funnier that the Elvis film didn't have to tear down Priscilla but this one does.Would love to see her address the internets opinions and statements on her late ex-husband. Not that she will... or that she even cares.Poor Elvis, rip.",
    "27": "The great Sofia Coppola delivers another gem, which is just perfect for any film, and music fan.The Elvis film from last year, ever acclaimed, and by the incredible Baz Luhrman, was indeed an incredible drama - yet very romanticised compared to this haunting depiction. The actors all do an incredible job, truly breathtaking, for sure. Very career defining, which is saying a lot, given that these actors already have rather promising and great careers. This depiction of Elvis is very nuanced, abusive, yet loving, disturbed, yet smooth. It is a very human and real picture, like no other. The role of Priscilla is, of course, incredible, very Oscar worthy. Both of them are very much so.The cinematography, cutting and editing is stellar, as per usual with Coppola - and it is all around very beautifully put together.Overall, definitely an incredible drama, one of the best of the year for sure, and very much deserving of all the praise and acclaim it has gotten. Just don't expect too much Elvis music in it, though there is some. This is about the human drama first and foremost. Highly recommended for any lover of film, and fans of Elvis, and Coppola of course!",
    "28": "Insane. This was WAY more than the film I thought it was going to be, and is probably one of the most intense of the year. Cailee Spaeny killed it, and is personally my pick for Best Actress of the 2024 Oscars. Jacob Elordu has managed to outdo every horror villain in years with his bipolar, unhinged performance as Elvis. This honestly just really goes deep into the behind-the-scenes not just in Elvis', but a lot of lives that celebrities/artists that we love that are just despicable people in reality. Honestly one of this year's best, most in-depth look into a life, and just one of the best films in general. I can also definitely see why the Elvis estate didn't want this to be made but hey, truth comes out eventually.",
    "29": "Movie was very boring. Actress had no change in emotion and was very monotone throughout the whole movie. Jacob basically mumbled throughout the whole film, and the only thing that could be heard from him was \"daddy\" and \"little one\".The movie is flat as the come. No emotions, fake and flat. It's like you are watching a few pictures just pasted together. There is zero depth in this movie. Even if the relationship between Presilla and Elvis was that shallow, a good director knows how to convey that shallowness. Instrwad, in this movie it was just nothingness, emptiness... just a few beautiful scenes. Don't waste your money!",
    "30": "I went to watch this movie not having high hopes. And i was right the acting was terrible mainly from Jacob Elordi. Cailee Speany was alright ig. The start of the movie was so rushed i didn't even know what was happening. Then she suddenly met Elvis. But i didn't understand a word Jacob Elordi was saying he was mumbling. He didn't look or sound like Elvis at all. Cailee also didn't look like priscilla maybe just the hair. Their is a reason that this movie only sold 17 million in 4 weeks unlike Elvis 2022 that sold 31 million in 1 day. The movie was too rushed didn't say anything good about Elvis even though Priscilla keeps saying hes the \"love of her life\". In half of the scenes i was laughing cuz of Jacob Elordi and his failed Elvis impersonation. The ending was Priscilla leaving and I Will Always Love You Playing probably cuz Priscilla said Elvis sang it to her at their divorce even though they divorced in 1973 but that song came out in 1974-.Also the timeline was inacurate their was a scene in 1963 about Elvis talking about a movie he was supposed to play in even thought that movie wasn't made until like 1968. Definetely a waste of money their was also no Elvis music played. Lana Del Rey declined to song in it instead she accepeted to sing in an Elvis Christmas Special Event. Elvis 2022 is a masterpiece Priscilla doesn't even compare. Anyway came out still loving Elvis.",
    "31": "This movie surprised me in some ways, but in other ways, it didn't. This is Sofia Coppola's (the daughter of Francis Ford Coppola, the director of The Godfather movies) interesting attempt at making a biopic. You know, I'm not a huge Elvis Presley fanatic, but I went with a buddy of mine who is. I compare this a lot to the Elvis movie that came out last year from director Baz Luhrmann, which was a lot more artistically driven and told the story between Elvis and his shady manager. This movie, however, had a very different feel to it, and it turned out really well. It's slower-paced, but obviously, it's showing everything that happened to Elvis from Mrs. Presley's perspective. Yeah, I'm not going to lie, it's kind of a chick flick, but it's told honorably, I believe. I know there was a lot of shady stuff that Elvis did to Priscilla, like I knew he was verbally abusive and physically abusive at times, and of course, his constant use of drugs was bad. And all of this is shown remarkably well in this biopic about everything Priscilla had to endure from the sidelines of Elvis's fame, and it does a really good job doing that. You don't ever see Elvis on tour or on stage, really; it's all seen through the eyes of Priscilla and everything that she endured on the sidelines, and I think it does a remarkably good job telling it that way. Of course, Priscilla was like 17 or something when she first met Elvis, and at times it can be a little cringe, a little uncomfortable, and a little awkward with that fact, but overall, I don't know how faithful this is to what actually happened. Of course, this movie is open to all kinds of creative interpretation, but I think it does a faithful enough job of getting the general consensus of some of the things that Priscilla may have dealt with while dealing with Elvis in her life and why she ended up leaving him later in his career. I will say it ends a little bit abruptly, and I wish they showed more. But overall, I think it's a decent biopic; it's slower-paced but has a woman's touch and matches what you would expect. It's not all bad by any means; I can just see this really not being for everybody, and like I said, this is more of a chick movie than a guy movie. When I went to see this with my friend, we were like the only guys in the theater practically. But if you're an Elvis fan and if you want to see a different perspective of his life through the eyes of Priscilla, this is an enjoyable watch!",
    "32": "The movie was good but nothing to write home about. Jacobs take on Elvis was good, the voice and the look. Sometimes the movie was funny, but if your looking for a steamy movie with sex scenes, you're watching the wrong one. The movie is excellent if looking at it as a semi accurate depiction of what Priscilla's experience actually was. The movie seems to be very reserved as Priscilla appears to be in real life. Since she was an Executive Producer of the movie and everyone involved in making it would probably have known her personally, I think the movie really feels like a passion project born from her own memoir about these same experiences. This movie would be good for a person who either develops an obsession for all things Priscilla or just got introduced to Elvis and falls down a rabbit hole.",
    "33": "I was looking forward to this one, but ended up wondering how shallow this movie was. It looked like a TV movie, maybe in fact it is. There is zero character development even for the main cast which is Priscilla and Elvis. He comes out abusive and she wasn't strong enough to fight him. Rest of the cast is nonexistent. The little dialog the movie had wasn't interesting to pay attention to, I didn't care for either of them, I didn't feel sorry for Priscilla even if she ended up in the movie and I guess in real life as a victim of psychological abuse. It's the parents to blame. She had no business at 14 years old visiting Elvis house and even if so (considering Priscilla saw him as her idol) definitely no repeat visit. Girls are fragile at young age and she got manipulated by an Adult from the start. Anyway the movie didn't work for me as I found it incredibly boring. Shame.",
    "34": "This is a joyless movie about a joyless relationship. Visually it is dull and offers only basic coverage. The actors are OK I suppose but the script really gives them so much to work with. I went into this movie already depressed and left feeling even worse. This is a joyless movie about a joyless relationship. Visually it is dull and offers only basic coverage. The actors are OK I suppose but the script really gives them so much to work with. I went into this movie already depressed and left feeling even worse. This is a joyless movie about a joyless relationship. Visually it is dull and offers only basic coverage. The actors are OK I suppose but the script really gives them so much to work with. I went into this movie already depressed and left feeling even worse.",
    "35": "To call this movie a romance movie is utterly appalling! This is a movie depicting a grown man grooming and abusing a child. At 14 I myself had never menstruated meaning I was a pre pubescent child. Depicting an adult man grooming and abusing a child and actually labelling it as \"romance\" is disturbing to say the least! People seem to be excited that finally there is a movie that actually admits how young she was! But at the end of the day they are still playing the situation off as romance and not true crime which is what it is! I'm very sick of seeing children written as adults. 14 year olds act like children even if they try to be mature. And getting adults to act children is morally decayed.",
    "36": "I knew it would be just like that! Considering the timing after Elvis movie success, SC made a disappointing decision by outshining him, even making him aggressive and her the mistreated wife adding a lot of unnecessary drama which can be proven even is Priscilla says it because he is not here to defend himself. Elvis is shown as a bad father as well , introducing Priscilla to some drugs. If any of this were true, why she and Lisa Marie worked with BL presenting a caring father, devoted husband who admits his flaws and extramarital affairs but never the monster we can see in this feminist version that makes her the hero. She kept the surname why ? If he makes her so miserable. This not cinema Sofia, you did great movies. What happens if someone demonises your father ? You disappointed million.",
    "37": "Priscilla is a biopic about Priscilla Beaulieu(Cailee Spaeny) & her rollercoaster of a relationship with Elvis Presley(Jacob Elordi). Priscilla starts a relationship with Elvis & discovers that the king of rock-and-roll has many different facets to him.Priscilla is an impressive film. Director Sofia Coppola has given us a movie that beautifully shows us Priscilla's point of view, after Elvis(2022) focused on Elvis Presley's point of view. However, the film could have been a bit more fast-paced & the ending could have been more impactful. Cailee Spaeny is spectacular as Priscilla. Spaeny's awe-inspiring performance is the highlight of the movie & keeps you glued to the screen, even in the slightly dragging scenes. Jacob Elordi is mind-blowing as Elvis. Spaeny & Elordi have effortless chemistry in all their scenes together. The supporting cast is fantastic. Priscilla is worth a watch. However, just lower your expectations & you'll definitely like it better.",
    "38": "Once again Sofia Coppola creates another beautiful film. I'm torn with this film. I tried to put my personal opinions on Priscilla and Elvis aside.The visuals are stunning, the soundtrack featured great classics, very fitting to their scenes, especially the ending song, \"ill always love you\" and the casting was excellent. Cailee was great at showing how young Priscilla was with her mannerisms, her way of thinking and her being so petite. And Jacob just is a great Elvis.I'm unsure though what to think on the way Elvis was portrayed. I understand he wasn't perfect like how he is made out to be but this film really painted him out as a villain. Keeping in mind Lisa Maries reaction to the script, I feel his behaviour may have slightly been overemphasised. It's sad he isn't here to speak on his side.",
    "39": "She was boring and i don't know why they filmed this boring history but musics and scene angles was good. Actions moved very fast. I couldn't get into characters. She changed her style so suddenly and.He was boring and i don't know why they filmed this boring history but musics and scene angles was good. Actions moved very fast. I couldn't get into situations . He changed his style so suddenly and.She was boring and i don't know why they filmed this boring history but musics and scene angles was good. Actions moved very fast. I couldn't get into characters. She changed her style so suddenly and.",
    "40": "Didn't know this film existed and the clouds parted, my wife and I had a date night opportunity and this was playing nearby. We are both Elvis fans and Sofia Coppola fans so this was very worth the cost of watching a film these days. I use the term film appropriately here.This film sets a beautiful tone of what our main character is having to navigate and I love it. Very consistent theme and her character progression is understood, even within the bright lights of being married to the king of rock and roll. All I can say is if she really left the hospital after giving birth to their daughter and had herself dressed to the 9's like in this movie, I am very impressed with Priscilla's strength and resolve.",
    "41": "I hate to say it but I was so totally unimpressed with the acting skills of the young woman that played Priscilla. Her acting felt very high school play to me. Unfortunately she wasn't memorable to me or my partner. I could run into her at the store and not know who she is. Priscilla at that age was so stunning and an icon and I don't feel this actress had the confidence.Aside from that, I thought the movie was decent. It seemed much more indie than you would think for a director of this caliber.I'd love to research if some of the things that happened in the film really happened in real life. I know Elvis was controlling but my goodness! Some of the stuff he did was crazy!",
    "42": "I must admit that after seeing \"Elvis\" last year I was very skeptical when I heard they were releasing a film called \"Priscilla\". However. Sofia Coppola did not disappoint in adapting \"Elvis and Me\" into \"Priscilla\". Where Baz Luhrmann's \"Elvis\" was a bright, energetic biopic of Elvis and his life. Sofia's \"Priscilla\" was a darker, heavier tone of a film displaying the behind scenes look of Priscilla and her relationship with Elvis we never got to see. Scenes that showcased intense, manipulative, and controlling sides of their relationship along with some of the good moments of their time together. The best part of the film is obviously Cailee Spaeny and Jacob Elordi who did not disappoint once and provided equally outstanding performances. The only issues I get from this was pacing seemed to struggle in this film and never feeling like a fluent story, more like random scenes placed together without structure sometimes. Overall, a good watch and would recommend.",
    "43": "Sofia Coppola tells this story from a completely different point of view. This movie is not an Elvis movie, there is a lot of Elvis in here, but the main focus is Priscilla herself and her relationship with Elvis. Cailee Spaeny is fantastic as Priscilla, and Jacob Elordi blew me away with his performance. He's no Austin Butler by any means, but you can't really compare the two. Butler gave a more energetic and chaotic performance, whereas Elordi gave a more calm performance. Coppola's directing made for some terrific scenes and when the credits started rolling, I felt satisfied. All in all, a terrific film that more people need to watch. Don't skip this one!",
    "44": "This is a great movie with good actors within. Love that they didn't focus on Elvis too much (as we've had a million bio-movies made of him already).This movie truly focuses on Priscilla's experience it was interesting to watch. The movie is set in the 50's/60's and the music/soundtrack and set is true to the era it is set in.Beautiful music, amazing actress, love the 50's era and how true to life it felt. (Unlike others I have seen of Elvis, which were terrible). This one is actually really good, and shows how Priscilla became who she did, from a teenager to a woman, and how Elvis's lifestyle sadly ended their beautiful marriage.",
    "45": "I love it. I love sofia coppola movies on general, but this is my favorite of all of the them.The way it still shows the 50s/60s aesthetic well and beautifully, without really romantizing Elvis, and the way it shows how priscilla changed during the relationship with Elvis through her style was really impressive. I also like how they chose an actress that could actually pass for a 14 year old child for priscillas role, so that the audience realizes how young she actually was.I also loved the way they never actually played elvis's music in the moviethis was also very beautiful visually, like i would say about every Sofia coppola movie.",
    "46": "Early in Sofia Coppola's languid distillation of Priscilla Presley's life with Elvis, she receives a beautifully coiffed and presented gift of a pet poodle. Priscilla (Cailee Spaeny) had recently moved into Graceland when she gets the present. 14 when they met in Germany, Priscilla was still only 17. She coddles the pooch and treats it like a little princess. Coppola (who wrote the screenplay adapted from Priscilla's book) makes a case that Elvis (Jacob Elordi) viewed his then future wife as a type of possession. When the teenager asks for permission to take a part-time job, the musician forbades it saying that he needs her to be available whenever he desires. Like the dog, Priscilla is always to be primped and pampered to its owner's specifications.One could say that PRISCILLA represents the other side of Baz Luhrman's recent phantasmagorical film ELVIS in both style and POV. That's certainly true in many ways, but it's doubtful that Coppola would have made her movie much differently even if Luhrman's film didn't exist. Phillipe La Sourd's cinematography, Tamara Deverell's Production Design and Stacey Battat's costuming all fit nicely within Coppola's aesthetic. The filmmaker's love of pop music is also fully on display with period songs mixed freely with more recent tunes in a similar vein (the movie begins with The Ramones and fades out with Dolly Parton).Coppola has rarely been an auteur interested in pure plot and narrative drive. She prefers to soak the viewer into the milieu of her characters. On that level, PRISCILLA has a certain effectiveness. Neither Spaeny nor Elordi are stars, but, their anonymity adds to their relatability. Elordi in particular, faces not only comparisons to Austin Butler's ebullient Oscar nominated performance, but decades of imitators. He humanizes the mythic figure even if, at a certain point, his lack of flash reduces the King of Rock 'N Roll to too much the mere mortal. The elephant in the room is, of course, that Elvis would be considered persona non grata in today's climate. When Priscilla first enters Graceland, Elvis' ever-present entourage are taken aback at how young she looks. Coppola exaggerates the difference by casting actors over a foot apart in height (the real difference was closer to 8\"). It does make her look like a little girl (and Spaeny convincingly pulls it off despite being only a year younger than Elordi; Elvis was a decade Priscilla's senior). In Coppola (and Priscilla's) telling, Elvis isn't portrayed as making his young wife into a purely sexual object. He kept her under glass in his misguided notion that he was protecting her. To make her into an idealized good Christian girl and modern Southern belle who his recently deceased mama could have been proud of. It's an extraordinary tricky balance - particularly with the real Priscilla being a Producer on this film.By design, PRISCILLA never takes a truly deep look at all the details of the couple's lives. Colonel Tom Parker is only vaguely alluded to. The viewer sees Elvis performing only near the very end, and briefly. Once at Graceland, Priscilla is barely shown with anyone other than Elvis' posse. The movie only spans the years they were together. It's a very insular movie which relies heavily on mood and atmosphere. It will be up to each individual viewer if that is sufficient.",
    "47": "Priscilla is absorbing material told with a quiet confidence; like Marie Antoinette, for at least two thirds of the way in, this feels like it is so close to being one of this director's most Formally and performance-wise impressive and inspired films. Whether you sense any deeper personal connection Coppola may have had with the story (Id need a psychology degree to unpack what it may or may not be like for this director to have been so close to a figure like Francis Coppola, though a much different context), the film largely works as a story where you get not only why a young woman would fall for this man at this time, but why it would be so hard to leave when it gets... rough.When it's Priscilla in her high school years, in total yet totally understandable infatuation with Elvis (that time period when he goes away and she counts the months by calendar, chefs kiss), and even into most of the time into Graceland, it's engrossing. The flaw is when it kept going after running out of things to say; in that sense, ironically given how they are so wholly tonally different films, this has the same problem as Luhrmann's Elvis where it covers so much ground that it runs out of steam dramatically (the Hit The Points We Know sort of thing). If you asked me which is the superior film I'll say Coppola's, but it's not by a long shot exactly, just with different strengths for each.Still, Spaeny gives, along with Dominic Sessa in The Holdovers, the OMG where did *that* come from Young actor turn of the year, as well as Elordi being ideally cast as *this* Elvis, and even with my qualms I would say to anyone vaguely interested to check it out. It's the kind of storytelling where the physical details are so impactful - watch what Priscilla does just before she goes to the hospital to give birth to her daughter, not subtle but a devastating fine-underlined point about her life as it was - and as per Coppola the production design and costuming and the camerawork is fantastic (though it took me a few minutes to adjust to how dark some of the scenes are lit).And I must also add, other mostly splendid music choices besides (sampling from 80s New Wave to Santana), the opening needle drop (\"Baby, I Love You,\" by The Ramones via Phil Spector) is as nerve-tingling as the final one is tacky (I'll leave you to be the judge, but I kind of groaned at that forced romantic irony).PS: that moment when Priscilla breaks down and tells Elvis to stop reading from that book is one of my two or three favorite moments from any film this year.",
    "48": "Priscilla takes the spotlight instead of Elvis in this one. It had that retro aesthetic, but it was portrayed differently from the 50s/60s in Baz Luhrmann's 'Elvis.' This film had a more understated, even slightly gloomy vibe in comparison. Andrew just like the visuals, we get a quieter look at the relationship between Elvis and Priscilla, told from her perspective.The soundtrack is nice, you don't hear much of Presley's music. Unlike last year's Elvis biopic, this one doesn't cover an entire career; it's solely focused on their marriage. It feels like we spend a significant amount of time watching how they met, but the later years felt like we were skipping stuff. Priscilla seems isolated and controlled by Elvis, whose presence is distant in the movie. The first part of the movie feels like we're sitting through Priscilla's memories, but the last half feels like we're skimming through them.It's hard not to compare them, but Austin Butler's portrayal of Elvis is better than Jacob Elordi's; Butler's performance is almost iconic. Jacob's fine, I just think there was a disconnect between Jacob's speaking voice and his singing voice. The age difference between Elvis and Priscilla is depicted better here, more creepily, mainly due to the innocence Cailee Spaeny conveys, emphasized further by the height difference.There isn't much chemistry between Elvis and Priscilla depicted in this film. Maybe it's how it was in reality and how it's depicted, but it seems like they fell in love over small talk, like \"hey, I miss home,\" \"hey, I like talking to you,\" and then it jumps to the abusive, controlling part of their relationship filled with arguments. Intimacy over small talk.I do think Cailee Spaeny did a great job as Priscilla. You can always tell how she feels, and the movie doesn't need to explicitly state \"oh, she's sad\" for you to understand. We witness the transformation of Priscilla over the years, and Spaeny flawlessly captures the journey from an innocent young fan to a frustrated woman trapped in a controlling and isolating relationship, culminating in her portrayal of a grown woman who had had enough of Elvis' behavior.Honestly, the film isn't particularly special, especially considering the visually epic story we got from the 2021 Elvis movie. I thought it would bring something different or offer deeper insights, especially since it's a well-known story and was recently told on the big screen. But it doesn't feel deeply felt or ravishingly detailed as described.Vegas backdrop looked so fake, like not even cgi, more like when they build small miniature towns and shoot those. Movie's Anticlimactic too.Certain aspects of her life are teased, like her affair with the instructor, which seems essential to the story but is only hinted at. It goes back to how the last years of their marriage are depicted, making it feel like we're skimming through memories instead of experiencing them. Maybe it was just to keep her innocence.It's a story that's already famous, so I expected this film to bring a unique and possibly deeper perspective, but it doesn't offer anything that isn't already known. It feels like it missed the mark and turned out mediocre, uninteresting, and somewhat forgettable for me.",
    "49": "How can they make such an interesting story into such an uniteresting movie? Well, that's a good question.Some of the reasons as follows.No chemistry. No emotions. No sensuality or sex. Nothing interesting happens. No new insights. No real suspense, tension, happiness, joy or emotions. Just actors trying to act without any real feeling getting through to the viewer.And the actor that plays Elvis are to tall for the role. He doesn't come through as someone that millions of girls and guys would love. And what about the music? Just a collection of songs that have no relation to Elvis.Nope, this is just a bland and boring try to tell the Priscilla - Elvis story, without actually telling us more than a short written article could do as good, or bad.",
    "50": "Okay, so that abortion which was Baz Luhrman's Elvis flick didn't kill the king, it took his own wife to put the final nail on the idea that Elvis has not only left the building but they keep flogging him in the grave.The entire thing is one giant uncomfortable groomer flick. Yes, I paid to watch this movie so this site better let me vent on it. Yes, it was the late 50s and he WAS Elvis but the idea that a 14 year old could convince their parents that Elvis's intentions were noble is painful. This is obviously taken from the disgustingly unreliable narrator which is Priscilla herself. Made an executive producer so as to paint this entire budding relationship as wholesome. Was it to make excuses for him? Who knows. It's gross. But that is reality.I do not ever buy this Cailee Spaeny as Priscilla. She looks and sounds like Natalie Portman doing an impression of Priscilla. And Jacob Elordi doesn't embody Elvis in the least. He mumbles here and there. But there was a gravity to the way Elvis conducted himself that seemed to have a deeper presence. No one has captured this yet, and the rest are cheap Vegas imitators. Throw this one on the pile too.This movie glosses over the major moments of Elvis's life which should have notably effected Priscilla. Sure, the movie is named \"Priscilla\" but what was going on with her life as he was making flicks. If she wasn't watching over her poodle, she was reading articles of Elvis's movie trysts. It is a MASSIVE drag. She...has...no...life!His return to greatness in the early 70s should have held more heft. Instead, it's a quick scene of them watching it on television and getting phone calls (budgetary reasons, perhaps). Coming from someone whose entire life and personality came from Elvis, Priscilla seems to be ungrateful to someone who provided her with this level of stardom. Was it worth it?They do add strange moments of fury from him. Nothing of which I could see as threatening in the least. This is something director Sofia Coppola has a blindspot to. It's okay to show terrible people doing terrible things. And it's okay to show women as less than perfect. Having the real Priscilla be part of the production hogtied you into this sanitized Movie Of The Week dreck. They don't even make Elvis bloated. Are we to assume Priscilla never saw him as a degenerate drug addicted blimp of a man? That she continued to see him in a dreamy light? Give me a break.Sofia Coppola has lived off the name for so long, it's an insult to continue pretending she has the chops Dad or even brother Roman have. Her career predicated on casually selecting story lines no one cares about. I sat through \"On The Rocks\" and I was cheering for her only to be greatly disappointed there. But here we are with something much more terrible.I think what bothers me most about this is that there isn't anything real juicy that should have come from the real Priscilla's mouth. She chose, and most likely leveraged, Sofia to keep the true dirt to her grave.The timeline on this movie is so wild. And nothing really feels like there's a point. Horrible time wasted.",
    "51": "Greetings again from the darkness. It was less than 18 months ago when Baz Luhrman's Oscar nominated ELVIS hit theaters and we were admiring Austin Butler's performance. Where that movie was glitzy and loud and centered on Elvis and Col Tom Parker, this current film from writer-director Sofia Coppola (Oscar winner for LOST IN TRANSLATION, 2003) offers a quieter, more intimate glimpse at the relationship between Elvis and Priscilla through her eyes.Ms. Coppola is a detailed filmmaker who excels when dealing with personal isolation, and Priscilla makes a fitting and worthy subject. The screenplay by Coppola and Sandra Harmon is adapted from Priscilla Presley's 1985 memoir, \"Elvis and Me\", a book that also served as the basis for the 1988 TV movie of the same name (screenplay by Ms. Harmon). Although Elvis Presley Enterprises was not involved with this film (explaining the lack of familiar Elvis music), Priscilla Presley did serve as Executive Producer (EP, ironically), so her memories and preferences likely play a key role in much of what we see here.Relative newcomer Cailee Spaeny (\"Mare of Easttown\") delivers an outstanding performance - from 14-year-old Priscilla Beaulieu in 1959 to Elvis's bride in 1967 through their divorce in 1973. Ms. Spaeny perfectly captures the wide-eyed innocence of a young fan, the frustrations of a young woman being controlled and isolated, and finally, a grown woman standing up for her own freedom. Playing Elvis through this same time period is Jacob Elordi (\"Euphoria\"), and he is effective in mimicking the familiar mannerisms and speaking voice. Physically, he towers over the diminutive Spaeny, which although not historically accurate, does add a dimension to the couple's disconnect. As for the age difference, the two actors are close in age, but are able to portray the actual 10 year age gap between Elvis and Priscilla.The creep factor is ever-present as 24-year-old Elvis, overseas on military duty, shows an elevated interest in 14-year-old Priscilla Beaulieu, whose military father is also stationed in Germany. The naivety of their first meetings is captured as Elvis' beloved mother has recently passed away. Both are lonely and away from home, and Elvis simply finds her easy to talk to. It's hindsight to question how parents could allow the situation to escalate, but anyone who has parented a teenager understands the challenges. When Priscilla turns 17, she moves into Graceland, yet Elvis insists the intimacy wait until after they are married.At the core of the story is Priscilla's solitude and loneliness. She is confined to Graceland and requested to \"keep the home fires burning\" as Elvis marches off to the stream of movies set up by a never-seen-here Col Tom Parker. Keeping Parker on the phone allows Priscilla's world to remain even smaller despite being married to the biggest star on the planet. Doses of Elvis and the Memphis Mafia occur between extended stretches alone with Elvis' grandmother and personal cook. She is isolated from the real world and clearly controlled by Elvis, who was only partially present.When Priscilla and Elvis are together, the strain is apparent. Prescription drugs and sexual tension are interrupted by periodic bursts of Elvis anger, followed by a sincere apology. It's here where we realize he's more of a kid than she is ... emotionally stunted in what makes a relationship (it takes more than the tabloid reports of movie set flings Priscilla reads about). This is also evident as she watches him go through many phases in search of himself - martial arts, bible study, eastern philosophy, etc. In the family photo shoot with Lisa Marie, body language tells the whole story. Priscilla's fling with karate instructor Mike Stone is teased, but not dwelled upon. We realize that Priscilla was the one thing in life he felt he could control. By the end, one of them has escaped the cage, while the other remains captive.Voted 'Best Film' at this year's Venice Film Festival, it also reminds us what a terrific filmmaker Sofia Coppola can be. Working with a limited budget, she and her team are so proficient, it never seems as if they cut corners. Cinematographer Philipe Le Sourd and Editor Sarah Flack manage to sustain the pacing despite an inordinate amount of time Priscilla spends on her own at Graceland. Production Designer Tamara Deverell recreated the recognizable interior of Graceland, while the work of Costume Designer Stacey Battat guides us through the fashion changes that occurred over these 14 years. The film recreates some of the iconic images and moments that are ingrained in our memory banks, and director Coppola chooses to end with Dolly Parton's \"I Will Always Love You\", supposedly the song Elvis sang to Priscilla as they finalized the divorce.Opens in theaters on November 3, 2023.",
    "52": "I saw \"Priscilla\" yesterday. \"Priscilla\" is a 2023 American biographical drama film written, directed, and produced by Sofia Coppola, based on the 1985 memoir \"Elvis and Me\" by Priscilla Presley (who served as an executive producer) and Sandra Harmon. It stars Cailee Spaeny in the titular role and Jacob Elordi as Elvis Presley. I looked forward to seeing this film based on the rave reviews it has received. However, I must say that I was disappointed by the film. Some critics say that the movie was \"understated\" - that is an understatement! I found it to be tedious and slow. I just couldn't get invested in Cailee Spaeny's performance - it didn't grab me as authentic. She has limited range as actress - which seems to be all the way from A to B. Jacob Elordi is strikingly handsome (as Elvis was) but he doesn't seem right for the role - he is 6' 5\" and Elvis was 5' 11\"! More importantly, his performance is annoying, especially when he mumbles (of course, he could be a victim of Coppola's script and direction). Speaking of writing and direction, Coppola speeds through parts of Priscilla's life towards the end whereas she spends too much in the initial buildup to the marriage. Therefore, I cannot recommend this film. As Elvis sang - \"return to sender\". 4/10.",
    "53": "The movie fails to provide a closer look at the real Priscilla -- most of the movie's portrayal is already known to the world-wide Elvis audiences. Worse is that it portrays Elvis in such a negative light -- again, much of which; the drug addiction and its obvious ills, the audience already knows. The actors did what they could to this uninspiring script, especially Elordi but it was really the visuals that were, if anything, at all interesting and beautiful. That said, I could not get past the height difference between the key actors which was an obvious mismatch nor a more in-depth understanding of the main character herself. As I drove home from the theatre I just kept asking myself, \"But...why? Why make this movie?\" What good comes from it? For me, the portrayal did no good to Priscilla necessarily; as mentioned it taught little of her; her parents or their parenting, it lacked an emotional fullness to the real life story of this romance (if you will), and other than the bedroom scenes, very little of Priscilla's thinking, the relationship of Elvis and she. Lastly, and importantly, it does little good to the real-life extended Presley family, not to mention, the legacy of Elvis.",
    "54": "I enjoyed it.It's an interesting movie that explores the notorious relationship between Priscilla and Elvis with strong directing, good production and strong performances from the cast members. Sofia Coppola is an interesting filmmaker as she has made some great movies in the past like \"The Virgin Suicides\" and \"Lost in Translation\". Here, her direction was good as her directing was able to handle the themes, tone and atmosphere pretty well through an honest depiction. Many of the production, costumes and make-up help perfectly capture its time era. The writing, while is predictable due to the narrative being the standard biographical story, remains interesting as it does a pretty good job on exploring the themes of isolation, innocence being robbed, heartbreak, solitude, and stardom. The soundtrack was really good alongside with the camerawork and production design.All of the performances are pretty good as Callie Spaney does a fantastic portrayal of Priscilla and Jacob Elordi also did a pretty good job on his portrayal of Elvis as well. The dialogue between the characters were pretty good although there were certain dialogue moments from Elordi that were a bit muffled. Most of the pacing is good but there were some pacing problems that did drag the movie a little. Especially with the second act as the second act felt a bit lost and some of the color presentations were a bit dull which could have used some improvements.Overall, while not my favorite Sofia Coppola movie, this movie was still an interesting watch.",
    "55": "Based on the book written by Priscilla Presley, it tells her story right from a 9th grade student being smitten by Elvis and hopelessly falling in love with him. Then Priscilla, leaves her life behind to be part of Elvis's life and live it the way he wants her to. The cheating, mistreatment and complete disregard for her feeling eventually pushes her to realize that she has her own identity and it is not worth living somebody else's life. The film documents their life together till their divorce.Having watched Elvis the movie and totally enjoying it to the core, it was hard to buy into this Bad Elvis. Thanks to the performances especially by Cailee Spaeny, I was able to stay with the narrative till the end. This had a serious narrative and it wasn't an easy watch. As it only documents the years from the moment Priscilla meets Elvis and them living together, only to end up in a marriage which parts them enough to give Priscilla enough courage to seek divorce.Once again it was a powerful performance by Cailee and kudos to Sofia Coppola to get such a performance from her and to have that control over the narrative, which successfully portrays the emotional journey of Priscilla. From being a naive teen who is hopelessly in love, despite being ill treated to finally grow up enough to figure out what needs to be done. The pace is slow and like I said, it is not an easy watch.",
    "56": "It's unfortunate that this movie came out so recently after Baz Luhrmann's Elvis did. Unfortunate because most will look to that as the \"definitive\" Elvis biopic - while it is in many ways, there are an equal number of ways that Sofia Coppola's Priscilla offers deeper insights into Elvis and Priscilla Presley and their very famous relationship.Truly, these two films shouldn't be compared as they are very different. However, since they will be I'll throw my thoughts into the ring. Elvis was a very erratic, wacky film that had too much going on to the point that you never really engaged with it, moreso just followed along as it quickly gave you flashes of significant events in Elvis' life. Priscilla, on the other hand, focuses on one element of the Elvis story - his relationship and marriage with Priscilla. Plus, in this film, rather than taking an objective perspective like in Elvis, we get to follow the perspective of Priscilla and see Elvis the way she saw him, which is a far more compelling setup for a story.Sofia Coppola holds nothing back (losing permission to the music rights in the process), as she artfully captures the loss of innocence and darker aspects of the famous relationship between Priscilla and Elvis. She was the perfect filmmaker to tell this story from this perspective, directing it almost like it is a dark fairytale.Delicate and quietly fierce, at first glance, this film may not appear to share much with Oppenheimer and Killers of The Flower Moon, but they all have one thing in common: depicting the banality of evil in an almost detached way, framing objectively problematic events through a subjective individual's experience. Somehow, all three are able to say so much without preaching, presenting you with ugly and evil things and allowing their ugliness to be self-evident, often through juxtaposition between intense sin and mundane ordinariness.Priscilla does not include impassioned monologues about female independence or misogyny-in fact, it's arguable that the heroine makes her first active choice in the final moments of the film-but it manages to grab you with its subtle allure and wrap you up in something that feels somehow good and gross, a delightful and desirable fairy tale and a slow-motion car accident from which you can't look away. It's hard to praise performances without being generic, but suffice to say that Cailee Spaeny's eyes and little half-smiles are doing so much heavy-lifting here-and Jacob Elordi somehow pulls off Elvis far more effortlessly than Austin Butler, in all his intense energy, could have ever dreamed. The seemingly 10-foot divide in height between the two of them helps, too.Without even opening his mouth, Elordi embodied the essence of Elvis with his mannerisms and the way he carried himself. And when he did speak, that Southern drawl could charm anyone. Spaeny's performance from a naive and vulnerable fourteen-year-old to an emotionally mature adult was flawless. (I was amazed how the performance and the hair/makeup/clothing seamlessly worked to convince the audience of Priscilla's age in each period.) Spaeny's doe-eyed innocence at the beginning slowly turns to a sexual hunger and then pure emptiness. She was molded into the \"perfect\" wife by Elvis, and she had no freedom to choose her path in life.The movie looks gorgeous and the soundtrack is phenomenal. The choice by Elvis' estate to not let his music in the movie worked positively for it. Without that music, he loses some of the mystique he has. He's just a normal abusive man.I really enjoyed Priscilla - it is quite a special film that I hope people find! The mainstream take on this story will always be Baz Luhrman's version, but this truly has something more to offer. And that's to say nothing of the direction; there's an almost Phantom Thread level of soft and silky atmosphere here that makes the whole thing feel like ASMR, which only heightens the dysfunction that occurs within that gentle world. I loved the subtlety to Sofia Coppola's direction and was compelled the entire time; I couldn't take my eyes off the screen. The fact that the story ends at what feels like the halfway point only drives home the feeling that, for Priscilla Presley, that's what it was. Unfortunately, this film does lose a bit of its momentum near the end as it becomes less cohesive and jumps years forward between scenes, but it didn't really detract from my enjoyment of the film. This is definitely my preferred film compared to last year's presentation of these characters.Priscilla is a subtle piece of art from Sofia Coppola. Cailee Spaeny is a marvelous revelation while Jacob Elordi turns in a subdued, more complex version of Elvis. Highly recommend it.",
    "57": "Ultimately I felt I couldn't pass judgement without seeing this. I intentionally read very little of the film prior to going. I of course had read Elvis and Me but only last year. In reading this I did feel Priscilla's love for Elvis on the page, despite the negative aspects and obvious difficulties in their relationship which was not only complex but represented a very different time and culture.My first impressions of the film were okay, Cailee introduces Priscilla as a lonely bored teen, Elvis was also portrayed as lonely and homesick and they enjoyed each others company briefly in Germany. However the casting of Elvis seemed totally off and lacking charisma. Jacob is also very tall, towering over a short, slight Priscilla, deliberate I'm sure. Some of his speech and mannerisms were okay but also overacted and he mumbled in many scenes making it difficult to understand his dialogue, I was searching for subtitles!Of course I found myself comparing him to Baz's Elvis. Austin truly put his heart and soul into the character and his love for Elvis shines through. With Jacob however it felt like he had little interest in knowing who Elvis was, a poor portrayal. The whole thing felt quite predictable, each negative aspect from the book was put together almost as individual short scenes with little context to support it or marry them together. For example, Larry was introduced in a snapshot scene, (blink and you'll miss it) without explanation, as someone Elvis suddenly trusted and then was gone. Not the true spiritual guidance and friendship that fans know developed. This scene amongst others was delivered in a comedic way, showing Elvis' character as angry, emotionally immature, flighty and not very intelligent. I'm not sure if this was the intention but how it's shown. I wander if the director was trying to show his softer and more vulnerable side. However there was a lot of laughter from the audience during scenes such as this suggesting she sadly missed the mark. Baz's Elvis also showed many sides of his character some fans may find difficult to swallow but delivered in a balanced and believable way. Also a big concern - I felt there was little character development in either Priscilla or Elvis so I felt no emotion or empathy toward them. Most other characters were barely significant. The whole thing just felt rushed and fudged together. There were a few moments of affection and love between Elvis and Priscilla but these also felt like individual scenes rather than part of a developing story. I went with another Elvis fan and it was clear our feelings were very similar on exiting the cinema. I prayed this would be a positive experience but all in all the result just left me feeling, cold, shallow, and disappointed.Maybe others will view it differently/more positively? Yes the movie is called Priscilla, however for me this is not how you represent Elvis, one of the most significant cultural figures of the 20th century. Therefore, I'm more grateful than ever to Baz, Austin and the whole team for in my opinion doing Elvis right.",
    "58": "Sofia Coppola shoots for grand heights in this biographical drama but is not as grand as it attempts to be.So, to open this review, I will state the positives...This film features good writing, good performances, and for its budget good production value.The film, in particular, does a good job at delving into the relationship between Priscilla and Elvis as well as providing a different perspective of the relationship and of the man. From the moment they meet to their eventual break up, we are presented with some uncomfortable sequences that definitely made me question why her parents would let her be with a man his age, considering how young she was. As for how much is true or dramatization I could not tell I don't know much of Priscilla or Elvis only to say if what portrayed on screen was true then she should have never started up with him in the first place but that's just my opinion.Then, everything in this film is escalated thanks to a great performance from Cailee Spaeny in the role of Priscilla. She did such a great job at conveying the vulnerability and innocence of a young Priscilla. It genuinely made me want to protect her from everything that could harm her, including Elvis, haha.Unfortunately, I can not say the same for her co-star Jacob Elordi in the role of Elvis Presley. Not to say he was terrible but I just couldn't buy him as Elvis and everything she did just outshines him which is fair considering she is the films titular character, and after the outstanding ten out of ten performance Austin Butler gave us in the Elvis biographical drama its not his fault because I don't think anyone could stand next to Butler. However, I must say Jacob and Cailee did work well together on screen.But where this films shortcomings lie are well, it's just not all that powerful or as strong as it is attempting to be. As I stated before, it shoots for grand heights, but it doesn't have the power to reach those heights.There are some other smaller things such as poor cgi backgrounds. In certain scenes, the backgrounds were quite terrible, but considering the films budget, that's not very surprising.Secondly, while I understand this film is about Priscilla and not Elvis, I was surprised by the lack of Elvis music here. Either like the backgrounds, it was due to budget constraints, so they couldn't license the music or it was a purposeful choice. There were some instrumental renditions of his music and one scene where they were watching his TV special but not much else. Now, I wasn't expecting or anticipating to be rocking out to an Elvis soundtrack in this film but was just surprised by the lack of it.Overall, while I understand what Sofia Coppola was attempting in this film, the material just wasn't all that strong to reach what I felt she was aiming for.IMDb: 6/10\nLetterboxd: 3/5Watched in Theaters.",
    "59": "This story could have been told at any time over the last three decades. Why, suddenly was a movie about Priscilla Presley green-lit and quickly filmed? I'm sure it had nothing to do with the fact that Elvis grossed $300M in the previous year.So given this is by definition a derivative concept, the movie leans heavily into the idea that the partner that is close to fame but not famous loses their sense of identity by virtue of being with their more famous partner. The problem is this movie makes the mistake of thinking Priscilla Presley is, or ever was, inherently interesting. With that in mind Priscilla is a locum tenens for anyone in an asymmetrical relationship.Ironically the only reason her name is even known is the fact that she was married to one of the most impactful artists of all time.This is a cynical cash grab capitalizing on the reflected glory of the late, great, Elvis Presley. Nothing more.",
    "60": "Director Sofia Coppola may be the darling of cineastes but she also rates pretty high with insomniacs in \"Priscilla.\"\nThis latest effort, the story of Priscilla Presley, compresses the story of her romance with Elvis from first meeting to separation into less than two hours. Sounds like it might be an electrifying ride, a coming-of-age story with a teenage girl marrying the biggest rock star in the world. Instead it is all weirdly lifeless. Put aside the fact that there is no Elvis music or performances. Elvis has left the building for the most part.Cailee Spaeny does a fine job of portraying Priscilla's range of emotions from a teenage crush to a depressed and lonely trophy wife wandering around Graceland while Elvis is mostly ignoring her or touring. The visuals are as somber and subtle as the famously dark scenes fromThe Godfather's underexposed mob headquarters in her father's breakthrough film.Coppola presents this empty saga as a series of vignettes rather than as a story. I get the feeling that Coppola's many loose-ended vignettes are simply excerpts from a Priscilla Presley autobiography. The highs and lows of Elvis's rise and fall must have been exhilarating and crushing...full of flamboyant characters, clowns and users. You won't see that here. Priscilla is alone, bored, excluded and lost.",
    "61": "Before Elvis Presley's daughter Lisa Marie passed away earlier this year, she was quite contemptuous over Sofia Coppola's portrayal of her parents in her biographical feature Priscilla. Based on Priscilla Presley's 1985 memoir Elvis and Me, the film has nonetheless garnered mostly positive reviews and even earned Cailee Spaeny the Volpi Cup for Best Actress at the 2023 Venice Film Festival. Given that Priscilla herself was an executive producer on this project, it's best to look at this project at a more earnest portrayal of Elvis and Priscilla instead of it being romanticized or sugar coated.Now as this film depicts the courtship between a then 14 year old Priscilla and a then 24 year old Elvis, the biggest takeaway from this feature is that it's supposed to comment more on the idea of love being difficult to obtain as the wife of a global superstar. While it does depict a taboo romantic subject in mind, it becomes far more toxic when Elvis proves to be far more manipulative and abusive than his rockstar persona claims otherwise. Cailee Spaeny and Jacob Elordi share quite a conflicting bond as their depictions show a more disturbing underbelly to what the public thought of the Presleys otherwise. Coppola makes sure to emphasize the unfortunate implications behind their relationship without directly endorsing it, especially as we can see how much the spousal torment and jadedness behind the life of fame creates more misery in Priscilla than to the people worried for her like her parents and socialites. Behind all the rock & roll, glamour and pizazz lies a hollow marriage where one is no longer illusioned to much of anything, be it romance or appreciation for the music.That being said, outside of the disturbing implications behind Priscilla and Elvis' courtship, there really isn't much else to take away from the movie. By putting so much of Priscilla's perspective into the limelight, the portrayal of her husband isn't interesting enough to dissect beyond him being a fake charming guy who more so likes the idea of a soul mate instead of actually being with one consistently. It doesn't help that the film rushes certain plot points just to get to Presley's life of prestige, such as Priscilla's time with her rightfully concerned family, her trouble focusing in school and even the implied drug addictions she and her husband faced. Despite that latter key point playing a big role in Elvis' abusive behavior, it isn't explored enough to leave much of a dramatic impact. In fact, for a film that tries to incorporate themes of domestic abuse, it feels surprisingly lacking in showing much of that tension. Also, once the film ends, it feels as if it missed the opportunity to go more into Priscilla's life after leaving Elvis for good, almost as if it felt it didn't need to tell more when it should have.Outside of those qualities, the filmmaking is competent enough yet never rises above decently well crafted in depicting the era of subject. The cultural aesthetic of the late 50s and early to mid 60s feels more tact on for the sake of the time period, as outside of some of the road shows and projects Elvis is apart of, only the costuming sticks out the most, and yet the film hardly does much with them to make much of an impression. If anything, the pop cultural influence from this era feels more like an accompaniment to the story than really playing much of a role beyond the media playing up Elvis' life as more than it really is. Also, the lack of much of a background score surprisingly doesn't work as most of the scenes play out with an awkward tension that would have benefited from more than just what's on the soundtrack. Speaking of which, for some reason there are all kinds of retro and contemporary rock and jazz songs except from the king himself. Perhaps given the involvement of Priscilla Presley and her ex-husband's enterprises, this comes off as understandable yet confusing.So while made with earnest intentions and captivating performances, Priscilla is a decent enough biopic that falls flat in exploring more about its subject matter beyond superficial love and all the glitz and glamour that comes with it. I would recommend this on the grounds that it's more interesting than it is thought provoking, though definitely take that for what it's worth given how much influence was done by the target at hand. Besides, even if the king is no longer looked at the same way he was then, projects like these are good reminders to not look up to everyone you admire, let alone fall for.",
    "62": "It's one thing being famous, and quite another being married to fame. Sofia Coppola's Priscilla isn't the methodical biopic that some will no doubt be expecting but rather an episodic, ethereal character study of a girl placed in an unconventional relationship at a very young age, almost beyond her own agency. Cailee Spaeny is an elemental revelation as Priscilla, an angelic beauty handpicked from her idyllic teenage-hood by the king of rock and roll himself (Jacob Elordi) and whisked away to fabled Graceland where the romance and eventual marriage to him don't quite end up being the storybook ending she anticipated. Coppola keeps it meticulously spare here, using none typical soundtrack choices, story beats or stylistic fanfare employed in these kind of stories. It's very much from her perspective and so it should be, this is after all a film named for her. A frustrating, often smothering courtship and marriage are told through a gauzy, lacy lens with beautiful period appropriate production design, hypnotic fade ins and fade outs and the strong undercurrent of Spaeny's uncanny acting work. I've been watching her since she walked away with the otherwise mediocre Bad Times At The El Royale a few years back, she's done terrific work for Alex Garland in Devs and will headline the new Alien film out next year. I had an intuition she was going to do very well and this role lets her shine, often quietly but always brightly.",
    "63": "Sofia Coppola's \"Priscilla\" promised a subversive biopic, a kaleidoscopic glimpse into the life behind the sequined curtain. But as the film unfolded, I felt myself drifting further and further away, captivated by the spectacle but yearning for substance.Coppola's signature aesthetic mastery is undeniable. \"Priscilla\" is a visual feast, each frame dripping with the opulent decadence of Elvis' world. Yet, amidst the glitter and rhinestones, Priscilla herself seemed to fade into the background. The film skimmed over pivotal moments in her life, leaving me with a series of dazzling tableaux rather than a cohesive narrative.The rushed pacing felt like a cruel joke on Priscilla's agency. We flitted from Graceland's gilded cage to sun-drenched Vegas stages, never truly allowed to inhabit her perspective. This superficiality was particularly disappointing from Coppola, a director known for her deft touch with complex emotions. Where was the vulnerability beneath the bouffant wigs? Where was the heartbreak of a life lived in the shadow of an icon?Priscilla's relationship with Elvis, the very core of the film, remained frustratingly opaque. Their interactions felt choreographed, their emotions muted. I longed to see the cracks in the facade, the quiet battles of power and identity that surely played out behind the scenes.Coppola's choice to tackle Priscilla's story was undeniably intriguing. She seemed the perfect artist to peel back the layers and reveal the woman behind the myth. But somewhere in the process, the focus shifted. \"Priscilla\" became a love letter to an era, a glittering postcard from a bygone world, rather than a portrait of a soul.Ultimately, \"Priscilla\" feels like a missed opportunity. It's a visually stunning film, but its beauty remains hollow without the emotional depth and narrative coherence that could have truly elevated it. I left the film with a lingering sense of dissatisfaction, like I'd glimpsed a mirage shimmering in the desert, only to find nothing but sand upon closer inspection.",
    "64": "Priscilla (2023) :\nMovie Review -Priscilla Review: Last year, we had Elvis Presley's biographical \"Elvis,\" and now we have his wife, Priscilla Ann Presley's biopic \"Priscilla.\" Has a thing like this ever happened before? I mean, husband and wife having individual biopics in such a quick time? Certainly no. To be frank, Elvis was a legendary figure in his field, and he lived a very controversial life, so he kind of made a perfect filmy script. The point is that he deserved that biopic. Now, can I say the same for Priscilla? After watching Priscilla, my answer should be \"NO\". Yet, this film can be watched once for Cailee Spaeny's beautiful portrayal of Priscilla Presley and Jacob Elordi's classy accent of Elvis Presley-not looks.In the late 50s, 14-year-old Priscilla Beaulieu (Cailee Spaeny) is residing in Germany as her father is stationed in the military. At a party, she meets Elvis (Jacob Elordi) for the first time. After a silent first meeting, Elvis finds Priscilla attractive and calls her for a date. They both begin seeing each other, while Pris' parents keep complaining about the same. Priscilla keeps getting insulted and humiliated in this relationship and yet carries it forward. Presley's affairs and personal political frustration are clearly visible, but every time he successfully manages to convince Priscilla to come back to him. They both marry despite the age gap, and then Priscilla begins sensing the isolation and compartmentalization, which leads the way to the rest of the plot, but there is hardly anything that deserves to be comprehended.Sofia Coppola's script doesn't really hold you much in its grip, and the screenplay is very slow. When a 110-minute film feels slow, believe me, there is something wrong with it. It's maybe because Priscilla's life wasn't full of headlines. She kept fighting herself and was never able to bring it on her external appearance. Maybe because she was paired with the man who had a publicly exposed image and somewhere she felt that pressure. The scenes like high school gossip, the graduation ceremony, Elvish's departure for the military, and that family photoshoot have given a pretty good idea of the self-complexity of Priscilla. After all, she was married to a superstar, and nobody can deny that fact. She had to battle that fact, and then she had a baby to carry his blood forward. There is nothing dramatic about the whole marriage life, and that's why this movie fails to entertain you and keep you hooked.The biggest plus point of the film is Cailee Spaeny's dedicated performance. She looked like Priscilla, that's one thing, but she was able to bring that persona on screen without saying much. Sometimes silence speaks louder than words, they say, and here is one of the situations where it fits right. Cailee's gorgeous face will take your heart away, for sure. Jacob Elordi has done tremendously well when it comes to Elvis' accent and body language, but man, don't ask if he looked like Presley. He was looking more like Austin Butler than Elvis Presley, and the fun part is that Butler looked exactly like Elvis in Elvis. This was a big mismatch, but not as a performer, but as a lookalike. Ari Cohen and Dagmara Dominczyk have a few scenes here and there, and like most of the supporting cast, they go unnoticed. Now, do I have to mention the supporting cast separately?Getting an original motion picture soundtrack for Priscilla was a challenging call, and the team deserves to be hailed for that. Some of the tunes do feel nostalgic, especially with the visuals featuring mainly Elvis and Priscilla. The art design and production design are fine. Philippe Le Sourd's cinematography is okay, while Sarah Flack's editing lacks sharpness. Sofia made one big mistake with the film: she gave a lot of importance and screen space to Elvis. The film was Priscilla's biopic, but it is presented as her marriage life, hence making Elvis the hero. Somehow, he overtook the space, and the main character got into a competition, which shouldn't have happened. Of course, Elvis' character was damn important, but he was never the main character. He was always supposed to be the second-main character. Sofia felt more interested in glorifying Elvis' wrongdoing, and Priscilla was a poor little girl. That was part of the process to create sympathy for her character, but you end up feeling pity for her. Even in the last frame, when she is leaving Elvis at once, Sofia has to show Elvis' fans cheering for him. With some mistakes like this here and there throughout the film, Sophia Coppola's Priscilla seems stained and a pretty average flick. To keep you awake, there are a lot of steamy smooching scenes, so make sure you don't miss them.RATING - 5/10*By - #samthebestest.",
    "65": "For years as I watched many Elvis biographies, prior to Austin and Tom, there were many biographies; I always wondered how a 14 year old girl could have her parents blessing to move into Graceland with Elvis. Sofia Coppola grasps this question and responds articulately. The same \"Elvis\" story being told from Pricilla's perspective intelligently and deftly.It reminded me of my own childhood when a teacher would drop by our home and ask my parents if he could take me out for dinner. It was an honour to go out with him, nothing secret or shameful. My situation was a far cry from Priscilla's yet similar in that the man was respectful and admired and our families were very happy to be associated with him.The actor who portrays Elvis had some big shoes to fill which he did humbly, giving the spotlight to the actress who plays Priscilla.Sofia Coppola is an excellent director. She deserves more recognition.",
    "66": "Last year like many being an \"Elvis\" fan I saw the \"Elvis\" movie with Austin Butler and was thrilled by it and enjoyed it, as they say and always as most know their is two sides to every story and we get it here with this new bio film named \"Priscilla\" based on a 1985 book \"Elvis and Me\", from director Sofia Coppola. And really one might say after watching that this is anti-Elvis film. It really is a fairy tale like look at a young teenage girl who's handpicked by the king to be queen, only sadly to end in hurt and divorce. Elvis(Jacob Elordi) is actually a controlling and tough like dog to Priscilla( a charming and emotional performance from Cailee Spaeny), the movie starting when Priscilla is 14 and she begins courting Elvis when he's 24, the romance a fantasy finally ends in marriage only sadness begins as Priscilla begins a shut in at \"Graceland\" while \"Elvis\" is off with his film work and possible flings with Ann Margret and Nancy Sinatra, as only \"Elvis\" gives her time to time phone calls. Really you see a gross of power balance between a star and young woman, still despite all of the hurt and drama one thing for sure that this film shows is that \"Priscilla\" couldn't help falling in love.",
    "67": "In Sofia Coppola's film \"Priscilla,\" the story unfolds as teenage Priscilla Beaulieu encounters the iconic rock-and-roll superstar, Elvis Presley, at a party.Behind the scenes, he transforms into someone unexpected: a thrilling crush, a companion in solitude, and a vulnerable confidant.Through Priscilla's perspective, the movie delves into the unseen facets of the great American myth, exploring Elvis and Priscilla's protracted courtship and tumultuous marriage-from a German army base to his opulent estate at Graceland.The film boasts a stellar cast including Cailee Spaeny, Jacob Elordi, and Ari Cohen.\"Priscilla\" adeptly captures a young woman enthralled by celebrity allure, struggling not to lose herself in the glitz and glamor.While some Hollywood biographical dramas tend to exploit sensationalism, \"Priscilla\" skillfully navigates the risky territory, presenting a poignant portrayal of Priscilla's vulnerability within a toxic relationship.The film offers a crucial perspective, shedding light on a female point of view in a predominantly male-dominated world, set against a backdrop of suffocating confinement.The movie aptly depicts the challenges of a toxic relationships - the importance of perspective.Priscilla's story unfolds amidst parental consent for their daughter's involvement with an older man, reflecting a stark reality.The film skillfully conveys Priscilla's desperation and disappointment, making viewers acutely aware of her feelings of suffocation.The film does not shy away from addressing the predatory nature of the relationship, the intoxicating power of fame and its influence on the young and impressionable, with women often being the victims.\"Priscilla\" offers a thought-provoking and unsettling exploration of fame, toxic relationships, and the vulnerability of young individuals. (Women). It's a good watch.",
    "68": "No JoyThe story of this movie is simple, it's the life of Priscilla before and during her time with Elvis. As a young girl, 16/17 getting swooned into an infatuation with Elvis after a night they become closer and closer until she moves to him and they start a \"life\" together.The movie is sad, the poor woman was treated like crap by this beloved man. I don't want to spoil it completely, yes it's a true story but on the other hand I had no idea about any of this until the movie.Elvis isn't this amazing be all end all guy, he is a star, who struggles with self confidence and takes that out on Priscilla, there are some intense scenes, and very little to smile about.The movie is good, I don't really see myself watching this one again, not that it's bad it's just a bit heavy, that's a testament to the terrific acting all round.A bit slow, not amazing but not bad, decent watch 6/10.",
    "69": "This is a dangerous premise that can be explored deeply if you are bold and insightful. Sofia coppola is neither as her career demonstrates. Her most interesting movie was a go at a psychological deep dive of the mind of a middle aged celebrity coming to terms with his limited happines in the later stages of life. Here we have a movie with a similar attempt of catching the same sombre, slow and immersive shooting style where actors are left a lot of room to breathe and \"act\". A lot of pauses, a lot of silence, it can be immersive as it also allows the viewer to observe the character without any of the plot pulled into the forefront. You get to take in the human experience, at least that is what long pauses and empty silences left in a movie is for. But when the actors are not scarlett johanssen or bill murray, when they have nothing interesting to show or possibly say then the movie becomes this. Even if your characters ARE elvis presley and priscilla presley you never reall care. The fault lies in both the actors and the direction and the script.First of all as I mentioned this is a dangerous premise, the script yet never takes any real risk in showing the confusion, the power disparity, the innocence or corruption that may take place with such a controversial couple. Instead the script plays it safe and keeps those formative years of them short, brief and under the rug.The actors do a decent job, both elvis and priscilla convinced me of their roles. Still as the script they are not showing a whole lot of range required for their complex characters, if anything you would think of an conventional dysfunctional couple without anything sticking out. It is difficult to differentiate where the script hindered and where the actors but it is underwhelming nonetheless.Finally the gravest sin of the movie is the boredom. Movies ought to.fulfill one viewer expectation at the leaast and that is being entertaining. Since the movie aimed to be as family friendly as possible with the unfriendliest premises it fails miserably being both. Neither family friendly nor edgy. It is just meh, a mediocre piece of media failed from the beginning due to the direction lacking any umpff or courage.",
    "70": "Before I get into my opinion, I want to say that a lot of peopel seem to be missing the point. This is Priscilla's movie. Based on her book. So it is her version of who Elvis was as she remembered it as basically a child. Not yours, not Baz Luhrman's (terribly overrated overall, but especially his Elvis movie), not anyone else's. Only she truly knows if it is accurate, or embellished, you do not because you were not there so stop claiming that that the depiction was wrong, it is just one you are not familiar with.Now on to my opinion.... I love Sophia Coppola. I defend her every time that someone says her movies are boring, or that nothing happens. However, this movie just was not compelling. Maybe it had to do with the fact I knew the story, and have read her book, but this movie just did not hold my interest. Her direction was still fantastic. The cinematography was excellent. I think the acting was very good, especially Spaeny, but Elordi was fine as well. I was able to understand him and think he did well with the voice and mannerisms. Stop comparing him to Austin Butler. He did good as well, but these were completely different movies tonally and both played the role as they were expected to.The problem here was the screenplay, in my opinion. Not sure what more Coppola could have done to tell the story Priscilla wanted told, but she was able to give us a unique Marie Antoinette and turn what I consider a boring novel into a masterpiece of a film with Virgin Suicides, so I was expecting more.",
    "71": "A teen falls for a rock star and bores you to death.Phew, managed to stay awake. At no point in time was I rooting for the couple. It was so bland and uninteresting I was tempted to turn it off but I kept expecting this to get better but the ending was perhaps the most boring part.The acting?Cailee Spaeny is great and very believable 14 to 28 year old Priscilla. I was impressed that at each stage she seems to look and act as expected.Jacob Elordi pulls off a believable Elvis and they did a great job pulling off all the looks of the real Elvis over the time frame. He makes a good Elvis.So what goes wrong? The script and the directing were just horrible? I dunno but something goes horribly wrong with what should have been a great love story and ever spiraling decline due to the pressures of fame and fortune. But yawn, I struggled to pay attention. There is no love, there is no excitement, no spark, and very little romance. The actors just seem to deliver their lines and move on in the dullest monotone possible. The ultimate breakup felt like it was summed up in a single line of dialog.Recommendation?Don't waste your time. I don't think I have ever given that recommendation about a movie in a review before. This is no where near living up to the rating it's currently getting. If this was their marriage it didn't die from infidelity, it didn't die from a lack of love, it didn't die due to drugs, or even the music / movie industry. It simply died of sheer boredom. Sorry to leave such a down review but this was as dull as it gets. A 4 is a gift.",
    "72": "After the success of Elvis in 2022, it was interesting to see that Sofia Coppola would be tackling the other perspective of that story. Whether you're talking about Lost in Translation or even more recently On the Rocks, I have been a big fan of Coppola as a director. For that reason alone I was going to give Priscilla a shot, and I'm glad that I did. I have my issues with it, but I believe it's a good film. Here are my thoughts on Coppola's latest.Meant to act as a portrait of the period of Priscilla's life when she was with Elvis Presley, this film focuses entirely on her perspective. Elvis is very much a presence in the film, but we never see his day-to-day life. In many ways, this is simply a character study of the mindset of his wife and I thought that was fantastically done. I honestly didn't know a lot of the ins and outs of their relationship and how awful it was for her on an emotional level. That sucked me in from the beginning, but the story doesn't really have anywhere to go beyond that.Cailee Spaeny is a huge standout here, completely devoting herself to this role. She is easily one of the biggest highlights for me, as she's somehow terrific without being given enough to work with. She's acting circles around everyone, as well as the screenplay. It's a very streamlined film and if you know what happened in real life, it can actually start to feel its length, even being under two hours. I was hoping for a few surprises here and there or some crazy moments, but Priscilla is basically always a very calm film. That was its detriment, but the fact that it's slow definitely had me appreciating the set design and cinematography.Although static and simple, the cinematography feels like a character in the film. There's not much going on, but Philippe Le Sourd did a wonderful job behind the camera. Upon looking up his previous work, I shouldn't be surprised because one of my favourite \"looking\" movies in the last ten years or so is a film called The Grandmaster, which he also did the camerawork on. He's great with framing crazy stunts and moods, as well as subtle portrait-like imagery, as seen in Priscilla. He's one of the better cinematographers out there in my opinion, but hasn't done all that much.Overall, Priscilla has a stellar central performance in Cailee Spaeny, Jacob Eloise is solid as Elvis, and Sofia Coppola absolutely does her best directing this film. I just wish there was more included in this film story-wise. I was really enjoying watching this period of the titular character's life, however, there wasn't enough drama or interesting material to take it over the edge. I'm sure certain viewers will find more than enough to like here, but I can also sense that many viewers will also find it boring or uninteresting. I fall on the positive side and say give it a watch if it's something you're already interested in. Priscilla is now playing in theatres.",
    "73": "This is the worst movie ever made about Elvis. It's a low-grade chick-flick. It was made by a talentless director only in her position due to family connections, and whom obviously has led a very sheltered, and spoilt existence. The truth about Pricilla is far more interesting in reality than how her life - or a speck of it - was portrayed in this beyond beige movie.If you value your time, skip this garbage. However, if you watch it in fast-forward you'll see very quickly that nothing unique, creative, or interesting occurred during this movie.Grey, bland, boring, uninteresting, vacuous, and unentertaining is how I would begin to describe this time-thief of a production.The director took a minimalist approach to this sub-standard boy-meets-girl movie. The story was minimalist (in that nothing of any interest or revelation happened), the wide shots were minimal, the sets were minimal, the number of extras was minimal, the entertainment value was minimal (non-existent, really), and the writing was minimal (boy meets girl; they laugh, they cry, they get angry sometimes, et cetera, and they live a bland life, which I am certain doesn't reflect reality). Pricilla's closet full of skeletons was certainly kept locked tight as far as this pathetic attempt to show her life with Elvis is concerned.",
    "74": "It's 1959 Germany. 14-year-old Priscilla Beaulieu (Cailee Spaeny) gets invited by a soldier to meet Elvis Presley (Jacob Elordi). She's in the ninth grade.This is Priscilla Presley's version. The big controversy is an internal family dispute over the estate and then this film. After watching this, I get it now. Priscilla is long past her hero worship of Elvis and wants to tell her side. The grandkids were born after Elvis and nobody wants the family's dirty laundry hanging outside. I certainly get it, but it is Priscilla's life. She lived it and she gets to tell it. To be clear, Elvis does some stuff, but he's not a cartoon villain. He is a troubled man. Most Elvis movies have him as a victim beset by drugs and the Colonel. This movie shows that victimhood does flow downhill.Most of the time, accuracy be damn especially when the world doesn't depend on it. In this case, I do have a bone to pick with Sofia Coppola. Priscilla did have affairs. That does matter especially when Elvis threatens to kill a guy. That's great drama. Why isn't that in the movie? I suspect that Sofia is doing her usual ethereal powerless female trapped in her life. The affair probably detracts from her thematic cinema works. I would have prefer keeping it in. This is a great biopic. It takes a central theme and runs with it. Cailee Spaeny needs to get some recognition.",
    "75": "\"Priscilla\" is more than an accurate bio of Elvis Presley's very young wife; it is the story of a very young woman getting everything she could possibly want that turns out to be not what she wants; and it is the story of young girls confronting a teen idol, and losing themselves in their adolescent longings.Writer and director Sofia Coppola gives quiet life to Priscilla Presley's novel, Elvis and Me, by accompanying her during those years when at 14 she met Elvis, married him a few years later, and then left him after he had left her so many times for work and, as the tabloids reported, Ann-Margret and Nancy Sinatra. Coppola's strength is that she might as well be talking about any girls, like my sisters, who were mesmerized by the king.No scenes with The Colonel, no Elvis songs, and no screaming as their marriage deteriorates. We do, however, have multiple scenes of the couple taking excessive drugs that will eventually, we know, be the downfall of Elvis.As Coppola did with Virgin Suicides, Lost in Translation, and Marie Antoinette, she goes inside young women to ferret out their anxieties and their dreams. As with Lost's Scarlett Johanssen, Priscilla can't be charged with gross immaturity; rather their journey is toward a better understanding of those occurrences.The sound track, non-Elvis, culls from 60's and 70's hits like Venus, Crimson and Clover, and I Will Always Love You (sung by composer Dolly Parton=just right). Coppola seems to say that without Elvis's music we should be able better to understand the complexity of the nave couple.",
    "76": "Director Sofia Coppola is known for her slowburning character portraits and this movie is no different, but this being a lovestory I missed something quite crucial:The bad: I truly tried to give it a chance, to not be too critical about the likeness of the actor who played Elvis. Because he didnt impress me at all with his looks, nor his accent, nor his (lack of) charisma.The real Elvis had instant charm and tons of charisma, this actor has not enough character to personify the great Elvis, but let's forget about that for a moment, there is something else really wrong with this love story:More bad: there is no true drama or fiery romance! This being a love story and all I was expecting fireworks, but none of that. This entire story just toddled along gently, with several tedious lovey dovey meetings between Elvis and Priscilla, but it never elevated to something worth getting excited about. A definite lack of chemistry between these 2 lovebirds.Not terrible for sure, but quite uneventful and a bit boring to be honest, not at all what it was hyped up to be. It's basically not much more than a girly movie about puppy love, with mediocre acting performances and a definite lack of true drama or any drama or romance at all, to be honest!",
    "77": "After watching this attack on 'The King' by his ex-wife, I had to go on IMDb to see how his fans would react and was surprised to see that it had a robust 7 rating. Guess there are more \"ex-wives\" out there watching this than there were Elvis fans ...I saw some of me in my failed marriage and wondered when Elvis was born. Sure enough, Priscilla portrayed him as a control freak and, that's just what a majority of people born under the Capricorn sign are. We are fun, charismatic and loved by many - but make terrible spouses ...It is portrayed that Elvis wanted someone he could control after going off and whoring it up on his movie shoots, even describing Ann Margaret as \"every other Hollywood actress\" - caring \"more about their careers than their men.\" In his defense, here's a man who could've had almost any woman on the planet worshiping him at his feet and he just wanted \"the perfect woman\" to fit the role of not being like that when he got home ...Every couple has their problems,and Elvis is not around to defend himself and Lisa Marie I've since learned had vehemently denounced this movie before she died (although she wasn't around when all this took place and we all know that daughter's love their Fathers unconditionally ...) so why now? Because Hollywood obviously wanted to capitalize on the success of last yrs 'Elvis' movie.Keeping that in mind, there was just no need to air this one-sided dirty laundry. I'm sorry i saw it.",
    "78": "Priscilla is another triumph from Sofia Coppola, exploring Priscilla Presley as she embarks on her complicated relationship with Elvis.It's refreshing and expected that Coppola doesn't shy away from the reality of this relationship, delving into its more sinister elements to create a really intriguing film. It covers a good amount of ground, and even when it isn't dwelling on the events themselves, it always captures the mood.I think this is what Sofia Coppola does better than most filmmakers out there. She is unrivalled in capturing mood and tone through use of music and visual elements and her direction is always faultless in this respect. As a result, the essence of this relationship is portrayed so effectively.Of course this is helped massively by the performances. Jacob Elordi is good, not great. With Austin Butler in recent memory as Elvis this performance was always going to be overshadowed a bit. But that is almost inconsequential because this film is all about Cailee Spaeny, who gives a truly captivating performance. She portrays the complexities and growth of Priscilla so well. You literally see Priscilla grow from a girl to a woman through this performance and it is incredible to watch. For this film to work it needed a star in this part and Caille Spaeny delivered.The result is a rich, complex and layered film that lifts the lid on one of the most famous relationships of modern times, exploring it in an unflinching and powerful way.",
    "79": "\"Priscilla\" is a biographical drama film written and directed by Sofia Coppola (\"The Virgin Suicides\", \"Lost in Translation\", \"Marie Antoinette\") based on the memoir \"Elvis and Me\" by Priscilla Presley and Sandra Harmon. Starring Cailee Spaeny and Jacob Elordi, it presents an often overlooked perspective of an iconically complex romance.In 1959 in West Germany, 14-year-old Priscilla Beaulieu (Cailee Spaeny) is staying with her family at a U. S. military base where her father has been stationed. One night, Priscilla attends a party on the base where she meets the famous singer Elvis Presley (Jacob Elordi), who was recently drafted into the military. Despite being ten years her senior, Elvis takes an instant liking to Priscilla, believing she is far more mature than her age and the pair begin dating in secret. After completing his service, Elvis returns home to the United States and eventually loses contact with Priscilla, which leaves her heartbroken. In 1962, Elvis reaches out to Priscilla, requesting that he comes to live with him at his estate in Graceland. Priscilla accepts Elvis's invitation, and she travels to meet with him where the two become a couple once more. Over time, the pressures of both Elvis's fame and Priscilla's worsening mental state begin to grow, which takes a toll on their outwardly perfect relationship.It's a safe bet that anyone with even the most basic knowledge of music knows who Elvis Presley is. During his lifetime, Elvis redefined rock and roll as we know it, rightfully earning himself the nickname \"The King\" as a result. But what many people may not realise was the complexity of Elvis's relationship with Priscilla Beaulieu, whom he met when she was only 14 and later married after an almost eight-year-long courtship. Sofia Coppola's film \"Priscilla\" delves into an interesting side of this relationship from a viewpoint that other forms of media tend to omit altogether.From the way this film is presented, it's obvious that Priscilla's vision of a fairytale romance with the world famous singer will not to go the way she had envisioned. When she first meets Elvis, he makes it abundantly clear that their age difference is going to play a major factor while they are dating. Yet despite this, the two nonetheless choose to continue their relationship with each other, regardless of what others think. Later on when Priscilla moves in with Elvis, it seems things can only get better for her as he showers her with lavish gifts and money, as well as the most comforting thing of all; the hospitality of his family.However, cracks soon start to show in Priscilla's new life, changing her from a starstruck fan to an ostracised member of society. It is here that the film does a clever job of showing how Priscilla is unable to live normally under these new circumstances, including how she faces the scorn of the staff at the Catholic school she attends due to her boyfriend's \"evil ways\". The tragic part here is that Priscilla now knows full well that she can never go back to her regular life, forever having the stigma of being in close affiliation with someone as controversial as Elvis Presley. To make matters worse, she is still technically a child at this point, meaning she still has her whole life ahead to cope with her mounting problems.Thanks to Sofia Coppola's subtle direction, the film never feels overly sensationalised in its execution. Unlike Baz Luhrmann's 2022 \"Elvis\" biopic, which revelled in its bombastic nature, this film is content with its slow burning, refined tone. One scene where I thought this was particularly evident is when the young Priscilla is in school trying to get on with her studies, only to be leered at by her fellow students and teachers due to her personal associations. Instead of playing this part up like some cliched teenage drama, Coppola uses this opportunity to showcase Priscilla's ostracisation via some artistic choices. For instance, Coppola chooses to slowly zoom in on Priscilla's sad face as she deals with constant ridicule to show that this is an internalised conflict she must overcome, as well as giving off the feeling that the whole world is closing in her. Additionally, there are also some creative choices in lighting during similar scenes to symbolise her bright future becoming dark as a result of all her problems. In the hands of another director, the nuances of Priscilla's life may have been glanced over in favour of the spicier details but Coppola understands the need to focus on certain details in order to properly humanise her subjects.As the title character, Cailee Spaeny does a convincing job showing Priscilla Presley's (ne Beaulieu) youthful naivet at all the right moments. Spaeny's performance is especially a stand out as she is able to convey a great deal of information about her character to the audience through more than just dialogue. In one scene, we see Priscilla standing inside her large bedroom filled with expensive furniture and artwork, somewhere many would consider rather luxurious. However, it is clear that Priscilla herself is unable to enjoy where she currently is because of her husband's absence, which is shown through her reserved body language. As this film is executive produced by the real Priscilla Presley, I can safely assume that she approves of her depiction in this movie, even if her late daughter Lisa Marie reportedly did not.I think Jacob Elordi's depiction of Elvis is definitely worth mentioning as well. In this film, Elvis is less like a rock star and more like a vulnerable man who loves his family, to the point where he desperately wants to welcome someone like Priscilla into it. He seems like a person who wants a real partner to share all his fame with, but cannot form a real connection with anyone other than Priscilla. Of course, her being underage is a major elephant in the room so it's hard to really want to support a relationship that would be considered statutory rape in any other context. Nonetheless, Elordi's portrayal is a worthy one that compliments Spaeny's quite nicely.If anyone was put off by the exuberant stylings of Baz Luhrmann's Elvis film, then \"Priscilla\" provides the appropriate antidote you might be looking for. It achieves what it was going for not via sensationalism, but rather through the subtle behaviour of its subject matter. Rarely have we ever gotten a film about the most important people in Elvis Presley's life that doesn't make him the centre of attention, but this one does a nice enough job of respecting his influence while also keeping the focus away from him and on the actual person in question. For that reason alone, the film has done something right.I rate it 7/10.",
    "80": "I try over and over to give Coppola a chance. I cheer her on in my mind thinking maybe she'll make a movie half of the virgin suicides. I had the innocence of a little kid before the grinch steals Christmas coming into this movie.It feels like Coppola had a burst of motivation that lasted 15 minutes into the film and then she threw in towel. Monotonous, Lacking, Boring, Bad and Awfully DEPRESSING!!!Let's start off with the movie heavily relying on the aesthetics, which is not able to carry a solid movie alone. Elvis looked like he needed a cheeseburger and the actor for Priscilla couldn't display any emotions other than the sad puppy dog face. Maybe that's how it was. Who knows. The movie had virtually no plot, no climax and an ending that felt unfinished. Did you run out of a budget?Elvis and Priscilla's story is a striking one, but unfortunately only some can accurately capture it. Coppola is not one who can. Waste of my money and I thought about walking out of the theatre.",
    "81": "This is one of those movies that feels longer than it actually is, we swore it was well over two hours when it was done. The strangest thing that stuck me is that there was zero concern whatsoever for a 14 or 15 year old girl hanging out without her parents at adult parties and then alone with a man 10 years her senior. And why she stayed with him after his treatment of her is also a mystery. Although not entirely his fault, I'm sure partly because of his daily abuse of prescription drugs, Elvis is shown to be a real ass at the drop of a hat over and over. Also kind of amazing that they could make the life of Elvis at his peak so boring, albeit spiced up with constant frat boy behavior with his buddies, which they neglected to point out was named the Memphis Mafia. Since Priscilla was a producer on the movie, one would assume the stories shown are accurate, at least from her perspective. They also almost completely ignored the constant philandering by Elvis, which was probably the last straw that ended their marriage after only 5 years.On a personal note, a friend of ours actually lived in a house behind Graceland when he was a kid in the 60s and he remembers them riding horses and shooting guns at all hours of the night. They had the guns in the movie, but not horses.",
    "82": "Like all biopics, Priscilla provides a standard chronology of the key events in the life of its subject. Where the movie takes its biggest risk is in its portrayal of Priscilla herself. Coppola sees her as being largely unchanged from when she met Elvis until just before she divorced him. The movie is a sobering and often disquieting counterpoint to Baz Huhrrman's flamboyantly entertaining Elvis. While the latter characterized Elvis' life as a wild carnival ride, this one shows what it was like for his wife when he wasn't around. Through her photographer's eye for detail and setting, Coppola deftly captures how Priscilla's life was glamorous, occasionally exciting but mostly boring. I've been an admirer of Coppola's artistry from her first feature film. I love how all of her films are imbued with her unique vision and insight, and how she uses her stories to explore different aspects of the themes that interest her. As with her previous films, Coppola allows her curiosity to guide her vision, crafting a story that yields a fresh perspective on the questions she's compelled to ask. The subjects here may be Priscilla and Elvis Presley, but the insight the movie offers is universal. Recommended.Detroitcineaste dot net.",
    "83": "I must admit my initial reservations about watching this film were wholly justified pretty early on. It's one of the worst Elvis based movies yet, and i've pretty much seen them all.Of course, regardless of oddly accepting Southern US attitudes back then (see Jerry Lee Lewis marrying his 13 year old cousin for further evidence) the whole bizarre scenario here is pretty creepy and wholly unacceptable in this day and age, in that a 24 year old guy casually woos and dates a 14 year old girl, let alone that it was the King of Rock n Roll doing so.Indeed the sad, sordid little tale itself is pretty dull and uneventful, but for me what absolutely ruins it most is the bizarre inaccurate difference in height between the two leads, which makes the 10 year age gap and premise between the two look even worse...Cailee Spaeny's Priscilla is actually well portrayed, especially aesthetically, but Jacob Elordi's Elvis just doesn't cut it - he nails the voice ok but being a gangly 6' 4 actor when Elvis himself was 6 feet and pretty toned, it looks laughably bad, especially up against teeny tiny Priscilla.The glaring omission of any Presley music also doesn't help (The EP estate refused permission, no surprise there).All in all then Priscilla is unsurprisingly a total bust with deviant undercurrents galore that make it rather surreal, uncomfortable viewing from thr get go - do yourself a favour, skip it and go watch Baz Luhrmann's recent/decent Elvis biopic instead, it's definitely a case of A little less conversation, a little more action over this pervy outdated rubbish...",
    "84": "Keeping in mind that this was a film from the perspective of Priscilla, I was not surprised that Elvis was nothing more than a wall paper But even that wall paper was very one-dimensional and flat.As Elvis is no longer among the living we have only Priscilla left to tell the story. So, she comes out as a victim and there aren't many still around to tell the truth or tell it fron an other perspective. This is excatly the thing I have against this film. Priscilla comes across as a mere girl swept into a life of partying, drugs and a guy who builds her into his living doll. With absolutely no voice to her own. She does eventually at the very end. Elvis comes across as a guy who is there bringing in the money, goes and comes as he pleases and keeping his doll to his house and his leisure. I had hoped to see more of how Elvis made Priscilla decide to leave him. It was very rushed towards the end. Too much was given to their budding romance and too little to the end. It made it a very uneven telling Cailee Speaning did a decent job as Priscilla, though I never felt she became her. Jacob Elordi was not convincing as Elvis. Too tall, no charisma and not likable. As I mentioned, nothing more than wall paper.",
    "85": "At last, a film depicting Elvis as the groomer he actually was.So funny the Elvis fans giving this film 1 and 2 out of 10 because they are fuming at the film actually telling the truth.No matter how you dress it up, Priscilla was 14. 14!!!He gave her drink and drugs.I have a daughter who is 14 and the thought of a grown man treating her and going after her this way is sickening.I definitely blame the parents and the 'she is mature for her age' trope is pathetic.Well done to Sofia Coppola for this truthful portrayal. Rather than casting Elvis in the saintly, innocent badly done to, bereaved victim.He was a groomer! No more, no less.",
    "86": "I'll keep this a brief as I can.The guy that plays Elvis looks nothing like him. Could say the same about the girl who plays Priscilla, both were certainly uninspiring, neither took the movie and made you want to keep watching.I expected a film by Sophia Coppala would have surpassed the original 1988 mini series but not to be.But that is just the beginning on how bad this movie is. I can understand why EPE wanted nothing to do with it. It's amazing that a remake of a mini series made in 1988 could fall so far below par.I was really looking forward to watching this but was very disappointed.Do yourself a favour and give give this one a miss & watch the original 1988 mini series Elvis & Me. A much better production all over."
}