{
    "0": "\"Exploits of A Young Don Juan\" is very unique, in that it's a softcore erotic film where the main character is a boy instead of a girl/woman. When the men must leave the picturesque Italian countryside to fight in WW1, 16 year old Roger is left behind, with a house full of lonely women! The film takes place in a beautiful old mansion, and the sets and period costumes are all top notch. Truly this is a gorgeous looking production. The character Roger is cute and likable enough, and there are many silly, light moments. Especially towards the films conclusion, when it is discovered that he has unwittingly impregnated all the women in the house, including some servants! Don Juan, (AKA The Initiation) could have used a bit more serious, dramatic moments, but it seems like the director was going for something light and sweet. The film is a success, and I'm surprised it isn't well-known. As it stands this is an extremely rare title, almost impossible to find. While not as graphic as films like \"Emmanuelle\" there is a bit of nudity and a lot of sexual innuendo. But never for a moment does it become sleazy, or low-brow entertainment. This reminded me of an American film, \"A Night In the Life of Jimmy Reardon,\" starring River Phoenix, also from 1987. It is worth tracking down.",
    "1": "This film was released on NTSC VHS videotape in North America by Acteurs Auteurs Associés (AAA) Films Distribution in 1987 with the French title..... LES EXPLOITS D'UN JEUNE DON JUAN....It had a small distribution in Quebec and the French speaking areas of Eastern Canada and the northeastern USA....There is no DVD version......It was released in French Language with no English Subtitles.....It is no longer In Print and is rarely seen in French Canadian video stores.....the Ex-Rentals are generally poor quality and and the original tape has often been replaced.....Best to find one with \"Good\" Picture Quality........It was released with a French language jacket with a picture of the young boy and five beautiful women on the cover......Directed by Gianfranco Mingozzi and stars Fabrice Josso, Virginie Ledoyen (as a child) , Claudine Auger, Serena Grandi, Marina Vlady....the run time of the North American release is 1 hour 38 minutes............Contains extensive female nudity.......\"Serena Grandi and most of the beautiful females in this film are alone during the War in France and they are all lusting after 16 year old Roger in this very sexy French comedy........He soon impregnates the maid (Serena Grandi), his aunt (Bérangère Bonvoisin), and others in quick succession. Roger desperately tries to marry off the women to other men to avoid a lurid scandal.....Wonderful fun.....Beautiful women....and a very cute Virginie Ledoyen in her first film role.\"",
    "2": "EXPLOITS OF A DON JUAN (Gianfranco Mingozzi - France/Italy 1987).Based on the novel attributed to free-minded Guillaume Appollinaire, probably written around 1910 (he never acknowledged writing it). He became most famous for his recognition of the works of Marquis de Sade in early twentieth-century French literary circles. Just as De Sade's work, most of his own work was banned (and totally obscure) until the late sixties.Sultrous Italian bombshell Serena Grandi is the main female attraction in this French-Italian sex comedy set during WW I about a 15-year old young man who impregnates three women, including his aunt, while all the men are away in the trenches. Don't look for particularly stunning French beauties here, it's mostly well-rounded, somewhat older, women who awake young Roger's sexual interest, like maids, aunts and farm girls. Delivering this kind of erotic cinema remains largely the exclusive domain of the French. Although directed by Italian Gianfranco Mingozzi, this largely follows this pattern, but at times it's a bit of an odd mix of the more typically French high-brow erotic finesse and more low-brow, perhaps more typically Italian farce or slapstick, but altogether a surprisingly good film. It's well made, shot with relatively large means and good production values and period design, it's actually a very handsome production.Camera Obscura --- 7/10",
    "3": "Just a quick little review for this enjoyable little film. It's a rather strange hybrid of an Italian sex comedy. The cast is quite international with quite a large French complement and it was a France/Italy co-production. This perhaps explains some of the differences to other films in the genre.The sets and costumes are marvelous and authentic. Lovely cinematography. The writing is terrific. Very light and funny with some slapstick and farcical elements. Plenty of sexy spice in there as well.The cast is quite talented with a lovely female contingent and the men are good at adding comic relief without trying to hog the spotlight. The male lead is pretty perfect casting. Young and appealing enough to make a believable young \"Don Juan\" rather than the usual aging Lothario.This movie is funny and sexy without being sleazy. It's the kind of movie that I would like to see more of. In the current Disney dominated Hollywood sex is expected to be hidden away in case it corrupts our morals. The people who do \"erotic\" films today have to work with a low budget and seem to think sex on film has to be dirty and shocking and explicit to make an impression. Some of those \"dirty\" movies are quite good but mostly they're just bad.Ok rant over. I can honestly recommend this movie to anybody that doesn't think sex is bad and who likes to laugh.",
    "4": "\"L'iniziazione\" - and try saying that title three times fast - is allegedly a softcore, erotic flick, which is actually based on a pornographic novel by the poet Guillaume Apollinaire. What's funny is that there's no real attempt at eroticism in the movie. There is some nudity, but it's incidental, and never shot to arouse or even be the focus of the shot.There's also no sex. Characters have sex, yes, but the action cuts to afterwards, so we don't get to see.The main character also isn't particularly likeable. He's a prop, like any male character in a porno film, there to have sex. But since the movie has no sex, he just wanders haplessly through it.The movie's only real source of life or interest is the beautiful Virginie Ledoyen, here in her film debut at only nine years old. She lights up the camera. The movie should have been shot through her eyes.",
    "5": "In setting and story, this film is fairly similar to David Hamilton's Tendres Cousines.  In both films, we have the sexual awakening of a male teenager during the outbreak of WWI as the centre piece of the story.  In both films, the viewer largely experiences the story through this boy. In both films, the outbreak of war is used to make women more 'available' to him, since the adult males are conscripted or volunteer for the army. In both films, he makes use of that - first cautiously, then with increased confidence and vigour.But while Mingozzi must have seen Tendres Cousines, his film is not a carbon-copy by any means.  Hamilton's film closes with a romantic happy ending that just does not ring true and Mingozzi avoids this fault. Our Roger may be hormonally oversupplied, but the find-a-girl-to-settle-down hormone is nowhere to be seen.  Keeping the plot bubbling along was also not one of Hamilton's strengths - he focuses on scenes and lighting, while 'Exploits...' is overall a more rounded picture.Perhaps the most striking difference between both films are the objects of sexual interest.  In Hamilton's case the word \"nymphettes\" inevitably springs to mind, while Mingozzi's objects of desire are less obscure - quite simply \"women\", of different ages and shapes.  In particular, Hamilton lets his older women (meaning: older than 22!) hint at expressing their sexual desires, but cruelly these desires always remain unsatisfied - Mingozzi is much more merciful in that respect.",
    "6": "I think it is obvious that the story should be treated as a fantasy of a young boy,\notherwise the sanity of the protagonists should be seriously questioned here.But as a dream it is quite charming, the journey of the boy to the adulthood in the safe environment where everybody is friendly and supportive ( sometimes even a little too much).And having Serena Grandi as a sensual guide it is a dream many would subscribe to.There are plenty of funny moments in the historical ambient, actors wearing the clothes from the era\nand the copy I have seen was of a good quality, that should be enough to provide some entertainment.The high rank notes are lowered by the incestuous topics, that does not fit for this genre of the movie.Also, however it may be addressed to the novel, not the movie, the nickname young Don Juan is an abuse to the great literature protagonist\nwho was everything, but a country retard.Not like the English movie title is any better."
}