{
    "0": "Salman khan did the same monotonous low pitch voice in all his recent movies. Which is unbearable, annoying. No voice modulations, emotions and variations.. He probably tries to imitate Bobby deol silent action hero type acting. Like Soldier, Bichhoo, Gupt.. But Bobby Deol's low pitch voice is not annoying at all, it is soothing, while Salman's voice seems like he has flu and sore throat since a month.The acting of all the actors was decent. Story was forgettable, screenplay was similar to the previous versions, nothing catchy. Overall a linear action drama. And another repetitive thing in the movie was the introduction Background music, especially Emraan Hashmi's BGM, it was given each and every time he came on screen!! Hella irritating, overdone! Unnecessary!Its a boring film for me. No spoilers.",
    "1": "Being a Khan fan the flagship dish named \"2023\" was very heavy & painful to digest, especially after such continuous disappointments. First pathaan, then Jawan and now tiger 3. All are the beads of the same necklace. It feels like Bollywood has become complacent and hence has done abortion of 2 terms, \"Innovation\" & \"Creativity\". This movie is no exception. All things disappoint, from storyline to overcooked action scenes and from acting to less cooked script. The dish tiger 3 is over cooked from certain aspects and less cooked from others. All contributing equally to another disaster.If you are lucky enough to have a decently working brain, please keep it outside, because this movie doesn't make sense even for a minute. Each and everything is absurd and baseless. Sometimes even a congress spokesperson makes more sense than this movie. A rogue ISI agent trying to become PM of Pakistan and a rogue Raw agent trying to stop him, both agencies on the other hand are just displayed as mere spectators. Feels like a storyline at which even a 8 year old will laugh.Only 2 points which were impressive enough were acting displayed by Imran hasmi and background music. I don't see anything cooking similar to that of Oppenheimer or Interstellar from Bollywood for another decade, because of lack of 2 things namely, directors brain and demand for good quality movies. This movie fails to grab and involve the attention of the viewer which her 2 predecessors did brilliantly. The first half was bland but still decently enjoyable. The second half came with a good nap.I was only waiting for the movie to end since the second half of the second half began. The theatre was filled with forceful laughter and internal disappointments. Srk cameo was the only fresh breeze to make you smile in the complete second half. Climax is the last nail in the coffin. The brain of the director of the movie seems similar to that of the real life ishan who has not found his amir khan yet.",
    "2": "The entire experience is shameful, \"Tiger 3 is biggest flaw, a complete lack of Script, is only further underscored by a laughably unrealistic Action of our heroine doing action in Towel and heels.\"\nThe highlight of the film is the Pathan cameo and post credit scene.The downside is interval and Second half, where we are shown that Tiger can escape from any impossible situation simply.The first half is a slow, of course the second half which is pacy but weak on the script front.In simple Words Maha boring than Movie\n\"Fan\" which was also directed by Manish sharma\nThe VFX of the film is Average Totally\nDisappointed.",
    "3": "Wasted time and money on this crap. Story is all haywire with many missing dots to understand the storyline. They didn't pay attention to story, but on fights and violence. Almost a dark movie except some European and Russia day light scenes where actors aren't visible. Most story and action is all inside. Pathaan and War aren't really connected, seemed like those two actors were joined to this movie by a duct tape.Only Salman Khan fans would love this one. This one has the bogus masala and unwanted action for them. It's not at all gripping as the first one, even as gripping as second one. It has too much of sound just to express that scene is something really interesting, when it's not.",
    "4": "Salman had set high expectations but Tiger3 does not at all live upto the hype. Poor VFX, very few punch lines, slow moving story, over use of graphics for fight scene makes movie miserable. YRF and Salman combo would have killed the stage if story was good, direction was good, but no, they totally messed it up and probably a disaster in Tiger series.Despite other big shots cameo, the movie does no justice to the name and fame of Tiger 1, 2.To rate the movie, it's an overall 2/10\nSalman acting : 5/10\nStory : 2/10\nPunch lines : 3/10\nGraphics : 1/10\nVFX : 2/10\nDialogues : 4/10\nCameo : 6/10\nHeroine : 3/10.",
    "5": "Direction has been a little disappointing around the films associated with YRF Spy Universe including recent releases like Pathan and Tiger 3. Whereas speaking about performances of this film, it was forecasted properly from the actors. Salman khan is all about action and charisma whereas one should never expect crying from him. Katrina Kaif has done a fabulous job in all her action sequences and Emraan Hashmi is all about perfection. Kumud mishra has been amazing throughout the film. Story telling was good in the film but it would have been much better with less action sequences. Bgm felt nostalgic and overwhelming which actually helped the film and audiences to connect. Cinematography and DI has been much better than any tiger franchise. Some scenes felt very much jumped by director and some of them were meaningless in the film. Arijit's song and many other music pieces felt not needed in the film. Overall charismatic performance by the actors but it never brought hold towards audiences.",
    "6": "Utter nonsense and waste of time. Looks more like vimal and thumbs up advertisement got fused. Went to theater after looking reviews of youtube critics, sadly i was fooled. Movie starts with illogical scene where bhai as usual appears from no where and try to ride a bike in deserted vfx mountain faster than a helicopter and jumping into helicopter without being blown by the motor. SRk arriving out of nowhere in openly visible cable car in highly secured prison in a remote area in Pakistan and fighting pakistani machine guns and tanks and attack helicopter with bare hands. Typical bhai movie, if you want some story or have even a pinch of brain then this movie is not for you. Its only for bhai fans who have orgams even when bhai farts and they rush to smell it.",
    "7": "The last film of Salman Khan that I truly enjoyed was Tiger Zinda Hai that too way back in 2017. Almost 6 years later, every Salman film has been horrendous with Salman putting almost zero effort or ruining even best chances for himself. Finally early this year Pathaan came and his cameo as Tiger cheered the hell out of all the fans, I got even more excited for Tiger 3 and I had expectations it's going to be total blast, especially after knowing SRK is in the film as Pathaan and even rumoured Hrithik cameo. I tried controlling my hopes before trailer but after it released I had a blast especially after long rumoured Emraan Hashmi cameo was confirmed and seemed he'd play the brains against Tiger's brute strength, paralleling Pathaan and Jim. And I watched the film with complete excitement, only to receive a mammoth level disappointment! Tiger 3 is easily it just weakest of Tiger series, but weakest of entire Spy universe!Yes on paper the plot might look good due to geopolitical situations, but the final screenplay was totally haywire, first half focusing on the storytelling with big loopholes and mediocre dialogues like 'Ye Kanya Mardo ko ladna sikhaati' Nani Nano Nana Saand ko Laal Rang; or Emraan Hashmi's getup(onto that later); or even illogical action scenes in terms of writing especially saving much loved Gopi from Ek Tha Tiger and calling it as Mission Timepass, seriously? Revathi clearly described the location where Gopi was as a place where no one comes back alive, how the hell did Tiger saved Gopi in 10 minutes? By jumping towards Helicopter(I don't know what did they think Helicopter means). And then soon Gopi dies of injuries after revealing Zoya is working with ISI on something dangerous. Should I feel for Gopi's death or feel for Tiger as Zoya is backstabbing him?And then entire time no elevating scene, no out of the world action scene, just random plot moving on that too mediocre one. At least Pathaan with a mediocre plot had an entertainment factor, Tiger 3 is totally missing it. And then comes real reveal about Emraan Hashmi, the Zoya backstory which was forcefully integrated having absolute zero impact in the end. After that Emraan Hashmi scenes that somewhat was set in ETT events that made absolutely no sense due to continuity errors which got Emraan Hashmi pregnant wife got killed, yes similar backstory as Jim in Pathaan, except with lesser impact. For Junior, Tiger and Zoya attempt a heist, Tiger calls his RAW friends from TZH but don't tell them why they're doing it when they were supposed to be informed later on in the interval, what sense did it make then? Absolutely NOTHING! The heist was mediocre, so was the hyped Katrina Kaif towel fight scene. Till interval I awaited some banger moment, like previous Spy films but this one had one average Salman Khan entry and that's it! As the plot was being build, interval happened?The second half somewhat picks up pace but before that highly illogical Pathaan entry(onto that later) almost made me pull my hair, like what is going on! And then everything was about saving Pakistani PM more than the PAL codes that can destroy Indian cities, like seriously? And while another fan favourite character Karan from TZH was dying, you reveal another character Javed turning against Tiger and Zoya because he was brother of Emraan Hashmi's wife, SO WHY DID HE FIGHT ALONGSIDE TIGER AND ZOYA IN TIGER ZINDA HAI AND DID NOTHING!!? And again am I supposed to feel bad for Karan's death or feel shocked for Javed turning villain? Incoherent screenplay. Even Hassan's character in TZH was given a mediocre role and death failed to impact well enough, especially when he was like son to Tiger and Zoya. In the end it was supposed to be Emraan being brainy and powerful but somehow Salman outwits Emraan most of the time, like how? And in the end it's all about Pakistani prem to the extent played Indian National Anthem on Pakistan soil, like seriously?This is the first time I felt bad for Salman Khan, because he actually gave his best foot forward and acted well, living upto Tiger's name. Perhaps his best performance as Tiger and easily top 10 best Salman performances. And again Salman is back in his element when it comes to action, even in emotional scenes he emoted really well. But unfortunately script lets him down. Katrina didn't give any good performance unlike the one she gave in Tiger Zinda Hai, although her end action scenes were terrific and it was clear she was the one performing her own stunts. But the real scene stealer without second thoughts was definitely Emraan Hashmi! And unfortunately that's the only thing I could say about his performance, he had no fault in acting department but his character Aatish was mediocrely written, with almost zero shining scenes unlike John Abraham as Jim was given in Pathaan or Tiger as Saurabh, or even Sajjad Delafrooz in TZH. Even the makeup on him looked weird especially by giving him grey hair you expect him to play an old character, almost zero effort in makeup department. If Emraan was given Jim level treatment with actually making him threatening or someone with high brains, he could've emerged as best Spy universe villain! Vishal Jethwa(replaced original Hassan from TZH) was good too, but as I mentioned earlier, his character dies and left with lesser impact. Revathi had almost zero importance unlike Dimple Kapadia in Pathaan. Here again Simran plays Pakistani PM and she was fine, that's it. Rest of the supporting cast, I was disappointed with their treatment. SRK cameo as Pathaan was highly nonsense and OVER THE TOP in every frame! Both SRK and Salman were defying physics, logic, sense and unnecessary added humour and plotholes, 1000 bullets go past them none of them hit the duo but they easily manage to evade bullets and their aim is too perfect for normal soldiers, like seriously? The best cameo and best scene or this film was that of Hrithik Roshan as Kabir, teasing War 2 which seems it's gonna be grittier, darker and more gruesome, something I wanted to see for a long time! Comparing the spy universes characters, I'm glad Tiger, Kabir and Pathaan are vastly different from one another, especially due to their styles. While Tiger is brute strength, The OG, matured and stylish; Kabir is hand to hand combat specialist, intelligent, team leader, no nonsense and ready to go dark path; Pathaan is the goofy, flirtatious, alpha male and street smartness. Hoping to see how War 2 shapes Kabir especially his fight with Jr NTR, then finally much hyped Tiger vs Pathaan, the ultimate Civil War/BVS battle!For now going 4 stars especially for Salman Emraan and somewhat an attempt of trying different in spy universe, had its screenplay and dialogues were better.",
    "8": "Its not a marvel fan service, they tried but according to me they failed. The movie was not great its just forgettable. From starting to end there is no specific goal of movie, whether its indopak peace or story of betrayal or its a rescue movie. Actually movie constantly shifts from character to character.The only good things are in movie are cameos but i dont know why they made it very very less although they could have done it little bit more but as i said it felt enjoyable but little bit enjoyable.As for acting the funny thing is why did Salman tried to cry and Katrina's Pakistani accent doesnt feel Pakistani at any point except her youger self actress played better than her.",
    "9": "Movie is so pathetic that I don't want to watch it again even in my free time. Only good thing about this movie is the Cameo and Post Credit Scene rest is very bad. My Diwali time is waste for this third class movie. No story, No proper Direction just fight and fight. Why Mr. Salmon Bhoi making this weird kind of movies everytime, after so much expectations the tatti we see in the theatre. Guys please look for another movies or enjoy your Diwali with your family and loved ones. You don't deserve to see this Tatti in the theatres. Not recommended for time pass only also. Se the post credit scene in online.",
    "10": "\"Tiger 3\" left me disappointed as Salman Khan's performance fell short of expectations. Known for his charisma, he appeared forced and dull, lacking the dynamic presence I anticipated. The film heavily relied on explosive action sequences, sidelining character development and a compelling plot. The overall narrative felt superficial, making it hard to stay engaged. Despite high hopes, \"Tiger 3\" failed to deliver the nuanced acting and gripping storyline I had anticipated, emphasizing the importance of a well-crafted narrative over spectacle in cinematic experiences. God help Salman to do better.",
    "11": "This movie is best for those who hasn't watched spy movies from Hollywood or South. It's typical Bollywood movies with similar story line. Not that much twist and vfx aren't that much good. We can see some vfx issues during fight scenes. Overall nothing new! Some scene are okay but overall not that much good. They should've focused more in the story rather than fighting scenes. Expected more from Imran and Katrina. But didn't get enough chances to make noticable impacts. It's all about Salman Khan. Spy movie, but nothing like \"spy movie\" in the story. Always we bring Pakistan in the movies. Can't our writes create something rather than involving Pakistan? Look at south movies and learn something Bollywood writes. Create something new and make us proud!",
    "12": "This movie just was so dull with so many meaningless action and soulless emotions.The action scenes with body double and slow motion looked like THUMBS UP commercial.The spy universe that they are trying to create looks like patchwork.The review that you see here with over 8 stars are written by Salman Khan.The much hyped Katrina Towel fight scene is as boring as her facial expression. If you have seen the trailer you have seen the entire fight scene.Most movie is shot on Green scene as Salman Khan is too old to perform his own stunts. But he is still doing lunges and calls it dance moves.",
    "13": "Tiger 3 fails to create any tension or excitement. The plot seems convoluted and lacks coherence, jumping from one subplot to another without proper development. The film's attempt at incorporating geopolitical elements feels forced and unnecessary, overshadowing the potential for a thrilling action-packed storyline. While the acting is commendable, it is not enough to salvage the lackluster storytelling. Overall, #Tiger3 falls short of expectations, offering little more than a mundane and uninspiring cinematic experience. It is a disappointing addition to the Tiger franchise.So it's an below average movie for me.",
    "14": "This is really hard to believe that it is an Indian movie. What will Indians do with the political affairs of Pakistan. Indian audience couldn't able to connect themselves with the movie. Nonsense script. The storyline always sorounding with Pakistan and some of the scenes were made to just forced mass movements. So many unrelated scenes and no proper storyline made us feeling that the pulse is missing. 1st half has less actions and past of Tiger Joya elaborated somehow give the feeling that next half can be exiting. But unfortunately 2nd half is a total different story which seems film starts again.",
    "15": "Finally After 3-4 years of Back to Back Disasters, Salman Khan Delivers A Blockbuster Hit In The Name Of Tiger 3 which is the best Comeback Of his film career. Overall Tiger 3 is a high octane popcorn action entertainer with a good engaging storyline, backstory of Aatish Played By Emraan Hashmi and Zoya Played By Katrina Kaif was fabulous and impactful into the movie story, screenplay is not too perfect but it works well with the films flaw, Maneesh Sharma Direction is superb, First Half Is Good with the usual previous Tiger type story with the missions revolving around in the movie, also we see Abit of emotional shades in some of the moments in the movie, second half was amazing with full on action.Performances of the cast are fabulous, Salman Khan shines very well throughout the movie and the character Tiger is one of his career finest roles, Emraan Hashmi As Aatish is outstanding and brings out the shades of a proper villain, Katrina Kaif as Zoya is superb and her action sequences are too good and so well Choregraphed and shot, supporting cast of the movie does their role well, action sequences of the movie are well choregraphed and well shot which was a treat to see on the big screen, Cinematographer is top notch and it's locations are well filmed, Pritam Music is good with Leke Prabhu Ka Naam being a foot tapping Chartbuster track through definitely not better than Swag Se Swagat, Ruaan is a Melodious romantic track, Background Music of the movie is superb especially the iconic Tiger Theme and Aatish Music.Cameo of SRK in the second half was Exhilarating and amazing so was the cameo of Hrithik Roshan in the end credits scene setting up the introduction of War 2.Movie is a good blend of Action, Entertainment, Patroism.Overall The Movie is a good watch and a well packed popcorn action entertainer, 3.5 to 4 stars for the movie.",
    "16": "Tiger 3 just amazing and high level action movie all time this is blockbuster movie all actors are doing great and fantastic acting emraan hashmi nailed it performance in antagonist Salman khan just awesome Katrina Kaif crush all cameos are brilliant go and watch in your nearest cinema don't follow the negative reviews from srk fans because srk fans is doing wrong so go and watch the movie enjoy the movie and your Diwali also so this is a emotional with action movie .great song aur leke Prabhu Ka name don't miss the post credit scene amazing mind blowing my star is 10/10 amazing emraan hashmi.",
    "17": "Great performance as expected by the movie, awesome effects and with a catching storyline.. a must watch for all... Can't miss Salman with Katrina in good duo with superb action.. full great way of enjoying.. need watch again and again this thrilling and enjoyable based on spy story, picked up from the last sequel.A must watch for action movie enthusiasts along with the magnetic performance of Mr. Khan coupled with Katrina the bold and the beautiful lady of the millennium.Tiger 3 delivers its promise to fulfill the expectations by the audience and proves to why be in the 100crore bucket again.",
    "18": "Story was really good, many misconceptions about Salman Khan's acting must be have been blown away. Tiger is a really good franchise, it got better with Emraan Khan's acting, he proved that he is a versatile actor like he did in the that movie, Selfie with Akshay Kumar. If actors like John Abraham and Emraan Khan can nail a negative role then these big shot actors can too start considering a side role. Also if this movie would have got some Hollywood actors like Sylvester Stallone would have made a cameo then that would have been loved by the media also because he also had previously shown interest in working with Salman Khan.",
    "19": "#Tiger3Review : BLOCKBUSTER Rating:- 5* Salman Khan proves once again he is the undisputed king of Bollywood Never underestimate Megastar Salman Khan when it comes to Box Office.#SalmanKhan is all set to give #YRF his first 600cr films with Tiger 3 Emotional Scenes will make you very emotional for all. Action scenes are top notch and best ever in the Indian cinema.#KatrinaKaif Towel fight Scene gonna Blow Your Mind ... Katrina Kaif is in superb form and her action sequences in particular will bowl you over... #EmraanHashmi is all fire and acid, the antagonist packs a punch with a knockout performanc.",
    "20": "Its a good bollywood masala movie with wonderful action scenes and charm of srk and salman is outstanding. Worth watching movie.Wonderfully scripted with action drama, fight sequences and dialogues. Its the addition in the spy world of yashraj which going to increase the hype of coming spy movies after it and hopefully as an indian cinema we are also planning and executing something new and advance.1. Watch for the support of indian cinema.2. For srk and salman\n3. For super action and drama\n4. Yashraj movie\n5. Location and sequences\n6. Fight scenes of katrina is worth watching\n7. Wonderful use of spy world of indian cinema.",
    "21": "7.5 rating LoL 😆\nMujhe lagta hai ki Chappri Logo ko action Jyada Pasand Aaya hoga 🤣🤣🤣\nCheap VFX and animation.Lol !! No words.. just feel like why the hell we went to watch the movie? All artists are good specially katrina and imran hasni.Good vfx to show 50 yrs actors look young !! THERE was no need for srk cameo!Please don't waste your time and money, absolutely rubbish movie, extremely week story line, away from the reality. When would old Bollywood actors understand that one man can't fight with ten men. It looks like science fiction, away from the reality and no Pakistani would ever read the national anthem of due India with due respect to all Indians. Such a jock ,it should be comedy movie. Salman you should do some other roles.",
    "22": "Tiger 3 provides what it promised that's entertainment at its very best...you get what you expect from a action movie that's action and lots of it and a little extra with pure entertainment..\nGo for it you won't regret..\nCongrats to salman in adavance for the massive comeback.Direction is top notch although could have been better at patches..\nSalman's screen presence is extraordinary as always..\nKatrina is pure fire .Emraan is too good\nAnd the rest of starcast support very well..\nOne thing I am sure of is rhis movie is gonna break many records and create many new ones .Blockbusterrrrrrrrrr✅",
    "23": "When Salman Khan collaborated with YRF ,in general ,the product is good. Tiger 3 brings that oomph factor which Salman Khan has been lacking in average productions in the recent past . The storyline is quite predictable as is the case in each of the Tiger movies so far . However the production is quite slick with good performances by Salman , Katrina and Emraan Hashmi . Salman has a superb screen presence and steals the show . SRK teaming up with SK was not necessary or required , still it looks good on screen . A good watch on the whole. The story is average but the movie has good production values .",
    "24": "Three parts,three different directors,three different perspective but one character that is successful with all. Tiger is synonymous with Salman Khan and as Tiger he is totally different from his other mediocre characters in other films (Kick,Radhe,KBKJ,etc).Tiger 3 is good continuation of previous parts, the story make connections with the past events which made it more interesting. Katrina Kaif is superb in her action sequences. Emran Hashmi is perfect antagonist against Salman and has done her part superbly.I didn't like the songs and music in this one, both earlier movies has good Music. SRK's cameo add flavor to the film, The Spy Universe is getting bigger and better.",
    "25": "Tiger 3 is a well directed film directed under the direction of Maneesh Sharma. The story works in the film. Salman Khan back in form after delivering back to back flops. Katrina Kaif shines as the leading actress. Emraan Hashmi best choice to cast in the role of the villain. Supporting actors like Kumud Mishra, Ranvir Shorey have done a fine and commendable job in the film. Shah Rukh Khans Cameo lights up the cinema hall. Hrithik Roshan Cameo a treat to watch on the big screen after a long time after War.Overall the film is a sure shot hit. Music storyline, direction, cinematography all works in this film and are met.",
    "26": "So I just watched Tiger 3. Went in with many expectations for this movie as well. Well, I did find the movie to be very good their was a couple cons to it to.Let's start with the good. To all the people saying their were no mass moments. First of all, it's not trying to be that. It is trying to be clever unlike what we saw in pathaan. I just kept seeing nonstop action in that movie which was forcefully put without a proper screenplay. Here I loved how the first half, it focused on building the characters and storytelling. If you've watched the Bourne series, mission impossible and bond films, you'll understand what they tried to do here. The second half was much more fast paced in regards to the editing but it gave you that dopamine thrust. The action pieces were amazing and although VFX still needed some work at parts, it was much better than pathaan. Seems like they took the feedback and worked a bit on it. Talking about performances, Emrasn Hashmi's character was not as good as it could be but he made it his own and acted it off really well. Salman Khan as Tiger was exactly what we've seen but I liked how he was trying to act in this one unlike the last couple lacklusters he's given. Katrina Kaif as Zoya was what I think should be the talk of the town. Almost all of her action scenes are done by her and she makes one hell of an action star. The other supporting cast was good and did they job well.Now let's talk about the negatives. As I said vfx was a bit off at parts but I'll give it some leeway because this is a Bollywood movie and it isn't mounted on a $100m budget like Hollywood films. Tigers screen time in actions scenes was a bit less I felt. They gave him more interaction and witty moving instead which I don't mind but I felt they could've added a bit more of him. Talking about the big cameo in the movie, I loved watching the whole sequence but I feel the SRK should've kept it a bit more serious as the stakes were high. I am a Salman fan but I will say, Tiger Overshadows Pathaan anyway. It's like Salman was born to be Tiger.So that my thoughts on the movie. I give it a 7.5 / 10 but I will say, the movie does not beat the first one. I believe Ek Tha Tiger was the best movie in this universe and will remain due to its intelligence in presenting a narrative one could only imagine. Do go and watch this one.",
    "27": "This film has everything - awesome Action, rooted Emotion, engaging Story, suspenseful Drama, soothing & enjoyable Music and an impeccable Cinematography along with stellar performances from the actors which makes this a sureshot BLOCKBUSTER experience.Salman Khan as Tiger deserves the maximum credit for the conviction & screen presence he portrays. However, Katrina Kaif as Zoya is no less and contributes equally. Emraan Hashmi as the protagonist is menacing and deserves appreciation as well.Lastly, Kudos to the supporting cast and crew for enriching this film with their support and performance.A must watch !!!",
    "28": "I went to watch some tamil movie but somehow ended up watching Tiger 3. I didn't have much expectations because of Salman khan's recent movies but movie surprised me. I has good story with logic in place on most of the places. The acting byb3 lead actors Salman khan, Katrina kaif and emran hasmi is really good. Actions scenes look good. I missed the first 10/15 minutes of movie but still I was able to enjoy the movie. There are no distraction by unnecessary songs unlike in salman khan last movie Kisi ka bhai kisi ka jaan. It had 2 songs both are good. Salman khan looks good for his age and Katrina kaif looked hot and really good with action sequences. Overall movie is good watch. Let's hope Salman khan does more of this kind of movies instead of doing silly movies like KBKJ, race 3, dabangg 3....",
    "29": "The best action in India and again the amazing star power of Salman Khan, which causes people to go crazy in cinemas all over the world 🔥🔥❤❤💪💪\nThe best action in India and again the amazing star power of Salman Khan, which causes people to go crazy in cinemas all over the world.The best action in India and again the amazing star power of Salman Khan, which causes people to go crazy in cinemas all over the worldThe best action in India and again the amazing star power of Salman Khan, which causes people to go crazy in cinemas all over the worldThe best action in India and again the amazing star power of Salman Khan, which causes people to go crazy in cinemas all over the world.",
    "30": ".With start of next half the movie continue to gear up with Shah Rukh Khan cameo...Well seeing them both makes you smile and burst into laughter...He is the plus point in the movie...but before and after that cameo movie again run with same dull moment. Beside them Emran Hasmi does his job but still lacks the aura as of Jim..But still thumbs up to his dialogue delivery which other leading actors and actress lacks.Plus points in the movie:- 1)BETTER VFX than of Pathaan 2)Action done by Zoya(most fight scene) and Tiger(Few fight scene) 3)Cameo and Bromance 4)Positive second half and bgm👌👌👌 Lacking points in the movie 1)Dialogue and its delivery...After the movie no person will remember any dialogue except for few and some salman fan 2)Not so entertained with the flow of film..May be due to lack of director execution 3)No adrenal rush& surgerthroughout movie except for the cameo moment and National anthem moment 4)No gripping story lineup 5)Little fast pace with some story but lacks the emotion to touch the audience Well movie has both sides to be watched...If you are salman fan and atleast wish his best go to near theatre...If you are normal audience it can be avoided else can be watched after ott release...",
    "31": "You must watch it. Tiger 3,\" a spy-themed movie suggests an action-packed storyline. Spy movies often involve thrilling espionage missions, intense action sequences, and plot twists. The success of such films often depends on engaging performances from the cast, a well-crafted script, and dynamic cinematography.The success of such a plot often hinges on how well it manages to keep the audience on the edge of their seats. Elements like the agent's escape plans, the cat-and-mouse game with the enemy, and the development of characters amid the high-stakes situation can contribute to the film's overall appeal.",
    "32": "Mass cinematic and brilliance action displayed on super star Salman khan and 👑 kartina kaif .... Screen play amazing and guest roll well placed in movie 🎥.. each and every scene good organised .Frist half is very nice and music quite good .. commercial lover should be enjoying every scene of the movie second half and clamix amazing well organised music very excellent and goosebumps .. very good spy thriller of this year given by director and Salman khan ...Tiger 3 ....introduction scene is mass and marvelous I think this Indian Hollywood movie\nTiger 3 is industry hit of Indian cinema.tiger 3 hukumm.",
    "33": "I have seen all the parts of Tiger movie, I was excited for a long time, Part 3 is finally out. Salman bhai or katrina kaf looking hot amazing ... katrina kaif and chinese girl fight so exiting.And then after that the fight fought by the seventh brother was very cool. And some medical information was also found in this movie. And Emraan Hashmi's role was also good. I also got to know about the training of people who join them, where does their network come from or the people they target, everything became clear in us movie or in Pakistan, all that was shown. To this How support is shown in this movi pi.",
    "34": "The best spy movie, this is the best action movie of bllywood the hand to hand combat, action scenes, color grading and the vfx are top noth and the acting & swag of salman khan will make u fall in love with him with imran hasmi outstanding portyal of a serial killer the movie has all the elements to become the best action movie of bllywood. Manees sharma direction will also surprise u and the cherry on the top is katrina fighting skill in the movie looks very natural with his very power packed performance she has delivered the best action portyal of a women spy in spy universe and with no useless dialogues or funny silly things this is the perfect portyal of how a raw agent shuld be of.",
    "35": "Old movies story + lame acting by salman khan+ not any epic scene that i remember+ no heroism\nOld movies story + lame acting by salman khan+ not any epic scene that i remember+ no heroism\nOld movies story + lame acting by salman khan+ not any epic scene that i remember+ no heroism\nOld movies story + lame acting by salman khan+ not any epic scene that i remember+ no heroism\nOld movies story + lame acting by salman khan+ not any epic scene that i remember+ no heroism\nOld movies story + lame acting by salman khan+ not any epic scene that i remember+ no heroism\nOld movies story + lame acting by salman khan+ not any epic scene that i remember+ no heroism.",
    "36": "Bollywood don't have stories remakes trends not working anymore due to south actors raise of market in north so now sequel trend just make film to ruin its original flavour simple same old routine revenge drama with souless music copied songs and including chereography too first two parts salman khan bearing with his charm Emraan Hashmi looks cools in baddie katrina Kaif unbearable with Botox sharukh khan again bearable with his charm Preetam music souless overall routine story made with high level action and vfx overall request to Bollywood stop making passionless movies using superstar just for money.",
    "37": "Don't waste your time and money. This movie gives you nothing. Not even good music. This movies director and writer thinks indian public is fool. They use only sentimental scene to show deshbhakti. A false attempt. There is not any story line that connect the dots or engage you in the film , there is only rubbish action in it. Only Salman Khan's popularity and Imran hashmi's acting is not enough to make a movie hit. There is something called Story line , direction , cinematography all are missing in this film. Action and story line goes where ever they want , there isn't any connection , there isn't any suspense , there isn't any thrill.",
    "38": "Very bad acting,useless herogiri,zero expression,emotion...only good thing is Emraan hashmi...Tigwr 3 is not worth it at all..waste of money...waste of time....just useless creativity or can say garbage in the name of fikm..salman khan must takw proper acting classes from tv stars..or should take retirement from actinf...he doesn't know A of Acting.....disgusting,\nKGF,RRR,Pushpa,Sri Raghupati are best films...not this spyBollywood must avoid actors without acting skills.The old man as a hero will be a dangerous affairs for Bollywood industry. They must give them role of chacha,mama,tau ji etc.",
    "39": "Massive action movie i very much enjoyed with my family. Salman khan is my favorite actor looking so young always... Katherine kaif very beautiful actress she's acting is wonderfull.. I have seen this movie in first day fist show.. Probably i always used to see salman movies first day first show. We should appreciate the camera men who captured this movie scene. Becoz every scene has beautyness.. Actions scenes is very much impressed me. Salman khan is always no. 1 in Bollywood he proved again via this movie. All action scenes are very fast and we getting edge of the seat while watching this movie. This movie definitely deserved for Oscar.",
    "40": "Salman's Tiger 3, Met expectations but did not exceed them.The story/plot is out dated and cringy with Terrorism and Pakistan. Tiger and Zoya go on a personal mission to save Junior. While saving junior they also save the Pakistani PM and Democracy! With the number of times \"democracy\" being used in the movie, I thought it was Biden fighting for democratic values.The action sequences are death, gravity and logic defying. Bike chases are phenomenal! On par or even better than Hollywood movies. The much talked about Katrina's towel scene definitely has good stunts/fight sequences.We acknowledge that Salman Khan is not known for his acting. But he has no dialogues only words! Katrina is good with action but can't deliver a dialogue, she should have been given words! Emraan Hashmi.. not much to add there.SRK has a cameo, but I don't think it will have an impact on this movie. Overall, It will be difficult for Salman's Tiger 3 to match the success of Pathaan and Jawan.",
    "41": "Tiger3 is such an accurate depiction of what the corrupt pakistani armed forces are doing to the Pakistani people. I wish there was a Tiger in reality to save democracy &ImranKhan. You won't ever forget what the movie stands for. Not a hypothetical story. It's the reality.Tiger3 is an intelligent film. It's not like typical spy film where action is the first thing. The plot is solid here. I feel it is most grounded tiger film in the series. It takes time for the audiences to absorb in this world.The Best thing was Salman Khan was Balanced by Salman Khan - The Actor, Kudos to Maneesh for that, There's no match to SALMAN as TIGER, Emraan- His BGM, His Voice, mahn truly Menacing, Loved Katrina & Pathaan's cameo (surprisingly).",
    "42": "One of the best action movie of Bollywood and what a comeback by Salman Khan. Tiger 3 has excellent storyline as well every character has played their role perfectly emran hasmi as a antagonist he played his role beautyfully. This movie going to create history in Bollywood box office it is far better than Pathan and war 3. Great action sequences, especially the ones performed by Katrina Kaif .I enjoyed tiger 3 compare to Pathan and war hope Salman choose right team like these in near future to carry his legacy forward buy giving these kind of movie to audience cause he has caliber to bring the people in cinemas hall.",
    "43": "The movie is known for its intense action sequences, engaging storyline, and the chemistry between the actors..... movie throws us into a world of intense action sequences and gripping storytelling.......\nIn conclusion, tiger 3 is a must-watch for action enthusiasts......... It stands out among similar movies for its gripping execution and well-executed action sequences....... The storytelling prowess, coupled with outstanding performances, made this drama resonate on an emotional level........It's a testament to the power of storytelling and the complexity of human emotions....... personally i would recommend to watch it..",
    "44": "Great movie to watch with family Full on entertainment and surely doesn't disappoint you at all.... Salman Khan's movie always superhit Great work by Katerina kaif and Salman khan. Love to watch them togetherKatrina Kaif always shines in action sequencesShah Rukh Khan and Salman Khan action scenes which are the most #highlighted scenes of this movie Climax scene is good. Special PM's speech scene.... Arijit Singh's awesome party song at the end of the movie. Direction work needs little improvement...... The action scenes with body double and slow motion looked like THUMBS UP commercial........",
    "45": "If you're following the Tiger franchise from beginning you'll love this movie. The same aura of Salman Khan and Katrina Kaif bring you a total blockbuster. Salman Khan as usual did a great job and it's something that if you're his fan you gonna live his new adventure in this movie and it tells a lot about why this franchise is still in the game. Action packed drama and romance stick yoh throughout the movie and enjoyment is guaranteed. There's nothing much to speak about this movie while everyone knows the capability of Salman Khan. A must watch' movie if you need some action packed with a little romance. Thanks.",
    "46": "In short summary it's up there with tiger 1 but definitely better then war and pathaan. Much better than even tiger 2. Srks cameo was cherry on top. Srks cameo scene in this was best fitted.nonetheless, emotional story no over the top action, only maybe 1 scene which didn't make sense but then again it's a movie so that's where imagination takes place. I'd say Emraan was protrayed as a much bigger threat as of John and Kahlid. The songs were good. Exposed the bad army Pakistan has ( I'm Pakistani) and basically showed good on and evil from both countries. Nonetheless, hrithik at the end would be better or was it ? ...",
    "47": "Tiger 3 is a disappointing sequel that fails to live up to the high standards set by its predecessors. The film is a rehash of old tropes and cliches, with a predictable plot and uninspired characters. The action sequences are poorly choreographed and the visual effects are subpar. Salman Khan's performance is uninspired, and Katrina Kaif is wasted in a forgettable role. Emraan Hashmi's villain is one-dimensional and lacks any real menace.One Time Watch for Salman Khan Fans. I hate why Pakistan centric movies are created. Sadly 350cr movie wasted on such a poor written story. YRF are taking wrong direction.",
    "48": "I was genuinely exited for this film and had been anticipating it ever since it was announced. But when I say this was the most cliché and repetitive movie I have ever seen it is not a exaggeration. The movie consists of one song that symbolised tiger doubting his love. Yet that was just 4 minutes of the story and it seems romance or the idea of tiger and zoya had left the script along with the energy of the film. The editing was not smooth either. We had cuts between scenes, random music being cut off instead of blended into another scene then bought back again. Unlike how the movie said, this movie is not a \"time pass\" it's a \"time barbad\" and it's been over hyped for the actors like Pathaan but the real story is a mishmash of unrelated ideas trying to happen in less than 3 hours. There's a certain goal to what you want your writing to reach yet here it seems they rushed many things they wanted to happen, mainly because it was the last movie of the series. Again the trailers, the trailers spoil the whole movie in a nut shell and the other stuff is irrelevant. Salman khan was basically flying half the movie and the aspect of reality left the chat. Furthermore, I would not like to get to the political aspect of the film but you can't keep milking one idea of Pakistan and India over and over again. Again the villain just seemed annoying, no general character development and if I do recall did the same thing of mother and unborn child not happen in Pathaan with Jim. Why is it litterly the same thing ex-raw ex-isi, I u der stand Emraan was part of the hype for this film but it honestly felt like he was trying to replicate South Indian villains which doesn't not make sense given the circumstances and genre of the film. It was dry and I was genuinely just waiting for him to get off screen. I rate it a six as it's not completely unwatchable like the beginning was good but after the interval it slacked off a lot and the energy completely got lost and it was like the scalped the idea and after the interval began the whole movie again. The reason the first 2 tiger movies where good is because they explored the world and showed us the excitement of agent life. Here it's just fighting and dying fighting and dying over and over again to the point 4 ppl in the cinema where discussing walking out. You can tell the director and writers r different and this is just a more annoying version of Pathaan.",
    "49": "Brilliant film.....high ocatane action thriller with lots of twists , gripping storyline with a message, salman , katrina , emraan in top form , good cameos , end credit ...well connected with ett , tzh...the bridge scene , climax action , salman entry , katrina's towel scene , emraan 's evil avtar was major highlights...it also has a story that make you emotional at certain times...overall it's a must watch. You wont be bored...its a paisa vasool film. Superb\" seems like an understatement for this latest addition to the Spyverse! This film, surpassing the last four installments, delivers a richly emotional and engaging storyline that hooks you right from the start. The action sequences are a cut above, impeccably choreographed, complemented by riveting dialogues that keep you on the edge of your seat.",
    "50": "In this latest cinematic endeavor, Salman Khan, often hailed as the 'Bhai' of Bollywood, proves yet again why he commands an unrivaled position in the industry. The film takes its audience on a thrilling rollercoaster, navigating through a spectrum of emotions, high-octane action, and pure entertainment, all while spotlighting the actor's magnetic charisma and undeniable star power.Salman Khan's latest outing is a must-watch for fans and cinephiles alike. It's a celebration of Bollywood at its best, combining action, drama, and entertainment in a way only Salman Khan can. Whether you're a die-hard fan or just looking for a thrilling cinematic experience, this film delivers on all fronts. Buckle up for a ride you won't soon forget.",
    "51": "Tiger3 is the best movie of Spy universe. Infact, Salman khan was born to play this role of Tiger. The story of Tiger3 will keep you busy with the next move. Emraan Hashmi is great as antagonist.. well made movie . You will definitely like Katrina Kaif as Joya. Her action moves are a treat to watch. Salman khan as Tiger will make you feel that why he is the greatest action hero of Bollywood. The colour grading, VFX, story telling and Ruaan song made this movie more stronger and powerful. Tiger 3 is the movie which will make sure the Greatest comeback for Salman khan and wish he continues to glorify his Super stardom even more🔥🔥🎥",
    "52": "The movie was amazing. Possibly top 2 alongside ek tha tiger in the franchise. Emraan hashemi did amazing as a villain. It could have been a bit more personal but still overall quality movie and would highly recommend it.No words for Salman khan, his lines, action, expression everything was on point. Salman khan back to his very best!!Only thing was the character introduction at the end after the song was kind of point less and not related to the movie.Overall, I would highly recommend this movie as it did not have vulgar scenes, had decent comedy, full of action and emotion. The only scene was the towel, which did not show any nudity.",
    "53": "It's great movie.storyline was great. All characters done justice to their roles. Salman ,Imran,Katrina and Shahrukh were at best. But above all Imran gave the best performance. Action sequences were of high quality. Best thing is that you can watch this movie with your family. The movie should also be released in Pakistan as it promotes peace between India and Pakistan. The best action sequences was when Shahrukh and Salman were together. All the supporting actors were great in their performances. But after a long time here comes an action movie with great storyline and logic. Highly recommended 👌.",
    "54": "I love tiger 3 it's an action film love the story. The story and the action sequences are amazing and the camo of other stars are also good. It's a Diwali celebration and enjoy the movie with your family and friends go and watch it. This will be Salman Khan's biggest return on the big screen after a quadruple streak of flops in the box office. I love tiger 3 it's an action film love the story. The story and the action sequences are amazing and the camo of other stars are also good. It's a Diwali celebration and enjoy the movie with your family and friends go and watch it. This will be Salman Khan's biggest return on the big screen after a quadruple streak of flops in the box office.",
    "55": "Overall, the movie is strictly AVERAGE - The first half being a Snoozefest and an absolute Bore. You don't feel anything throughout the movie - no patriotism, no adrenaline rush, no fun - nothing. It's a flat movie with underwhelming stunts and no highs or clapworthy/celebratory moments. Salman's Entry is disappointing and he looks tired & uninterested, and Emraan gets a forgettable role. Even Shahrukh's cameo is okay. Easily the weakest movies in the Spy Universe.Sadly today, there are not even 5 directors in Bollywood who can handle these big-budgeted mass-action entertainers. Siddharth Anand & Ali Abbas Zafar are the only ones who have proven themselves in this genre - the rest are all a hit-and-miss.",
    "56": "Expected much more that this...\nWas excited for this movie that's why skipped diwali celebration but this movie broke my heart.First half was unbearable full of torture i was almost slept in the theatre common it was supposed to be a action film but in the first half full of emotion which is not even suit. Salman khan acting is terrible with no expressions. Katrina kaif acting was full of comedy she can't even act properlyNow comes to second half. The only better thing was happenned in the movie was Shahrukh khan cameo which was good but couldn't execute properly by Lord Maneesh Sharma BAD!",
    "57": "If you are a blind Salman Khan fan only then you can see it. There is nothing new to the story. Don't understand why their mentality is always stuck on the animosity with Pakistan. SRK's cameo was good but not up to mark; could have done better. Visual effect &CGI work felt cheap; don't know why they don't hire Red Chilies for that. Production house like YRF should think bigger. The only attraction of this movie is Imran Hashmi's performance. Katrina was fair but they should have utilized Salman more. Maneesh Sharma let it down, even TIGER ZINDA HAY was way way better than this one. What a waste of time.",
    "58": "It is indeed one of the best action films of bollywood. The actions are superb. Cinematography is top notch. Srk cameo is great to watch and last hrx cameo is too good .Direction also too good. Katrina salman chemistry works very much still. Salman again proves that he can act well when he is directed by good directors and he is the last action hero of bollywood. Story by Aditya Chopra is good though not very much convincing. Screenplay by sridhar raghavan is gripping and have some twists and turn also. Supporting casts are also good. The best film of spy universe. Overall it's the best of 2023 till date no doubt.",
    "59": "Salman overshadows his character due to his swag but flat expressions. Katrina is good. Show stealer is Shahrukh Khan again in unbelievable action sequence.Emran Hashmi is dense and impressive in his role. Overall it was he who had been given the chance to act. Rest supporting characters come and go.Finally, the audience who like only action can watch this. Others can avoid as soul is missing in this movie.Problem with movie is that actions are not realistic. If one compares movie with James Bond, Mission Impossible series, it can be easily differentiated.One time watch people muat go and enjoy.",
    "60": "What a action packed movie... After so long it seems like Og Salman Khan is back what a charm, swag and specially his action fabulous. Shah Rukh Khan always rocks he was so energetic in the scenes. Both Salman and SRK are the best Duo in Bollywood in each and every scene of them together was totally goosebumps\naudience were shouting and enjoying all the theatre was house full even in the morning show as well.Last but not the least, The Greek freaking god Hrithik Roshan man his charisma his style and his looks everything was perfect for the post-credit scene eagerly waiting for WAR 2. I heard even loudest shouting from audience when Hrithik appeared on the screen.This movie is must watch...🔥",
    "61": "I watched it was a crap for me. Predictable and boring. Only Pathaan SRK entry was great apart from that there was nothing. Story was very slow and it was very boring story, direction was humiliating how you can direct a spy thriller movie like this. If we compare Tiger 3 to previous Tiger movies then it is not 10% of those movies. Sorry to say that for me it a bug flop movie Salman Khan acting was like before no improvement as well. If you want to watch some actions go for it but there is story. Only SRK part was great but SRK has only one scene. This movie is completely disaster. Sorry to say this.",
    "62": "Fabulous, Mindblowing and it's looking like a hollywood environment Fast X. Everything is very interesting in this movie.10/10 🌟🌟🌟🌟🌟\nPure Family picture, Everything is exceptional.Salman's entry 🔥🔥🔥\nI found one this is, if the story would be longer it would be much better. Else all the things are present enough in this Package if they involved India and Pakistan in this movie so I think they should also involve USA and Russia military are some connection in it. If this would happens believe me this movie will became the masterpiece and Father of all the movies including Bahubali abd KGF series.Atlast, Superb 🔥🔥🔥",
    "63": "Greater movie to watch and full of entertainment.super movie in spy universes.greaterst of all is cinimatogrphy\nLove the way showed Katrina and Salman. Tiger 3\" roars onto the screen with high-octane action and a gripping storyline. Salman Khan and Katrina Kaif deliver compelling performances, adding depth to their characters. The film's sleek cinematography and intense fight sequences keep audiences on the edge of their seats. While the plot may have a few predictable moments, the overall execution, combined with stellar production values, makes \"Tiger 3\" a must-watch for fans of the action genre.",
    "64": "Some action scenes of Salman Khan with Shahrukh Khan's crew are excellent. Apart from this, there is nothing tremendous in this film. This film does not attempt to give anything new to the audience. Emraan Hashmi is in the role of villain but he is not given much screen time. Katrina Kaif has also been cast in this film only for the action scenes. This film will do good business at the box office in theaters but this film is worth watching only once. If you are a fan of Salman Khan and Shahrukh Khan then you must watch this movie. There is no need to watch One Nice movie, it is necessary that you waste your money and time on good movies instead of this movie.",
    "65": "\"Tiger 3\" is a gripping action thriller that continues the successful franchise starring Salman Khan and Katrina Kaif. Directed by Maneesh Sharma, the film takes the audience on a roller-coaster ride filled with high-octane action, espionage, and a hint of romance.The movie begins with an adrenaline-pumping sequence, setting the tone for the rest of the film. Salman Khan reprises his role as the fearless RAW agent, Tiger, and delivers a power-packed performance. His charisma and action sequences are a treat for fans, and he effortlessly carries the weight of the film on his shoulders.Katrina Kaif, returning as Zoya, complements Salman's intensity with her own brand of fierceness. The chemistry between the two leads is palpable, adding emotional depth to the narrative. The film successfully weaves personal relationships into the larger backdrop of international espionage, giving the audience a reason to invest emotionally in the characters.One of the standout aspects of \"Tiger 3\" is its breathtaking cinematography. The film takes us to exotic locations, from bustling cityscapes to picturesque landscapes, enhancing the visual experience. The action choreography is top-notch, with well-executed stunts and fight sequences that keep the audience on the edge of their seats.The storyline, although predictable at times, is engaging and filled with unexpected twists. The plot seamlessly blends elements of espionage, betrayal, and redemption, keeping the audience guessing until the final act. The screenplay strikes a balance between intense action sequences and moments of emotional resonance, making it a well-rounded cinematic experience.The supporting cast, including talented actors like Girish Karnad and Ranvir Shorey, adds depth to the narrative. Each character plays a crucial role in the unfolding drama, contributing to the overall impact of the film. The villains, portrayed by skilled actors, bring a menacing presence to the screen, creating formidable adversaries for Tiger and Zoya.The film's soundtrack, composed by Vishal-Shekhar, complements the narrative with its pulsating beats and soulful melodies. The music enhances the mood of the scenes, whether it's a high-energy action sequence or a poignant emotional moment.While \"Tiger 3\" excels in many aspects, it does have its share of clichés and formulaic moments. Some dialogues and plot points may feel familiar to fans of the action genre. However, the sheer energy and charisma of the lead actors, coupled with the technical brilliance of the filmmaking, elevate the movie beyond its clichéd moments.In conclusion, \"Tiger 3\" is a must-watch for fans of action-packed thrillers. Salman Khan and Katrina Kaif deliver stellar performances, supported by a talented cast and impressive technical elements. The film strikes a balance between heart-stopping action and emotional storytelling, making it a satisfying addition to the \"Tiger\" franchise. As the third installment in the series, \"Tiger 3\" not only lives up to its predecessors but also raises the bar for Bollywood action films.",
    "66": "This movie was great to watch moreover Salman icon was there, no words to applaud it with wonderful and so sophisticated actor ever. I have watched full movie more than 10 times, it is very patriotic and among the youngsters very motivating movie ever. This movie contains nice action, nice cinematography, good lyrics, and very message given movie without spreading hindrance. This movie made up with an insight of positiveness and up the line everything. I am very fond of watching movies since sholey and all, this movie gives us real insight of action, and I love action movies a lot. I also like to watch real life movie and this movie was also inspired by real story that make s it more worthy which Salman usually do by giving true justice to any movie too.l.",
    "67": "And create many new ones .Blockbusterrrrrrrrrr✅\n13 out of 22 found this helpfulvipin8812 November 2023\n8/10\nWatchable ,all and all SK show\nWhen Salman Khan collaborated with YRF ,in general ,the product is good. Tiger 3 brings that oomph factor which Salman Khan has been lacking in average productions in the recent past . The storyline is quite predictable as is the case in each of the Tiger movies so far . However the production is quite slick with good performances by Salman , Katrina and Emraan Hashmi . Salman has a superb screen presence and steals the show . SRK teaming up with SK was not necessary or required , still it looks good on screen . A good watch on the whole. The story is average but the movie has good production values .9 out of 20 found this helpfulbeingsahilrajput12 November 2023\n9/10\nBest of SPY Universe!\"Tiger 3\" is an exhilarating addition to Salman Khan's SPY universe, delivering a perfect blend of action, suspense, and entertainment. Khan's charismatic performance as Tiger is unmatched, and the film's gripping storyline keeps you on the edge of your seat throughout. The dynamic chemistry between the lead actors adds an extra layer of charm, making it a must-watch for fans of the SPY genre. With breathtaking stunts, impressive visuals, and a stellar soundtrack, \"Tiger 3\" is set to be a blockbuster that exceeds expectations and leaves audiences wanting more. Get ready for an adrenaline-packed cinematic experience!15 out of 28 found this helpfulaabhasb-6097412 November 2023\n10/10\nJab Tak TIGER mara nahi tab tak TIGER haara nahi..\nWarning: Spoilersabhimanyusingh-2610712 November 2023\n10/10\nSure Shot Blockbuster.For me the best movie in the spy universe for sure & lot better than their previous release pathaan.Director #ManeeshSharma has ensured the budget given to him for movie is clearly shown in the movie scenes.#SalmanKhan as tiger phenomenal & their are lots of whistling & clapping moment & the tiger bgm elevates the each scene.#EmraanHashmi as Aatish is fierce,his mind is its biggest weapon & he has done a wonderful job.#KatrinaKaif as Zoya in superb in fight sequences,towel scene is good.& the cameos which everyone know are lit & given enough screen time.A Full Paisa vassol movie.Go & watch & you won't regret!6 out of 14 found this helpfullj-9289712 November 2023\n10/10\nLove it\nWarning: Spoilersataullahsaiyad12 November 2023\n10/10\nfavourite 💛\nWarning: Spoilersakashak-4012712 November 2023\n9/10\n#blockbuster\nI'm not much of a reviewer (I know there are many so called critic in today's social media world).All I can say is this is one of the best action movies made in India.Salman khan delivered his one of the best performance...he's the darling of the masses...al he was looking for since 4-5 years was a good script and #tiger3 has it all. Katrina Kaif was brilliant specially in action scenes. Undoubtedly the best action actress in hindi right now. Emraan Hashmi as always did brilliant acting and man his background score was so good and menacing.Maneesh Sharma surprised everyone WHAT A DIRECTION!!!....All in all, #Tiger3 is the best gift one could get this Diwali.Just don't believe in so called new born social media \"critic\" and reviewers and you will exit the theatre with a smile on your face.0 out of.",
    "68": "If you have watched the earlier 2 movies of tiger franchise then you will get disappointment watching the third one. The story is average with below average direction. Don't expect much from this movie.The movie starts with salman knowing from one of his collegaue agent who is about to die that zoya (katrina) is a double agent. He wants to find out the truth about it and falls into trap. Salmaan and Katrina's son junior is taken as a hostage by emran hashmi who wants them to steal a suitcase which has codes of nuclear missile. They stole it and gave it to him. Emran wants to become dictator of pakistan with its help. For complete story watch the movie.",
    "69": "Tige3 is one of the best spy movie after war.... and salman khan best comeback Tiger3... and also salman khan returns old salman khan swag... Background music,song,Location,fight. Everything is best.... and also salman khan and Katrina kaif best as a tiger and Zoya.... and emran hasmi s villainous character outstanding... and every action scene mindblowing.. and when I watch Leke prabhu ka nam song in theater I want to dancing.... it's a superb movie of tiger franchise... and also towel fight outstanding.... totally paisa wasool movie..... this movie one of the best movie tiger franchise......",
    "70": "Full paisa wasool movie action triller and katrina dance and action was awesome everything is great full entertainment Salman scree presence give a goosebumps next level action by salman khan Imran hasmi is plus point of the movie nice movie for family you can go and enjoy cinematic roar echoes through the cinema\naction sequences 🔥🔥🔥\nKatrinaKaif was electrifying & those action scenes left me in awe.Imaran hasmi a surprise package 👏\nHis presence has added a whole new dimension to the film.The script is tight, the performances are stellar & the cinematography is breathtaking. Many Surprises awaits you in the movie 🍿A must watch for any movie buff ✨",
    "71": "Tiger 3, the third installment in the Tiger series and the fifth movie in the YRF spy universe, falls short in execution. The plot is good, better than Pathaan, but the screenplay and editing are too poor to salvage the first half. Manish Sharma has failed to deliver what this Tiger sequel needs. The action choreography is not impressive, despite the movie's massive budget, failing to provide wholesome entertainment. Many high points lack engaging background music, though the music itself is hummable. In the acting department, Salman and Katrina have done a decent job. The second half is better, but the half-hearted filmmaking disappoints big time. The cameos are exciting, but one might question whether the story demands them or if they're merely fan service. ETT remains the best spy movie till now. It's high time Aditya Chopra hires a better screenplay writer or brings back Kabir Khan. Overall, Tiger 3 is a decent one-timer, better than Salman's previous movies.",
    "72": "Beautiful vfx.. Salman khans performance was very good.. Extraordinary action scenes..mind blowing cameos.. Katrina was also very good.. And as a villain Emran hasmi did fantastic job.. Well done yrf..well done salman khan.. #salmaniac..Hope bhaijan will do movie like this, sultan, bajrangi bhaijan and kick. Expecting 1000 cr iz coming.. And Tiger vs pathan needed.. This will best movie ever in indian film industry... Best of luck yrf and salman khan.. Love from Bangladesh bhaijan.. The king of single screen.. The king of masses...bhaijan you need to do little bit work on your crying scenes.. Try to cry little bit more.",
    "73": "\"Tiger 3\" is an exhilarating addition to Salman Khan's SPY universe, delivering a perfect blend of action, suspense, and entertainment. Khan's charismatic performance as Tiger is unmatched, and the film's gripping storyline keeps you on the edge of your seat throughout. The dynamic chemistry between the lead actors adds an extra layer of charm, making it a must-watch for fans of the SPY genre. With breathtaking stunts, impressive visuals, and a stellar soundtrack, \"Tiger 3\" is set to be a blockbuster that exceeds expectations and leaves audiences wanting more. Get ready for an adrenaline-packed cinematic experience!",
    "74": "Action is good but VFX is very bad, parachute opens while falling from a bridge 😁😁 Both of them also do paragliding before the parachute opens, you must have known the average height of a bridge. I liked the acting of some of the actors but the story did not seem that realistic, it was just action, meaning the storyline was predictable, overall the film is good. This is a family movie, you can watch it with the family, everything seemed fine but everything was spoiled by inserting a comedy scene in the serious time.Go and enjoy the 🍿🎥 movie ,\nIn my opinion it could have been even better. Thank you.",
    "75": "\"Tiger 3, the latest installment in Yash Raj Films' Spy Universe, proves to be a family entertainer with Salman Khan's swag making a strong comeback. However, the reuse of music from previous parts becomes monotonous, and the dialogue writing, despite commendable Telugu dubbing, falls short. Katrina Kaif delivers a good performance, but the villain's character could have been more powerful. The runtime is well-balanced, and the confirmed cameos of Pathaan add a thrilling twist. Contrary to initial impressions, the film is not Pakistan-supportive. Overall, a good Diwali watch with family, earning a 7/10 rating. Don't miss the old films: Ek Tha Tiger, Tiger Zinda Hai, War, and Pathaan.\"",
    "76": "Bollywood is looking for some way to attract the masses and make this industry an ATM rather than expressing art to the audience. YRF Spy Universe is a good model, but a plot is necessary.Tiger 3 is the fifth film in Aditya Chopra's Spy Universe, which follows the events of Tiger Zinda Hai, War, & Pathaan.The film has a backstory that explains a little bit about Zoya's life and how she joined ISI. Aatish Rehman is an ex-ISI agent turned terrorist who also has a part in Zoya's life and wants to exact revenge for the killing of his wife and to punish Tiger for it by having him declared a traitor as well as destroying India.This film is precisely about how Tiger and Zoya, along with their agency comrades, work together to thwart Aatish's plans (abolishing the peace treaty between both neighboring countries by killing the PM of Pakistan to take over) and clear Tiger's name.Let's just put it out there and say that the narrative was egregious and predictable on many levels. It was clear what was going to happen in every scene. It was nice to know a little about Zoya's life, and that was fine, but the narrative was a bit all over the place.The positive notes were the cameo by Pathaan and the post-credit scene that featured Kabir (a start to War 2), which added some justice to the film's plot.Performances were 50/50Salman Khan has been consistent in his role as Tiger and doesn't cease to amaze the audience.Katrina Kaif, as Zoya, was also decent in her performance but could have been better. She was rudimentary and acted at the level of a workshop exercise.Emraan Hashmi as Aatish Rehman and it's not easy saying this, but the man deserves applause. The way he played the villain validates how second chances can be given. Although some areas could've been tightened, he was the one to watch and performed well.The comrades played by Gavie Chahal as Abrar (ISI agent), Kumud Mishra as Rakesh (RA&W hacker), Danish Bhat as Javed (ISI agent who goes rogue), Chandrachoor Rai as Karan (RA&W analyst) and Nikhil (RA&W bomb expert) were also good. It did justice bringing them back along with Ranvir Shorey's 5-minute performance as Gopi.Shahrukh Khan as Pathaan (cameo appearance) was a treat to watch, and he was the justice to the plot.Hrithik Roshan as Kabir didn't have much in his 2-minute post-credit scene, but he looked great, and this one was a warm-up for War 2, which will come out in 2025As Colonel Luthra, Ashutosh Rana was in the same post-credit scene as Kabir, but seeing him in this film was good. YRF can't have a Spy Universe film without this man.Revathy does the same role for RA&W Chief Shenoy (played by Girish Karnad, who passed away four years ago) as Maithili Menon, who was also good but would've preferred Girish if he was still alive.Sartaj Kakkar as Junior, Tiger and Zoya's son was sweet and niceVishal Jethwa plays Hassan, whom Tiger and Zoya rescued and adopted in Tiger Zinda Hai. How is it possible that an arab kid could easily pick up the desi accent that fast? He plays a hacker and helps Tiger and Zoya in their mission to stop Aatish, but his performance is cringe.Pritam was extremely out of his league this time when making these two soundtracks. The lyrics and the composition of Leke Prabhu Ka Naam and Ruaa were horrible.The action sequences and cinematography stood out at Hollywood's level. Editing needed a bit of work, but all in all, it was consistent.Overall, the film was just okay, and like the mission's name in the intro, a time pass due to its inept narrative and music.2.75/5.",
    "77": "I had the entire theater to myself, which was a first time, rather fun and usual experience, but the movie deserved a packed house. That being said, I was thrilled to see an Indian film have an airing slot for 4 days in a row in my city's main theater in the States. The action sequences were creative and fluid, the plot intricate with some moments being deeper and others acting as more of a cushion. If I had to be picky, I would have loved some of the subplots to play out for longer, such as the suspense and suspicion we felt radiating from Tiger at the start of the film. That being said, I rather enjoyed the cameos and the tie-ins with former characters from the Tiger franchise. Those moments humanized the larger-than-life, action hero, and brought him back in small moments to the brawny and sometimes blundering spy that radiated charm in the first film. I think it was the banter between all those characters (more so than the action) that had me leaving the theater with a wild smile plastered on my face. Also, always a fan of the music!",
    "78": "I was very nervous when reading the reviews i didnt know if it was going to be good or not. I do understand where some of the reviewers were coming from \"too many fighting scenes\" not enough conversation however - i think most action films have this downfall and aside from tiger 1 being the only movie that had minimal action the rest of the franchise has been packed with it, so maybe it's something they can work on the next film? Overall i enjoyed it, and it gave similar shock feelings as tiger 1, with the twist and turns. Some people enjoy a straight story line, not everyone can keep up with the plot as some people do, but if you can keep up with the story line you can understand why there is so many action scenes. Some people do definitely leave bad reviews just to leave them, so i would watch the film for yourself before deciding if the film was for you or not. It was nice to see salmaan khan cry felt very emotional, i do think the prison scene was a bit over the top, and some what unrealistic, but what is an action film without some cringy scenes.I definitely enjoyed it and i look forward to the franchise's next film!",
    "79": "Films remembers me of Benazir Bhutto assassination story with TIGER turning to save against the Military and ISI of Pakistan with a dictator style Antagonist Emraan Hashmi who delivers a terrific performance looking for revenge against the super spy Geo Political saga looks good but it's the action that keeps us glued on the seat Katrina Kaif looks convincing and surely the best female superstar in action for Bollywood SRK cameo brings humour and joy in this vivid mode dark film Finally THE TIGET SALMAN KHAN IS THE HEART SOUL AND BLOOD OF THIS MOVIE WHO doesn't take a minute before firing bullets and performing death defying stunts VFC are k direction is good surely the TIGER BHAI HAS COME TO ENTERTAIN.",
    "80": "It's the biggest blockbuster movie ever going to be. And Bhai Jan did very well and I would like to say that no one is going to beat tiger, he the king of Bollywood and no one is going to replace Salman Khan from this. He's just so amazing and also kait did well and the action was amazing the dialogue. And the best entry of tiger. I just love it and this is going to be the biggest blockbuster ever and ever always love you Salman bahi Jan. You are the best and you are always going to roar in the cinema. Love you bhai Jan always favorite superstar of Mine . May god always bless you and do what ever you want to do. Lote of love.",
    "81": "Tiger 3 is a fantastic movie and a perfect big screen spectacle. Salman Khan is back with a bang and what a performance by him! Katrina Kaif has given a beautiful performance, brilliant as Zoya .. Emraan Hashmi gives a powerful performance as Aatish. The direction of Maneesh Sharma is very good. The plot and it's twist and turns are a treat to watch. The cameos add to the entertainment. Shahrukh Khan and Salman Khan together turn the theatre into a stadium and that whole sequence was fantastic and a treat to watch. The VFX is outstanding and our audience needs to stop glorifying Hollywood over Bollywood because the level of Tiger 3 has raised the level.One more request to the movie lovers, please don't pay any attention to the people who are spreading negativity just because they dislike Salman Khan or are someone else's fans. There are people who don't even watch the film and start spreading negativity. So please use your brains and totally ignore these viruses of the society.",
    "82": "Had watched all the YRF universe..Among all ,Tiger 3 stands with the weak story line and execution...\nLet's get into the film with no spoilers except for the cameo by Shah Rukh Khan and Post credit scene of War 2(Hritik Roshan)\nFilm early starts with story of Zoya and Aatish and the film continues with Bhai...With flow movie goes on dull note and predictable...Vfx is atleast better than pathaan...With start of next half the movie continue to gear up with Shah Rukh Khan cameo...Well seeing them both makes you smile and burst into laughter...He is the plus point in the movie...but before and after that cameo movie again run with same dull moment. Beside them Emran Hasmi does his job but still lacks the aura as of Jim..But still thumbs up to his dialogue delivery which other leading actors and actress lacks.Plus points in the movie:-\n1)BETTER VFX than of Pathaan\n2)Action done by Zoya(most fight scene) and Tiger(Few fight scene)\n3)Cameo and Bromance\n4)Positive second half and bgm👌👌👌\nLacking points in the movie\n1)Dialogue and its delivery...After the movie no person will remember any dialogue except for few and some salman fan\n2)Not so entertained with the flow of film..May be due to lack of director execution\n3)No adrenal rush& surgerthroughout movie except for the cameo moment and National anthem moment\n4)No gripping story lineup\n5)Little fast pace with some story but lacks the emotion to touch the audience\nWell movie has both sides to be watched...If you are salman fan and atleast wish his best go to near theatre...If you are normal audience it can be avoided else can be watched after ott release...",
    "83": "Anwar says: A movie is remembered by the story , screenplay, direction and acting and not by cinematography , stunt choreography and VFX direction and Tiger-3 fails in the former though excels in the later. How many times you would see the theft of nuclear codes, RAW vs. ISI and a planned coup in Pakistan . You can not cater same food in the name of action , YRF Spy Universe , particularly after brilliant War & Pathan .Sallu mian has started looking old. Katrina Kaif got an overdose of action though her towel fight in a Turkish Hamam with the Chinese marshal art expert is a great sequence . The actor to watch is Emraan Hashmi , the cool bad man is not intending to wipe India from world's map , rather want to assassinate the Pak PM and take charge first but director Maneesh Sharma is not Kabir Khan.A perfect example of a creation where action overshadowed acting . Watch it for only a cameo of Sharukh Khan . Would not reach 500 crore club for sure.#movie202 #anwarsays #Espionagethriller #excessdoseofaction\n#IndoPakRelations #vfxchallenge #sharukhkhan #EmraanHashmi #KumudMishra #timepassmission.",
    "84": "Tiger (Salman Khan) is sent on a mission by his new boss Ms. Menon (Revathi) to save an old friend. He succeeds partially in the mission and gets a shocker of an information which shakes him. Enter the baddie Aatish Rehman (Emraan Hashmi) who used to be the mentor of Zoya (Katrina Kaif). The past and present get entangled, making things too personal for Tiger and Zoya. How they get out of this mess created by Aatish and save Pakistan out of all in the silliest plot the writers came up with, forms rest of the story.There is nothing much to write about the story or the screenplay, as even writing too little is gonna reveal the entire thing. So let me be blunt in saying, it falls under the silliest of the stories written and there is not much hope for the spyverse as far as the writing department goes. The film starts with Mission Time Pass and ends up being one thanks to the overload of action segments completely driving the second half.For the kind of hype they created, the first half action scenes aren't that extraordinary. The second half thankfully has the action set in indoors without much distraction from poor CGI like in Pathaan and much of it being hand to hand combat helps in the film's favor. Salman Khan is almost a demigod on the big screen when it comes to action films and he aces with his sheer screen presence. Katrina Kaif gets to shine too until she is given the kind of dialogues which she gets pulled down while trying to pull them off. Emraan Hashmi was actually really good as Aatish but his characterization can be easily interchangeable with John Abraham's Jim and none would notice the difference. I was genuinely happy to see Simran sharing screen space with Bhai.In their minimal effort to create a throwback to Zoya's origin story to even Tiger-Zoya's origin story, the writers eventually resort to playing safe than explore it better. They even resort to extreme violence in the third act which works for the film but mind you, this went too dark and too violent, which to an extent felt overdone. Lastly, the Pathaan segment where much of the efforts were put in. Sadly, taking the word which is being thrown around Tiger 3's pre-sales, the Pathaan's cameo was anything but organic. But it was sheer fan service, glorifying Shah Rukh in one shot and immediately following up with glorifying Salman so as to not offend any fanbase. These 10mins were fun and then the film goes on non-stop action mode.Overall, I will be a bit harsh as I am against usage of national Anthem as a gimmick which this film uses and I am not on board with it. We all stood up during it bur hopefully filmmakers avoid this in future. The nation might be divided but neither Salman nor Shah Rukh or even Aamir need this sort of gimmick in their films. The action set pieces in the final act works, enjoy the film for that but the story gets way too silly so one has to ignore that to find this film to be a thorough Time Pass.As a fan, Bhai entertained me but Bhai deserved a better film and the wait for such a film continues.",
    "85": "Some #good points of the movie :-1. #KatrinaKaif's iconic #towel fight scene is great.2. #ShahrukhKhan's stylish cameo.3. Shah Rukh Khan and Salman Khan action scenes which are the most #highlighted scenes of this movie.4. Katrina Kaif shines in action sequences.5. #Climax scene is good. Special PM's speech scene.6. #ArijitSingh's awesome party song at the end of the movie.7. Finally #HrithikRoshan's cameo.8. Family movie.Some #bad aspects of the movie :-1. #SalmanKhan's entry is not so special.2. The #first song of the movie sung by Arijit Singh is very poor and awkward.3. Salman Khan rescued #RanvirShorey very well with his bike. So how Ranvir Shorey died?4. The 1st half of the movie is very bad. Nothing to entertain.5. Complete #waste of #time. #Lack of entertainment.6. Most notably #SalmanKhan used #bodydoubles in all his action scenes. Because #physically Salman Khan is very #unfit. He will not be able to do such action #stunts in any way.7. the character of #EmraanHashmi is not so special.",
    "86": "Movie is out an out full of action. Almost after every 2-3 scenes action overdose is seen.Problem with movie is that actions are not realistic. If one compares movie with James Bond, Mission Impossible series, it can be easily differentiated that hollywood series have some story line too. But after watching this movie, it seems that spy only fight. Just like in any action games.Salman overshadows his character due to his swag but flat expressions. Katrina is good. Show stealer is Shahrukh Khan again in unbelievable action sequence.Emran Hashmi is dense and impressive in his role. Overall it was he who had been given the chance to act. Rest supporting characters come and go.Finally, the audience who like only action can watch this. Others can avoid as soul is missing in this movie.",
    "87": "The same old ghisa pita storyline, illogical situations and bakwas dialogues, sometime I felt like watching 70's movie with predictable climax.New thing - RAW agent in work from home (WFH) mode 😄😄 with ultra lavish life and all expenses paid by govt of India.I saw people yawning leaving and desparate for movie to end. Traumatized after watching this movie, slept twice in the middle of the movie 😞😞One thing I liked is the name of the mission - \"Time Pass\". Really they have created the movuie just to pass their time and waste our time.I don't understand most the positive reviews for this movie The entire plot is confusing, no good acting, out of army of men and thousands of rounds of ammunition fired, not a single hit any of the heros.",
    "88": "I have always had this complaint about most of the action movies produced by Bollywood and in past few years Hollywood as well that they put so much focus on action sequences that they hardly care enough about a well woven storyline.Thankfully and yes surprisingly, Tiger 3 excels in all these departments by a very huge margin even if you consider the movies only from the Spy Universe.You can feel in every frame that Salman Khan totally reinvented himself for this movie to deliver a very wounded yet very powerful Tiger to the audience. Be it in emotional scenes when he felt betrayed or when he lost someone dear or when he was angrily digging bullet holes in whoever that stood between him and his mission.There are really some unforgettable action sequences like the chase sequence in St. Petersburg, raw action fist fights of Katrina in Türkiye (it felt like she thad been training herself for these sequences for a decade - I mean it all felt so so real) and the high octane well choreographed and well edited action sequences where both Tiger and Pathaan take on the enemy soldiers is something you can't simply watch in the theatre seat without giving a shout-out some hard claps.Any review will be a totally biased one if you have missed mentioning the spectacular performance delivered by Emraan Hashmi, who's vengeful/vindictive/villainous act forms the core of the whole storyline. Emraan brought the real chaos without being in the midst of the chaos, a kind of villain the spyverse really needed to set the bar to another high.And with Tiger 3, the complaints of many (that includes me as well) about very little focus on Zoya's character development have been fully addressed.P. S. - This is Salman Khan's best action movie till date. No exaggeration, just fact!Tiger 3 is indeed a top class action movie to say the least with one serious comment and that is when you plan on areal shots you can defy all laws of physics which is totally acceptable but not the laws of safety. You simply cannot jump on the chopper from the top when the chopper's rotor blades are rotating at a speed of more than 200 RPM.",
    "89": "Had watched all the YRF universe..Among all ,Tiger 3 stands with the weak story line and execution... Let's get into the film with no spoilers except for the cameo by Shah Rukh Khan and Post credit scene of War 2(Hritik Roshan) Film early starts with story of Zoya and Aatish and the film continues with Bhai...With flow movie goes on dull note and predictable...Vfx is atleast better than pathaan...With start of next half the movie continue to gear up with Shah Rukh Khan cameo...Well seeing them both makes you smile and burst into laughter...He is the plus point in the movie...but before and after that cameo movie again run with same dull moment. Beside them Emran Hasmi does his job but still lacks the aura as of Jim..But still thumbs up to his dialogue delivery which other leading actors and actress lacks.Plus points in the movie:- 1)BETTER VFX than of Pathaan 2)Action done by Zoya(most fight scene) and Tiger(Few fight scene) 3)Cameo and Bromance 4)Positive second half and bgm👌👌👌 Lacking points in the movie 1)Dialogue and its delivery...After the movie no person will remember any dialogue except for few and some salman fan 2)Not so entertained with the flow of film..May be due to lack of director execution 3)No adrenal rush& surgerthroughout movie except for the cameo moment and National anthem moment 4)No gripping story lineup 5)Little fast pace with some story but lacks the emotion to touch the audience Well movie has both sides to be watched...If you are salman fan and atleast wish his best go to near theatre...If you are normal audience it can be avoided else can be watched after ott release...",
    "90": "This movie actually proves that they are really trying hard.It's really nothing new. Nothing unexpected. Sometimes it even goes in a direction that builds up expectations for you but then you get disappointed.It's like the villain is creating a big problem, but then he ends up not harming anyone. Or lots of action scenes are being cut, to another angle... you get to know that they are hiding mistakes or weaknesses in cinematography.They are trying nice things to make it better, I am not saying they are doing nothing. And this is a good sign. But you can see Bollywood is still lagging behind. Especially in terms of storytelling.You can see how they are taking Mission Impossible feel and mixed it with Indian story. You can see how they are trying to take cinematography from Hollywood and South India (ahem Lokesh Kanagaraj ahem).",
    "91": "\"Tiger 3,\" the 2023 Indian Hindi-language action thriller film directed by Maneesh Sharma, had its moments of excitement and intrigue, but it left me with mixed feelings. Produced by Aditya Chopra under Yash Raj Films, this installment brings back Salman Khan, Katrina Kaif, and introduces Emraan Hashmi to the franchise.The execution of the film is commendable, with certain action sequences that may remind you of Hollywood movies. However, there was a noticeable sense that Salman Khan appeared somewhat reluctant and tired throughout his performance.The pleasant surprise came in the form of Katrina Kaif, who shone in her role. Her scenes, whether action-packed or not, were executed with visible effort and commitment. Emraan Hashmi's performance was good, adding to the ensemble cast's overall appeal.The supporting cast also deserves credit for giving their best performances. However, Shahrukh Khan's cameo felt somewhat out of place, resembling an action number more than an integral part of the storyline, which, at times, turned unintentionally humorous.The storyline, while okay, may not be easily acceptable to all viewers. It had its moments but didn't consistently maintain the level of excitement and engagement that was expected from a film in this genre.In conclusion, \"Tiger 3\" is a thrilling sequel with some standout moments, especially in Katrina Kaif's performance. However, mixed performances and occasional pacing issues may leave some viewers wanting more. If you're a fan of the YRF Spy Universe, it's worth a watch, but it may not reach the heights of its predecessors.",
    "92": "Just Watching #Tiger3\nBox Office Tsunami incoming.#Tiger3Review : BLOCKBUSTER\nRating:- 5*\nSalman Khan proves once again he is the undisputed king of Bollywood\nNever underestimate Megastar Salman Khan when it comes to Box Office.#SalmanKhan is all set to give #YRF his first 600cr films with Tiger 3\nEmotional Scenes will make you very emotional for all. Action scenes are top notch and best ever in the Indian cinema.#KatrinaKaif Towel fight Scene gonna Blow Your Mind ...\nKatrina Kaif is in superb form and her action sequences in particular will bowl you over...\n#EmraanHashmi is all fire and acid, the antagonist packs a punch with a knockout performance.#Tiger3FirstDayFirstShow #Diwali.",
    "93": "Bollywood has taken to new lows after they have started this spy universe. They want to show spies who can perform death defying action but the direction of those action sequences is horrible.There's clear signs of someone not applying their brains to direction.I don't quite understand how you can show an army of any country that is so dumb. Be able to fly aircrafts in enemy territory without being shot down.Kids will definitely find this movie exciting because they usually like these kind of sequences.For anyone else, don't try to find any story or any sense in the movie. Just watch if you have nothing else to do and money to spare to Bollywood to make other craps like these.Atleast its better than Pathan.",
    "94": "A VERY SOLID step in that direction. Big scale, serious spy film - driven by a SOLID plot - not just by juvenile jokes and shenanigans. I really hope YRF continues to work in this direction.Loved Tiger 3 even more the second and third time!Rare action film where every character is important to the story, was especially good to see. Found T3 an apt successor to ETT & TZH in terms of story-telling.Am just witnessed the roar of Tiger , and i can say that this film.Emotions hai drama hai hakle ka cameo h lovely music hai\nTiger nd zoya ki pyorest chemistry .It's full-on entertaining film with good 1st half & brilliant 2nd half from big scale, action, strong villian to performances of lead actors everything is on point, overall it matches the level of TZH.. a enjoyable big screen experience!",
    "95": "Giving this an 8/10 ratingNext part of the YRF spy series, Pathan was part of this. Salman Khan is back as Tiger, along with the superb Katrina Kaif as Zoya. Also Emraan Hashmi is top notch as Aatish.It's the evil of terrorism and courption from India's neighbour, Pakistan and the trail leads across the world as the spy films go global and come home to end, it's just how the story and the characters unfold that make it not only good, but superb. The action is over the top at times, but is top, and I mean, top notch. Evil is proper evil and no sugar coating the causes and effects of everyone, good or bad, actions.India and the locations across the world look beautiful, and the music numbers, which are not many, are still great fun. Great staged set action pieces when needed, are superb, no crappy dialogue here, everything said and done, has a purppose. Just wish all films were made with care and attention, and fun like this, then we would have a better bath of films to watch. This is one film that is a real good one.",
    "96": "Yes, yes and YES. Just watched it here in the UK for the first time, first day first show and Salman is back and this time it's personal. I love the fact that there is a lot more backstory to characters here and an emotional punch to the gut too, makes it even more enthralling to watch when there's something real at stake. I definitely think that this is the weaker one out of all three, but that doesn't mean at all that the movie is bad in any way, I think because the first two films really gave us everything and more and also it was a bit short for my liking, everything just happened so quick. I was also worried that Maneesh Sharma would really not be able to deliver this sort of movie but he did. Yes, there were some CGI moments in there and some Hollywood stuff in but it can't be as bad as Pathaan, you might as well call that a full bred Hollywood film, so honestly this movie exceeded my expectations by far. Also to all you Shahrukh Khan fans NO SPOILERS all I can say is his entry....🔥\nBut what a film. Well done Salman. You've earned it. 9/10Oh and also, stay for the end credits.",
    "97": "Another solid entry into the YRF Spy Universe as far as its cinematic quality for a film of this genre is concerned. This spy film is action packed, technically well-made, well-shot, smartly written, slick with a tight script, good direction, acting, stunts, VFX, CGI and cinematography. Maneesh Sharma (Band Baaja Baaraat, Fan) has delivered which is not a surprise. It is pretty engaging from start to finish and apart from characters just being immune to machine guns, there are some real stakes and emotions and some of the violence feels pretty real. One gets his throat slit and you can hear the gurgling till his death. There are nice callbacks to Ek Tha Tiger and Tiger Zinda Hai. This is definitely a Salman Khan and Katrina Kaif show all the way but Emraan Hashmi makes an impact as the antagonist. He is not a supervillain like Jim but still a good villain and just enough of a match for Tiger. I personally liked his fight scene with Tiger in the red lighting. It looked cool. Salman Khan gave a good performance and has emoted quite well. He can definitely act as is the case here. Katrina Kaif is a show stealer with her brilliant action and the towel fight is nicely choreographed and performed but there is a weird editing error because it is unclear how they wrap the towels back on their bodies. She is a bonafide action star and fully believable as a spy. Well, they both are. It's weird to say but Pathaan's cameo raises the mass quotient of the film which is just too over-the-top silly since the rest of the film is a mixture of class (grounded intelligent espionage thriller) with some mass provided by the score and elaborate action sequences. SRK is fully a mass hero now. Gone are the Don days. Maneesh Sharma has directed action, explosions, fights very well with nice drone shots and it does feel like a step up from Pathaan. It's cool that they showed some history of Zoya and how the villain is connected to her and Tiger. It's nice to get some more information about the characters. It's interesting that Tiger can manufacture a small bomb from the Pakistani prison by himself to escape.Coming to the story, ofcourse it's an Indian agent who saves Pakistan's PM and democracy from Jihadi extremists and Pak army. But the story and setting of this film is such that it is completely idiotic to avoid mentioning Rubai or getting Rubai to team up with Zoya to save her people. Also, how long has it been since the events of Pathaan? Getting blamed for killing Pak army chief got Tiger in trouble. But no consequence for Rubai killing General Qadir? Why no mention of General Qadir? This is not how you \"follow the events of Tiger Zinda Hai, War and Pathaan\". Just mentioning Tiger being a hero in Pathaan does not cut it. Do better. I am so glad this is not Pathaan's plot. By the number of times you hear the words Pakistan, Pakistani and aman in one sitting, RAW and ISI agents teaming up and having a banter, I think this film may not make it as big at the box office as expected. Maybe I need to watch this again but what happened to the nuclear launch PAL codes? Why wasn't that brought up again? Why didn't they use it to threaten India? I think ISI was after them. The twist with Javed was pretty good. Gopi revealing Zoya is a double agent and Zoya fighting a disguised Tiger were also pretty good. There are a lot of such minor surprises and twists in the writing that kept me interested and engaged.Ofcourse, how can I NOT talk about Kabir's appearance. The lines hype up War 2's antagonist and the visuals hype up its protagonist Kabir so much, it's insane. Also, if that's the way War 2 is going to look, then it is already a masterpiece. All hopes on Ayan Mukerji to deliver. And I am sorry but as an SRK fan, Kabir seems like the daddy of both Pathaan and Tiger. He seems like someone who can go up against both and win. It looked like Korean cinema to be honest. I hope it is bloody violent and we can finally move away from India Pakistan plots. I guess Tiger 3 was just being true to its predecessors with the India Pakistan plot but it may not go down too well with the masses. Can't wait for RRR star Jr NTR to rock Kabir's World.Hey YRF and Aditya Chopra, did you know that Pakistan, Russia, Afghanistan, Turkey are not the only countries in the world besides India? I can think of many plots that doesn't involve showing Pakistanis being the sweetest, most innocent people on planet Earth despite the exponentially decreasing percentage of population of non-Muslims, rogue terrorist state Pakistan wanting peace with India and its ISI, which was involved in 26/11 terrorist attacks, helping R&AW in restoring order. Here's one. An Indian scientist/inventor has recently invented something using ancient indigenous knowledge with the potential to turn into a billion dollar market having global demand. Something like shampoo. Or has made a deal with Russia or Japan to acquire some equipments or raw materials required for a scientific experiment/space mission, or has made a deal with Russia or Japan to purchase jets or submarines or some other weapons. But US/Europe/China wants to steal the knowledge to get the patent on the invention first or they do not want the deal to go through. Pathaan/Tiger/Kabir is assigned the mission of preventing them from succeeding. Rocketry The Nambi Effect is such a great true story for the YRF Spy Universe to be inspired from and yet they continue to do 69 with Pakistan.",
    "98": "The start scene entry to movie of main lead Salman Khan of this movie gave us chill, clapping and cheering.Not because played by my favourite actor but entry of main character is in another level. Literally eyeing on every details which has presented in a superb level . No flaws just wow wow wow!!!Damn this movie had gave us chills and awesome time during watching it. Couldn't be much better though missed some more of comic time and songs. Forgotten those little missing part but yeah ...\nExceptional action\nBest dialogues\nWonderful connected Story line from Ek Tha Tiger and Tiger Zinda hein and yet another spy franchise\nMust watch 💪\nWonderful presentation.Congratulation 👏🏻👏🏻",
    "99": "Tiger3 starts off with a personal battle but ends up saving Pakistan from its own armyExcellent: mature and thrilling storySalman is emotional and has controlled aggression. As good as SultanKatrina and Emraan have given their career best.Script and Maneesh Sharma 🔥Was pleasantly surprised to see a sensible movie, full of emotions, action, thrills, twists and patriotism.What comeback of Salman... He needs good scripts and directors, beast mode.Andhbhakts and chapris will not like this film.Second day business will cross 60 crores for sure as book my show is selling more than 45000 tickets per hour as of now.",
    "100": "I'm not much of a reviewer (I know there are many so called critic in today's social media world).All I can say is this is one of the best action movies made in India.Salman khan delivered his one of the best performance...he's the darling of the masses...al he was looking for since 4-5 years was a good script and #tiger3 has it all. Katrina Kaif was brilliant specially in action scenes. Undoubtedly the best action actress in hindi right now. Emraan Hashmi as always did brilliant acting and man his background score was so good and menacing.Maneesh Sharma surprised everyone WHAT A DIRECTION!!!....All in all,\n#Tiger3 is the best gift one could get this Diwali.Just don't believe in so called new born social media \"critic\" and reviewers and you will exit the theatre with a smile on your face.",
    "101": "Nice movie to watch. And the action sequences were superb. Worth to watch for this diwali and deepam festival. Salman's acting was fabulous. The movie available with many languages as pan India movie. The lead actor's star power comes in handy, but Tiger 3 (like Pathaan and unlike War) is gender-agnostic. Katrina Kaif is allowed almost as much of the action as the invincible Tiger, whose death-defying feats return in the third instalment in a bigger and more brazen form. Latest\nBollywood\nReviews\nRegional\nHollywood\nTV\nWeb Series\nPhotos\nVideos\nTrending Stories\n1\nWorld Cup Final: Deepika With Dad Prakash And Ranveer Fly Out To Ahmedabad\n2\n\"Waiting For Them To Lift The Trophy\": Salman-Katrina's Message To Team India\n3\n\"You Gave Me My First Ever Hit\": Abhishek's Tribute To Sanjay Gadhvi\n4\nWhen Ranbir Asked Rashmika To Choose Between Him And Vijay\n5\nVignesh Shivan Wishes Wife Nayanthara Happy Birthday With A Famjam Pic\n6\nSRK Had This Much Fun With Anant-Radhika At Isha's Twins' Birthday Bash\n7\nKatrina And Kiara Lead Celeb Roll Call At Isha's Twins' Birthday Bash\n8\nInside Anand Ahuja's Adorable Post With Wife Sonam Kapoor And Son Vayu\n9\nSeema Sajdeh's Son Yohan's Fan-Boy Moment With David Beckham\n10\nKareena Kapoor's Post For Her \"Hot Husband\" Saif Ali Khan Is Everything\nView More Stories\nNewsMovie ReviewsTiger 3 Review: The Salman Khan-Katrina Kaif Show Stays On The Rails For The Most Part\nTiger 3 Review: The Salman Khan-Katrina Kaif Show Stays On The Rails For The Most Part\nTiger 3 Review: Katrina Kaif is allowed almost as much of the action as the invincible Tiger, whose death-defying feats return in the third instalment in a bigger and more brazen form.ADVERTISEMENT\nMovie Reviews Saibal Chatterjee\nUpdated: November 14, 2023 11:32 am IST\nRATING\n2.5\nImage was shared by Salman Khan. (Courtesy: beingsalmankhan)New Delhi : It is overlong, overheated and over the top. But is that the end of the story. No. Who expects a Tiger to change his stripes? In his third outing as superspy Avinash Singh Rathore alias Tiger, Salman Khan, with aid of a story by producer Aditya Chopra and a screenplay from Shridhar Raghavan, proves that there is always a great deal of purchase from the spectacle of an irrepressible hero leaping off all kinds of perches and landing on his feet.The lead actor's star power comes in handy, but Tiger 3 (like Pathaan and unlike War) is gender-agnostic. Katrina Kaif is allowed almost as much of the action as the invincible Tiger, whose death-defying feats return in the third instalment in a bigger and more brazen form.By TaboolaSponsored Links\nOriginal Adidas Striped Men Black Track Suit With 75% Off\nAdidas India's Franchise Store\nIt bears no repetition that the heroine, herself an agent with a mean streak, gets a major action sequence all to herself in a Turkish hamam attired in a towel as she goes head-to-head against a deadly Chinese agent and martial arts instructor (played by American stuntwoman-actress Michelle Lee). The two deliver loads of cool. If nothing else, the two spotless towels add an extra layer to the film.The YRF spy universe is obviously not meant for those that look for realistic, close-to-the-bones espionage thrillers but for everyone else (whether you Salman and swag) there is a lot in here. For good measure, the villain in this film isn't just another scowling, growling Pakistani agent. He gives the hero a run for his money. The action in the first half of the film belongs more to the stunt doubles than to the two stars. In the second, things balance out and Salman and Katrina jump in - yes, jump is the operative word - and are joined by another superstar of the universe returning a favour that he received in his previous film of the thriving genre.",
    "102": "Ok I love mindless masala action entertainment. I went to see Tiger 3 and let me tell you I almost slept for the first half of the movie. Had a lil fun with srks cameo, it wasn't as good as it was in Pathan but idk seeing those stars together on the screen makes up for all the bad writing and acting as well😅. Could barely watch more 20 mins after the cameo and left the theatre in middle. I have watched my share of bad movies but was never compelled to leave the theatre before.Very very disappointed, its a bad movie with bad acting, bad dialogue, bad writing, bad direction, bad action. Totally waste of time. Pathan and Jawan were way better than this garbage.Bhai ke liye to koi shabd hi nahi hai, katrina was plain boring as always, it was really painful to watch mr. Hashmi been wasted in this pathetic film.Just to be clear I am not a bhai hater, I still watch his good movies but it's hard to say that I have liked any of his movies in the past 5 or 6 years.",
    "103": "\"Tiger 3\" is an action-packed extravaganza that delivers on all fronts-spectacular action sequences, riveting performances, and a gripping storyline. Salman Khan and Katrina Kaif reprise their roles as RAW agents Tiger and Zoya, and their on-screen chemistry is electric.The film takes the audience on a thrilling global adventure, with stunning locations serving as a backdrop to intense, high-octane action. The fight choreography and stunt work are top-notch, keeping viewers on the edge of their seats throughout.The narrative is tightly woven, blending espionage, romance, and adrenaline-pumping sequences seamlessly. The addition of a formidable antagonist adds an extra layer of suspense and tension to the plot, making for a truly engaging cinematic experience.In \"Tiger 3,\" the visual effects are nothing short of spectacular, elevating the grandeur of the film to new heights. The cinematography is mesmerizing, capturing the larger-than-life scale of the story with finesse and flair.Salman Khan and Katrina Kaif's charismatic performances anchor the film, with strong supporting performances from the ensemble cast. Their dynamic characters and unwavering commitment to their missions make for a captivating watch.Overall, \"Tiger 3\" is a tour de force in the action genre-a gripping, adrenaline-fueled spectacle that is sure to leave audiences enthralled. Director Maneesh Sharma has crafted a film that expertly balances heart-pounding action with moments of emotional resonance, creating an experience that is not to be missed. This installment in the \"Tiger\" franchise is a triumph, and a must-see for fans of high-energy, blockbuster cinema.",
    "104": "I watched Tiger 3 with huge expectation but was led down by boring narrative.I lost the movie some where down the line and ultimately made me bore.Pathaan was way better if not the best and had me captivating and I am shocked to see such a drastically deterioration of the script from same YRF franchise.The movie is one time watch even though in my 1st attempt I found it to be boring and repetitive.Director and script writer needs to get out of the mindset that you could serve Indian audience anything in the name of Salman Khan.In today's Era you need to have script and enterta factor to keep thenaudience stick to their seats till the very end.",
    "105": "\"Tiger 3\" is an absolute blockbuster that seamlessly blends action, intrigue, and stellar performances. Salman Khan's screen presence is nothing short of captivating, bringing his trademark charisma to new heights. His portrayal of the character is a testament to his versatility, seamlessly adapting to the nuances and demands of the role.Salman Khan's performance is a masterclass in action and emotion, keeping audiences on the edge of their seats throughout. His chemistry with Katrina Kaif is electrifying, adding depth to the storyline. Khan's commitment to the character shines through, making \"Tiger 3\" a thrilling cinematic experience.Emran Hashmi's addition to the cast elevates the film to another level. His nuanced performance adds layers to the narrative, bringing depth and intensity to his character. Hashmi's on-screen presence is magnetic, contributing significantly to the film's success.The film's high-octane action sequences, coupled with Salman Khan and Emran Hashmi's stellar performances, make \"Tiger 3\" a must-watch. The perfect blend of adrenaline-pumping moments and character-driven storytelling makes this installment a standout in the Tiger franchise.",
    "106": "Tiger 3 (2023) :\nMovie Review -YRF's Spy-Universe has a new chapter with a new director, Tiger 3, helmed by Maneesh Sharma. Tiger and Zoya's story is the only established chapter in the universe, and with Tiger 3, we go back to the time before they met each other for the first time. Ek Tha Tiger started all this unrealistic stuff of RAW & ISI agents working together and falling in love, and then Pathaan also followed the same formula after over a decade. War (2019) was far from this irrelevant stuff, but it went messy in the second half with so many plastic theories. Now, Tiger 3 again deals with Tiger and Zoya's conflicts and also brings the patriotic theme back after a while. In all those 5 films of Spy-Universe (including T3), the writing has been the only problem, while the screenplay, mass appeal, action, and scale have only gone higher and higher. It's just that we are in post-pandemic times now, which demands a lot of smart writing pieces, and all SU films, right from the beginning, have failed to do it, be it ETT, TZH, War, Pathaan, and now Tiger 3. And like I said, the action and scale keep getting bigger, and Tiger 3 does that.Tiger 3 begins with the twist we have all been hoping for since the beginning. Yes, there is a connection between Zoya (Katrina Kaif) and Aatish (Emraan Hashmi). The story goes back in time to explain why, and somehow Tiger (Salman Khan) is involved too. In the present time, Tiger enters with a long action sequence to save Gopi (Ranvir Shorey), who murmurs about a double agent in his last moment. Tiger suspects Zoya and even catches her red-handed, but there is a kick to it. Aatish knows that Junior (Sartaaj Kakkar) is their common weakness, and he uses him to put Tiger and Zoya down. With family conflicts getting worse and Tiger's patriotism at stake, he and Zoya must find a way to prove his worth and also save his and her country's name. Will they be able to do it?The writing of Tiger 3 is a mix-bunch of highs and lows. This spy world is so for an intelligent audience who understands RAW, ISI, secret missions, codes, hacking, plans, and what not, which is usually seen in Mission Impossible and the James Bond series. Tiger 3 takes too long to set the plot for the masses. It takes time to differentiate whether it's personal this time or a national issue. During that process, it loses the audience's interest, and then it has to work too hard to gain it back. Some predictable twists, nationality conflicts, and revenge theories continue driving you even after a decade. It feels repetitive and lengthy sometimes. On the positive side, we have Tiger and Zoya teaming up with a bunch of officers for something that's really interesting and new. I mean, Saving Pak's PM is not a regular conflict for a Bollywood movie. Thrashing is, but saving, No. Somehow we reach a safe point by the end, as the stakes are high and action is overloaded.Salman Khan carries on with his ultimate swag as Tiger, and this time the persona is even bigger. The entry scene is bang on for a known character, and he has several other scenes that seem like an entry scene because he has those heroic moments, pauses, and dialogues. \"Choti screen dekhna chodo Bhai saahab, mein aapko bade parde par live action dikhata hai,\" he tells a Pakistani soldier before beating him. \"Hamare yaha Diwali 3 din hoti hai. Aatishbazi tumne shuru ki thi, khatam mein karunga.\" That's what Tiger is. Katrina, as Zoya, has different shades, and she shines in all except her accent. That towel fight scene with Michelle Lee is going to have a water drop silence in cinemas, followed by chaos by male audiences. She has another good action set in the climax at Pakistan's PM's bunker, and these two are sort of like two Hollywood-kind action segments for Bollywood audiences. Emraan plays an ex-ISI agent, and he is brutal, smart, and sorted. Hashmi adds some of his own accent to Aatish's character, which makes him pretty dark and raw. However, some more physical skills and violence could have been added here. Kumud Mishra, Revathy, Ranvir Shorey, Vishal Jethwa, Simran, Riddhi Dogra (cameo), Gavie Chahal, Aamir Bashir, and others have done well in supporting roles. Shah Rukh Khan's special appearance is massy, but I think YRF needs to look at it seriously now. In Pathaan, we saw Tiger and Pathaan taking situations so lightly. In Tiger 3, the special role is a little more extended, only to see them having some childish conversation and doing Krrish-level flying in the air, which is not at all suitable for \"Indian Spy Agents\". It's not just about bringing two superstars together and creating some temporary mass hysteria, but about presenting them in glorious manners. Pathaan lacked it, and now Tiger 3 does the same. However, we have Hrithik Roshan's elevated cameo in the post-credit scene to cover some lost ground.Tiger 3 has some great action set pieces-actually, the most for any film in the spy universe so far. Tiger's entry sequence, PAL Codes robbery in Russia, Pathaan's entry in Pakistan, and three scenes at the Pakistan PM's office in the ending-these are the major highlights of the film. The cinematography is good, and the background score is fantastic-especially that Tiger's theme music. Tiger 3 has two songs: Leke Prabhu Ka Naam, which appears as the end credit song, and it's a typical celebration song. \"Ruaan\" is about love and pain, but you better experience it in theatres to avoid spoilers. The first half of Tiger 3 is slow, but the second half is longer and yet faster. That's a good trick, I must say. The editing deserves credit for taking a risk in the beginning and then finding a success code by the end. Maneesh Sharma has taken the scale to a new level, while the storytelling still seems to be on a mid-level. All Spy-Universe films suffer from the same issue, but I hope they find a cure soon and we will get a memorable action film instead of one-time and run-of-the-mill action movies. While we have Tara Singh smashing Pakistanis in Gadar 2, let's enjoy Tiger doing the same, but this time the message of communal harmony is much louder. Hardly any film has Pakistanis singing India's national anthem. Tiger 3 is likely to set cinemas on fire with that scene. Sorry, but this one spoiler needed to be shared.RATING - 5/10*",
    "107": "What an absolute thrill ride! Tiger 3 starring Salman Khan and Katrina Kaif is a masterpiece that will leave you on the edge of your seat from start to finish. Salman Khan's screen presence is nothing short of magnetic. He effortlessly commands every scene he's in, reminding us why he's one of Bollywood's most iconic stars. His charisma, intensity, and unparalleled charm are on full display, making it impossible to take your eyes off him.But the real surprise here is Katrina Kaif, who delivers a knockout performance! Her action sequences are a sight to behold. From high-octane chase scenes to jaw-dropping fight sequences, Katrina proves that she's not just a pretty face but a force to be reckoned with in action films. Her dedication to training and the way she executes each stunt is truly commendable.And speaking of Katrina's beauty, she exudes an undeniable sexiness that adds another layer of allure to the movie. Her on-screen chemistry with Salman Khan is sizzling, making their pairing an absolute treat to watch. Their dynamic, both in action and in their romantic moments, adds depth to the film's storyline.The plot is engaging, the direction is top-notch, and the music is catchy. But what truly sets Tiger 3 apart is the incredible synergy between Salman Khan and Katrina Kaif. They complement each other perfectly, creating a cinematic experience that's impossible to forget.In summary, if you're a fan of Salman Khan's captivating screen presence or if you've been waiting to see Katrina Kaif's exceptional action skills and undeniable sexiness, Tiger 3 is the film for you. It's a thrilling rollercoaster that will leave you exhilarated and wanting more. Don't miss this electrifying ride!",
    "108": "I have finally watched one of this year's most anticipated big releases, i.e., Tiger 3, and this feels very different from previous 'Spy-verse' entries. How? Well, I will get into the nitty-gritty, but first, let me state that this review will be distributed in three segments: Positives, Negatives and Mixed, as has been the tradition for my every theatre viewing in the last few months.So, without further ado, let's begin.Positives:-1. Mounting & Scale -\nPathaan had already breached the usual standards of a Bollywood-produced espionage thriller, but Tiger 3 tops it and takes it to greater heights. The extreme wide shots are plenty, and they perfectly exhibit the bigger stage this story encompasses.2. Cinematography & VFX -\nThe magnificent camera work alongside some gorgeous locations do the trick and make it probably the most beautifully shot instalments in the series. Visual effects, too, had its upgrade and look convincing, barring a couple of sequences where inefficiencies peek through, although those moments are few and far between.3. Story & Narration -\nThis was quite unexpected as Maneesh Sharma did something out of the ordinary. He did not make a movie keeping Salman's stardom in mind; he was not willing to do fan service, and I admire that. We have a workable story here with a few twists and turns. Some junctures do defy rationale, but we will come to that later.4. Hand to Hand Combat -\nSome of the best this universe has offered so far. I'm back from the theatre, but I still remember the incredible choreography, a crisp edit, and fitting music in the background.5. Katrina Kaif as Zoya -\nIn a word, 'Fantabulous', I went to watch Salman as Tiger doing action and ended up being mesmerized by Katrina as Zoya. We have already witnessed her potential in the previous film (Tiger Zinda Hain), but she took it up a few notches this time. Every fight, each and every kick and punch, felt unbelievably convincing. I was spellbound!Negatives:-1. Editing Issues, particularly in the First Half -\nWhilst the action pieces are stupendously pieced together, the same cannot be said about the overall editing. Many sequences feel elongated and need further trimming to improve the screenplay's pacing.2. Logical Loopholes -\nThere are a few specific instances (I can't disclose in detail because of Spoilers) where you would be compelled to question the lack of rationality as I did.3. Supporting Cast -\nThe writing had allowed a dozen 'side' characters to participate in the proceedings, but unfortunately, they were not given adequate screen time. As a result, they failed to leave the kind of impact that was expected from them.Mixed:-1. Cameos -\nThere are two cameos: the main one is right after the intermission, and the second is presented as a post-credit scene. On the one hand, I duly appreciate the humour and the rampage these well-planned-out scenes brought along. On the other hand, more could have been done with them, especially with the 'bigger' and 'lengthier' cameo.2. Emraan Hashmi as Antagonist -\nEmraan Hashmi is one of those few actors I think highly of; he is a talented performer but never had ample opportunities to prove his mettle, so I got excited when he was announced as the Villain for the third entry of the Tiger franchise. Now, he did a commendable job and did what was asked of him, but somewhere, I feel more could have been done with him as well as with his character, Aatish Rehman.3. Salman Khan in Emotional Scenes -\n'Bhai' is at his best when there's not much to emote. He excels in showing rage or with his witty dialogue deliveries, but whenever he needs to emote through his eyes or facial muscles, particularly in emotionally charged moments, he cannot do as effortlessly as he does with the rest.Conclusion:-If you are a fan of YRF's concept of 'Spy-verse', pay no heed to my criticism and go for the ride; rest assured, you won't be disappointed.However, if you consider yourself a casual moviegoer, not necessarily an admirer of the star or the franchise, you could still have fun at a packed theatre. Try to avoid some of the logical fallacies of the script, and you are good to go.",
    "109": "Tiger 3,\" the 2023 Indian Hindi-language action thriller film directed by Maneesh Sharma, had its moments of excitement and intrigue, but it left me with mixed feelings. Produced by Aditya Chopra under Yash Raj Films, this installment brings back Salman Khan, Katrina Kaif, and introduces Emraan Hashmi to the franchise.The execution of the film is commendable, with certain action sequences that may remind you of Hollywood movies. However, there was a noticeable sense that Salman Khan appeared somewhat reluctant and tired throughout his performance.The pleasant surprise came in the form of Katrina Kaif, who shone in her role. Her scenes, whether action-packed or not, were executed with visible effort and commitment. Emraan Hashmi's performance was good, adding to the ensemble cast's overall appeal.The supporting cast also deserves credit for giving their best performances. However, Shahrukh Khan's cameo felt somewhat out of place, resembling an action number more than an integral part of the storyline, which, at times, turned unintentionally humorous.The storyline, while okay, may not be easily acceptable to all viewers. It had its moments but didn't consistently maintain the level of excitement and engagement that was expected from a film in this genre.In conclusion, \"Tiger 3\" is a thrilling sequel with some standout moments, especially in Katrina Kaif's performance. However, mixed performances and occasional pacing issues may leave some viewers wanting more. If you're a fan of the YRF Spy Universe, it's worth a watch, but it may not reach the heights of its predecessors.",
    "110": "Tiger -3 action thriller . Salman never disappoints his fans . A treat to watch in theatres for his fans .Action sequences and BGM is top notch .This action drama has got the emotions / love .Salman khan and Katrina Kaif have played their part .You got to watch all the previous spy movies from yash raj film before watching it.Characters involved in the movie is refreshing and most of the South Indian fans will have a surprise factor in it .Considering the previous spy movies - tiger 3 movies is a time pass. You can jus book your tickets and have a good time in watching our Salman Bhai on a mission in a complete action mode .",
    "111": "For me the best movie in the spy universe for sure & lot better than their previous release pathaan.Director #ManeeshSharma has ensured the budget given to him for movie is clearly shown in the movie scenes.#SalmanKhan as tiger phenomenal & their are lots of whistling & clapping moment & the tiger bgm elevates the each scene.#EmraanHashmi as Aatish is fierce,his mind is its biggest weapon & he has done a wonderful job.#KatrinaKaif as Zoya in superb in fight sequences,towel scene is good.& the cameos which everyone know are lit & given enough screen time.A Full Paisa vassol movie.Go & watch & you won't regret!",
    "112": "The first half is okay and promises a better second half, but the second half ends up feeling streched and lacks any engaging storyline. The cinematography in action scenes is good but doesn't do enough to keep you hooked in the second half. Emraan Hashmi totally outshines Salman, who does an average job. Katrina does well in the action scenes but could have been used better, especially in the emotional aspect which the movie fails to create unlike the previous parts. The twists are as predictable as ever, and the only good suspense is revealed inside the first hour. None of the actions sequences are as memorable or will be as talked about like the ones in Jawan. The towel fight sequence could have become iconic but got wasted. SRK\"s cameo fails to create much impact and could have been better used. The locations were good but screenplay could have been better and VFX needs improvement big time. A lot of things felt similar to Pathaan. Probably needed better direction and better writing in the 2nd half. Also, the repetitve and loud BGM becomes annoying by the end. Tiger's theme BGM is good as always but gets overused which takes away all the fun and goosebumps moments. Pritam fails to create an impact with 2 medicore songs. Vishal-shekhar would have been more ideal. The comedy is stupid and forced and doesn't make you laugh at all. Dialouge writing has been an issue for a lot of movies now and this one isn't any exception. The story building in the first half is good (Zoya's backstory, the conflict, Emraan's character building) but falls apart in a hectic 2nd half. Not better Or even on the same level as jawan and Pathaan. A downgrade from the first 2 parts and probably the worst movie of the spy universe so far. Watch this only if you are a huge fan of the spy universe or either of the lead cast.",
    "113": "Tiger 3 disappoints as the weakest link in the series. Salman Khan's overutilization in close-ups raises concerns about compensating for a weak storyline and action. Unlike its predecessors, the film relies excessively on visual effects and stunt doubles, sacrificing the authentic, adrenaline-pumping sequences that defined the series.The film's plot lacks innovation, offering a predictable storyline that fails to engage the audience. The absence of a strong supporting cast further hinders its impact. Salman Khan's star power alone cannot rescue a film with such shortcomings, leaving fans yearning for the dynamic narratives and thrilling action that were once the hallmark of the Tiger series.The decision to prioritize visual effects over practical stunts diminishes the film's raw and intense appeal. The audience is left questioning Salman Khan's commitment to delivering an authentic performance as the heavy reliance on stunt doubles raises doubts about his dedication to physically demanding roles.\"Tiger 3\" fails to capture the essence of its predecessors, missing the mark on both narrative depth and action. Fans expecting a riveting cinematic experience are left wanting, as the film falls short of delivering the high-octane excitement that defined the franchise. In the end, \"Tiger 3\" stands as a disappointing installment that struggles to live up to the standards set by its predecessors.",
    "114": "TIGER TIGER TIGER....SUPER POWER PACKED ACTION/SUSPENSE\nBHAIJAAN - THE GOD FATHER/OG OF ALL ACTION.. IS BACK.BGM : 5/5*ACTION:5/5*STORY: 4.5/5*MUSIC: 5/5*CINEMATOGRAPHY: 5/5* OR 10/10* (LOCATION SHOTS SO WELL):::::::: OVERALL: 5/5* :::::::::\nBHAIJAAN HAS DELIVERED ANOTHER BLOCKBUSTER HERE.TIGER 3 IS WELL EXECUTED AND IS CONNECTED WITH EK THA TIGER AND TIGER ZINDA HAI. So it doesn't make you feel Lost.IT HAS EMOTIONS, ACTION, SUSPENSE, UPSCALE ACTIONS, GOOSEBUMPS MOMENTS..LOVE THE WAY HOW THEY ARE REVEALING STORY /SUSPENSE. EVERYONE IN THE MOVIE HAVE DELIVERED PHENOMENAL PERFORMANCE.BHAIJAAN LOVE YOU AND THANK YOU FOR THE DIWALI GIFT..ONE THING FOR SURE.. BHAIJAAN, EVEN AT 58, STILL GIVING \"THE TOUGHEST COMPETITION\" TO NEW COMMERS AND OTHER ACTORS. GOD BLESS MY BHAIJAAN AND..JAB TAK TIGER MARA NAHI..\nTAB TAK TIGER HARA NAHIDIE HARD BHAIJAAN FAN (SINCE 4 YRS OLD)",
    "115": "Tiger 3 treads familiar ground but stumbles in comparison to its predecessors, warranting a modest 5-star rating out of 10. While it plays its part in developing the YRF Spy Universe, as a standalone, it's just okay and could easily be skipped.The film's Achilles' heel lies in its repetitive storyline and lacklustre dialogue. Salman Khan's usual charm is conspicuously absent, failing to infuse the movie with the magic seen in earlier instalments.Despite these drawbacks, Emraan Hashmi impresses as the main enemy, though the film could have tapped more into his potential. On a positive note, Katrina Kaif delivers a commendable performance with riveting action sequences and a more substantial role, injecting some vitality into the overall experience.In the realm of the Tiger franchise, this third instalment falls short, making it a lukewarm addition to the series. While it might be worth a single watch for fans of the genre, it lacks the spark to make it a memorable cinematic experience.",
    "116": "Tiger Zinda Hai was Better but it's a good watch too.Full on Drama and action Movie.(action scenes are bit less)Undoubtedly continuing the franchise by adding more character in good way.Katrina is improving. She is just wow.It's a nature's law. When you expect more you get less,\nSame happens here.I was expecting more action scenes but got Balanced.I loved hashmi's work. Perfect just perfect.Storyline is bit lengthy and not that much entertaing, unnecessary Songs.Sure it will boom the box office because of its franchise and massy Entertainer side.Action Scenes are Good. BGM is worthy and Boom.Salman Ka Fan will love it.Good movie. Wait for Post Credit.Review of Tiger 3 by itsbymayank - Mayank Bharat Bhushan Louteriya.",
    "117": "Tiger 3 is the phantom of Pakistan political opera, it borrows the story line from the current mayhem of \"democracy\" Vs \"dictatorship\", it didn't solely attack on Pakistan Armed forces, but clearly points the idea that Pakistan is run by dictatorship and whenever they find a genuine leader to sort them out of all the crises, somehow the millitary steps in and put the PM behind the bar. That's the theme of Tiger 3 that they have executed perfectly.Being a Pakistani, I felt that If the character of Salman Khan \"Tiger\" wanted to liberate our ex prime minister \"Imran Khan\". He couldn't do it realistically so he made a film to entertain that Idea, which I think will be likely followed by all the Pakistanis as we all want \"democracy\" to win in the end. Unfortunately, Tiger Mian, the things are not as simpler as you had depicted in the film. It's a toll to catch up!If I talk about Tiger 3 as a film, then I have to say, It's a complete package, the first is edgier, the ark of the story build up strongly, and It's like a political carnival, Tiger was put on a burner by Aatish, but somehow Tiger escaped it. Without revealing much, If you like action thrillers, you will like Tiger 3.SALMAN KHAN IS OG OF ACTION THRILLERS IN INDIA, and he have proved that in Tiger 3, whenever he is onscreen, you will cherish that moment, It's like a man with action poetry. Katrina is good as Zoya but her dialogue delivery is terrible, the film was centered on Pakistan but she lacks the emotions to portrayed on screen. She was stoned face in scenes with Emran Hashmi.Emran Hashim as Aatish is Aatish (Fire). I would like to see the more of him with Salman Khan has they have a real intensity whenever they face off, It's like putting two Tigers in a den to sort out who is best. If YRF wanted to make a villain verse, they should make a film with Jim and Aatish, I would like to see them collaborating as both of their agencies disowned them and they lost their families in the end, and Emran is more evil than Jim in terms of his stringiness and rawness of the character. The rest of the cast members did a commendable job especially Anant Vidhant, Gauvie Chahal & Kumud Mishra.Music is average & the BGM elevates the action sequences.Tiger 3 is a treat for all those who love Salman Khan as It is the best film of Spy Verse.",
    "118": "Finally after a long time an action thriller movie from Bollywood which totally relies on it's storyline. From the beginning till the end, the plot of the film carries the movie forward.Salman Khan shines as usual in the role of Tiger, the OG spy from YRF spy universe.Katrina Kaif too shines as Zoya, a bit more in this part of the franchise.Emraan Hashmi as Atish Rehman, well it's needless to say how well he performed like he always does in all his movies.The cameos of the other spies brings a star value. The mid credit cameo was a surprise.Film has a lot of suspense. So it keeps the audience hooked till the end.In my opinion,\nStory wise - Tzh > T3 > Ett\nEntry wise - Ett > T3 > TzhRealistic action sequence wise/spy thriller wise - T3 >>> all other spy movies.",
    "119": "Tiger 3, under the direction of Maneesh Sharma, storms into cinemas with Salman Khan's magnetic screen presence, elevating the franchise to new heights. Sharma, known for his adept storytelling, collaborates with Salman Khan to weave a tale filled with unexpected twists and turns, skillfully connecting with its predecessors, \"Ek Tha Tiger\" and \"Tiger Zinda Hai.\" While the storyline takes center stage, Salman Khan's stellar performance adds a layer of depth that enhances the overall cinematic experience.Salman Khan's charisma is undeniably a driving force behind the film's success. His on-screen presence is nothing short of wow, commanding attention in every frame. The actor's portrayal of Tiger is a testament to his versatility, seamlessly blending intensity with moments of vulnerability. The connection to the previous films in the series adds a nostalgic touch for fans, creating a cohesive narrative that ties the trilogy together.However, the film is not without its minor shortcomings. Despite the thrill of unexpected plot twists, the weakest link comes in the form of Shah Rukh Khan's cameos, which fail to leave a lasting impact. While Khan's appearance adds a touch of star power, the execution falls short, leaving audiences wanting more from the much-anticipated collaboration.The action sequences, though commendable, could have been more elevated to match the grandiosity of the narrative. While the choreography is impressive, a few more jaw-dropping moments could have further intensified the film's edge-of-the-seat appeal.On a patriotic note, Tiger 3 deviates from the usual India-Pakistan geopolitical theme, with Emraan Hashmi portraying a Pakistani villain. However, the absence of a strong patriotic feel may leave some viewers yearning for the charged emotions that usually accompany such narratives. The choice of Hashmi as the antagonist adds a layer of complexity to the plot, but the geopolitical angle may have been better explored for a more resonant impact.On the positive side, the film excels in its overall package. The combination of good acting, thrilling action sequences, captivating cinematography, and a noteworthy musical score makes \"Tiger3\" a complete cinematic experience. The international settings are captured with breathtaking visuals, and the background score by Vishal-Shekhar enhances the emotional depth of key moments.In conclusion, Tiger 3 under the direction of Maneesh Sharma, emerges as a cinematic triumph, with Salman Khan's captivating screen presence and a storyline that successfully connects with its predecessors. While some elements may fall short of perfection, the film delivers on the promise of an action-packed blockbuster. With its commendable acting, engaging narrative, and a well-rounded cinematic presentation, \"Tiger3\" stands as a formidable addition to the Tiger franchise.",
    "120": "Tiger 3 Movie Review:>>\nDirected by Maneesh Sharma & a part of the YRF spy universe, Tiger 3 is an \"out and out\" action film. Salman is back with bang and this movie is diwali gift for all Salman Khan Fans.Great action sequences, especially the ones performed by Katrina Kaif in white towel.In the middle of the movie a cameo from Sharukh khan who returns his favour to Tiger for saving him in Pathan. Don't miss the teaser of the next YRF film starring Hrithik ( Kabir) / (War 2) at the end of the \"Leke Prabhu ka Naam\" song !Emraan Hashmi best acting as a villian. Cinematography is praiseworthy & locales are just awesome (Russia, Turkey, London), a treat to the eye.Tiger 3 is a good spy movie & will definitely appeal to the masses. My rating for this high octane action movie is 4/5.#Tiger3 #tiger3movie #salmankhan #katrinakaif #EmraanHashmi #YRFSpyUniverse #YRF #movie #review #yashraj #action #arijitsingh #songs #music 💥🔥",
    "121": "Tiger 3 we have our perfect trilogy. Action with Emotions and story is the skeleton of this trilogy and Maneesh Sharma(dir) didn't disappoint. There were so many scenes, deja vu moments which reminded me of ett. TZH characters marked their presence beautifully.I got the content i craved for.Tiger3 is a perfect celebration feast for tiger zoya fans. Salman Khan lives tiger. He walks, talks and breathes tiger. His one stare, his subtle dialogue delivery, his chemistry with Katrina, everything was pitch perfect. His stint as tiger would always be my favourite.His body stature is made for those epic back poses. His presence Is god level. He just has to be there on my screen, and my eyes lit up.Emraan Hashmi cake walks. He's simply brilliant. He's effective and scary. Not that he has got unreal weapons or something, but Emraan's aatish was effortlessly menacing. His voice and walk >>\nKatrina Kaif proves why everyone calls her mother of spy universe. She was the best presented in this movie. Her character add-ons were so good that nothing felt forced or out of place.RUAAN RUAAN IS NEXT BEST OR EQUALLY BEST AS SAIYAARA. That song, the setting, trust me. Makers saved it for the best. Experience it in theatres yourselfTiger3 is imperfectly perfect! It serves the ett and TZH fan in me in a wholesome way. Repeat value is high.Tiger 3 we have our perfect trilogy. Action with Emotions and story is the skeleton of this trilogy and Maneesh Sharma(dir) didn't disappoint. There were so many scenes, deja vu moments which reminded me of ett. TZH characters marked their presence beautifully.I got the content i craved for.Tiger3 is a perfect celebration feast for tiger zoya fans. Salman Khan lives tiger. He walks, talks and breathes tiger. His one stare, his subtle dialogue delivery, his chemistry with Katrina, everything was pitch perfect. His stint as tiger would always be my favourite.His body stature is made for those epic back poses. His presence Is god level. He just has to be there on my screen, and my eyes lit up.Emraan Hashmi cake walks. He's simply brilliant. He's effective and scary. Not that he has got unreal weapons or something, but Emraan's aatish was effortlessly menacing. His voice and walk >>\nKatrina Kaif proves why everyone calls her mother of spy universe. She was the best presented in this movie. Her character add-ons were so good that nothing felt forced or out of place.RUAAN RUAAN IS NEXT BEST OR EQUALLY BEST AS SAIYAARA. That song, the setting, trust me. Makers saved it for the best. Experience it in theatres yourselfTiger3 is imperfectly perfect! It serves the ett and TZH fan in me in a wholesome way. Repeat value is high.Tiger 3 we have our perfect trilogy. Action with Emotions and story is the skeleton of this trilogy and Maneesh Sharma(dir) didn't disappoint. There were so many scenes, deja vu moments which reminded me of ett. TZH characters marked their presence beautifully.I got the content i craved for.Tiger3 is a perfect celebration feast for tiger zoya fans. Salman Khan lives tiger. He walks, talks and breathes tiger. His one stare, his subtle dialogue delivery, his chemistry with Katrina, everything was pitch perfect. His stint as tiger would always be my favourite.His body stature is made for those epic back poses. His presence Is god level. He just has to be there on my screen, and my eyes lit up.Emraan Hashmi cake walks. He's simply brilliant. He's effective and scary. Not that he has got unreal weapons or something, but Emraan's aatish was effortlessly menacing. His voice and walk >>\nKatrina Kaif proves why everyone calls her mother of spy universe. She was the best presented in this movie. Her character add-ons were so good that nothing felt forced or out of place.RUAAN RUAAN IS NEXT BEST OR EQUALLY BEST AS SAIYAARA. That song, the setting, trust me. Makers saved it for the best. Experience it in theatres yourself.Tiger3 is imperfectly perfect! It serves the ett and TZH fan in me in a wholesome way. Repeat value is high.",
    "122": "*** Tiger 3 Hindi Movie Review ***Directed by Maneesh Sharma starring Salman Khan Katrina Kaif Emraan Hashmi in lead roles..A movie to be perfectly slotted for a Diwali Festival..The Movie's storyline differs from the other spy verse films and the through which the film tries to give a message...Performance wise, Salman Khan as Tiger always roars.. If Daniel Creig fits into the shoes of James Bond, Tom Cruise as Agent Ethan, Salman Khan effortlessly shoulders the Tiger & the movie is all of Salman's performance...Katrina as Zoya shoulders her character thereby the movie well. There has to be a union of Deepika & Katrina characters in the upcoming YRF spyverse which will raise the enthusiasm of watching...Shah Rukh Khan Cameo in 2nf half adds flavour as the two when seen together on the big screen, box office sets on fire.. Whether it's coincidental or planned. Tiger's entry after a few minutes in Pathaan the second half the same being observed in Tiger 3, shows that the team really sticks to the \" YRF SPYVERSE\" concept.Emraan as the antagonist did a great job. Good to see him in a different shade...Action sequences were interesting to watch keeping aside it's logic..VFX is a scope of improvement...A bit of strech felt towards the end. Need to have trimmed a bit.End credit awesome..Overall as Tiger says till his next mission he will be under Operation Time Pass , the same way Tiger 3 is a time pass entertainer keeping aside the brain.",
    "123": "We waited long long time from salman khan for this and finally Tiger 3 arrived . It's has everything actually more than what k expect . Story, style, acting, action and emotion.Salman khan as his best like ever before .Katrina is good but Ekram Hashmi did excellent.Action are just Hollywood standards. Story keep you full in sense and emotion will melt your heart.After so long salman khan came with good movie . We want great movie from him since he have great fan base and people love him,\nAlll together it's a blockbuster.Starting and 1st half is the key for me and it was amazing and 2nd half fulfill everything.",
    "124": "Salman Khan is back as Tiger and he gave an excellent performance! A perfect comeback film for him and this was much needed. The emotional scenes he has, he emotes really well and he did so good!Katrina Kaif as Zoya is a totally bonafide star, and she does her action scenes so freaking good!! She's amazing! Her performance was really great and her chemistry with Salman Khan is always perfect! That towel fight scene was perfectly shot and amazing!Emraan bhai as the villain gave an outstanding performance and he literally killed it!!!! Damn what an amazing actor he is! Emraan bhai as villain is always fantastic!Shah Rukh Khan sir as Pathaan was just amazingly fantastic!!!! That 20min screen presence was too good! Loved watching Tiger and Pathaan fighting it out together on screen!Cinematography was really great, and the film had some amazing visuals and the chase scenes were shot well! Action scenes were also shot brilliantly.BGM uplifts the film and is absolutely amazing!! The 2 songs were really good and both are my absolute favourites! Loved Leke Prabhu Ka Naam and Ruaan!An absolute BLOCKBUSTER!! The 5th best film from the YRF Spy Universe!"
}