{
    "0": "Technically, there was no cohesive storyline. Dialogues were all over the place. Conversations between characters were weird. Like every time one would say something and other would go into an unrelated monologue. (Mostly ranbir).It's nothing like the trailer. Story is not about son and father. They didn't show anything about their relationship after the first few scenes.Coming to content, Ranvijay never knew to answer a question straight. His character had no consistency. Even if you make a negative character, his actions need to be consistent. In one instant they want to show he is unhinged and doesn't care, and then next instant he would forgive and protect them.A movie needs to have a story, a plot, characters need to make sense inside the movie.Their attempt at jokes were so distasteful. He gives a wedgie to a servant, rants about his underwear, there's two monologues about pubic hair, there's denial about medicine.Even the climax was so underwhelming. They just faught in one song.Worse part was how they used Sikhs in the movie. They tried to use them to do idk what. But they're just around to elevate Ranvijay. And in main climax they're told to stay back. Then killed on screen helplessly. Why would you show something like that.All in all, as a movie it sucks due to lack of story and badly written characters. Then there's the content.",
    "1": "The movie glorifies violence, physical and sexual abuse, denigration of women and basically banks on shock value to provoke viewers rather than pull in people with a coherent story.The director will claim that he is some sort of indian tarantino, but its not even close. Just a badly made movie with a man whom every woman must be careful of and stay very very very far away. Consider this a warning and avoid this psycho and his movies. Nothing good can come out of them.Its specially troubling when you know that these movies will appeal to already mysoginistic men in India and encourage further crimes against women. Really feel bad for women who now will have to put up with more misogyny because of trash like this.",
    "2": "Ranbir personal show with no story, no logic and absurd action scenes. Anil Kapoor and boby are wasted totally, the film story is from the age where there are no law and enforcement exists you can do whatever you want to either it's your own country or you are in foreign kill as many people as want .... to make a century of corpses is like a piece of cake. Zero emotions and no chemistry between father and son....not even close to a worst family drama and yes it's not a family movie strong language lot of unwanted smooching and obscenity. Spend 3.5 hrs with your father or if you are father spend quality time with your son and save yourself from this disaster.",
    "3": "Animal, the latest cinematic blunder from director Sandeep Reddy Vanga, is a film that assaults the senses and insults the intellect. The story, if one can call it that, centers on Vijay, a gangster as devoid of depth as he is of conscience. Ranbir Kapoor's portrayal of this abhorrent character is as unsettling as it is uninspired. His performance, lacking any nuance or complexity, reduces Vijay to a mere caricature of toxic masculinity. Animal is a cinematic disaster, a toxic symphony of violence and misogyny. It offers no insights, no entertainment, and no redemption. It is a film that should be avoided at all costs, lest it leave its viewers feeling as empty, jaded, and disturbed as Vanga himself.",
    "4": "Went to see it with my 2 boys last night in Manchester.What looked like an awesome film from the trailer turned out to be an awful experience. An embarrassment of 2023.Be Sharmi. Be hayaaii. Be ghairati. The Indians are fast losing their sense of identity as they try so hard to westernise themselves but none of the western world watches any of this kind of trash so why bother losing your authenticity?This film is a sex romp with a mindless and senseless killing spree. It beggared belief and on so many occasions we just wanted to walk out but hung in there hoping against hope it would improve.Ranvir Kapoor an excellent actor was unable to make the film look intelligent at all and a deaf Bobby Deol now looking aged was thrown in for good measure in the last 20 minutes. Anil Kapoor looked lost with the odd decent dialogue but nothing out of the ordinary.It was just killing upon killing with scenes and dialogues of sex that would make Bollywood no go films with your daughter or mother. Any wonder that Bollywood is dying out slowly and actors are out of work. Carry on with this trajectory and Hindi cinema won't exist in another 20 years as it will have lost itself completely.Distasteful. Disrespectful. Disgusting.",
    "5": "You seriously need to question the sanity of the director, producers and even the actors of this film. I'm a bit traumatized by the movie, and Ive seen my fair share of gore. This movie was beyond bad. And the storyline defies logic which makes it even worse. Too many instances where basic questions and clarity in communication would've reduced the screen time from three hours to two hours max. The worst part is the director is planning on a sequel soon.If you value your hard earned money and your mental health, I would advise you to abstain from watching this 3 and a half hour torture of a film.",
    "6": "I have a migraine watching this cringe movie. Literally every aspect of this movie is cringe. And in terms of originality, this is Rajneeti meets Kabir Singh with an overdose of papa, papa. Give it a rest, you can love your father without being abusive to the rest of the world. And the great thing is that there is still no closure for the audiences who've been wound up for 3.5 hours in the hope of at least a detente.The 'visionary' directory Sandeep Reddy Vanga goes to town bringing every debunked cliche to life - the cliched 'alpha' shtick, the slap-happy father who favors the son-in-law over his own son, the subjugated wives and mother, the 1 'alpha' killing 100 of people (not an exaggeration) armed with a couple of axes, creating 'body doubles' as if that's a thing.The funniest part is that the climax fight with Bobby Deol literally has its own narration ongoing in the form of a song in the background - as if singing \"Ye dekho kaisa thappad maara~\" with every slap landed.No closure is offered to any of the sub plots ongoing with the protagonists - the relation with the wife, the kids or even the father. To compensate for this, Sandeep Reddy Vanga overcompensates with gratuitous violence to satisfy the enraged crowd watching this trash, never having been involved in as much as a scuffle, much less an actual fight.The plot is as simple as it gets, and it's clear Sandeep Reddy Vanga didn't have a story to tell, as much as a couple of ideas for scenes he wanted to execute based on his diminutive understanding of Marathi music, fetishization of Sikh Youth and culture and more importantly, his bloodlust to satisfy.Such is the bloodlust, that even the post-credits scene is drenched in more blood than most animes, and that's saying a lot.",
    "7": "When we make a female lead movie, everyone labels it as a feminist movie. But even then those movies just portray how a woman challenges society and comes forward in life. Society can't accept even that and rates the movie so low. Then what about this nonsense movie. Is this not a misogynist movie. How many movies like this are shown to insult women and objectify them. Why is no one labelling such movies as misogynist when it actually is. Why are we still showing women as objects in such kind of movies. What is it with movies like Kabir Singh and Animal. This movie is so disgusting, it shows how ranbir is in real life. Look at the movies alia chooses and look at the movies this useless fellow chooses. He either chooses a playboy movie or a movie where he objectifies women. Poor alia to be married to such a misogynist.",
    "8": "The movie is ridiculously bad. Keep the misogyny aside (which is absolutely horrid), the movie is still looks like a headless chicken running around. There is absolutely no story. I wanted to leave the theatre on so many occasions, yep, it was that ridiculous.There is such a lack of logic as well! Ranbir Kapoor is in supreme health just a short while after getting a HEART TRANSPLANT and beats the hell out of Bobby Deol. Ranbir is killing 200 men alone while his Sikh brothers are singing in the background. Heights of stupidity.Please do not watch the movie and give it attention that it clearly does not deserve.",
    "9": "I dont think I have felt so enraged after watching a movie. Prominent figures, especially actors in a country where movies have so much impact on the population, should behave with certain social responsibilities. With absolutely no story, and such ill treatment of people (especially women), there is no scope to appreciate any creative angle. Just naming the movie \"Animal\" does not justify validating the excessive misogyny, elitism and narcissism. Also there is a line to where it gets excessive, but that was crossed way back and you still have to sit through the movie which could have ended at intermission.Hating the fact that this movie is getting a good opening and could have a sequel. *puke*",
    "10": "Man. Ranbeer kapoor, and his pind brothers, what a lit and elite squad. Absolutely run havon in the city.Vanga simply says it bluntly on everyones face, i will dare to do what i want and show what i want and he has done that.Vangas vision is completely fulfilled by ranbeer and all other actors. Movie becomes little boring in 2nd half. But the finale is good. It is about the real man to man fight.Am still in awe of ranbeers role. This is his best acting till date. Kudos to all. Rashmika did grt in her part as well as anil kapoor. Bobby has also done good. This is a must watch theater exprnc.",
    "11": "After the long wait, my friends and I went to the morning show of this movie, and the theater was packed. I was excited to watch it because I liked the trailer, but despite the interesting first half and a great scene before intermission, the entire cast started doing nonsensical things after the break. It seemed like the director instructed them to do anything imaginable to bore the audience until the climax scene, which was somewhat good. Despite the cast's performances, I found this movie extremely skippable. Rashmika was improving, Bobby Deol deserved more screen time, and Ranbir Kapoor's performance deserved a better film. Overall, it's not worth your time. While the background music makes it somewhat watchable, I still recommend skipping it. You might as well go to the zoo and watch a real animal; you'll be done in 1-2 hours, rather than spending more than almost 3 hours and 30 minutes watching this unnecessarily violent, misogynist, low on story cheap adult film with mediocre action and far too many nonsense scenes.",
    "12": "This movie is such an atrocious movie. The poorest of the scripts in recent years. Ranbir Kapoor is definitely an over hyped actor. Unnecessary the movie has been exaggerated for so long. Ranbir Kapoor looks weird in macho in fight seen. He definitely is not meant for these kind of such scenes. A time when movies of 2 hours seem to be too long without a good script, this movie is a torture for three hours 20 minutes. This fiction has miserably failed to create a positive impression and convey any message to the society. Ranbir looks psycho is his character and so in his acting, too many unnecessary characters in the movie has made it a big failure.",
    "13": "All bark and no bite. That's the point of the movie Animal in 5 words. When you sit down in the theatre to experience the much hyped, one of best movies of 2023 and receive randomized, unnecessary scenes in the name of extravagant cinema, you feel let down and cheated.Sure, there's a lot of action, violence, gore, anger that people may not have seen before in a state side movie. But if it doesn't relate to the story, the characters of the movie and most importantly the emotions of the film, it feels like you have been cheated out of 3hrs 21mins of your precious time and money. So behold, something you dont understand, you dont like and yet, you will spend money on it. Sad and shameful. The only saving grace of the movie is Bobby deol.",
    "14": "In the cinematic landscape of the past 5 to 7 years, this movie stands as a beacon of originality amidst a sea of formulaic productions. Breaking free from the recycled narratives, it's a refreshing sip of new wine in an industry often pouring old ones into new bottles. Amidst the exceptions like Bahubali and KGF, this film emerges as a paragon of authenticity. Witnessing moments of emotional intensity, it could be deemed one of the most emotionally charged films to date. The film's pacing is a tale of two halves, with the first delivering entertainment and intensity, while the second gains fervor upon Bobby Deol's entry. Sandeep Reddy Vanga's audacious storytelling steals the spotlight, cementing \"Animal\" as a standout in this year's cinematic landscape. The amount of violence in this movie is overwhelming in a good way, the blood and gore is not for the faint hearted, definitely a benchmark.Ranbir Kapoor's fantastic performance and transitions set this violent revenge saga on fire hands down. Ranbir Kapoor's stellar performance solidifies his position as the superstar of Indian cinema. AK is excellent in the confrontational scenes and Bobby looks menacing, but both have very little to do. Rashmika did a good job. A must-watch for those seeking a gripping and well-crafted film. Highly Recommended.",
    "15": "Just Watched Animal, Hold the Breath. It's a BLOODSHED BLOCKBUSTER...Ranbir's daring & dashing performance never seen in screen before. Just nailed the role! He is really a versatile actor. He did this with so intensity. Bobby Deol is in beast mode. Rashmika got a decent role. This is a masterpiece by SandeepReddyVanga and Ranbir Kapoor which will remain in everyone's heart for years and years... Remember the name Sandeep Reddy Vanga. All hail pride of our TFI . Special mention to my brother Harshavardhan Rameshwar knew him since ArjunReddy days.what a BGM man that interval fight goosebumps guaranteed with this film SRV will enter to next league of filmmakers in Indian cinema, HUGE EXPECTATIONS will be on Spirit now. In this web series era where people sit hours and hours to watch their fav genre we can easily spend and watch those extra 15-20.",
    "16": "Bollywood as usual à man's world. The clear success of this shows how toxic the thought of viewers and the industry. Misogyny praised, cheating normalised. Just a garbage storyline put into together just to satisfy some men and fantasy of the director.From begining till the end, it normalized cheating by men, disrespect to women etc. The director clealry showed his disrespect towards women in life and showed unrealistic and unmatched masculity through raw sex scenes and violence.Movie is sickening to its core and breaks the society even more to disrespect women.Tried to imitate a bad version of bdsm movie like fifty shades of grey but conveyed very dark.",
    "17": "Ranbir Kapoor had to be pretty desperate to sign up for such a B-grade script. This is like the old B-grade Mithun movies -- revenge storyline, plenty of violence and women being shown their \"proper\" place. Merely tagging on a father-son conflict, adding some raw dialogs and getting an A-lister to play the protagonist does not elevate a movie from B-grade to A-grade. Of course, people with a certain mentality enjoy this kind of stuff -- no doubt it will mint obscene money.Some of the reviewers here are saying it is pathbreaking etc -- pathbreaking for what? For making B-grade mainstream? About Ranbir's acting: nothing great.. over acting and over shouting.. (Ahem as befits a B-grade movie). Also beats me why a talented actress like Tripti would agree to be a part of such a regressive movie.",
    "18": "This film is a validation to all the psychopath and mysoginist male in the society. This type of movie is a cancer to society where the character like Ranvijay are celebrated as a hero. Those who say a film is just a film, it does not have any impact on real life, then they are forgetting that we all are more or less the result of the movies we grew up watching. How we think now is the portrayal of the environment we grew up, including the movies we watch.Even if we avoid the issue of moral right and wrong and simply try to focus on the movie itself, then it is a garbage. The whole movie doesn't make any sense, it is full of nonsense emotions which is not normal at all. There is no strong story, the scenes jump from one shot to another without bringing any completion to the former shot. On climax scene, which is very violent, it plays a song about father-son relation with a romantic tune, which feels really absurd.Now, talking about the characters, the female characters are disturbing portrayal of very weak women, the male characters are portrayal of mysoginist and barbaric characters, but doesn't have any consequences of their actions, rather the characters are glorified and shown as masculine figure. Each and every action of the character Ranvijay are justified in the whole movie.This film promotes violence, influences demoralized characters of society, and most importantly it is a badly made movie, without any proper concept. Just to hide the lacking the director made it full of actions and violence, so that it can easily make money. Sadly he succeed. But the people who can really judge a movie will know why we should avoid watching these movies. Hopefully one day the audience will mature and know which movies should be appreciated and which ones not.",
    "19": "Even 3 is pushing it. This was so bad I'm beginning to doubt i watched a different movie than what everyone else is describing. What a downgrade from kabir singh. They wasted so much time on random stuff, more than 3 hours and here i am asking myself every second when will the \"story\" kick in but it feels like they forgot to do that or add depth to the characters; and I'm not a person who looks for a \"purpose\" in every movie that is really not my point when i say there wasn't anything going on i really mean there was nothing. Nothing feels natural, the quirkiness, the edginess, none of it was really delivered.",
    "20": "Interesting scenes:\n1. Monkey story from Ranbir says this is not at all a serious movie\n2. It's like human version of Jurassic park\n3. Potrays how a child behave if he lost father's love\n4. Doop of Anil Kapoor scene says importance of Ranbir choosing violence\n5.pre interval gave decent fight sequence which we missed in climax\n6. Movie talks about many points about relationship\n7. Sandeep might not impress with 2md half but concludes wellNegatives:1. Isn't hyping the next scene\n2. Just webseries kind of scenes but we can't hear many of their dialogues even in that theatre sound\n3. Mad characters are almost making us mad in theatre for a while.",
    "21": "This movie is made for audience who seeks for action, Background music,Drama &Comedy A 10/10 movie made in this decade specifically in bollywood Special vibes for Marathi audience ✌🏻Who loves to see craziness, limitless love & affection for family this movie is made for you, Majorly enjoyable movie for youngsters, worth they money you'll spentSpecial features\nAction\nDrama\nBackground music\nSongs\nPanjabi vibes\nMarathi vibes\nEmotion for family (not just father)\nIntimacy & loyalty for partnersGo for it don't miss a chance to watch this movie if this genre is your favourite then watch this.Love it.",
    "22": "Don't waste your time. Hopeless movie with too much toxic masculinity! Slapping between couples is glamorized. Total nonsense. Ranbir Kapoor's character is clearly full of toxicity. The movie is low on substance and clearly, all the protagonist wants is validation and goes on a killing spree just to prove it. Clearly, Ranbir Kapoor is mentally sick and all is justified in the name of saving the father. Utter nonsense. I don't know who they are copying - Godfather or scarface or Kill Bill. \"Sadly it's a man's world\", Vijay says to his wife in a scene\", need not say more about the inherent sexism.",
    "23": "Good aspects\n1 originality\n2 action scenes\n3 Ranbirs acting is brilliant\n4 timelines of story portrayed well\nBad aspects\n1 total disrespect for women\n2 rashmika mandana is just for kissing scenes and to listen ranting of the protagonist\n3 portryal of all women is very disturbing\n4 no depth in story\n5 willing extension of disbelief also very difficult bcz they have chosen a genz timeline but the story is based in millenial timeline\n6 there is a particular event in the movie which is unacceptable and unbelievable it depicts that the protagonist cheats on his wife and tries to justify his motives and funny and disturbing thing is that wife doesnt give him divorce everything continues\n7 in movie protagonist wants to protect his father and wants a revenge he just wants to kill people for his father but he listens to his father 0% of the times and he doesn't even think of his kids and wife\n8 it is very disturbing how people are liking it so much.",
    "24": "Not every Friday we get to see a film which has eccentric but very effective writing, terrific direction and a lead actor who acts like there's no tomorrow Animal is one such rare film Apart from editing, every other department gave their best Music and BGM are top notch in Animal. Ranbir Kapoor deserves all the awards next year. Movie met its expectations and now it's time for Animal to break all box office records All time blockbuster GO WATCH IT you will never regret. Ranbir kapoor nailed it man What a movie man. BLOCKBUSTER written all over. No such movie has created or will be created in the future.",
    "25": "First of all, there is no vision in the movie. The movie is 3.5 hours long and does not keep the public engaged during the whole movie.An experience of watching 80% phone screen, 10% the food in front and 10% movie screen.Felt like it would be worth it but totally wasn't. Disappointing Bollywood Direction, Pathetic Dialogue writing and highly ineffective acting and overacting by female actresses.The movie could have been shortened to 2.5 hours but unfortunately, they thought that boring the audience and taking their money by producing such stupid movie was a better idea.Advice - Ignore the paid (positive) reviews and Donot watch it and waste your 4 hours. I did and I can't stop regretting it.",
    "26": "What a WOW! Only Ranbir could have matched the superamacy of Bahubali, style of Pushpa and larger than life character in KGF, all combined in this ANIMAL.Amazing screenplay, direction and choice of supporting characters and music. This was a treat to watch on this weekend snowy day.Only catch is that this movie may be too much with family and might not fly off with that group. Watching with friends and colleagues, this will give you that adrenaline rush on a boring day, but will still leave you full of mixed emotions.And there is a surprising element as well. This will not let the movie impression go away for some while for sure.",
    "27": "I dont think I have felt so disturbed after watching a movie. Prominent figures, especially actors in a country where movies have so much impact on the population, should behave with certain social responsibilities. With absolutely no story, and such ill treatment of people (especially women), there is no scope to appreciate any creative angle. Just naming the movie \"Animal\" does not justify validating the excessive misogyny, elitism and narcissism. Also there is a line to where it gets excessive, but that was crossed way back and you still have to sit through the movie which could have ended at intermission.Hating the fact that this movie is getting a good opening and could have a sequel. *puke*\nI don't understand who are these people rating the movie so highly, or are they trying appease one and other! Someone has to be real psycho to appreciate a movie of this gore or there is scope to buy ratings, they audience will lose faith in ratings.",
    "28": "One of the best movies I have watched in a while. Sandeep Reddy Vanga is a true genius. He challenged status quo like never before. Ranbir and Anil Kapoor gave brilliant performances as well. I am certain that this film will have reconsolidated Ranbir's reputation in the industry as a star. A thorough entertainer and certainly his father's worthy son.Ultimately the secret of the success lay in the direction since it is the director who brings out the best in his actors and Sandeep Reddy Vanga has always been a champion in this field. Even minor characters like Prem Chopra and Tripti Dymrii were amazing in their limited screentime. Great way for Bobby Deol to make a comeback. The scenes and the realistic acting will always be memorable. The film certainly is a reality-check for many (as is evident for those who are unnecessarily unnerved by this masterpiece). Eagerly waiting for the sequel.",
    "29": "Animal starring Ranbir Kapoor,Rashmika & Anil Kapoor is an awful attempt to create a movie like Oldboy(gory action scenes), every scene in the movie is like Godfather & Second half is like Kabir Singh and Arjun Reddy married version.The story is nicely paced in first half with gore action sequences and bloodshed with some sense of vision by the director but in the second half added some unnecessary scenes with half cooked sub plot. Bobby Deol is under used in the film\nCinematography is upto the mark casting is good but All\nthe way its the Ranbir Kapoor show and Anil Kapoor is nowhere in the movie. Rashmika character is strong but i felt under used. There are many loopholes and it makes this film a boring undercooked action saga in the end.BGM and songs are great but the film lacks in heart and soul and some script🙂",
    "30": "What a Movie... The first half is so good... yes it is a little lengthy, but want an awesome movie... Ranbir Kapoor is actually the best actor no doubt, the direction bhai sandeep reddy vanga is now one of my best director want to see what this has to deliver more.There is not much action but one do not have to show the Animal inside you.The father son is nice.. do not miss the interval. The actress is not good at all they would have casted someone better.Bobby deol get very less screen time, but its amazing what he do with it...i will watch it again 100/10 is what i will give..............",
    "31": "This is not a movie but 3 hours of torture. Undoubtedly Ranbir's acting was good but the movie doesn't have a script, and full of illogical sequences and redundant action sequences. Nothing is worth watching. You will go berserk by the intermission and will be left with a heavy head.Totally misogynistic. The female characters don't have any substance and they are just puppet of the so called protagonist of the story. This movie also promotes vandalism, indiscipline and hypocrisy at many levels.They just created hype to earn more in the first week. So many scenes look exactly as Kabir SinghIt isn't worth your hard earned money. Better avoid it.",
    "32": "Words cant describe the inner feeling of anyone. If something happens to someone closer and you love them more than your life, what's your inner feeling? This the movie is exactly the same thing. Interval bang is something else, no army can produce. I haven't watched any movies with Bollywood actors/actresses for the last 5 years. The only reason I watched this movie is because of Sandeep Reddy. But, honestly, this movie is nothing without Ranbir, I think he is the correct fit after all, I can't think of anyone, to be honest (NTR/Surya/NANI/ Mamooty) who can make it work but this story definitely belongs to Ranbir/Shahid) May MAHESH BABU can make it work. Every screen and frame is focused on Ranbir, and I can see why Sandeep chose him after many attempts. I wish Alia Bhatt instead of Rashmika. More creative than Arjun Reddy. Will watch it again. BGM 🙏",
    "33": "Animal is an action crime drama thriller film directed by sandeep reddy vanga.Ranbir kapoor has transformed into an acting powerhouse through this film. He becomes an animal in true sense, his dialogue delivery on par with his rockstar and barfi days. His expressions were on point throughout the film. This was his film and he made it his own. Anil kapoor, plays a distant father very well, emotionally caring but not showing enough. The back and forth between him and his manic son is impressionable. Rashmika mandanna acts good and bad both. She fluctuates a lot with her performance. She starts well, then crashes and finishes well. Quite an on and off performance. Bobby deol in his limited screen times lit up the screen. Saurabh sachdeva too acts well a sidekick.The first half is brilliant. The characters their motives, their personalities are perfectly defined and fleshed out. The action scene before the interval block is outstanding. The choreography and background music and the song 'arjun vailly' is terrific. The marathi song also tonks up the scenes. Ranbir is swift and flexible like a swinging door. But the problem starts in the second half. The recovery time extends beyond limit, and the cheating subplot is unnecessary. Tripti dimri is very good as zoya, but the act of justifying cheating in the name of daddy issues is layman writing. The music is outstanding. Every song is clapworthy. The comedy is also very good.Now, coming to the politics of the film, i agree with some and detest some. The portion about becoming like the man of the family is something i will agree with. There is nothing wrong about protecting your loved ones, the way could be wrong but the intention will always be right. As I said, the cheating subplot is nonsensical. Some dialogues about periods are also very basic and seem insensitive, could have been better.",
    "34": "The first half would give u kicks of adrenaline ...the second half would be good ...this movie has violence , action along with a good story and character depth that makes action more interesting and would glue u to screens for 3 hours ...go for it ...its the type of movie which would come out as the best in theatres so go for it without thinking much ...Also don't go with certain expectations ...try to be neutral when going that way the scenes would have more impact ...the acting by all of the cast is amazing and you would be able to see there perspective ...also the bgm and whistle would stay with you.",
    "35": "Even 3 is pushing it. This was so bad I'm beginning to doubt i watched a different movie than what everyone else is describing. What a downgrade from kabir singh. They wasted so much time on random stuff, more than 3 hours and here i am asking myself every second when will the \"story\" kick in but it feels like they forgot to do that or add depth to the characters; and I'm not a person who looks for a \"purpose\" in every movie that is really not my point when i say there wasn't anything going on i really mean there was nothing. Nothing feels natural, the quirkiness, the edginess, none of it was really delivered.",
    "36": "Interesting scenes:\n1. Monkey story from Ranbir says this is not at all a serious movie\n2. It's like human version of Jurassic park\n3. Potrays how a child behave if he lost father's love\n4. Doop of Anil Kapoor scene says importance of Ranbir choosing violence\n5.pre interval gave decent fight sequence which we missed in climax\n6. Movie talks about many points about relationship\n7. Sandeep might not impress with 2md half but concludes wellNegatives:1. Isn't hyping the next scene\n2. Just webseries kind of scenes but we can't hear many of their dialogues even in that theatre sound\n3. Mad characters are almost making us mad in theatre for a while.",
    "37": "This movie is made for audience who seeks for action, Background music,Drama &Comedy A 10/10 movie made in this decade specifically in bollywood Special vibes for Marathi audience ✌🏻Who loves to see craziness, limitless love & affection for family this movie is made for you, Majorly enjoyable movie for youngsters, worth they money you'll spentSpecial features\nAction\nDrama\nBackground music\nSongs\nPanjabi vibes\nMarathi vibes\nEmotion for family (not just father)\nIntimacy & loyalty for partnersGo for it don't miss a chance to watch this movie if this genre is your favourite then watch this.Love it.",
    "38": "Don't waste your time. Hopeless movie with too much toxic masculinity! Slapping between couples is glamorized. Total nonsense. Ranbir Kapoor's character is clearly full of toxicity. The movie is low on substance and clearly, all the protagonist wants is validation and goes on a killing spree just to prove it. Clearly, Ranbir Kapoor is mentally sick and all is justified in the name of saving the father. Utter nonsense. I don't know who they are copying - Godfather or scarface or Kill Bill. \"Sadly it's a man's world\", Vijay says to his wife in a scene\", need not say more about the inherent sexism.",
    "39": "Good aspects\n1 originality\n2 action scenes\n3 Ranbirs acting is brilliant\n4 timelines of story portrayed well\nBad aspects\n1 total disrespect for women\n2 rashmika mandana is just for kissing scenes and to listen ranting of the protagonist\n3 portryal of all women is very disturbing\n4 no depth in story\n5 willing extension of disbelief also very difficult bcz they have chosen a genz timeline but the story is based in millenial timeline\n6 there is a particular event in the movie which is unacceptable and unbelievable it depicts that the protagonist cheats on his wife and tries to justify his motives and funny and disturbing thing is that wife doesnt give him divorce everything continues\n7 in movie protagonist wants to protect his father and wants a revenge he just wants to kill people for his father but he listens to his father 0% of the times and he doesn't even think of his kids and wife\n8 it is very disturbing how people are liking it so much.",
    "40": "Not every Friday we get to see a film which has eccentric but very effective writing, terrific direction and a lead actor who acts like there's no tomorrow Animal is one such rare film Apart from editing, every other department gave their best Music and BGM are top notch in Animal. Ranbir Kapoor deserves all the awards next year. Movie met its expectations and now it's time for Animal to break all box office records All time blockbuster GO WATCH IT you will never regret. Ranbir kapoor nailed it man What a movie man. BLOCKBUSTER written all over. No such movie has created or will be created in the future.",
    "41": "First of all, there is no vision in the movie. The movie is 3.5 hours long and does not keep the public engaged during the whole movie.An experience of watching 80% phone screen, 10% the food in front and 10% movie screen.Felt like it would be worth it but totally wasn't. Disappointing Bollywood Direction, Pathetic Dialogue writing and highly ineffective acting and overacting by female actresses.The movie could have been shortened to 2.5 hours but unfortunately, they thought that boring the audience and taking their money by producing such stupid movie was a better idea.Advice - Ignore the paid (positive) reviews and Donot watch it and waste your 4 hours. I did and I can't stop regretting it.",
    "42": "What a WOW! Only Ranbir could have matched the superamacy of Bahubali, style of Pushpa and larger than life character in KGF, all combined in this ANIMAL.Amazing screenplay, direction and choice of supporting characters and music. This was a treat to watch on this weekend snowy day.Only catch is that this movie may be too much with family and might not fly off with that group. Watching with friends and colleagues, this will give you that adrenaline rush on a boring day, but will still leave you full of mixed emotions.And there is a surprising element as well. This will not let the movie impression go away for some while for sure.",
    "43": "I dont think I have felt so disturbed after watching a movie. Prominent figures, especially actors in a country where movies have so much impact on the population, should behave with certain social responsibilities. With absolutely no story, and such ill treatment of people (especially women), there is no scope to appreciate any creative angle. Just naming the movie \"Animal\" does not justify validating the excessive misogyny, elitism and narcissism. Also there is a line to where it gets excessive, but that was crossed way back and you still have to sit through the movie which could have ended at intermission.Hating the fact that this movie is getting a good opening and could have a sequel. *puke*\nI don't understand who are these people rating the movie so highly, or are they trying appease one and other! Someone has to be real psycho to appreciate a movie of this gore or there is scope to buy ratings, they audience will lose faith in ratings.",
    "44": "One of the best movies I have watched in a while. Sandeep Reddy Vanga is a true genius. He challenged status quo like never before. Ranbir and Anil Kapoor gave brilliant performances as well. I am certain that this film will have reconsolidated Ranbir's reputation in the industry as a star. A thorough entertainer and certainly his father's worthy son.Ultimately the secret of the success lay in the direction since it is the director who brings out the best in his actors and Sandeep Reddy Vanga has always been a champion in this field. Even minor characters like Prem Chopra and Tripti Dymrii were amazing in their limited screentime. Great way for Bobby Deol to make a comeback. The scenes and the realistic acting will always be memorable. The film certainly is a reality-check for many (as is evident for those who are unnecessarily unnerved by this masterpiece). Eagerly waiting for the sequel.",
    "45": "Animal starring Ranbir Kapoor,Rashmika & Anil Kapoor is an awful attempt to create a movie like Oldboy(gory action scenes), every scene in the movie is like Godfather & Second half is like Kabir Singh and Arjun Reddy married version.The story is nicely paced in first half with gore action sequences and bloodshed with some sense of vision by the director but in the second half added some unnecessary scenes with half cooked sub plot. Bobby Deol is under used in the film\nCinematography is upto the mark casting is good but All\nthe way its the Ranbir Kapoor show and Anil Kapoor is nowhere in the movie. Rashmika character is strong but i felt under used. There are many loopholes and it makes this film a boring undercooked action saga in the end.BGM and songs are great but the film lacks in heart and soul and some script🙂",
    "46": "What a Movie... The first half is so good... yes it is a little lengthy, but want an awesome movie... Ranbir Kapoor is actually the best actor no doubt, the direction bhai sandeep reddy vanga is now one of my best director want to see what this has to deliver more.There is not much action but one do not have to show the Animal inside you.The father son is nice.. do not miss the interval. The actress is not good at all they would have casted someone better.Bobby deol get very less screen time, but its amazing what he do with it...i will watch it again 100/10 is what i will give..............",
    "47": "This is not a movie but 3 hours of torture. Undoubtedly Ranbir's acting was good but the movie doesn't have a script, and full of illogical sequences and redundant action sequences. Nothing is worth watching. You will go berserk by the intermission and will be left with a heavy head.Totally misogynistic. The female characters don't have any substance and they are just puppet of the so called protagonist of the story. This movie also promotes vandalism, indiscipline and hypocrisy at many levels.They just created hype to earn more in the first week. So many scenes look exactly as Kabir SinghIt isn't worth your hard earned money. Better avoid it.",
    "48": "Words cant describe the inner feeling of anyone. If something happens to someone closer and you love them more than your life, what's your inner feeling? This the movie is exactly the same thing. Interval bang is something else, no army can produce. I haven't watched any movies with Bollywood actors/actresses for the last 5 years. The only reason I watched this movie is because of Sandeep Reddy. But, honestly, this movie is nothing without Ranbir, I think he is the correct fit after all, I can't think of anyone, to be honest (NTR/Surya/NANI/ Mamooty) who can make it work but this story definitely belongs to Ranbir/Shahid) May MAHESH BABU can make it work. Every screen and frame is focused on Ranbir, and I can see why Sandeep chose him after many attempts. I wish Alia Bhatt instead of Rashmika. More creative than Arjun Reddy. Will watch it again. BGM 🙏",
    "49": "Animal is an action crime drama thriller film directed by sandeep reddy vanga.Ranbir kapoor has transformed into an acting powerhouse through this film. He becomes an animal in true sense, his dialogue delivery on par with his rockstar and barfi days. His expressions were on point throughout the film. This was his film and he made it his own. Anil kapoor, plays a distant father very well, emotionally caring but not showing enough. The back and forth between him and his manic son is impressionable. Rashmika mandanna acts good and bad both. She fluctuates a lot with her performance. She starts well, then crashes and finishes well. Quite an on and off performance. Bobby deol in his limited screen times lit up the screen. Saurabh sachdeva too acts well a sidekick.The first half is brilliant. The characters their motives, their personalities are perfectly defined and fleshed out. The action scene before the interval block is outstanding. The choreography and background music and the song 'arjun vailly' is terrific. The marathi song also tonks up the scenes. Ranbir is swift and flexible like a swinging door. But the problem starts in the second half. The recovery time extends beyond limit, and the cheating subplot is unnecessary. Tripti dimri is very good as zoya, but the act of justifying cheating in the name of daddy issues is layman writing. The music is outstanding. Every song is clapworthy. The comedy is also very good.Now, coming to the politics of the film, i agree with some and detest some. The portion about becoming like the man of the family is something i will agree with. There is nothing wrong about protecting your loved ones, the way could be wrong but the intention will always be right. As I said, the cheating subplot is nonsensical. Some dialogues about periods are also very basic and seem insensitive, could have been better.",
    "50": "The first half would give u kicks of adrenaline ...the second half would be good ...this movie has violence , action along with a good story and character depth that makes action more interesting and would glue u to screens for 3 hours ...go for it ...its the type of movie which would come out as the best in theatres so go for it without thinking much ...Also don't go with certain expectations ...try to be neutral when going that way the scenes would have more impact ...the acting by all of the cast is amazing and you would be able to see there perspective ...also the bgm and whistle would stay with you.",
    "51": "I went into this movie expecting a never seen before story. The story was simple and nothin more than that but Ranbir Kapoor.... God damn man he is the best actor in India right now. He pulled it off with such ease and elevated the movie on another level. It is a well shot movie in my opinion and vanga has made a great movie to showcase the acting skills of such a great talent. The 1st half of the movie is amazing and goes with such smoothness. I felt the movie dip a bit in the second half and that romance angle could've been out to the side. Bobby Deol was a game changer but really underutilized. He should've gotten more screen time and a better backstory. Anil Kapoor as well was amazing and did a great job with his given role. The movie won't bore you at all because Ranbir Kapoor is taking up almost all of the 3 hours in this movie and he makes you wanna sit there and admire his work in each frame. The violence in the movie is gritty but not as much as I expected it to be. But overall, a good movie with great acting and also, do not take your kids. You will regret it.",
    "52": "This movie felt like a disjointed mess with a plot that went nowhere. The characters were one-dimensional, and the dialogue was painfully cliche. The cinematography was lackluster, leaving the entire viewing experience underwhelming. It seemed like the filmmakers prioritized flashy visuals over substance, resulting in a shallow and unengaging narrative. The soundtrack was a jarring mix of random tunes that did nothing to enhance the already lackluster atmosphere. Even the supposed emotional moments were so contrived that they failed to evoke any genuine feelings. In the end, it's a movie I wouldn't recommend to my worst enemy. Overall, watching this movie felt like a colossal waste of time.",
    "53": "Went to this movie with a great expectation as I like ranbir, movie was like without story or screenplay. Repeated boring violence like current south violence trend. Ranbir acting was really good along with lord bobby. One of the weekest point in the movie is casting Rashmika, actor with zero acting skill and expression. Bollywood should stop casting this type of actors. Music was good, screenplay was too weak no storyline at all. Ranbir one man show couldn't save this movie. Second half is too boring that you will come out of theatre. Ranbir please stop acting with this south directors and cast you will spoil your career, Awaiting badly for Dunki .",
    "54": "This movie is exact defination of Alpha Male. Ranbir kapoor played so well that I was convinced that he is actually an Animal. Anil Kapoor was good. Shakti kapoor was good. Everyone played their character so well.Sandeep Reddy Vanga did good job in editing and direction. Action is a top notch. Enjoyed it.This movie is exact defination of Alpha Male. Ranbir kapoor played so well that I was convinced that he is actually an Animal. Anil Kapoor was good. Shakti kapoor was good. Everyone played their character so well.Sandeep Reddy Vanga did good job in editing and direction. Action is a top notch. Enjoyed it.",
    "55": "The movie is complete nonsense. Please don't watch it even on gun point. There is complete bloodshed in the movie, useless kissing scenes, unnecessary action, shouting and no story. Songs are the only positives in the movie. This is a simle story of dad and son, which is devastated by forcefully introducing those vulgar action scenes . I went to watch the late night show of this movie after all the hype it created. But sorry to say that you will feel like vomiting after watching the movie. One person is cutting another with an axe and another and other.... and this goes on in the entire movie. No family respect, no emotions, vulgar dialogues and a 3.30 hr complete torture.",
    "56": "\"Animal\" beautifully explores the complexities of the father-son bond, adding emotional depth to its gripping narrative. This exploration of the father-son bond enhances the film's emotional resonance, making \"Animal\" must-watch for those seeking a cinematic experience that combines gripping storytelling and exceptional acting.Ranbir Kapoor takes the film to new heights, delivering a nuanced and powerful performance. Rashmika Mandanna's presence adds a layer of brilliance, showcasing her exceptional acting skills\nThis is entirely new to me; I haven't encountered anything like it before.4.5/5.",
    "57": "Oh this is some film I had mixed feelings about . I mean first half is impeccable and I really didn't like some intimate or extra scenes which director included. The second half was over 20 minutes too long I am sure being director and editor he was having a hard time editing it but he really should have that is the only boring part . He will loose a lot of audience on that part but strangely I am recommending all my friends to watch it and after 10nyears it might be the first movie I'll reqat h again in cinema but that would be mainly due to songs and supporting actors . Ranbir is of course above the rim. The director needs to learn to cut scenes which are not needed . But why 10? Coz directors mistake ain't characters mistake. Bobby deol character was used extensively in trailer mr ranga reddy couldn't do justice to his role rather he spoiled my time in showing useless scenes of female lead in a bra and some other intimate scenes. May be he needs to get laid and get his frustration out I don't want to see same crap if their is a second part. Mr vanga get laid and focus on characters.",
    "58": "This movie gave just headache. Please watch at your own risk. What a load of rubbish, someone acting good can't save a movie without any real storyline and storytelling. It was too long with no real meaningful scenes, no scenes in the movie you would have a satisfaction that you have seen a good scene to remember. Only violence, violence and only violence. Very sorry to see the director thinks he has shown bold scenes but horrible to watch as nothing enhances the movie. Load of rubbish stiched together causing headache at the end. No words to describe the feeling to see they are planning for a sequels.",
    "59": "Perhaps the best movie of 2023 coming from bollywood hands down. A vicious and ferocious movie that delivers very well to those that understand the aim. The actor Ranbir gives a stunning performance very rare to see. The story is captivating and the direction is decent as well. The music, the rhythm of the music in the background scenes are superb. Am I giving this movie to much credit? No, I understand a good movie when I see one and this is a great movie. It gives you anxiety, gets your heart pulsing, and makes you dread what Ranbir will do next. You know when you have have given all your attention to one thing and you cannot focus on anything else. That's what this movie does. I won't spoil the movie or give anything away. Ranbir makes the best movies and he is the best actor in bollywood, no doubt about it.",
    "60": "I walked inside the cinema with a lot of expectations and hope, to be honest their might have been a few flaws in the storyline but one thing it does not miss on is keeping the viewers on their toes every second until the very end to a point where after the movie it took me some time to come back to reality. I am not a big fan of action films but used to love those john wicks anyway, that said I never much enjoyed the Indian action genre with people flying around the room with punches and the hero being faster than the enemy's bullets but that is not the case here, there is a story line that stands its grown more often than not and there are strong emotional scenes that drive the movie to it's climax. Overall it was bang for the buck kind of an experience. Totally recommended.",
    "61": "This movie is garbage. What a mistake to see this. None of it made any sense. Worst movie ever. Will never Ranbir Kapoor movie my whole life. Bakwaas. How did it get a good opening? Thought it would be good because of the good opening this movie had. Rashmika is so overrated. The plot is about a son who loves his dad in the most convoluted way. Such violence and contempt for life is very unusual. Please don't go and see this movie. Not worth your time or money. I just don't get it what was the director producers of this movie we're thinking making this gorie senseless movie. I hope fails big time at box office.",
    "62": "First of all the movie is DRAGGED a lot.. whole plot is confusing and full of sensual scenes to keep the certain class of audience glued to chair. The fact i am so much disappointed is that they used the trailers to show the main villain to hype the movie but in the movie the villain dies like any other ordinary movie of bollywood.. nothing new same old story since since beginning of indian cinema.. from the theme of the trailer i was expecting something Artistic and psychological from this movie but this movie is nothing but same old piece of garbage that bollywood is cooking since its creation..",
    "63": "For me an actor should have sound voice like raj Babbar in Aaj ki Awaz.simple but cruel against criminals or like Amitabh in andha kanoon.ranbir kapoor has a romantic voice which doesn't fit with this type of role.this film has touch of South Indian movie where a hero can kill 50 villains in one bout or can thrash 10 goons.I have seen his other movie tjmm a zero level film given hype by the media.just watch Shakti.no hooliganism,a simple soft movie on father son relationship.both actor were normal in whole film whereas there were murders too.these type of movie suits to sunny Deol or Sanjay Dutt.for me Ranbir should not take these ventures in future.media can hit this movie but movie will not remain in viewers mind even after 15days.",
    "64": "Our Islam is not the way these people have tried to portray Islam. Our Islam is a beautiful and peaceful religion. We respect women very much and treat them with respect. These people always try to defame Islam but our Islam is not like what these people are showing you. So please respect the religionOur Islam is not the way these people have tried to portray Islam. Our Islam is a beautiful and peaceful religion. We respect women very much and treat them with respect. These people always try to defame Islam but our Islam is not like what these people are showing you. So please respect the religion.",
    "65": "It's just an epic flop with no connection and basics of present day relationships. Yet again a good movie is ruined. No storyline, no connection, irrelevant dialogues, pathetic delivery by actors and actresses. I must say Sam Bahadur will always be preferred over Animal because Animal has just shown good advertisement but no force. Haha. I got up before interval, sorry to say but Bobby sir should not have taken this flop. Hypothetical things, no good songs , no thrillers, i mean why this movie was made. Still people are watching it, this shows the mob culture in People. Pl guys think and then try this movie.",
    "66": "I don't generally watch a movie so early after release. But there was an indomitable curiosity about this one. So went for the 11 pm show like a nocturnal Animal. & what I realised is, this film is the sixth hindi version of The Godfather, but in a completely Indian style. And all from Michael Corleone's point of view this time. A character that even Aamir Khan failed to play, none except Govinda made such an impact. But the greatest actor of the Kapoor family did no injustice. He was trying hard to break his traditional romantic image since 2015, this time he succeeds. But what about the movie? Recently the most successful films in India i.e. Jawan, RRR, KGF, Vikram, Pushpa are almost all stories of male dominated violence. The reason for their success is the larger-than-life display of primitive human instincts. In fact, humans are also a type of animals. And Animals can not live without two things. Sex and violence. We socially avoid these things as civilized beings, but love to watch them. The director has triggered exactly both of these. Camouflaged with his familiar male chauvinism. However, unlike Arjun Reddy or Kabir Singh, the heroine in this film is not mute and deaf, but her feminist protest is hard to understand through her unintelligible accent. I could not support the paternalistic support of infidelity. And why the hell did police not come even after killing people like insects? It is as if Akash Ambani can start killing without hesitation if Mukesh Ambani is attacked. There is no such thing as law in the country. The twist in the climax revealed that the sequel is going to be Ranbir vs Ranbir like Brahmastra.So is the movie that bad? Not really. Because there are some good things too. One of those is Bobby Deol, whose violent behavior resumes the film's downward momentum after half-time. And the biggest USP of this film is the interval action sequence. This scene is one of the best action scenes in Indian cinema. Adrenaline will go up to the head if you see it in theatre. But there is something better than that too. That is Loyalty for parents. Many boys will become paternal devotees after seeing this picture. Yes, but I don't know if the boy working in Bangalore or Gurgaon who is living with his wife and children will change by heart, but the boys like me who can't live without their parents, will definitely get tears in their eyes when they will hear the song saari duniya jalaa denge.",
    "67": "The movie has a worst editing and storyline was mediocre. The scenes lost there context and start randomly. The only face saver was Ranbir acting. Even anil Kapoor seems to be overacting.The movie is below average and awfully long. The story could have been told in 2 hours. Some scene s were very long and sitting through them felt like agony. Action was unnecessary and fight sequences seemed like filler sequences. Also action gun fights all seemed like fantasy action..there was no realism. Finally dont go to watch it with your teenage kids. The movie is bad and doesn't deserve your money and time. If you still want to waste your time. Wait for it to come on OTT.",
    "68": "Talking about the review of Animal that the acting ,expression & attitude of every single actor has excellent but when talking about story, screenplay, editing & direction of this movie is totally disappointing the editing was worst it is simply 2hr 20 min movie if the editor of this movie has good in editing The Screenplay was below average the timing of song is not suit the situation & sometime bgm is save the screenplay\nAnd story is different but the execution & direction is very poor for the demanding situation\nOverall the movie is below average\nWatch movie if you are die hard fan of Ranbir Kapoor 😍😍😍..",
    "69": "Villian came 10 min before and died just like that bobby deol did not even kill 2 or 5 people but ranvir killed 400 or 500 people but because he is hero than 😅\nHe says he an alpha and he will never betray but have affairs even when he has kids\nAnd the female actor can't even speak the dialogues 😅\nI think for a climatic experience movie was good but from society and your own moral view you cannot accept some scenes from this movie\nRanvir acting was nice ,but Bobby deol only came for a cameo that's it his character should be written again and then at least he will fight the hero properly\nNot so great movie just ok ok and very nice in action category\nBut the second half is, no action just drama and that's it.",
    "70": "Even though the length of the movie is long, It is the most engaging bollywood movie in recent times .There is not a single dull moment. The action,story everything is awesome. I saw lot of reviews that the 2nd half is not good compared to 1st. But it is not true at all . It must be because the 1st half set the bar so high that, their expectation increased a little. You can say the 2nd half is equally good compared with the 1st half. And all songs are situational and no lip sync , that is also pretty good. At last i want to say , It is a classy bollywood movie which needs to enjoyed ,cheered and celebrated. Best movie I watched in recent time.",
    "71": "It is not what they showed ous in trailers it was too much boring the film is around 3 hour 30 minutes long and you will regret wasting that time . And who has written those dilogues they are pathetic just pathetic when ever they are silent it looks good . You know what this film should be called MALARKEY. It was so disappointing and as always VFX is just bad. The problem is not that there are too many dilogues but the problem it that dilogues are boring. In house of the dragon there are also dilogues but they are engaging dilogues should be like that only . And maybe for what you are going for the film there won't be it.",
    "72": "The negativity in the movie isn't problematic the most problematic thing is these kind of negativity (adultery,violence, disrespecting women, violence of law and order etc) being glorified, being portrayed by the protagonist. Simple question: Would you prefer a husband who is a psychopath and has an extramarital affair and later on becomes a father like this? If youth is comfortable with this movie then it shows their loose mentality and it tends to degraded and worse face of coming generations. But i think the best movie of the year goes to 12th Fail❤ It just showcases the reality. Movies like animal are far from reality and idk ppl get wrong ideas and they start implementing it.",
    "73": "I generally like all movies but this is the first time I walked out of the theater when seeing a movie. It was so bad.the hero is shown to be a hooligan ,a villain himself ,how do you root for someone so foul and conceited .Ranbir Kapoor has acted phenomenally to incite such dislike but I am someone who likes to root for the good guy and cannot stand gratification of hooliganism like this and male chauvinism at its worst. I have seen many many Indian movies with a lot of violence and liked all of them but the hero is always someone you can root for. My wife hated it too but watched the whole thing,she did say there was mindless violence and now is so upset she wants to cancel our AMC passes. I sat in my car for half the movie and just waited but it was better than seeing that mindless drivel ,I will never see a movie by that director again Vanga ,luckily I did not see Kabir Singh as I read the plot and I was not interested but I will never trust this director again.",
    "74": "If you are 18+ , an Adult who knows the Adultery of Film-Making then this movie is an must watch for you. If you want to watch an Movie with Both emotions and Action as well as an Once in a lifetime Son and Dad Love story...Then this is an amazing time to watch one reach your nearest Theatres and experience this Journey of RanVijay Singh Balbir....🔥🦁\nRanbir Kapoor Shines again with his magnificent and on the edge performance.Anil Kapoor is also an shiny star of the journey. Next to Lord Bobby...Even he is mute,he is the best in all.*If you have an soft heart and finds an propaganda in everything then this movie is not for you...\nEither those who don't come under this * category then this movie will be an once in an life time experience for you all matured people...",
    "75": "Animal , This movie is a modern Mahabarath a family rivalry. Stroy, Sandeep just nailed it and made the best master piece of his career,son's love for his father, relationship bonding with siblings, his love for sisters, wife and family. Ranbeer is as always the best at his acting career , he just gave an animal out of him to the audience. Bobby is the next one who gave his best , Anil as usual he is our Mr India at acting... Music is ok and short love story... I am sure you will enjoy the movie... the best part of the movie is parenthood which directly reflects on the mental behaviour of kids..",
    "76": "This movie is really one of a kind in terms storytelling as well as the action and character development. Really liked this movie because there is no sugar coating and everything is as it should be. Ranbir portrays the darkness that people have within them very well and this just showcases what a person can be capable of if he really puts his mind and soul to it. Talking about the characters Ranbir Kapoor and Rashmika Mandana nailed it. Anil Kapoor and all the other actors did a fantastic job. The direction is next level and it really brings the movie to life. From the start to end this movie has kept me glued to my seat. The movie is a blockbuster and I personally would like to watch this masterpiece again. Really brilliant movie by Sandeep Reddy Vanga no more words to describe it.",
    "77": "Animal film starring Ranbir Kapoor, is an absolute cinematic triumph that captivates audiences with its gripping narrative and stellar performances. Kapoor's portrayal of his character adds depth and authenticity to the story, showcasing his versatility as an actor. The film seamlessly weaves together elements of drama, suspense, and emotion, keeping viewers on the edge of their seats from start to finish.The cinematography is breathtaking, with each frame meticulously crafted to enhance the perfect movie that I have been waiting for part 2 this is really wonderful movies the superb movie scenes...",
    "78": "Everything is phenomenal about the movie but in a scene, they showed cheating too much that it destroys the logic. The way they showed the romance in the first half the cheating feels really really bad. Although, it was a part of a plan, it could have been minimised. That would have reduced the length. There was a scene where I felt they could have used the song more than dialogues. Overall if these film would have removed or change the scenes mentioned above and showed bobby more it would been a lot better. Overall, it could have been a masterpiece.Tips: Don't watch if you are a feminist. Don't watch with your parents.",
    "79": "Despite a great line of actors involved, this movie fails to deliver. Such movies should be banned as they not only promote the wrong behavior (because of course many people may feel if Ranbir Kapoor is doing this it's probably cool and then why can't I?) but also spoil all the progress we've made as a country in uplifting women. Agreed that there are such bad characters in the society but promoting that by making a 10x worse version of it in a movie with famous celebrities is never a good idea. The movie just feels pointless without any good message or experience to take away from. Throughout its length, the only thought was why did I pay for this and is there any point in continuing to watch this craziness!",
    "80": "What a movie mindblowing. Ranbir kapoor is one of the best actor. And one of the best movie 2023s.. and what a violence. Ranbir kapoor and boby deol face of scene outstanding.. and sandeep reddy vanga one of the best and talented actor., and also ranvir kapoor and rashmika pair superb.. and also ranvir kapoor and anil kapoor what a performance.. fast to last you never bore. And climax scene and post credit scene different level.. and every actor act well performed.. and gun scene one of the best.. and action scene is very very brutal. This movie also crose 1000 crore in box ofice.. one of the best movie 2023.",
    "81": "The undertones that are present are to show the characters nature, it wasn't like it was met with a good end, his wife left in the end. In his self destructive nature it wasnt only his wife that he lost. I'm the same misogyny that was shown against his wife the exact opposite was shown with his sister in the start of the movie. It is this contrast that builds his self destructive character that would do anything for his father due to the lack of time he had and has at the end of the movie. Simplifying the movie to male ego does the character and the plot injustice. Even for bobby deol it was shown his wife's hated him. In his path he destroyed everything for his father which ironically met with him not having enough time with him also due to his cancer. If anything the movie shows that his misogyny made his wife leave him but his sister liked him as he wasn't the same with her. The character arc Sandeep reddy vanga went for is that you hate the character and still like him.Truly incredible movie.",
    "82": "Review of \"AnimalThe film revolves around a tale of vengeance.It's steeped in emotional intensity.The narrative is marked by its intensity and volume.Central to the plot is a complex Father-Son relationship and their conflict.The protagonist adopts a 'survival of the fittest' approach.He challenges the norms of a civilized society.The lead character's moral judgment appears compromised.The movie features considerable violence.There is a significant presence of explicit content.Engaging and captivating until the final moments.It avoids falling into monotony.Overall, a compelling film.The message is delivered with force and clarity.",
    "83": "Animal is a film where the director's presence is always felt on the screen, like a Hirani or Imtiaz has a mark on their work, Vanga is about strong impulses, snappy dialogues, and unflinching honesty. For Vanga diplomatic politeness is the actual red flag that is the root cause of our shallowness in human relationships. You can't not think of Kabir Singh how the protagonist is so good academically, physically, financially that he occupies his territory as an unflinching force and you can feel in your bones if you've touched the flesh of life that some of it is desperately needed in the world.",
    "84": "This is surely one of the best movies that bollywood has produced in the last 10 years in terms of entertainment. All things from storyline to music and from action scenes to quality of acting are brilliantly planned and executed. Even though the running time of the movie is almost 3.5 hours you actually don't feel its length.RK has really nailed it this time. This performance can be surely counted as one of his very best in terms of quality of acting. As much as I want to say the same thing for Rashmika, the element of common sense is simply not allowing me. Firstly, the quality of acting displayed by her is disappointing compared to her previous performances. And further I am still not able to understand why someone like her accepted the movie after reading the script.(may be due to RK). The character she plays feels like a clown in the movie.The adult scenes in the movie were forcefully forced into the script and felt very unnatural. The first half of the movie is the most striking and impressive aspect, but sadly it starts to lose momentum every minute in the second half. Unnecessary and untimely placement of songs further declines the experience. The movie deviates from its original plot & theme several times which can be frustrating. Another frustrating part is that several dialogues in English and punjabi language are said so fast that 90% of audience fails to digest them. Lack of twists and turns makes it boring at times. Boby deols screen time is not more than 25 minutes, and that too without a single dialouge, which is again disappointing and surprising because the trailer of the movie makes him look like one of the leads.But all things said, we cannot deny the fact that it is something very fresh and unique, which the audience will love. One of the most aesthetically appealing & enjoyable movie from Bollywood in long time. The message it delivers between a father and son is very beautiful and climax makes up for all the faults it has.Purely a theatre movie will not be that satisfying if witnessed on mobile or laptop.",
    "85": "\"Animal,\" directed by Sandeep Reddy Vanga, offers a captivating experience with impressive background music, memorable songs, and technical finesse. However, the film stumbles in terms of story strength and screenplay execution, featuring temporal shifts that lack coherence and fail to enhance the narrative.While the first half engages with its fast pace, the second half unnecessarily prolongs the story, leaving the film feeling overly lengthy and lacking character development, especially with Ranbir Kapoor's character. His abrupt temporal shifts lack clear reasoning, contributing to a disjointed narrative.Despite a touching emotional scene between Anil Kapoor and Ranbir Kapoor towards the end, it arrives too late, leaving the audience fatigued and eager for closure. The credit scenes, though appealing, add to the film's unnecessary length.Ranbir Kapoor's character, portrayed as a hero, raises concerns due to his criminal actions, lack of respect for others, blatant misogyny, and attitude problems. The film's attempt to celebrate such a character is problematic, as it glorifies a man-child who in reality needs therapy.Actress Rashmika Mandanna's performance is very poor, making her unfit for the role. She was struggling to deliver convincing dialogue and lacked depth in her portrayal.It's disheartening to witness Bollywood failing with films like \"Animal.\" The industry has the potential for impactful cinema but seems to fall for subpar narratives. They should strive for better storytelling and more nuanced character portrayals and should avoid the pitfalls of glorifying problematic characters for the sake of entertainment.",
    "86": "Complete garbage, glorifies school shooting, objectifying women, toxic realtionships, unstable personalities, degrading of mental health professionals.Any sensible person can not give this movie a great review, really please get a mental evaluation if you like the movie.How is a young student going with gun and shooting in college a glorifies thing now, when a whole country is suffering from such an endemic situation (US)?How is being toxic in a relationship and using sex as solution a glorified situation?How is the concept of alpha and idiots joining up for pride of family committing crime a glorifies situation?Beyond all these, massive, gigantic, colossal holes in plots and poorly developed characters. Honestly, the kind of garbage sometimes Bollywood produces is amazing, knowing that they have produced amazing works in similar vein like Gangs of wasseypur etc.... not even in same zip code these movies if they are trying to capture violence between two family and emotions for revenge...",
    "87": "Animal- The craziest and the most badass Indian movie that will ever be experienced by the audience on the screen so far since 110 years. Definitely falls under \"The Cult\" category.The boldest director Sandeep Vanga Reddy takes us through the journey of a Son's possessiveness towards his Dad to the volcanic extreme, that he is just replacing love with vengeance, peace with war, gentleness with rage and saneness with madness.Most of the scenes are original and never seen before.Ranbir Kapoor stuns you with the most complex character, and your jaw will be dropped with shock and awe for his mind boggling acting along with various emotions stampede. He just tears open the cinema screen with his brilliance and ease, as he transforms from a raging teenager to animal man, and there is no stopping even with a meteor.This marks him as the best actor of Indian cinema with a launchpad to reach the elites.Having to match him is no easy feat but Rashmika Mandanna does it elegantly with stubbornness and guts.Anil Kapoor is a class apart with his stature and maturity.Bobby Deol is back with a bang. He delivers his career best performance although his screen presence is very short (a bit disappointing).The story is uniquely presented with full heart and woven really well with astounding screenplay and terrific music.Strictly for 18+ years. The alpha man kicks in, with no good social message. Pure violence, rampage and massacre in parts.Wish some uncomfortable scenes were edited, and also movie duration trimmed (first part of second half) as its 3 hours 22 mins long.Animal movie cracks open the movie industry with the boldness and crookedness, and roars loud.Watch at your own risk!",
    "88": "Ranbir Kapoor's introduction as a \"superstar\" in the film initially raised skepticism for me. However, as I reached the halfway point, it became evident that he truly deserved the title.Sandeep Reddy Vanga's promise to showcase genuine violence in cinema was effectively fulfilled. In an era dominated by high-budget action films and contrived flashbacks, Vanga dared to create a world where everything is heightened to the maximum, making the violence seem normal and the behavior even more unsettling. One particularly striking scene involves Ranbir, who, after discovering a mole, compels the individual to lick his shoe as a bizarre demonstration of love. It's a level of intensity reminiscent of something Quentin Tarantino might appreciate.Addressing the question of logic, it's acknowledged that the film, like many others, is inherently illogical. Drawing parallels with films like Vikram, KGF, and Bahubali, it's recognized that crafting a movie with absolute logical coherence is a formidable challenge.However, the film does have its drawbacks. The character arcs of certain individuals, such as the mother, sister, and villain, felt underdeveloped. The hero's revenge arc could have benefited from more nuanced writing, and Rashmika's character, while an improvement from Vanga's previous works, still warranted additional depth.In summary, while I wouldn't classify it as a masterpiece, the film has its merits, particularly in exploring the dynamics of father-son and husband-wife relationships alongside the intense action sequences. It's a unique cinematic experience that some may appreciate for its visceral yet somewhat polarizing elements.",
    "89": "Simply put it's a masterpiece !The Director literally put his heart in this one, the complex relationship of Father and Son explained in a such a manner. I don't feel anyone ever dared to take such a step in Indian cinema. I literally enjoyed every minute of the movie it felt so realistic at times. Ranbir finally gave a great performance after Sanju!I mean just look at the facts Sandeep made 200+mins movie which means fewer shows plus he made it adult for it to be raw and as real as possible both these things require guts everyone told me to cut the movie down and make it U/A but I am so glad he didn't.Indian cinema these days have become very typical, like at times being a movie lover I find it difficult to understand that why are our writers and directors not being creative or trying something new/ different/ interesting.But finally we are seeing creative movies and trust me the background score, Acting, music, costumes everything was just wow !And I know there will be people who might find this movie too bold, too strong, lengthy and violent. I don't oppose to such things I just feel we should appreciate that atleast someone tried to break the status quo and make such a bold movie.",
    "90": "As a fan of gore and dark noir went with loads of expectations- first half was off to a near flawless flight but then the tailspin which began post-interval took down the whole movie.Excellent BGM, magnificient cinematography and out of the world acting by Ranbir (what a brilliant actor he is!) fell short to save the movie ridden with lack of depth and emotion in the storyline. The loosely written plotlines and characters severely dilapitated Ranbir's character as well because the other characters were so underdeveloped. Lack of motive in even the central character resulted in a lack of conviction in the whole story to such a level that after taking in so much of grandly choreographed violence, one is left scratching head wondering everything happened for what exactly! Emotion got translated i nto only one sided shouting and the viewer is left alone to experience an exhausting and frantic TV debate show where only the TV anchor gets to shout.Severe formula plotpoints and scenes , some of which are inspired from Godfather,OldBoy(2003), The man from Nowhere (2010) Rajneeti and even Kabir Singh were put together in such a way that one is left doubting whether the director wanted to copy from his own previous success just because it worked earlier. But it didn't result in anything like Kabir Singh because everything was so incoherent. The brilliant opening of the movie, by the director's own obcession of using pointless violence (or might be a desperate attempt to cover up the flaws in storyline) got reduced into one and only point- who can shout the loudest! Or thats what a predatory animal is supposed to do- a non-human who shouldn't be part of humane society but gets occassionally breaded by our society. It emanates an excruciatingly agonizing world around it; unable to love, empathize, dialogue & sense of integrity but is just filled with suffocating anger & treachery.",
    "91": "What a disastrous movie, this movie isn't suited for our Indian culture and traditions! Extreme and exceeded adult content with bed and lots of lip lock scenes, also filled with lust and double meaning dialogues.! These kind of movies affect the youth and masses a lot and leads to commit crimes, i feel shame for having this kind of psycho directors in my telugu state, who don't respect our culture and never think of the youth and effect of these kind of movies on the society..He has done his film course in Australia as he told in a show but, he shouldn't rub his insanity on our people! He might fit for foreign movies but not for Indian cinema, i don't know how the sensor board allowed such nasty and vulgar scenes with offensive dialogues!? May be they bribed them, anything can possible in India with money thats our fate..I felt ashamed while watching alone whenever the lead characters think of sex and starts a conversation and do so, as two unknown young girls were sat next to me in theatre.. Many couples and youngsters has come to watch the movie may be by thinking that this is an action and drama movie, you can't watch this movie with your any family member..Now a days some of the directors are going beyond the limits for the attention of the youth and masses to make money by leaving the ethics and values.. If there were no adult content and unnecessary scenes and kisses, this movie would have been a blockbuster..!Don't spoil the young, future generations and also our culture, traditions for the sake of money...",
    "92": "Acting, cinematography, violence, rawness, brutality everything is fine....But the story logic doesn't work for me at all....What's the point of the movie that the director wanted to make!!!??Why would a son have so much love for his father for whom he can destroy the entire world but his father treats him with no care, doesn't give any time....yet for him he is the best father in the world.....not possible in reality....And it's too much hero-oriented film..... everything happens with no reason but bcoz hero wants it.....you don't have any connection with your kins for 20 years and all of a sudden ranbir went to ask for help to them as bodyguards and they agree giving up all their jobs... isn't that ridiculous....I can't connect with the attitude and point director tried to make with the movie.",
    "93": "3+ hour's of worthless screen time with unhealthy fatherly obsession.These mainstream actors can neither speak english nor their mother tongue properly.Hindi bhi inhe foreign accent ke sath bolni hai.Everyone sounds so fake.Why try to copy western aspects of living and integrate them with such a horribly written classic indian plot.Main character is egoistic & irritatingly creepy with poor development.Concepts like beating of a child by his teacher, who's apparently supposed to be the son of the most powerful businessman, is portrayed as if he's enrolled in a local government school.Revenge of sister's ragging is south cinema like, dialogues like atmanirbhar bhaarat feels like a promotion, weird songs with every (unrealistic)battle scene, not to forget the final fight\nfollowed by the ultimate father son confrontation.... everything is cringe from start to finish.",
    "94": "Animal,\" the latest creation from director Sandeep Reddy Vanga, plunges audiences into a raw and unapologetic exploration of crime and redemption.This 3-hour and 30-minute cinematic journey is not for the faint of heart, boasting intense storytelling, unsettling violence, and a standout performance by Ranbir Kapoor.In the vein of Vanga's previous work in \"Kabir Singh,\" \"Animal\" fearlessly delves into the darker facets of human nature. The narrative is uncompromising, offering a brutal look at the consequences of choices, all set against a backdrop of morally ambiguous characters.Ranbir Kapoor, in a departure from his typical roles, embraces the challenge of portraying a truly unlikable character. Kapoor's brilliance lies in making you despise his character while simultaneously acknowledging the complexity and depth of his portrayal. It's a performance that's off-putting yet undeniably captivating, showcasing Kapoor's versatility as an actor.The film's soundtrack, hauntingly beautiful, adds an eerie layer to the story. It doesn't seek to comfort; instead, it amplifies the discomfort, enhancing the overall sense of unease that permeates the narrative. This bold musical choice pays off, leaving a lasting impression on the viewer.Cinematographer Amit Roy deserves commendation for capturing the raw essence of every moment. The violence, though off-putting for some, is portrayed with an unflinching gaze, adding authenticity to the narrative. Roy's work elevates the visual storytelling, making each frame a powerful and evocative piece of art.Now, addressing the elephant in the room - the unlikable protagonist and the unapologetic violence may not resonate with everyone. \"Animal\" challenges conventional notions of a likable lead, and Kapoor's character is intentionally crafted to be morally ambiguous. If you're looking for a conventional hero, you won't find one here.In conclusion, \"Animal\" is a cinematic plunge into the abyss, unapologetically brutal and anchored by a stellar yet unlikable performance from Ranbir Kapoor. While the violence may be a deterrent for some, and Kapoor's character a tough pill to swallow, for those willing to embrace the darkness, \"Animal\" offers a thought-provoking and unforgettable experience. It's not a film for everyone, but for those seeking cinematic boldness and depth, \"Animal\" delivers in spades.",
    "95": "Everyone told me that the action is great!I watched the movie and I was just sitting waiting for the actions.Actions may have been mounted to extra and bloody, but that movie is annoying.It's plain boring. There's no story, just a stubborn guy who has a mental problem roaming around doing what he wants. And turns out that guy is the protagonist of the film.It is so weird how people are celebrating such madness. Some people are actually laughing to nonsense jokes in the movie.Turns out not all people like it. Tons of people hate the movie too.Waste of time. Forget about whether things are toxic or not, the movie is pure boredomness.",
    "96": "In the first half, Vanga is in complete control. We get a quick tour of rural Punjab, which is just an excuse for a dozen burly 'puttars' to jump in: more boys, more toys, more risible jokes featuring the male nether regions. A kinetic sequence featuring a gigantic bazooka, and Ranbir Kapoor pumping hundreds of bullets into hundreds of bodies is the kind of gleeful comic-book action which is fun while it lasts. But then comes the endless second half in which everything is thrown at the kitchen sink in the hope something sticks. In the end, there's nothing to this pointless, vile tale: if I have to, I'd rather watch real animals.Arjun Reddy and Kabir Singh helmer Sandeep Reddy Vanga had said that he will teach Bollywood how to make a violent movie with Animal and trust me what he said, he delivered that without an ounce of doubt. On the whole, Animal is an adrenaline experience which will have polarising views but you can't deny its entertaining quotient, breathtaking performances and storytelling.Watch Animal for Ranbir Kapoor. He doesn't let you down in even one frame. If you are a hard-core action movie fan, Animal has enough and more to keep you hooked to the screen. The story is engaging and though, long, the performances and the novelty in Ranbir and Bobby's characters make it worthwhile.",
    "97": "Few films manage to leave an indelible mark as profoundly as Animal has done. Coming from Vanga, this film not only redefines the boundaries of storytelling but also serves as a testament to his unparalleled craft in making dark movies.Ranbir unlocks a new personality in this one w as an onscreen animal, known for his ability to dissolve into his characters, outdoes himself in this role. His portrayal of a complex and layered individual, is both haunting and deeply moving. RK's ability to convey a spectrum of emotions, from vulnerability to intensity, is a masterclass in acting. It's a performance that resonates long after the credits roll.The director's vision for \"Animal\" is executed with such finesse that each scene feels like a carefully crafted masterpiece. The narrative is gripping, blending elements of drama, emotion, and suspense in a manner that is both seamless and impactful. The director's unique storytelling style, combined with an eye for detail, elevates the film to a level that is rare in contemporary cinema.Moreover, the cinematography and the score are in perfect harmony with the film's tone, enhancing the emotional depth of the story. The visual aesthetics are stunning, capturing the essence of the film's theme and setting with remarkable clarity.In conclusion, this movie not only showcases the extraordinary talent of Ranbir Kapoor but also highlights the director's exceptional ability to create a cinematic experience that is both thought-provoking and emotionally stirring. It's a film that deserves all the accolades it receives and is a must-watch for anyone who appreciates the art of film-making at its finest.",
    "98": "Few things works in this movie and many doesnt.Animal is a good mix of emotions but explained badly. Performances of each actor is quite nice, Ranbir is outstanding Anil kapoor is amazing and Bobby could have steal the show but editing is weakest part of the movie, sub plots are not explained properly and villian Bobby deol is never shown enough on screen.What went well:\nVery good performances, Ranbir worked like charmRashmika fresh addition to bollywoodbackground score is goodWhat didn't went well\nAnil kapoor and bobby deol roles are small. Main villian comes in 4th of movie and that too only for 5-7 mins total. Anil kapoor should have more dialogue and scenes.Editing of movie is weak. This could have been smaller movie with better impact. But it feels dragged at many places.Love story part is badly portrayed, makes no sense.Father son emotional story needs father son scenes in movie to show or explain their bond. Last 5 mins are greater than whole movie.-overall i can't recommend this movie to any movie lover. This is only for ranbir fans.",
    "99": "As a fan of gore and dark noir went with loads of expectations- first half was off to a near flawless flight but then the tailspin which began post-interval took down the whole movie.Excellent BGM, magnificient cinematography and out of the world acting by Ranbir (what a brilliant actor he is!) fell short to save the movie ridden with lack of depth and emotion in the storyline. The loosely written plotlines and characters severely dilapitated Ranbir's character as well because the other characters were so underdeveloped. Lack of motive in even the central character resulted in a lack of conviction in the whole story to such a level that after taking in so much of grandly choreographed violence, one is left scratching head wondering everything happened for what exactly! Emotion got translated i nto only one sided shouting and the viewer is left alone to experience an exhausting and frantic TV debate show where only the TV anchor gets to shout.Severe formula plotpoints and scenes , some of which are inspired from Godfather,OldBoy(2003), The man from Nowhere (2010) Rajneeti and even Kabir Singh were put together in such a way that one is left doubting whether the director wanted to copy from his own previous success just because it worked earlier. But it didn't result in anything like Kabir Singh because everything was so incoherent. The brilliant opening of the movie, by the director's own obcession of using pointless violence (or might be a desperate attempt to cover up the flaws in storyline) got reduced into one and only point- who can shout the loudest! Or thats what a predatory animal is supposed to do- a non-human who shouldn't be part of humane society but gets occassionally breaded by our society. It emanates an excruciatingly agonizing world around it; unable to love, empathize, dialogue & sense of integrity but is just filled with suffocating anger & treachery.",
    "100": "What a disastrous movie, this movie isn't suited for our Indian culture and traditions! Extreme and exceeded adult content with bed and lots of lip lock scenes, also filled with lust and double meaning dialogues.! These kind of movies affect the youth and masses a lot and leads to commit crimes, i feel shame for having this kind of psycho directors in my telugu state, who don't respect our culture and never think of the youth and effect of these kind of movies on the society..He has done his film course in Australia as he told in a show but, he shouldn't rub his insanity on our people! He might fit for foreign movies but not for Indian cinema, i don't know how the sensor board allowed such nasty and vulgar scenes with offensive dialogues!? May be they bribed them, anything can possible in India with money thats our fate..I felt ashamed while watching alone whenever the lead characters think of sex and starts a conversation and do so, as two unknown young girls were sat next to me in theatre.. Many couples and youngsters has come to watch the movie may be by thinking that this is an action and drama movie, you can't watch this movie with your any family member..Now a days some of the directors are going beyond the limits for the attention of the youth and masses to make money by leaving the ethics and values.. If there were no adult content and unnecessary scenes and kisses, this movie would have been a blockbuster..!Don't spoil the young, future generations and also our culture, traditions for the sake of money...",
    "101": "Acting, cinematography, violence, rawness, brutality everything is fine....But the story logic doesn't work for me at all....What's the point of the movie that the director wanted to make!!!??Why would a son have so much love for his father for whom he can destroy the entire world but his father treats him with no care, doesn't give any time....yet for him he is the best father in the world.....not possible in reality....And it's too much hero-oriented film..... everything happens with no reason but bcoz hero wants it.....you don't have any connection with your kins for 20 years and all of a sudden ranbir went to ask for help to them as bodyguards and they agree giving up all their jobs... isn't that ridiculous....I can't connect with the attitude and point director tried to make with the movie.",
    "102": "3+ hour's of worthless screen time with unhealthy fatherly obsession.These mainstream actors can neither speak english nor their mother tongue properly.Hindi bhi inhe foreign accent ke sath bolni hai.Everyone sounds so fake.Why try to copy western aspects of living and integrate them with such a horribly written classic indian plot.Main character is egoistic & irritatingly creepy with poor development.Concepts like beating of a child by his teacher, who's apparently supposed to be the son of the most powerful businessman, is portrayed as if he's enrolled in a local government school.Revenge of sister's ragging is south cinema like, dialogues like atmanirbhar bhaarat feels like a promotion, weird songs with every (unrealistic)battle scene, not to forget the final fight\nfollowed by the ultimate father son confrontation.... everything is cringe from start to finish.",
    "103": "Animal,\" the latest creation from director Sandeep Reddy Vanga, plunges audiences into a raw and unapologetic exploration of crime and redemption.This 3-hour and 30-minute cinematic journey is not for the faint of heart, boasting intense storytelling, unsettling violence, and a standout performance by Ranbir Kapoor.In the vein of Vanga's previous work in \"Kabir Singh,\" \"Animal\" fearlessly delves into the darker facets of human nature. The narrative is uncompromising, offering a brutal look at the consequences of choices, all set against a backdrop of morally ambiguous characters.Ranbir Kapoor, in a departure from his typical roles, embraces the challenge of portraying a truly unlikable character. Kapoor's brilliance lies in making you despise his character while simultaneously acknowledging the complexity and depth of his portrayal. It's a performance that's off-putting yet undeniably captivating, showcasing Kapoor's versatility as an actor.The film's soundtrack, hauntingly beautiful, adds an eerie layer to the story. It doesn't seek to comfort; instead, it amplifies the discomfort, enhancing the overall sense of unease that permeates the narrative. This bold musical choice pays off, leaving a lasting impression on the viewer.Cinematographer Amit Roy deserves commendation for capturing the raw essence of every moment. The violence, though off-putting for some, is portrayed with an unflinching gaze, adding authenticity to the narrative. Roy's work elevates the visual storytelling, making each frame a powerful and evocative piece of art.Now, addressing the elephant in the room - the unlikable protagonist and the unapologetic violence may not resonate with everyone. \"Animal\" challenges conventional notions of a likable lead, and Kapoor's character is intentionally crafted to be morally ambiguous. If you're looking for a conventional hero, you won't find one here.In conclusion, \"Animal\" is a cinematic plunge into the abyss, unapologetically brutal and anchored by a stellar yet unlikable performance from Ranbir Kapoor. While the violence may be a deterrent for some, and Kapoor's character a tough pill to swallow, for those willing to embrace the darkness, \"Animal\" offers a thought-provoking and unforgettable experience. It's not a film for everyone, but for those seeking cinematic boldness and depth, \"Animal\" delivers in spades.",
    "104": "Everyone told me that the action is great!I watched the movie and I was just sitting waiting for the actions.Actions may have been mounted to extra and bloody, but that movie is annoying.It's plain boring. There's no story, just a stubborn guy who has a mental problem roaming around doing what he wants. And turns out that guy is the protagonist of the film.It is so weird how people are celebrating such madness. Some people are actually laughing to nonsense jokes in the movie.Turns out not all people like it. Tons of people hate the movie too.Waste of time. Forget about whether things are toxic or not, the movie is pure boredomness.",
    "105": "In the first half, Vanga is in complete control. We get a quick tour of rural Punjab, which is just an excuse for a dozen burly 'puttars' to jump in: more boys, more toys, more risible jokes featuring the male nether regions. A kinetic sequence featuring a gigantic bazooka, and Ranbir Kapoor pumping hundreds of bullets into hundreds of bodies is the kind of gleeful comic-book action which is fun while it lasts. But then comes the endless second half in which everything is thrown at the kitchen sink in the hope something sticks. In the end, there's nothing to this pointless, vile tale: if I have to, I'd rather watch real animals.Arjun Reddy and Kabir Singh helmer Sandeep Reddy Vanga had said that he will teach Bollywood how to make a violent movie with Animal and trust me what he said, he delivered that without an ounce of doubt. On the whole, Animal is an adrenaline experience which will have polarising views but you can't deny its entertaining quotient, breathtaking performances and storytelling.Watch Animal for Ranbir Kapoor. He doesn't let you down in even one frame. If you are a hard-core action movie fan, Animal has enough and more to keep you hooked to the screen. The story is engaging and though, long, the performances and the novelty in Ranbir and Bobby's characters make it worthwhile.",
    "106": "Few films manage to leave an indelible mark as profoundly as Animal has done. Coming from Vanga, this film not only redefines the boundaries of storytelling but also serves as a testament to his unparalleled craft in making dark movies.Ranbir unlocks a new personality in this one w as an onscreen animal, known for his ability to dissolve into his characters, outdoes himself in this role. His portrayal of a complex and layered individual, is both haunting and deeply moving. RK's ability to convey a spectrum of emotions, from vulnerability to intensity, is a masterclass in acting. It's a performance that resonates long after the credits roll.The director's vision for \"Animal\" is executed with such finesse that each scene feels like a carefully crafted masterpiece. The narrative is gripping, blending elements of drama, emotion, and suspense in a manner that is both seamless and impactful. The director's unique storytelling style, combined with an eye for detail, elevates the film to a level that is rare in contemporary cinema.Moreover, the cinematography and the score are in perfect harmony with the film's tone, enhancing the emotional depth of the story. The visual aesthetics are stunning, capturing the essence of the film's theme and setting with remarkable clarity.In conclusion, this movie not only showcases the extraordinary talent of Ranbir Kapoor but also highlights the director's exceptional ability to create a cinematic experience that is both thought-provoking and emotionally stirring. It's a film that deserves all the accolades it receives and is a must-watch for anyone who appreciates the art of film-making at its finest.",
    "107": "Few things works in this movie and many doesnt.Animal is a good mix of emotions but explained badly. Performances of each actor is quite nice, Ranbir is outstanding Anil kapoor is amazing and Bobby could have steal the show but editing is weakest part of the movie, sub plots are not explained properly and villian Bobby deol is never shown enough on screen.What went well:\nVery good performances, Ranbir worked like charmRashmika fresh addition to bollywoodbackground score is goodWhat didn't went well\nAnil kapoor and bobby deol roles are small. Main villian comes in 4th of movie and that too only for 5-7 mins total. Anil kapoor should have more dialogue and scenes.Editing of movie is weak. This could have been smaller movie with better impact. But it feels dragged at many places.Love story part is badly portrayed, makes no sense.Father son emotional story needs father son scenes in movie to show or explain their bond. Last 5 mins are greater than whole movie.-overall i can't recommend this movie to any movie lover. This is only for ranbir fans.",
    "108": "An Unrivaled Cinematic ExperienceSynopsis: \"Madness\" perfectly encapsulates the synergy between Vanga's direction and Ranbir's stellar performance, making this the standout Indian movie of 2023. Despite its 3:30-hour runtime, the film captivates without a moment of tedium.First Half: The movie swiftly establishes the father-son dynamic, unraveling the layers that transformed Ranbir into a formidable force. The narrative's depth shines through engaging dialogues, becoming the highlight of the film. The Interval block stands out as one of the most compelling sequences I've ever witnessed.Second Half: While the pace momentarily decelerates to portray the repercussions of bloodshed on the protagonist and his family, the film never loses momentum. Every scene propels the narrative forward, although some may initially seem misplaced, ultimately serving as essential building blocks for the impending twist.Musical Integration: Seamlessly woven into the storyline, the songs seamlessly complement the narrative, ensuring they don't disrupt the movie's flow. Ranbir's portrayal reaches a career zenith, with no scene feeling like mere filler.Noteworthy Element: The main character's vulnerability sets this film apart, defying the trope of invincibility. The post-credit scene marks the movie's second peak, a crucial element not to be missed.Final Verdict: For enthusiasts of action, gore, and complex characters, this film is a must-watch. It demands both your time and monetary investment, delivering a cinematic experience that transcends conventional boundaries.",
    "109": "Its hard to define 'Animal' in a particular genre. It's a father son story, it has action elements, romantics ones, its supposed to be mass entertainer but it also has this intelligence and class demanded by the script.Animal's core story is a son seeking his fathers' approval. There is a lot more sub plot apart from this, which elevates it from a simple film to something along the lines of Godfather.Acting:\nRanbir Kapoor is the best nepo kid actor in Bollywood for sure. This is a guy who might have been a superstar even without the Kapoor Lineage. This film has him play a similar dynast and it's a casting match made in heaven. Ranbir and the director takes his character and elevates the whole thing to another level. Ranbir's character Vijay often sprouts American terms since his upbringing has been shown to be in the states. It's a bit similar to Micheal Corleone who is raised up in Italy in the Godfather. Throughout the films various acts Ranbir is beyond rock solid. An acting tour de force. He has surpassed his peers by far.Anil Kapoor is solid and dependable as always. He plays the stoic no nonsense father figure to perfection and does not miss a beat. Overall his character is a bit similar to the one he played in Dil Dhadkne do, so this is not something entirely different than we have seen him play but whatever material he has been given, he does rather well.Rashmika Mandana, for me this actor is an eye sore. Neither is her expressions believable, her dialog delivery is pathetic and its actually difficult to make out what she is mumbling most of the time. The internet's trolling of her dialog delivery in the trailer is fully justified. Even during her introduction scene, she speaks like she has paan in her mouth. She definitely brings down the film, I am very curious to know why she has been cast in the first place! She is definitely the weakest link in this film. Any other actress would have been better than her.Shakti Kapoor has a brief role in the film and is surprisingly solid. His character is not very well defined, but this has to be the most sober role he has done in a while.The Music:\nThe songs make this film whole. Most movies like Jawan for example have good songs, but the songs are not the life of the film, in this the songs define the movie. Each and every song has its place and is there for a reason. Without them the movie doesn't work.The Action:\nThe violence in this film when it gets unleashed is on another level for a Indian film. Only Korean films can match this level of violence. So the A rating is justified. I wish to see the longer director's cut of this film and if that has even more gore and violence.Overall : The start and the end of the film CANNOT be missed. I can understand many missing the start, but how does one miss the ending? Well, most people started to leave when the credits rolled. But like a Marvel film, sit still. The movie doesn't end till the credits are done and then there one more scene. The movie is going in while the credits are rolling so it doesn't get boring. The audience that walked away at the start of the credits, doesn't know what they missed.So donot miss the ending of the film.Rating : 9.5/10. The first half of the film is a 10/10 for me. The interval block is beyond amazing. The second half does drag a bit especially Rashmika's scenes. So over the film is a solid 9.5 for me.",
    "110": "There was, in theory, no cogent plot. There were dialogues everywhere. Characters had strange conversations with one another. As in, each time someone spoke, the other would interrupt with a monologue about something unrelated. (For the most part ranbir).It differs greatly from the teaser. The story is not about a father and son. After the first few scenes, they didn't reveal anything more about their connection.Regarding content, Ranvijay was never able to provide a clear response to a query. He lacked consistency in his character. His behaviour must be constant, even if you create a bad persona. They want to convey the impression that he is insane and uncaring in one moment, but the next he would offer them forgiveness and protection.A film must have a narrative, a plot, and characters that make sense.It is not father son relation movie... Ot is purely a vulgar Movie.",
    "111": "Only if the director had established that he has set a movie where Cops and Media (except cnbc) doesn't exist, he would have justified his bizarre artistic license he rendered in creating this mess of a movie which tries hard to be at the league of Sin City and Kill Bill.Horribly edited with unnecessary scenes included and important links missed out, the movie flows so abruptly that even an amateur editor would laugh at this blunder of a work.Only the action choreographer and the director of photography are worth some applause as they did a great job.While, Ranbir. Kapoor and Bobby Deol gave their 100%, yet the director failed in carving a memorable character persona, primary reason being that the director just couldn't decide whether his protagonist is an out and out a pshyco or a normal guy with anger issues.So, the result is a mix of Michael Corleone and Sharukh Khan's character in Darr. Is Ranbir Kapoor an obsessed lover or an intelligent sane man who secures the legacy of his large-scale business family strategically, the director just doesn't know and he doesn't care and takes the story wherever he wants in a way that makes the audience uncomfortable to relate to the character let alone the situations where he kills hundreds of men in broad daylight with no alert to police and no propaganda by the media.The movie's hype is the larger than life getaway mood for the audience, but the lack of sensibility and bad editing couldn't save the movie and lands it as a forgettable blockbuster.",
    "112": "Directors are taking the indian citizens as granted. Movie shows a load of bad dialogues and lot of insults to women and society. I could not figure out if the movie was shot in India or in Mexico.Movie is about a son who lives his father no matter how much his father hates him. I still am trying my best to figure out what this movie wish to inspire the viewers? I cant understand what this movie was made of. Yes it had some good acting by Lord Bobby and Ranbir but no where this movie is acceptable where all are insulting each other and Ranbir to get the truth of his enemy slept with another girl and just moved on with his wife like nothing happened.No cops or nothing to investigate so many murders. This movie have nothing new to be honest and don't know why a few are saying its the benchmark of Indian movie where according to me the benchmark were Lagaan and Swadesh.This movie only focused on Ranbir Kapoor but very few scenes of Lord Bobby and others as if they were completely non existent.",
    "113": "POOR FILM.BAKWAAS STORY.ALL FAKE AND PURCHASED REVIEWS OF 5 STAR RATINGS\nRIDICULOUS DIRECTION\nONLY SHOUTING, SCREAMING, BLOOD.NO GOOD ACTING\nEXCEPT B PARAK SONG, EVERYTHING IS A PURE WASTE.USE OF ABUSIVE LANGUGAGE, UNNECESSARY SCENES, USELESS MURDERS , WASTE STORYLINE , DISGUSTING CONCEPT AND PATHETIC ACTING ...DONT KNOW WHY AND FOR WHAT THE ACTRESS IS TAKEN ?UNNECESSARILY BODY DOUBLE OF ANIL KAPOORSTRANGELY DOUBLE ROLE OF RANBIR KAPOORVERY CONFUSING WHY ALL SARDAR AND THEIR MARRIED AND YOUNG SONS LIVING IN VILLAGE WILL LISTEN TO A PERSON RANBIR WHO CAME FIRST TIME AFTER 22 YEARS AND GO WITH HIM TO LOOSE THEIR LIFE ???",
    "114": "Seriously I hate to all those people who are hyping this overrated movie over social media there is nothing special in this movie .this should have been a web series but they put into a movies which is very slow ,lengthy and over dramatic action sequence... Where actor is fighting with 200 people and their friends singing in group to cheer him up. So many unnecessary scene has been added with a very lengthy,slow and boring conversations.This movie could have ended in 2 hour but they extended with 3 hours 27 minutes unnecessary one and half hour the added I don't know why what was in their mind it wasn't needed... I was getting really bored boil watching in theatre.I am really pissed that people over social media are hyping these movie don't know why does nothing in this movie I was hoping to end to get the hell out from the theatre I got so much bored... This is first time in my life that I watched a very boring and bad film in the theatre this is the worst experience in my life never had watched this kind of movie in theatre....\nThis will be the only movie which I will regret forever to watch in a theatre....",
    "115": "A son's love for his father pits him against an anonymous assassin with a grudge.Animal is a whopping 3 hours and 22 minutes, and I don't think that includes the interval. The first half of the film is mostly overwrought familial drama and, to be honest, I was quite bored, much of the cultural stuff that seemed to be entertaining the largely Indian audience going way over my head. There weren't even any elaborate song and dance numbers to lighten the mood (I thought musical numbers were mandatory in Bollywood movies).I did, however, perk up when, immediately before the interval, the first action scene occurs, as anti-hero Ranvijay Singh (Ranbir Kapoor) hacks away at countless animal mask wearing enemy henchmen with a pair of axes before mounting a vehicle armed with enormous machine guns and blasting the remaining bad guys into oblivion. If this was an indication of the cartoonish OTT violence to come in the second half, I figured the hard slog of the past 90 minutes would have been worthwhile.Unfortunately, that blistering action scene proves to be the highlight of the whole film: the remainder of the film consists of more drama that seems to be building towards an exciting testosterone-fuelled climax but which culminates in a less than thrilling bout of fisticuffs between Ranvijay and villain Abrar Haque (Bobby Deol).5/10. I might have enjoyed it more if I had understood some of the humour, and, with such a long runtime, I think there should have been much more action, and at least one highly choreographed musical interlude (the song sung by Ranjivay's 'brothers' during the fight scene doesn't count).N. B. I loved the soundtrack, especially the spaghetti western style song Papa Meri Jaan and the haunting Hua Main - in fact, it is possibly the best thing about the film.",
    "116": "Mentally disturbing. No clear story. I would not recommend the movie. Only good thing about the movie is Satranga ishq song and the scene. Rashmika is just for kissing scenes, and facing the animal (heat of the beast). Any other actresses could have performance that role. She could have signed for better role. Ranbir's acting is phenomenal. But theme and story is horrible. Ranbir fights everyone for his father but listens to his advises zero times.Story: 2/10\nActing: 8/10.First half: pointless\nSecond half is dragged for no good reasons.For Bobby Deol, it's great comeback.I would not recommend this movie.",
    "117": "Where do I even begin? This movie has been known to be the most hyped movie of the year alongside other movies like Jawan, Tiger 3, and Pathaan. Ranbir Kapoor never fails to deliver an amazing performance. The movie met all my expectations and I knew walking into the theater that I would love it. The songs and the storyline were amazing! Everything about the movie was carried out so well. The action, the bloodshed, the story, the songs, and the acting of all the actors in the movie was top notch. I do not want to get into spoiling aspect but please trust me when I say that this movie will be amazing. There is a lot of violence, sex references, and somewhat partial nudity so please be careful about who you watch it with. It is rated A (Rated R in North America) so some of you might not want to watch this with your families unless they are okay with these type of movies. Bobby Deol as villain was insane. Rashmika did well in her role and as well Anil Kapoor. It was a long movie but it kept me engaged for the whole 3hrs22minutes. PLEASE DO NOT MISS THE CREDIT SCENE AT THE VERY END BECAUSE IT IS VERY VERY IMPORTANT. I give this movie a solid 10/10 and hats off to Sandeep Reddy Vanga for bringing us another banger movie after Kabir Singh🔥🔥",
    "118": "In the kaleidoscope of cinematic endeavors, this opus unfolds a narrative with commendable substance. While some elements may flirt with the border of realism, their allure remains undeniable. The characters, meticulously crafted, dance eloquently through a screenplay that, despite occasional lulls, orchestrates moments of brilliance. However, it does veer into excessive violence and sex at times, and the duration is overly lengthy.Ranbir Kapoor, a maestro in his role, etches an indelible mark through an amalgamation of impeccable appearance and an unforgettable performance.Anil Kapoor, in the paternal realm, delivers a virtuoso performance, while Bobby Deol, the on-screen sovereign, reigns with a captivating portrayal of the primary antagonist, albeit only in the last 40 minutes.Tripti Dimri is alluring and delivers a commendable performance.Enter Rashmika, the apt embodiment for a character demanding orchestrated disquiet. Yet, her artistry, mirroring her look, face, and voice, ventures into an unintended realm of vexation.Cinematography excels in many scenes but falters in a few. The VFX is also inconsistent, with some shots lacking quality.Locations, sets, props, costumes, makeup - each thread in this visual tapestry is finely woven, except for a few missteps.Songs take the audience on a melodic journey, swaying between highs and lows, while the backdrop symphony stands as a testament to musical prowess.However, editing poses an issue, as the second half is excessively lengthy and occasionally boring.In the directorial realm, Sandeep Reddy Vanga crafts a potent odyssey. An exhortation echoes through the halls:",
    "119": "It was the most non-sensical movie ever made. Playing to the gallery, has nothing good going there. Even Tripti Dimri looks wasted (it takes a lot to make her eye sore and shallow, director has succeeded in doing that).The trailer was built so well, I was really going for it. Acting wise Anil Kapoor takes the cake, ranbir is awesome thats all about it.The movie script was for sure written in upper case, its tonal loud. There's no cops here, its very convenient story (everything happens according to the whims of ranbir kapoor).The movie easily could have been an hour less (or less than 120 minutes) it would have been supremely tight actioner.Yes this movie will make money, as if that's the only thing that matters.Saw Ranbir's Tamasha for the umpteenth time this weekend, he has so much range, versatility. So much going for him, why did he choose such a dumb movie (no matter how big a hit they will shout and tell everyone it is). You are an amazing actor, but you are as good as the work you choose, choose wisely.",
    "120": "Vijay (Ranbir Singh) is obsessed with his father Balbir Singh (Anil Kapoor), going to any extent to win his approval. Other than being extremely obsessed, Vijay is also an alpha male. The privilege he is born with, makes him be all the things he perceives to be the qualities of an alpha male. He goes conquering every he lays his eyes on except his father's approval. When Balbir Singh is attacked, Vijay comes back seeking vengeance and all hell breaks loose. Who attacked Balbir? What is their connection with Balbir's family? Will Vijay ever get tired of devouring his demons, forms rest of the story.Sandeep Reddy Vanga got triggered a lot due to the harsh criticism he received for Kabir Singh from a small section of critics and vowed to make the most violent film, which he succeeds. He didn't say anything about making a good film and that reflects in the second half. For what it's worth, the 1hr 45mins long first half was indeed terrific and Ranbir Kapoor is presented in never seen before avatar (not just Ranbir but any Bollywood hero in general). The non-linear narrative helps and so does the excessive violence. Everything Vanga has cooked up in the first half worked superbly.The second half is where the film stumbled big time as the weak script and barring Ranbir's Vijay, every other character being underwritten, badly pulls down the film. Excessive of everything will become unbearable and that is exactly what happens in the second half. Atleast the first half had hero elevations and gave him a purpose to help connect with the character. But in the second half, the writing undoes everything turning Vijay into this massive jerk than an animal and it is only Ranbir's performance that tries to be the film's savior.Speaking of underwritten roles, it is exactly here where Sandeep Reddy Vanga fails. Everything strictly remains on the surface level, be it the father-son relationship or husband-wife. We are told the reason for the enmity between Balbir's family and that of Abrar Haque (Bobby Deol) but it is never effectively established what their backstory was. It simply settles to bunch of wild nasty men going at each other with unnecessary amount of violence. Even Tripti Dimri's Zoya is so poorly written, the character's action at the crucial point made no sense whatsoever.Coming back to Vijay and Geetanjali's (Rashmika) relationship, it is somewhat an extended version of Arjun-Preeti / Kabir-Preeti though Geetanjali gets to take charge of couple of situations, only to give in. Just having the couple talk about their sex life openly or even fight using sex in the argument alone isn't enough to sell their love story. Anil Kapoor's Balbir sadly gets sidelined in the second half, only to get a proper scene in the end. All of this is what makes the entire second half feel so empty. But, the post credit scene was indeed very good.Overall, Ranbir Kapoor's terrific performance definitely deserved a better second half. I am going with a lenient rating just for that first half, Ranbir Kapoor and the post credit scene.",
    "121": "For the starters I would say that you may love this movie or hate it, but you just can't ignore it in any caseFilm can be divided into four aspects - A) STORYLINE, B) ACTING, C) DIRECTION, and most importantly D) ACTION or VIOLENCE or simply BLOODSHED. Now below are my brief opinions on each of these aspects -A) STORYLINE - it is quite simple and mostly linear with few twists and turns. New is the father son bond that had long not been seen in any cinema. In this movie Mufasa and Simba get separated, but not for long, and what follows their union is mad mad love and madness around it.B) ACTING - acting by the cast makes this simple story very interesting and keeps you engaged for the entire runtime of the movie that is whopping three hours and 23 minutes plus few minutes of post credit scene which you can't simply miss and will leave you in awe. This role has evolved the actor in Ranbir as this one is no romantic and sweet Ranbir one is used to, this one's possessive, angry, masculine, and also, toxic. And he has played his role with absolute finesse. You get to see Rashmika's evolution too, which in latter half will leave you stunned. She has done a great job and looked pretty enough. Rest no one's average, and played their part well. Oh yeah Bobby's in here too, won't say much about him though, let it be a surprise and see it for yourself.C) DIRECTION - Sir, Sandeep Vanga Reddy had been quite upset or probably angry over the criticism his previous movie received, even though it became a box office success. However, this time he learnt the lesson well and guess what, he has responded back to the critics with a film that is even more toxic, masculine, violent and massy than his previous work beyond criticism. His direction is amazing. He has a knack for getting you engrossed from the beginning to the very end with his style of filmmaking that you start believing that you're a part of the events unfolding frame by frame and while sitting in the theatre through astral projection you've been transported into the screen and witness things right before your eyes and around you.D) ACTION/VIOLENCE/BLOODSHED - I've been fan of action and macabre stuff whether in movies or TV shows. But the bloodbath and violence that is present in this movie is unimaginable and unmatchable. This movie has for me taken everything to new bloody heights and raised the bloodied bar high enough. Before interval and nearing to climax and further it's a total RED ALERT. You may need a vomiting bag by the end. Anyway all in all violence is something that you may not like but believe me when it is not on the screen in this movie you will keep eagerly waiting for the blood to flow, muscles to collide, cuss words to be hurled at one another and sharp objects and bullets to cut and penetrate through the fleshes. It will keep the Dracula in you satiated for days.BLOODY GO FOR THIS MENACE CINEMA ASAP !!! AND DON'T MISS THE POST CREDIT SCENE !!!",
    "122": "Animal starring Ranbir Kapoor, is an absolute cinematic delight that captivates audiences with its compelling storyline and stellar performances. Kapoor's portrayal of his character is nothing short of brilliant, showcasing his versatility as an actor. The movie seamlessly weaves together elements of drama, suspense, and emotion, keeping viewers on the edge of their seats throughout.The film's unique take on the animal-human conflict adds a fresh perspective to the narrative, shedding light on the complex dynamics between humans and the natural world. The breathtaking cinematography beautifully captures the scenic landscapes and brings the animal characters to life, creating a visually stunning experience.What truly sets \"Animal\" apart is its powerful message about environmental conservation and the importance of coexistence. The movie doesn't just entertain; it educates and raises awareness about the delicate balance between humans and wildlife. This socially relevant theme is seamlessly integrated into the narrative, making it both entertaining and thought-provoking.",
    "123": "I recently had the unfortunate experience of watching a movie that was not only an abomination in terms of storytelling but also an exercise in excessive runtimes. The film in question was a seemingly endless marathon of nonsensical scenes, pointless dialogue, and a plot that could only be described as an insult to the art of storytelling.First and foremost, the story was so poorly constructed that it left me wondering if the writers had forgotten the basic principles of narrative coherence. The plot meandered aimlessly, lurching from one incoherent subplot to another, with no apparent connection or relevance to the overall story. Characters popped in and out of scenes with no clear motivation or purpose, leaving me perplexed and utterly disengaged from their fates.Furthermore, the individual scenes seemed to serve no function other than to waste precious minutes of my life. I struggled to find any semblance of meaning or significance in the endless stream of dialogue and action. At times, it felt as though the filmmakers were simply throwing ideas at the wall in the hope that something would stick, but alas, nothing did.To add insult to injury, the movie clocked in at an excruciating three-plus hours. Three hours of my life that I will never get back. I found myself checking the time, hoping against hope that the end was nigh, only to discover that I still had another hour of agony to endure. It was a cruel and unusual punishment, and I can only assume that the filmmakers were determined to test the limits of human endurance.The Climax Was So Bad With Silly Fight Scenes With No Point At All. Bobby Deol Has A Very Stupid And Weak Role In This Movie.",
    "124": "Ranbir is a superstar, a father and a celebrity of highest caliber belonging to legendary Kapoor family. What Sandeep Reddy has done to him is bad for his image. Ranbir will look back at this crap years from now and regret this. Kind of vulgarity, violence, misogyny on display here that takes one back to medieval times. Movie's plot is weak and there are plenty of junk in the storyline. Is there any police in the entire world for the worst type of violence that a person can commit without any repercussions? Any there rule of law at all ?The movie drags at snail pace at 3 hours and 25 minutes specially second half is miserably slow. Editing is terrible. Only plus is good background music but that's not enough to salvage poor concept and editing. Although one can remorse that excellent music is such a waste on such psychotic direction. This could have been a masterpiece had 50% of violence and misogyny was edited out or shown in not such crude manner. Particularly degradation of women shown in this movie is shocking to today's age. More so young men in drives are watching this as mainstream and they find this acceptable.Bobby Deol has a very short role. He is like a wannabe hero forcibly acting as a villain. Anil Kapoor is the best actor overall here.. however in a nutshell he's basically portrayed as a failed father.Overall it's disturbing to see men raving about this violent and misogynistic junk. Raises questions on mental health of many and to the director... Mr Sandeep, please calm down.. take chill pill and develop some respect for women.",
    "125": "This is definitely the worst movie that could ever be made. Commendable skills of the director and story writer to make it more and more boring for more than 3 hours with bakwaas unrelated plots !! This is commendable skillset of a different calibre.Worst punishment is to lose sleep and go for a late night show.Its just a massacre after massace no plots. Cheap KGF copy with no story and bakwaas details.Please book a psychiatrist before booking tickets for this movie and thank me later.Acting, direction, story and everything is at unimaginable lows.You could watch people repenting their decisions of coming to this movie and sleeping in theaters. I still have a doubt on how this pathetic of a movie can get such high ratings. This movie is worth rating in negative scale.PS: I signed up to imdb and wrote this review to pass time while trying to not watch this movie.",
    "126": "Animalistic as it sounds. The movie was more animal than the animal itself. So rude, disrespectful towards women, promoting incest behavior: first of all Reshmika, on the set Gitanjali called her beast as brother and then out of nowhere somewhere in the sky they are having intercourse, are you bonkers af? In a functional goddamn helicopter with them as pilots. Yo you better be bugging. And the female characters were so manipulative just like rashmika, I hated that performance. According to the animal theory from the movie, women are born to reproduce and have a sound decision to make out with alpha man of the tribe. Alpha man has to be one and the rest are literally sissies. Like where do you get these toxic masculine patriarchal thoughts from? The only look I liked of the movie was sardars as side characters, they had good personality for some reasons and that too had a bitter truth trait sticked to their characters as well. Kabir Singh's high version movie, I mean high. High. Father-son relations were portrayed as toxic, wife-husband and so was sibling relations too. And the attitude? Don't get me to it, bro that was above the pyramid that it hit to the height of Burj Khalifa that the attitude the hero had. Sad to miss Bobby and the national crush of India, but by the time my patient was outrun.",
    "127": "Long, Loud, Boring, Gory, Tiring. The movie starts off well, but turns out to be a disaster. The movie is a long drawn violent drama affair which doesn't end. Let's not talk about the story (there isn't one).Bobby Deol (the superstar of the 90s) is wasted, merely a cameo appearance and something his fans won't accept (no spoilers). Go watch his Gupt, Soldier, Ajnabee again!Ranbir's performance is fine, but being a mainstream actor of Indian cinema, should NOT have signed this torturous endless movie. I'm sure Ranbir will lose some of his loyal family fan base - but does it matter in the society we are living? I wonder if he read the script in full. His Shamshera is a far better movie than this so called Animal.At one of the marketing premieres for Animal, Ranbir said he prefers Sandeep over Rajamouli as the director. C'mon, Rajamouli Sir is one of the best directors India has ever produced and there is no comparison.If you are a hardcore Ranbir fan and would like to see Sandeep Reddy's Animal at any cost, go for it but don't forget to keep a Paracetamol with you.",
    "128": "This movie was a masterpiece. Once in a generation masterpiece like this will come. 3 hours of this masterpiece!Kabir Singh/Arjun Reddy was so boring, so I rated them 10. But this movie is such a masterpiece. Rating 1 also cannot define how am feeling now.Trailer was very bad. All the people who have seen the trailer will agree with me. But movie is totally opposite. Totally different. Bobby Deol, OMG, what a return. It was like rocket science. So fast that you have to experience it.This movie is not for normal people. Only legends and man of culture will hate this movie. This movie is also feminist friendly! Religious friendly!And the best part is I went to show as first day first show. I have spent my hard earned pocket money on this. Let me friend's experience the same.",
    "129": "Fool me once shame on you, fool me twice ( actually fifth time ) shame on me.Bollywood has tried to do different (with a Director-Writer actually coming from Tollywood) which again hyped by trailer released to create a troubled father-son relationship but some how falls flat particular in the second half which feels like endless.Sandeep Reddy Vanga has some serious problems with women who has once again (Arjun Reddy and Kabir Singh for the past reference) has presented a 3 hours and 21 minutes long movie comprised of bloodshed, testosterone and blatant misogyny to glorify the alpha Male-esque tale.Though trailer and songs have portrayed a movie filled with violence but some how father-son relationship shown in trailer is lost and the protagonist has become saviour of the family with whom we have sympathise as he is a love less child who takes refuge in bestiality as he didn't get attention of his rich and always busy PAPA whereas affection showered by MOTHER and SISTER means nothing.Acting is good, music is also very good but for 201 odd minutes it's a endless loop.",
    "130": "In director Sandeep Reddy's latest film \"Animal,\" Ranbir Kapoor delivers a captivating and unforgettable performance that showcases his immense talent and dedication as an actor. Kapoor's portrayal of a complex character leaves audiences in a state of awe and raw emotion throughout the film. His performance solidifies his position as one of India's finest actors.Rashmika Mandanna also delivers a powerful performance, matching Kapoor's intensity with her own grit and determination. Anil Kapoor brings his vast experience and gravitas to his role, adding depth and authenticity to the story. Bobby Deol also leaves a lasting impact with his memorable supporting role.Clocking in at three hours, \"Animal\" may seem lengthy, but the film grips viewers from start to finish. The strong direction, writing, and music work seamlessly together to tell a captivating story that keeps audiences engaged. However, it is worth noting that some scenes in the film push the limits of acceptability, challenging viewers to confront uncomfortable truths.\"Animal\" is an audacious work that will undoubtedly divide opinions. It fearlessly explores themes of violence, toxic masculinity, and possession. While not suitable for all audiences, it is a necessary and important piece of cinema that shakes up the industry. Ranbir Kapoor's performance anchors the film, making it an experience worth watching and discussing.The cinematography in \"Animal\" is breathtaking, with each frame meticulously crafted to capture the raw emotions and intensity of the characters. The use of lighting and color adds depth to the storytelling, enhancing the overall atmosphere of the film.The screenplay, written by Sandeep Reddy himself, is a masterclass in storytelling. The dialogues are sharp and impactful, leaving a lasting impression on viewers. Reddy fearlessly delves into the complexities of human relationships and emotions, exploring the dark corners of the human psyche.The music in \"Animal\" is hauntingly beautiful, perfectly complementing the narrative. The background score heightens the tension and adds intensity to the gripping scenes. The songs, composed by a talented team of musicians, add depth to the characters' emotions.The exceptional supporting cast in \"Animal\" elevates the film to new heights. Rashmika Mandanna shines in her role, displaying a range of emotions with ease. Anil Kapoor's commanding presence adds gravitas, while Bobby Deol delivers a nuanced performance.\"Animal\" demands attention and sparks conversations. It is a bold exploration of the human condition, delving into themes of love, obsession, and toxic relationships. The film challenges societal norms and forces viewers to confront uncomfortable truths.In conclusion, \"Animal\" is a cinematic masterpiece that pushes boundaries and leaves a lasting impact. Ranbir Kapoor's mesmerizing performance, coupled with the strong direction, writing, and music, make it a must-watch for any film enthusiast. It is a testament to the power of cinema and the immense talent of its cast and crew.",
    "131": "I have seen this movie 4 times and all of them were housefull. I love each and every scene and it's masterful execution. Film has strong emotions and has discussed very uncomfortable topics which no one in Bollywood have guts to even imagine.This movie is gem for any cinephiles who loves to watch original movies.Vanga sir has taken inspiration from Godfather, Old boy, Kill bill, Scarface and many cult classics of hollywood and used his brilliance to execute some wonderful high adrenaline power packed scenes in the movie.Ranbir kapoor has seperated himself from rest of the actors of this generation by his legendary acting. From the rage in his eyes to his face shaking with anger in every scene proves that he has lived his role. He is for sure the Superstar of this generation.All the supporting roles are wonderfully played specially the Punjabi clan, Marathi Gunseller.In the end I would like to kneel before Lord Bobby for stealing the show just in 15 minutes screen time in movie of 3 hour 21 minutes.I want vanga sir to continue this franchise with even more budget as I am quite sure that he has some crazy original ideas in his head.",
    "132": "Acting: good\nVFX: average.. at times very bad\nSound : weird.Character development: This is so lazy. They never show why is the boy so obsessed with his father.The most important rule of movie is.. \"show and don't tell\". But vanga never follows that. So lazy man. Some characters were abruptly introduced. No significance in taking the plot forward. Panchatpana. That's it.Dialogues: Random.. not coherent.. someone says anything out of anywhere.. kya mazak hai kya.. out of nowhere.. Ranbir starts talking about not shabi the pubes. Talks rudely to doctors. Effing idiot. The list goes on and on.Action: made a joke of it. So many cuts in shortest scenes. Such a turn of. No smoothness. Watch John wick or nobody. Go watch edge of tomorrow. It's like a treat to the eyesViolence: they have hyped the movie so much on this part. But it was a bit lie. A total scam. One scene was good. That too came without any depth. Wasted chance.Chemistry between father and son: 2/10\nChemistry between hero and heroine:0/10\nRun time: it was too long for a bad movie. Such run time wasn't necessary. One hour in, I was bored.Plot: doesn't go smoooth. So many subplots were abandoned.Such an effing turn off movie.",
    "133": "The first half is fine, story is somewhat engaging, but the second half is slower than serial. There's more of P**n than the typical \"animal\" behavior.And typical of Sandeep's previous movies, the heroine is useless. And senseless fight scenes, useless guns and shootings, hard to follow. Main villain comes only in the last 30 minutes, they fight for straight 6 - 7 minutes, what is this WWE? And nobody knows the reason for some of the fights.I guess this is a movie version of a typical soap opera. He should name it \"Movie to not watch\" instead of \"Animal\". Sentiment wasn't much. God knows how characters accepted such movie. So much of dragging, useless senseless kiss scenes that are out of place. Second half is just a synonym for headache. This has two heroines that have no purpose or place in the story. I still didn't understand what sandeep wanted to portray.Actual story can be completed in 30 minutes. Sandeep should stop making movies.",
    "134": "ANIMAL has been watched & this was one of my most awaited movie for this year, so here are my thoughts about it :If Rockstar & Tamasha weren't enoughly polarising, here is another one for you by #RanbirKapoorYOU'LL EITHER HATE IT OR FALL IN LOVE WITH IT.I loved it for the most part but I still have my grudges as I was convinced after watching the trailer that it is going to be a 5/5 movie hands down but sadly it isn't.Won't dive into the plot as it is majorly clear based on the trailer.Performances\nRanbir Kapoor : This man has made a movie for everyone, for one ADHM I did not like he made a TAMASHA & yes we all became his fans sooner or later & this time he has gone an inch above & given a top notch performance, he is representing multiple phases of his life as a school kid, as a college kid, as an assassin killing people, as a husband & in each role we cannot take our eyes off screen that is the benchmark of his performance and it comes with no surprise that we expected the same from him & he had to deliver it.Anil Kapoor : He is Jhakkas, he is shown as a father who has always been neglecting his son & yes you tend to develop a hate for him.Bobby Deol : You gotta be kidding me if I say that he wasn't working much in past few years, man he deserves some good scripts & needs to continue working with directors who can take out the best from him, he was robbed with screen time here & was more in an extended cameo role rather than what everyone expected, but whenever he comes up on screen he seems to be ruthless killer machine.Rashmika Mandana : While everyone made memes out of her one dialogue she actually surprises in the movie & she has been given multiple important acts where she proves her potential as a good actor, you need to see the scene where she tells Ranbir that he is fighting ghosts in his mind.Tripti Dimri : She didn't had much to do here but definitely is gonna be a big highlight in the upcoming sequel and her presence in this part was a build up for the next.Shakti Kapoor/Suresh Oberoi/Prem Chopra/Saurav Sachdeva all had small roles & they all looked stellar.Direction and Screenplay : Kabir Singh director was coming from a lot of hype & he had to prove that he was worthy of all that hype & yes he is, challenging to keep the runtime of over 3 hrs was a bold move, screenplay was engaging, Vanga made sure that the audience remains connected with twist turns up-till the end despite long runtime & he was successful, the cinematography was top notch especially in the action pieces be it Arjan Vailly sequence, Ranbir-Bobby Airstrip fight sequence, Ranbir chasing eve-teasers in an Endeavour, the sunrays striking Ranbir's eyes with shadows covering the remaining body in a G-Wagon & lots more....brilliant, the gore shown in the movie is the actual substance audience expects from a violent film rather than people jumping here & there after a gun shot which Sandeep was able to create perfectly, song placements were spot on especially the B-Praak's song which just played with the emotions with such strong lyrics from Jaani, colours were vibrant throughout the film & pleasing to eyes & even adopting colours to the screen such as during Arjan Vailey song covered with blood bath with a red screen, Kudos to @imvangasandeep for another success based on his instincts which worked big time.Songs : All the songs are good & none of them feels like a forceful addition, highlights for me were Arjan Vailey & Saari Duniya Jaala Denge, and the BGM was just thundering and was effectively used based on the scenes.Goods/Bads : While the movie is solid on story with enough twist & turns & keeps you engaged for most part you might feel some scenes as going on forever which might have required some trimming, and also you criminally under utilised Bobby Deol, he deserved a large screen space for the audience to feel more connected to his anger & that could have made the final battle even much bigger but still the movie with it's little flaws is a MUST WATCH on big screen.RATING : 4/5A generous additional .5 rating for Ranbir & Bobby Deol's characters.",
    "135": "Let's discuss main characters first -\nRanbir's character in the first half is arousing, but magnetic and heroic because it shows high class status which is uncommon in the middle class society. But the problem is, it started getting over and the director can't balanced it out. Vanga is unable to carry that character for long in Ranbir and messed it. Most of the frames are filled with him only.Anil Kapoor didn't got much chance to perform. Although he made it through whatever chance he got but can't match with the family's physical build which represents punjabi community.Bobby deol did good acting but it's too short for a main villian and that is too when the movie is quiet big.I liked Shakti kapoor after a long time in a positive role but his character didn't suffice any purpose.Rashmika, Suresh Oberoi and Prem Chopra performed well.Storyline - It started well, and picked the pace but then before 10 min. Of the first half, it slowly getting derailed and everything started getting unreal and illogical which makes no sense at all.",
    "136": "Director Sandeep Vanga Reddy, often accused of ruffling the feathers of self-proclaimed \"liberal critics\" with his films like Kabir Singh and Arjun Reddy, appears to have taken the criticism to heart and birthed a film that is unapologetically raw, intense, and unabashedly violent.Ranbir Kapoor's portrayal of \"Animal\" is a true tour de force. He effortlessly navigates between ferocity and vulnerability, crafting a multifaceted character that keeps the audience captivated from the opening scene to the closing credits...A standout feature for me is the director's choice to confront the critiques of his past works by offering a more substantial characterization for the female lead, played by Rashmika. In the second half of the film, Rashmika delivers an unexpected and impactful performance.The exploration of the relationship between father and son adds an emotional depth that goes beyond the superficial intensity. The tribute to The Godfather was rather nice.Ps: The only criticism I have is of Tripti's character. I wish there was more of her...",
    "137": "How does one review a film like Animal?Does one focus on the incessant use of violence to give shock value? Or the disgusting objectification of women to a point where their only purpose in the world appears to be to serve men? Or the mindboghling manner in which the hero goes on a mass rampage which is justified by him having 'daddy issues' ?The least that this movie could have done is have a tight script. Alas this was also not possible for the director.Anil Kapoor stands out as an exceptional performance.There is no role that this man can't do well.The length of the movie is also awfully long.",
    "138": "I swear, Sandeep Reddy Vanga hates women. I really didn't think his movies could get any more misogynistic than Arjun Reddy or Kabir Singh but, hats off to the \"creator\", he's managed to surpass himself by creating the vilest, most toxic protagonist/\"hero\" I have ever seen on the big screen.Ranbir Kapoor's Ranvijay Singh Balbir has absolutely zero redeeming qualities. Now, usually there is nothing wrong with that as we have seen our fair share of psychos in films that we have appreciated but Vanga makes abundantly clear that not only are we meant to understand his protagonist's intentions, we are actually supposed to root for him. We are supposed to laugh and hoot as he denegrades women every chance he gets and then nod accordingly when he attempts to justify why he is behaving the way he is. To say I was squirming watching this with my wife would be the biggest understatement of the decade.I was hoping the promised over-the-top action set pieces and the acting from seasoned performers like Anil Kapoor, Suresh Oberoi, Prem Chopra and Bobby Deol would make some of the vileness worthwhile but it didn't come anywhere close.There are a couple of enjoyable and applaudable moments in the film like a young and rambunctious Ranbir defends his sister against bullies at college, Ranbir Kapoor's quarrelling with his brother-in-law at his father's birthday party or Ranbir Kapoor gathering his troops in Punjab but these fleeting moments don't make up for sitting through over 3 and a half hours of something that comes across as an extended advertisement of masculinity made by the Tate brothers.If this film is lauded and becomes a blockbuster amongst Indians, I can only sympathise with the stature in which women are perceived by Indian males.",
    "139": "Ranbir Kapoor, is an absolute triumph that seamlessly weaves together riveting storytelling, powerful performances, and breathtaking visuals. Kapoor's magnetic on-screen presence elevates the film to new heights, delivering a performance that is both nuanced and emotionally resonant. The film's narrative unfolds with a perfect balance of suspense, drama, and heartwarming moments, keeping the audience on the edge of their seats throughout. The chemistry between the cast, particularly Kapoor, creates a palpable energy that adds depth to the characters and their relationships.Visually, \"Animal\" is a feast for the eyes, with stunning cinematography capturing the beauty of the natural world and the intensity of the story. The CGI seamlessly integrates with live-action sequences, bringing the titular animal to life in a way that is both awe-inspiring and realistic. The attention to detail in the creature design is commendable, immersing the audience in a world where the boundaries between reality and fantasy blur seamlessly.",
    "140": "When did violence in films become a yardstick for assessing a movie's quality? I'm perplexed by the way violence is marketed like a potent drug in films, triggering a dopamine rush that fosters a craving for more. Those profiting from selling violence and those paying to consume it seem unaware of the ripple effect. Continuous glorification of crime and violence may eventually lead to a realization of one's contribution to societal issues. As the audience, it's crucial to recall the proverb, \"Fool me once shame on you, Fool me every time shame on me.\" It's time to wake up and be mindful of the impact..While Ranbir Kapoor is a talented actor, this film doesn't seem worthy of his hard work and dedication.Such a lackluster film !!May the craft of filmmaking be blessed by the divine.!!!",
    "141": "ANIMAL( Hindi /Indian movie )- My review:\nTOTALLY ENGAGING and a crazy ride( As MB said, mental ekkuddi).I wish that this director will stay crazy ( SANKI gaadu itlaney vundaale). Story telling is just bloody fabulous. He has to be crazy to tell a story in this format .Ranbeer Kapoor blew my mind with his performance . AK brought all his experience and added the utmost importance with his acting nuances.All actors who played key roles are amazing.What I realized is that Sandeep Reddy vanga is taking us in to his crazy world and succeeding to engage us despite our usual comforts/discomforts.There are many things I wouldn't have usually appreciated but here I dare not to complain as he made them an integral part of the story and characters/ characterization.All songs are Beautiful.Back ground score is top notchAs the director said, don't miss the beginning and end.HEADS UP: This movie is rated A. I would write that in large red color A.So, NOT FOR KIDS and not for adults who are super sensitive to blood/gore and language.Be prepared for 4 hours of your time commitment including the break and ads etc.I did not feel bored or lag throughout the 3hr25 min run time.Lot more to write but I will stop here to let you guys go crazy in theater .",
    "142": "Where is police in this movie.....writer please consult with doctor before writing any story. You have wasted my hard earn money n time.No acting, no story, no suspense, no thriller, just copy paste from all region movie and want to earn money and wasting people time.Why Ranbir why what is the use of acting if u choose this ghatiya scriptdon't gonot for theaternot for familynot for childrenno messageno storyno impactweakness.Are you guy out of mind showing nudity as means of earning....how could one give money to produces such type of films write some meaningful story that can spread awareness.",
    "143": "Animal film starring Ranbir Kapoor, is an absolute cinematic delight that exceeded all expectations. Kapoor's exceptional performance adds a layer of authenticity to the narrative, bringing the characters to life with his impeccable acting skills. The film seamlessly weaves together elements of drama, emotion, and suspense, creating a riveting experience for the audience.The storyline is both captivating and thought-provoking, exploring the intricate relationships between humans and animals. The film beautifully addresses important environmental and conservation issues, delivering a powerful message without compromising on entertainment value. The cinematography is breathtaking, capturing the raw beauty of nature and the animal kingdom.What truly sets \"Animal\" apart is its unique blend of humor and heartwarming moments. The chemistry between Ranbir Kapoor and the animal co-stars is heartwarming, creating an endearing connection that resonates throughout the film. The well-crafted screenplay keeps the audience engaged from start to finish, with unexpected twists and turns that add an extra layer of excitement.The supporting cast delivers commendable performances, enhancing the overall impact of the film. The director's vision shines through, creating a visually stunning masterpiece that showcases the magnificence of the animal world. The soundtrack complements the narrative beautifully, enhancing the emotional depth of key scenes.",
    "144": "Not sure how you can call this movie a father and son movie, there are elements, only elements, otherwise this is a love and hate relationship.In India, only a rich man's spoilt brat can act the way Ranbir has in this movie, in fact I would not be surprised if he has based his character on an Indian tycoons or a politicians pathetic son. A spree of murders, and no sign of the police.Similar to the directors previous movie, the alpha male seems to be something he is fixated with, but his definition of an alpha male is bizarre, for him and alpha male talks about sex all day long, threatens women with slaps, and kills people. I wonder what type of a childhood Mr Sandeep Reddy Vanga has had.This movie, gets a rating of 5 from me the following reasons, an excellent soundtrack and the superb acting by Ranbir Kapoor, although I have to say his acting in Sanju was much better.I think the directors needs to visit a neural surgeon.",
    "145": "The Animal Movie is an action-packed film that showcases the extreme levels of a son's love for his father. The cinematography in this movie is excellent, capturing the thrilling action sequences with precision. The dialogues are well-written and add depth to the characters' emotions. However, some of Ranbir Kapoor's dialogues can be considered sexist and do not reflect real-life scenarios. These dialogues could have been avoided to create a more inclusive and respectful narrative.The acting in this film is top-notch, with standout performances from Ranbir Kapoor, Anil Kapoor, and Bobby Deol. Bobby Deol's comeback to the screen is remarkable, and he delivers a great performance. The chemistry between the actors is evident, adding to the overall appeal of the movie.The action sequences are superbly choreographed, keeping the audience on the edge of their seats. The music in the film, especially the songs \"Saare Dunya Jala Dengy\" and \"Papa Meri Jaan,\" contributes to the overall impact of the movie.However, one drawback of the Animal Movie is its lengthy runtime of around 3 hours and 25 minutes, which can feel dragged at times. Some songs could have been omitted to maintain a better pace. Additionally, Rashmika's acting is poor and lacks emotion, and her dialogues come off as cringy.Despite these minor flaws, the Animal Movie is a captivating film that explores the depth of a father-son relationship. It reminds us that not every child is typical and highlights the consequences of neglect. Overall, the Animal Movie is a must-watch for its outstanding cinematography, excellent dialogues, and great acting performances.",
    "146": "Wrote this review just after watching, so movie is still fresh in mind, great movie not gonna lie.Started as complete extreme, action packed, thriller ( Action and Thriller, is not for gun or fist fights, its just the vibe it gave, you will see that its not as action packed as one might have imagined from teaser, Actually trailer gave a better outlook on movie, as thats what it really is, A family, Psychological Drama with lots of emotions and love- you will feel it too later on, if you are correct audience for it. And this movie didn't shy away from blood and fight, which i loved ),Then converted into Psychological, Family Issues ( you already guessed it from trailer i think ), A unique outlook and ways of doing things ( This can't be seen in trailer, only in movie ).By the end, got very emotional ( i enjoyed that part the most, as it left a deep impact on me, so acting was top notch and emotions was right on track as it gets me ), and as always ended with complete twist ( You can only see movie for it lol ).So hands down, this was a wild ride and a great ride for me. ( At least at the moment of writing this review, i am full of emotions about the movie lol )",
    "147": "4 hours of gore, bloodshed, butchering and lots of smoke in this pollution.....ANIMAL!!!!Repeated psychopath killer movies...Shamshera...Animal..what social message???And people quoting best movie of the year.. should be send to oscars...!!World will be puzzled of all the things where is Indian Police, Army for the richest man and worst of all Scotland where there is world's best security....!!!!Such a worst portrayal of women when we talk about women empowerment they are just reduced to pelvic size..sic...!!!Had he been such a loyal son he could have provided Z grade security to his dad and spend time with him instead of horrendous murders...!!!!DO NOT RECOMMEND.",
    "148": "Wasting talent like Ranbir Kapoor by casting him in a South Indian film. For the movie to work, it should have portrayed Ranbir as a meta or superhero to justify his action scenes.Imagine the richest man in India whose son aspires to be a gangster. If this were set in Ludhiana's affluent society, it would still make sense.If the main character is depicted as an individual with such ruthless tendencies, why did he choose not to torture the fake mole, but later, he is willing to harm a pregnant woman? This man, in the beginning, declares he will not deceive his wine but contradicts himself later.In reality, children with toxic fathers do not usually turn out to be such ruthless individuals. Although they may dislike their fathers, this movie seems to portray an exaggerated and overly dramatic scenario.",
    "149": "\"Animal\" unfolds as a misguided cinematic endeavor, raising red flags for its portrayal of a central character steeped in possessiveness. The narrative traces back to the protagonist's school days, depicting him as the self-appointed heir to the family throne after an evidently neglectful father. This skewed sense of responsibility leads him to make decisions for others, showcasing a troubling dynamic.The film takes a regrettable turn by treating the central character's wife as an object and projecting a palpable disdain towards women. Such regressive depictions can confuse Gen Z viewers, who often prioritize progressive values. The violence depicted in the movie, coupled with the absence of law enforcement despite countless murders, adds a layer of inconsistency that undermines the narrative's credibility.A glaring departure from reality occurs when the protagonist engages in a prolonged, physically demanding fight post-heart surgery, straining the bounds of believability. However, amidst these narrative missteps, the film does salvage some merit through commendable performances. Ranbir Kapoor's commitment to the director's vision shines through, offering a silver lining in an otherwise turbulent storyline.The background music proves to be a standout element, complementing the intense scenes effectively. Unfortunately, the placement of songs during crucial junctures, such as the interval block fight and encounters with the main villain, fails to capture and sustain audience interest. These moments, rather than enhancing the cinematic experience, contribute to a disjointed narrative.In conclusion, while \"Animal\" boasts strong performances and noteworthy musical compositions, these aspects are overshadowed by a problematic storyline. The film's portrayal of possessiveness, mistreatment of women, and an unrealistic portrayal of physical resilience post-surgery undermine its potential. \"Animal\" ultimately falls short of delivering a compelling cinematic experience and, on the whole, is not worth the investment of time and attention."
}