{
    "0": "I didn't pay enough attention to the trailer that preceded this film's\nrelease during the week. This is one Hallmark film where the ending doesn't matter as much as what happens in each of the three stories. This film has sweet and relatable stories, and as is the way with Hallmark, love still takes center stage. Note: If you're a bit drowsy or are overly distracted, perhaps wait till you're not to watch, otherwise you'll likely miss the smattering of clues to help you understand what's going on with each of the three stories. With a large stellar cast, this film is not your typical Hallmark movie. Love that Hallmark is working hard to ensure ensure representation in story lines as well in casting.",
    "1": "This movie is about one house and 3 families each a generation apart. It is very confusing even before you realize that there are pieces to this jigsaw puzzle to link together. To me that is the only redeeming thing about this movie - trying to figure it all out. Sure there is a theme about family. There is the repeated idea that parents don't know what they are doing and just work it out but that's ok.There is one neighbor who is common to all the stories - Lizzie. Of course she ages according to which family she is neighbor to.The first couple gets deluged with both sides of their family immediately after they first moved in. The second is a widow about to remarry and move who has just informed her two grown children. The last couple is two married men who are taking in a little girl as a foster child hoping that their house remodeling gets finished before the child arrives.Each family faces some surprise crisis which creates drama and humor.I'm a huge fan of Erin Cahill and a big fan of Catherine Bell so I was hoping for more.",
    "2": "Three different households trying not to muddle up Christmas. Apparently written by a hundred different writers with really no idea what they're doing.Stop me if you've heard this one before..\nA Scientolgist walks into a Christmas movie....\nHow about, The Good Witch walks into a Christmas movie, with the same husband. Yeah, this movie is a confused trash heap of cliches and poorly conceived plotlines that meander towards a flat and dissapointing ending.Poor Erin Cahill waddles around this film 10 months pregnant and never gets a chance to show a lick of her beauty.This has a been a great Christmas season for Hallmark, but Cherry Lane is a bust.",
    "3": "This movie is about three different families living in the same home but at different time periods. It may seem to be a little confusing as it jumps between each story but each one is unique and interesting so it definitely keeps your interest. After a bit you easily get drawn into the families and their family/friends and the stories.There is a neighbor who is constant in all the years which helps tie it all together. There are many familiar faces and good acting from everyone.Without spoilers I just want to say that all of the stories leave you with tears and the wonderful feeling of love at the holiday season. Well worth the watch.",
    "4": "I come out other other end of this movie just a bit bewildered about the connectedness of the families portrayed in the movie. It's stellar cast did predictably well but the timeline jumps around. Is this the same house but different families over the years? How is the cop involved? So many foster children. I wish I had the time and the patience to watch this movie again just so that it all comes together a little more easily. Watching hallmark Christmas movies is like eating junk food - you can't stop at one, knowing there's several more out there, hoping the next one is a little bit better than the last. There's only so many hours in this life to watch all these movies once, so I'll close the book on this experience in a state of confusion, but Christmas on Cherry Lane was entertaining nonetheless.",
    "5": "For the first twenty minutes of this movie, before the commercial break I was lost. Or maybe disinterested is a better term. Then it closes before the break and says that the three stories we were watching are all actually happening on different timelines. Great, sounds fun. No. It's a slog. The stories are interconnected through the house the ALL live (or lived) in, but it doesn't really come together until the final five minutes of the movie, which left me a lot of time to wonder why I should keep watching. For a movie with Jonathan Bennett, I thought we'd see some funny moments, but no, it was all serious future-dad, fancy dinner chef drama. John Brotherton and Erin Cahill could have just had the whole movie to themselves and we'd have all been better off for it. And another thing, you don't keep having to mention \"high oil prices\" to tell us the year the events are taking place. We get it . . . Oil crisis. We just don't care.",
    "6": "I am not sure what it is about this wonderful addition to the Hallmark Christmas movies that encouraged me for the first time to write a review but it really touched me. The ties that bind this movie is truly in the spirit of the holidays. I was transported into the heart of each character and felt invested in their journey. Must admit I will love a follow up next year. (As I know Hallmark is want to do). Unlike most reviews, I am not going to give you a play by play as I feel the magic of this movie is to be experienced without any preconceived notions. But I will say that you can tell that each of the actors felt invested in their journey and give us their vision of what family really means and the various ways to show it. Kudos to the writer and the actors for the fun journey they took us on. As an aside, Catherine Bell you have never looked more beautiful.",
    "7": "This is really interesting that I'm saying this about a Hallmark movie. That's because it's incredibly different from any other Hallmark movie. Yes, they have the love. Yes they have all the other blah blah blah, yada yada yada. But I love the way that they took three different storylines from three different years in the same house and tied them all together. You just don't see that sort of thing these days. And, just when you think you've got it all figured out, they throw you a curveball. I like a nice curveball. I like it when a movie keeps me on my toes and I don't honestly see what's coming till almost the end. That's why I'm giving this one 10 out of 10. Well done whoever wrote this one.",
    "8": "I have been surprised by Hallmark this year, bringing out anything but cookie cutter movies. Christmas on Cherry Lane is one of those. I must admit when I saw the 3 scenes with the dates I did backtrack and say to myself, Whoa! What just happened? But then I got it and saw what they were trying to do. I totally enjoyed this movie and loved how it gave you clues as it went along, like a mystery, in order to put it all together. The acting was terrific, the stories engaging, and the sub-plots fit right in.Yes, I did have to stop at the end of the movie to make sure I put it all together correctly but I think that's what made it different and interesting. So glad. Hallmark has been doing so many new and interesting styles of movies this year that I don't want to miss one, not that I ever missed one before. Well done, Hallmark. You're hitting them out of the ball park. Keep up the great work!!!!",
    "9": "I enjoyed this movie. It's well constructed and acted with good performances all round in particular I liked Vincent Rodriguez III as Jonathan Bennett's long-suffering carol singing partner. The 3 story lines weave seamlessly if somewhat confusingly together and there is a heartwarming end. What more could you want from a Hallmark LGBT inclusive Christmas movie? Well, I for one would like to see Hallmark (and others) push just a little further. For all its diversity credit, this film is still wholeheartedly about the conformity of the family ideal. The gay men are cute with the children. The adopted girl is set firmly on the path to become a little princess. Religion rears its secular head through the singing of carols. None of this bothered me too much - but one detail did. The gay kiss. This was very much a 'no sex please we're hallmark' movie. No shirtless reveal. No steamy shower scene, and the kiss between the two men is blink-and-you'll-miss-it brief, and shot carefully to be out of sight of the child. A pity.",
    "10": "I really enjoyed seeing Catherine Bell and James Denton back together again after watching them for years in The Good Witch. Jonathan Bennett is one of my favorite Hallmark actors as well and never dissapoints. Once I realized this story line was about residents of the same house, it was fun putting together the clues to see how they all would be tied together. As one reviewer said, it brought back memories of \"This Is Us\". I thought all the actors had great chemistry, especially Bennett and his partner. I had to give only 8 stars because I felt one again Hallmark avoided reality by having the entire kitchen rebuild completed in less than a day! Counter top installation, cabinets, etc. All done in time for a holiday party. At least they had Jonothans character cook it elsewhere!! But... another wonderful Holiday movie.",
    "11": "Worst script ever! I'm still reeling over how bad this was. Not a single thing about any of the characters that could be considered redeemable. The one character I thought I might relate to turns out to be whiny and the one the rest of the family dumps on. There's too many characters. There's no cohesive moment in the film. I watch one scene and I can't wait for it to end. But then I'm tortured by another scene that's worse than the previous scene. The Etsy mission impossible commercials had more compelling characters and story lines. Never have I felt so much hope that Christmas would be ruined for every character.",
    "12": "I absolutely loved this movie. I think this is my all time favorite Hallmark Christmas movie now. I have watched it twice now as I wanted to go back and connect more of the dots. I also am making a chart to connect the dots for my mom, lol. I understand that this format is confusing for some, but I really enjoyed it. I can't stop thinking about it since I watched it. It made me wonder about who before my family celebrated Christmas in the house we lived in. We were the first in my childhood home, but there were 3 families before us in the house that my husband and I raised our kids in.I love that not all of the movies this year are focused on romance. I like that Hallmark branched out some and focused on the holiday spirit in different ways and told some really good stories. Not as predictable. I hope Hallmark continues to bring great movies like this one. I look forward all year to the Hallmark Countdown to Christmas.",
    "13": "This movie was wonderful. It was different than most Hallmark Christmas Movies and that surely added to its charm. Although it had its moments of romance, I wouldn't consider it a typical romance movie. Don't watch this movie is you're feeling a tad sleepy or plan to be on your phone the entire time; you have to pay attention to the details to fully understand the ending. I believe I made every connection there was, except for one! How did the car end up with Conrad? Did they not fully explain it or did I just miss it?? I loved the one constant throughout the entire movie and felt it added comfort.",
    "14": "I was a huge Good Witch fan (I wish more of those were being made) and I love Catherine Bell and James Denton, which is why I was excited to see them together in a Hallmark holiday film. So, I came for the two of them...but found myself enjoying quite another storyline instead, that of John Brotherton (John Hamilton) and Erin Cahill (Lizzie). John and Lizzie play a couple who have just moved into their first home, expecting a new baby, money is tight, they haven't unpacked, and Lizzie's big family descends on them for Christmas when they expect to have a quiet Christmas Eve just themselves. Funny and real with each other, this was definitely the story at the heart of this film.Cleverly the writers tied three stories in three different time periods together in the same house...and with some of the same people, like their neighbor on Cherry Lane played exceptionally by the same actress in all three time periods.There were some inaccuracies with their time frames, but they did try to throw in some time period specific notes...like the oil crisis and a hallmark keepsake Christmas ornament. I appreciated having a foster child pay it forward and make another foster kid's Christmas special. That was a really nice touch.This wasn't really a romance, but it was a family drama. If you like holiday family dramas then this might be for you.",
    "15": "This is another great movie and Hallmark is really hitting home with some of their recent releases.The only thing is you really have to be paying attention or re-watch the movie.There are three families across three different time periods (the 70's the late 90's and current time 2023). The time periods and families are not shown sequentially (since their connection is more than sequential).The connections to the other families and time periods is more than just the home, it's in the people themselves and their connection to each other, but that's not the focus of the story. Even though these people's lives have some connection or overlap, they each independently have life changing events occurring and the struggles that go with dealing with these events. As they overcome or accept these life changes they find strength in the people around them and the viewer sees connections that are hinted at but slowly revealed as the story progresses.I wish the changes between the time/families had been a little more clear, but do like the way it was showing the families and the overlapping storyline.",
    "16": "I really enjoyed this movie and appreciate how Hallmark upped its game in terms of telling the stories of different families who share something special in common. Basically, things center around 7 Cherry Lane, a house called home to three different families spanning over five decades. Though each family's storyline is separate from the others, there are people and details of each storyline that are interwoven with the others, creating a vibe that's similar to This Is Us.The families are young marrieds Lizzie and John, who are awaiting the birth of their first child; this takes place in the '70s. Then there's Regina, a forties-ish widow with two young-adult children, who's ready to move on with her life in the 90s era. Lastly, there's Mike and Zain, ready and hoping to welcome a child into their family in the present day. I don't want to give any more details because this movie is best enjoyed by discovering who's tied to who, how and when by the viewer. Wonderful cast of actors who had excellent chemistry with each other! Highly recommended watch.",
    "17": "Bravo, Hallmark.Loved every second. Tough competition in 2023 with the brilliance of 'Holiday Road' and 'A Biltmore Christmas' but the ensemble cast and the three intertwining stories (the 70's, 90's and present day) made for a proper Hallmark classic. Leaning more into the nostalgia of the season and the importance of family over place, 'Christmas on Cherry Lane' continues the Hallmark trend in 2023 of moving away from the (pardon the pun!) cookie-cutter movies they have become famous or infamous for.Whilst it was a little bit of a shock at the end of the first stanza of the film to see the years flash up on the screen, it was fun figuring out who was related to who, and how everyone knew each other through the years. You had to pay attention, but it was worth it.Catherine Bell's best work for Hallmark. Erin Cahill's best work for Hallmark. Jonathan Bennett finds himself in another classic (I'll never stop seeing him as the brother from the Christmas House movies) and a well-cast group of supporting characters. James Denton didn't get a tonne of screen time, but he was good. Brandi Alexander as Daisy tied everything together.Great sets, great music, great acting, great story -- no, an unforgettable story.The finale hits you right in the feels."
}