{
    "0": "I'm honestly not sure what I expected, but it wasn't this. It took me a little bit to get into it as I thought it was just going to be another so-so remake of the overdone \"Christmas Carol.\" When I learned that it was a semi-musical, I was slightly less enthused as I am not a big fan of musicals. In the end, it was just what I needed. It might be just what a lot of people need. It was funny, witty, charming and uplifting with just a touch of adult humor here and there. It is also something that has a relevant message for kids and teens. There were certainly some plot twists that set it apart from the normal run of the mill remake. In the end, it was a great watch. In fact, I might even watch it again.",
    "1": "Not perfect but highly entertaining - I could watch Ryan and Will banter all day. Background dancers were amazing and the singing from the leads was decent, particularly Octavia and Ryan. Will struggled with the singing the most and had the most solos but it was easy to give him a pass because he embraces his character so well. The singing is still less annoying than the live singing in Cats. This doesn't have the memorable music of The Greatest Showman but the first big number will stick in your head. Definitely a feel good Christmas movie with an original take on the classic story.Music C+\nDancing A+\nSets A+\nStory B+",
    "2": "Not sure why they didn't allow reviews till today but I'm delighted to be one of the first. I'll put it out though musicals are my least favorite genre and Spirited is one of the best ones I've seen; I usually can't stand the sudden singing in most cases yet this was so much fun and the story was spectacular fun! This was even better in RPX I was surprised how packed the audience I guess people like the mystery movies they are defiantly worth it. Sean Anders comedies are always great entertainment, the humor is spot on, cast is magnificent, and the special effects are impressive. Spirited was a great way to celebrate Christmas early I highly recommend it.",
    "3": "THINGS I LIKED:\nWho doesn't adore Ryan Reynolds? (Those who don't like the same character he plays in almost every role he does.) Well, now we know he can sing too! This is his first musical ever.I know some people don't like Will Ferrell, but I get a kick out of him most of the time. What I love about him is that he doesn't seem to take himself seriously and is up for any gag, joke, or physical humor.Both Ryan Reynolds and Will Ferrell were each paid $20 MILLION dollars for being in this movie! The total amount spent on the cast alone was $75 MILLION!This is the second adaptation of A Christmas Carol that Patrick Page has been in.You'll get a kick out of the celebrity cameos.This cute musical explains that the afterlife is a musical. Yay! I knew it! 😊\nThere's a funny shout-out to Judy Dench and her age. She's such a national treasure.There are a couple of sweet twists.Fun, energetic choreography. The fantastic tap dancing was a fun bonus.The movie isn't a traditional Christmas movie, but because it features elements from A Christmas Carol and some holiday décor, it makes a fun addition to the movies that come out in November to get us in the mood for the most magical time of the year!In between the bouncy musical numbers, there is some social commentary we should consider about the priorities in our own lives.Keep watching during the final rolling credits for a musical reprise.The ultimate test of a movie might be if you'd watch it again. For me, it's a yes. Some of the jokes fly fast and furiously, especially the lyrics in the songs, so I'm sure I missed some fun content.This is the kind of Christmas show that'll put a goofy grin on your face. We need more of those.THINGS I DIDN'T LIKE:\nI get a kick out of Will Ferrell, but readily admit his singing isn't the greatest. That being said, none of the leading singers were very good, but still plenty better than how I can sing.Not all of the humor lands.We don't need all of the crude humor. Making jokes palatable for adults who watch this with their kids doesn't mean the humor has to be vulgar.TIPS FOR PARENTS:\nSome profanity\nSome crude jokes\nWe see a naked Will Ferrell in the shower from the waist up\nWill Ferrell flips the birdTHEMES:\nCan people change?Redemption\nRipples of our kindness\nYour choices make you who you are.Do a little good\nThe afterlife\nPriorities\nPast, present, future\nChoices and consequences.You can see the full review on the Movie Review Mom YouTube channel.",
    "4": "Spirited stands out from other adaptations of A Christmas Carol. It puts its own spin on Charles Dickens' classic novella, imagining how things would have continued after that story, as well as how the hauntings were created. However, this movie could have used a visit from the Ghost of Christmas Movie Editing. It's over two hours long, and it felt like they left every joke and dance number in, when they should have trimmed the fat. Will Ferrell and Ryan Reynolds are a fun pairing, and this musical comedy has its moments, but I doubt it will become a Christmas staple for my family's holiday season.",
    "5": "Brilliant. It takes a classic and gives it a modern twist. It also cleverly adds a lesson that's piggy backing off of the original message of this classic story. Talk about transmutation branded for the times. Well done. I'm seeing some bad reviews out there and a bunch of good ones. The good ones get it. The bad ones...maybe they need to be next years case study lol. The \"unredeemable\" and not believing \"people can change\" are two belief models that stunt peoples personal growth and this process is so cleverly hidden in this movie. Love. Hope. And facing ourselves no matter how hard. The merging of dimensional awarenesses. This movie.... I see you writers and producers. *wink.",
    "6": "I was a little skeptical of it being a musical, but I'm going to say after watching \"Spirited\" (and I thought that required watching it with spirits, so in full disclosure, I obliged), Will Ferrell is the king of Christmas movies. I dare say I wouldn't need the alcohol to enjoy it, the best thing about the movie is that it knows what it is and actively makes fun of it. Will Ferrell and Ryan Reynolds are both very charismatic and have the ability to carry a movie on its own, and together their magic is additive. And while I expected this to simply be a retelling of \"A Christmas Carol\", it's actually much more, more of an extension of the story. Is it perfect or without flaws? Of course not, it could have been half an hour shorter, easily, as most movies these days. But it's an enjoyable watch.",
    "7": "First things first-it's Will Ferrel and Ryan Reynolds. Why are so many self-proclaimed movie experts (and Ferrel and zReynolds \"super fans\") expecting an Oscar-winning movie?! The script was uneven, the singing in many cases not great, the songs were cheesy, and-shockingly-the plot was predictable. Jeez...the original story is going on 200 years old. What so many seem to forget is that the story is about redemption and they did a great job making a campy, happy, silly version. It is fun. I'm very glad I watched it. Time well spent for a classic theme, and I'll probably tech it again this week. And yes, Octavia Spencer is awesome.",
    "8": "UPDATE! I wrote my initial review after watching the movie for the first time. I liked it but I had hoped for more. WATCH IT A SECOND TIME! Watching it the second time gave me time to listen to the music and watch the dancing. It's been a whole new experience since then, and now, I haven't been able to stop watching it and singing the songs ever since! Justin and Benj don't disappoint! The music is memorable and you'll be singing it in your head. (Don't miss the cut song, \"Ripple\" during the credits. It's my favorite! I have a bone to pick with whoever took that out of the main movie). Will Ferrell and Ryan Reynolds are perfectly matched and funny as hell. And they both can legit sing. My main critique would be of Octavia Spencer. She's lovely in this movie but she doesn't sing well, and the chemistry between her and Will Ferrell is just awkward. Oh yeah - PARENTS! This is definitely not a little kid family movie. There should be kind of a big disclaimer that there's some cursing and middle fingers, etc. (If you watch it first, you could easily mute or skip those parts). Bottom line - LOVE IT! Expect it to be a musical, making fun of musicals, with some SNL humor added in for good measure. You can't go wrong!",
    "9": "As many other reviews have said, this just was not written well, it did not have a good flow, and poor character development. This would have been much, much better if it hadn't have been a musical. Most of the music numbers are forgettable, too numerous, and too lenghty. The dancing is great, but over saturated. I love Octavia Spencer, but she seems like an out of place goddess in a sea of mediocrity. Patrick Page is amazing. Rose Byrne is a wonder. As time goes on, Ryan Reynolds (whom I have enjoyed in many movies) is playing the same old sarcastic character he always does. Good for him for making a mint out of it, but it is getting old and tiresome for me. This had a lot of potential given the actors, but it ran amok into old random bits of rehashed parts of every part the two main characters have played forever. I stayed to the end (my husband walked out half way through). Once was enough for me, good afternoon.",
    "10": "The script was actually a clever take on the Scrooge story, and Ryan Reynolds and Will Ferrell both did a good job. Sunita Mani was probably the best supporting character (very funny). However, the musical numbers were really difficult to watch. Something about the music and lyrics was really off. In parts where they tried to sound sincere, it sounded corny; in parts where they tried to sound funny, it wasn't working. At just over 2 hours, it felt like an eternity. This shouldn't have been a musical. It would have worked better as a comedy. I recommend you skip it. Or just re-watch any of the great Christmas comedies already out there.",
    "11": "That people can't step out of their wretched lives for 2 hours to enjoy something that is bonkers and uplifting at the same time. The song \"Good Afternoon\" was hilarious. And the people calling it dumb probably just didn't understand what makes it funny, which is usually the case as to why someone gives a bad review: lack of understanding.Most divisiveness comes from lack of understanding and the lack of wanting to understand, which is usually the sign of lack of intelligence as well. Intelligent people tend to want to understand things.The songs were fun and the dance numbers were amazing. I really enjoyed this movie and it made me smile.",
    "12": "First Impressions:\nAdapting any version of Charles Dickens' 1843 literary masterpiece \"A Christmas Carol\" deserves respect and attention to traditional detail. 2022's \"Spirited\" not only gave the 'heartless miser' trope a comedic spin, but also wrapped its entire message in a musical dressing that beautifully conveyed meaning through humour. \"Spirited\" made sure that the original plotline from Dickens found new life and relevance for a modern audience.The Crew:\nSean Anders did great work as director. He gave this movie a wonderful and fresh perspective.Anders worked with John Morris on screenplay to create a script that had its roots in tradition but aged well into modernity.Dominic Lewis' musical scoring was great, and made the movie outstanding in every way.Kramer Morgenthau's cinematography was excellent. It felt larger than life.Superb work all round by the production design, set decoration, and art direction teams.Erin Benach's costume design was remarkable.Hair-makeup and stunts were noteworthy.Editing was quite good.VFX was exceptional.The Cast:\nRyan Reynolds as Clint Briggs was amazing. Reynolds was being himself in every way and it fit right in with his character. He was one of the main reasons I sat through the movie.Will Ferrell as the Ghost of Christmas Present was engaging. His comedic timing was in form and the way he layered his character with emotional value was superb.Sunita Mani as the Ghost of Christmas Past was good. Her character wasn't as impactful as I felt it should've been, but Mani made it work where it mattered.Loren G. Woods as the Ghost of Christmas Yet-To-Come (or Future, as it's normally called) was good as the physical stand-in for Tracy Morgan's voiceover, which was great but could've benefited from more lines.Octavia Spencer as Kimberly was captivating. So much heartfelt and sincere acting from her.Patrick Page as Jacob Marley was great. Some nice natural and empathic acting from the man. His haunted version was spectacular too.Marlow Barkley as Wren was notable.Joe Tippett as Owen was quite good.Special Shout-outs:\nLily Sullivan as the HR ghost Margo was noteworthy.Rose Byrne as Ms. Blansky was also good. She was one of the 'redeemed' Scrooge-type characters in the movie.Jen Tullock as Wendy (Briggs' mother) was great.Andrea Anders as Carrie (Briggs' sister) was amazing.Plot Summary & Analysis:\nAs a musical, all the numbers, tunes, and rhythms in \"Spirited\" were entertaining and beautiful. I could see some of them being played on loop this December. Kudos to Dominic Lewis' scoring that complemented this great modernized take on the Charles Dickens classic.\"Spirited\" did not feel like a glorified song-and-dance special but rather an endearing Christmas musical that hit all the right notes. The team succeeded in balancing its musical numbers and dance choreography with the essential message contained in one of the greatest literary tales ever to capture the spirit of Christmas. This itself was an astounding accomplishment.The Ghost of Christmas Present (Will Ferrell) was supposed to have retired but found reasons to continue doing what he did. His latest target for redemption was Clint Briggs (Ryan Reynolds) who came across as a modern-day Scrooge-in-a-suit.Briggs' penchant for creating division and controversy was a major highlight in the movie. It set an interesting and meaningful tone going forward. The way they made his character \"unredeemable\" and the way Present thought otherwise brought a sense of suspense to the plot. Will he or won't he change?The idea that one ripple effect could change the world was a familiar but important element worth including in this script. Briggs was a \"perp with global reach\" (as Present called him) and his ripple effect could mean a great and marvellous change. The movie thus set a 'spirited' tone early in its telling.The haunt sequences were compelling and suitably scary. Will Ferrell's Ghost of Christmas Present ended up taking over two phases (past and present) haunts in his attempts to redeem Clint Briggs. The circumstances that enabled him to do so were clever and funny.A great and welcome twist in \"Spirited\" was when Clint demanded to know more about his haunter. He convinced Present to show him about his own life before the spirt could return to judging his. The trip into the 1800s that followed was amazing for several reasons, the most apparent one being that Present's world was in the exact same era as the one featured in Charles Dickens' book, from which this movie was loosely adapted.In this richly detailed historical setting, several aptly costumed characters came forth played their parts. Their collective presence enriched the movie. My jaw dropped when Dame Judi Dench made a cameo.What was truly a shocker, in a good way, was Will Ferrell's Present revealing his actual identity to Clint. It was the identity Present held when he was alive on Earth. The Ghost of Christmas Present was none other than the original Mr. Scrooge himself. Loved it! Exceptional acting here from Ferrell.And the twists didn't end there. Briggs used an opening to escape into the spirit world. All his sequences there were captivating, adding to the suspense of what might eventually happen to him at the end of the tale.One other thing about this movie that genuinely made it great in my eyes was how crisply they peeled back the marketing and publicity lies that kept (and probably still do) many sectors of Entertainment running. It was quite eye-opening to watch those portions play out.Final Notes:\nWhat \"Spirited\" creatively did to rework Charles Dickens' classic felt both respectful and trendy. This Christmas musical genuinely managed to capture the deeply meaningful, though dark and sombre, message of the season contained in the original book.In this light, \"Spirited\" came across as a magnificent new addition based on the Ebenezer Scrooge story. It boasted plenty of humour but also didn't fail to uplift the soul. The question of who was helping whom ended up lending this movie the refreshing Christmas spin it needed to soar above most adaptations based on the timeless Dickens tale.Anyone can be redeemed, if only someone believes that they can. This was the heartwarming message that, along with stellar music and timely comedy, made me appreciate and admire what the team did with this story. The ending was completely unpredictable, and glorious in every way. \"Spirited\" is the best 'feel good' movie you'll see this year.Disclaimer: This review was not brought to you by Sephora.",
    "13": "Wow all I can say is well I thought this film was very awesome and cool And the visuals are very good And will Ferrell And Ryan Reynolds were very awesome together I also think this is a extremely hilarious film and I thought that it was going to go one way but it went a very different direction than I was expecting and There are some great twist and turns in the film that you don't see Coming And this film It's also Very touching and will make you smile It is definitely a comedy film but this film could also Get very serious at times And Some of the one liners Ryan Reynolds what say reminded me of something that deadpool would say!!!",
    "14": "A story of a ghost that tries to help an unredeemable jerk. But then unredeemable jerk decides to help the ghost by trying to prove that no person can change? I really tried with this movie, but I couldn't make it to the end. I thought it was gonna be funny and there were a couple of funny parts but you can't even make it past the bizarre storyline. So the plot is the ghosts of Christmas Carol try to make a social media guy (I can't remember his job) redeemable. But then the guy tries to turn it around on the ghosts, and the ghost of Christmas falls in love with Octavia Spencer, and she can see him for some reason??Literally the first thirty minutes were great, until the ghost of Christmas present met up with Clint. It was soft, it was all over the place. When I see Will Ferrel and Ryan Reynolds I expect to see a comical funny movie, not a deep storyline that just goes nowhere. The places that could have gone, didn't. And the places it did, shouldn't have gone there in the first place.",
    "15": "I am not joking, that's too much love and ratings i am seeing again here for a movie.Will Ferrell and Ryan Reynolds, come on these are the bigger name. Nothing beats Will Ferrell when it comes to comedy and Ryan Reynolds can bring in fun in any character he plays, doubt me? Well just imagine him playing the role of Dracula and immediately you will picture the fun side.It is good, bringing some fun to the musical version of Charles Dickens's story but just found it too much musical, one two or three would have done the trick, but not every other scene. That made it a bit boring in the end.Well not bad but just one time watch only. Not beyond that.",
    "16": "I think this film deserves a much higher rating! It is full of joy, laughter, excellent dancing and wonderful scenery not to mention the superb main characters. I found myself smiling most of the time and find it so uplifting to see a film that unashamedly makes one happy. A rather unusual film with some surprising scenes - the sudden appearance of a national treasure for instance. (I won't say who as I don't want to write any spoilers!) I enjoyed this as much as I enjoyed \"Eurovision\" also with Will Ferrell. I know a lot of people didn't like that film but if you did then I'm sure you'll enjoy this one too!",
    "17": "This is a movie that everyone should watch and give it a chance. Not everyone loves musicals, but I think this is one of the better adaptations of a dickens novel which adds dance and song. The cast is amazing with Will Ferrell and Ryan Reynolds and the music is unbelievable. It was actually recommended by my grandchildren and my husband. I loved it as much as they did. I think everyone should try to watch a musical once their life and this should be the one. A great story and a great moral and best of all an amazing cast plus music which is a quadruple threat. I can give it a chance because it could change your life or one of your family members like to go anywhere. Very emotional, funny and special. I loved every part of this. The music is so uplifting. I love the shower scene. Reminds me a bit of Elf. It's amazing just saying!",
    "18": "Meh. I personally wasn't a big fan. Started off good but quickly went downhill and just couldn't recover from the fall. It was not as funny as I anticipated. I'm not big on musicals either though. The music and lyrics were just okay. Seemed to be trying so hard to be hip and fun that it was neither. I do however get the overall message of the movie (to be kind to everyone). If you have children please do them a favor and don't waste their time. It's quite lengthy in runtime. It was also pretty cheesy/cringey at times. For the cast it was quite disappointing. Probably wouldn't watch again.!!!!!",
    "19": "Will Ferrell and Ryan Reynolds together you can't help but smile. Some films just exist to put a smile on your face for a couple of hours and this is one. Keeping faith to the original tale and adding in a sprinkling of Ferrell silliness and Reynolds sarcasm, a bit of music and dancing, Octavia Spencer with a surprisingly great singing voice is all you need to a feel good Christmas Movie.I'm sure it will draw some comparisons with Scrooged, the Bill Murray, vehicle but this holds up on its own. It also passes a key test of avoiding the overly sentimental and saccharine coated traps that many Christmas movies fall into.A very good way to get you in to the Christmas Spirit.",
    "20": "Hard to describe where this movie fits. Not family, too much offensive stuff -female ghost seduction and discussion not suitable for kids, then I can't understand the point of the good afternoon song and dance, it was proudly offensive. It was a schizophrenic movie, a good scene interrupted by a poor song or rabbit trail. Not being a past fan of Will except in Elf, he was actually the best part of the movie. Ryan was his typical smart mouth adding crass to the movie. We started with high hopes, checked to see how much more there was after the good afternoon number and groaned when we discovered only half way through. Could not finish it. Not sure who the target audience is for this but we did not fit it.",
    "21": "This movie is precious. The message is amazing and the music is phenomenal. The dancing and costumes are incredible. I have watched this movie at LEAST 10 times. Ryan Reynolds and Will Ferrell have the best chemistry. Their timing is PERFECT!! I was surprised at the singing talent! My favorite dance number is Ripple. But you have to wait to the end to see the entire number. There really is a great \"twist\" at the end. The message is amazing, it's realistic and relevant. The cast had fantastic chemistry and did I mention the DANCING!!! Choreography was the BOMB!! Tap is a forgotten art and this movie showcased it!!!!",
    "22": "Ok. It's all over the place but the reworking and twisting of the oft-filmed classic is a lot of fun and Reynolds and Ferrell you get exactly what you expect. The songs are not especially memorable but the musical set pieces are fun and the lyrics very clever, in fact the script keeps things fizzing all the way the through. It's hard to get grumpy about a film like this as it's so good natured and you really would have to be Scrooge or a film critic not to enjoy it. Some of the cast, especially Octavia Spencer are underused but families will enjoy their night on the sofa watching this. The ending was a nice surprise.",
    "23": "After reading critics reviews I fully expected this to be a drab and soulless film that was just another rehash or the same story. It wasn't and I really enjoyed this. Both Ferrel and Reynolds were really enjoyable and the supporting cast were great too. It never really gave itself time to get too deep, or to really care about the characters that much, but there was enough going on to make it fun and enjoyable.It isn't really for kids below 12, not because it's suggestive or had any violence / swearing in it, just because of the premise really.Very much worth a watch, or maybe because it's Christmas I enjoyed it more.",
    "24": "I really don't have anything to add (to the mainly positive reviews here) but I just wanted to point out that the MAIN complaints of the rewiewers was/is that the movie was a little to long and it had ...singing and dancing? Have the reviewing standards fall to TikTok-attention span? Is it really so hard to watch a lengthy musical? Well... don't watch it. It's a musical! Musicals ARE generally long, Musicals HAVE music and dancing. That is no reason to give such a movie with so much effort a low rating. Respect the creators, go see another short episode of whatever series you're watching and avoid musicals. Kind regards and merry Christmas.",
    "25": "We started off watching this as a family, but realised early this one was pretty boring for the kids, its aimed at adults, its really about life purpose, marketing, human nature.. err and xmas. It has musical and comedy elements thrown in.It would be much better without the musical components imo, the story would just get interesting, but then stagnate during the song sequence, even my musical loving wife was in agreeance.Its not one of those Xmas movies like Elf or Noelle or Home Alone, that you might want to watch every year.. but as a 1-off, we really enjoyed it.. Will Ferrell and Ryan Reynolds are really what makes the movie, just enough funny stuff and some more serious reflections to make it interesting.",
    "26": "Did the movie \"Spirited\" make you cry? If not, either you weren't stoned enough or you haven't lost enough in your life YET. Those who pan this movie simply haven't lived long enough or weren't or haven't had their attitude adjusted sufficiently. At the age of 73, I have lost so many people and endured so much loss that this movie took axes to my heart. In the end, it saw redemption, and that is the saving grace. I have friends who thought it would be too painful to see, but when we support each other, as the movie ultimately reveals, we are ALL stronger than the one, and we ALL can take one another to the next stage.",
    "27": "Is this a comedy, a musical, an emotional story .. I don't know as it never managed to be any of these. Every time I thought it was developing in to something it slammed on the brakes and lost it's momentum which I think may have been due to the overly long run time. It kept adding filler but no story. If you like songs you'll enjoy this but if you like a film with a story that doesn't keep pausing without having done anything this will bore you. I don't know entirely what they were aiming for but they missed. Sadly this won't be a Christmas classic and feels like too much glitz and no real content.",
    "28": "Some effort was there but the music was instantly forgettable. Will and Reynolds bring their charisma and try to elevate a very dull script, only to fail miserably. Overall it needed another year of hard work on the script (and especially the music) in order to get this to somewhere near decent. I zoned out at one point near the end and completely missed a major plot point for Ryans character (yes you won't remember the characters name either). Overall it's on streaming for a reason. It just wasn't good enough to carry a theatrical run and only content hungry Billionaire streaming services were desperate and stupid enough to buy it. (It feels like they were trying to get Disney but even Mickey refused)\nSave yourself 2 hours and do something else. You're not missing anything!",
    "29": "The songs are Broadway quality and can't wait to download. And the dancing is spectacular- lots of energy. I think as the years go by and I watch it a few more times, it will just get better- there's a LOT going on the first time watching it. Great cinematography, a lot to digest in one movie. All of the actors are great in their roles- no time to slack in this one, and both stars did a great job dancing and singing, they looked great, but the dance ensemble was about as good as it gets in a movie or Broadway. The rehearsals must have been intense for this-and it shows! Look fwd to watching it next season.",
    "30": "Loved every minute of this movie with family. We all found it funny entertaining heart worming and sad. A really emotional journey with excellent songs which just worked. We are not massing musical fans so we're a bit worried we wouldn't like the spontaneous outburst of song and dance however it was executed brilliantly and didn't take its self seriously at all. Highly recommend for family viewing however for young children the word sh*#y is used quite a few times and the middle finger was used by a character. If you don't mind that you will be fine. Give it a chance and just indulge yourself in a great Christmas movie.",
    "31": "I had seen the score was disappointing but I love Ryan Reynolds and Will Ferrell so I wanted to give this a fair chance. Their chemistry was amazing. I was sure what to expect from A Christmas Carol meets musical meets comedy. I ended up enjoying the music and actors and story.It offered an updated fresh take on the original story. I actually became emotionally involved which was unexpected. I was worried about the ending because of some of the different character developments I wasn't sure how they would wrap it up but I wasn't disappointed.I came away after watching the movie with that warm and fuzzy holiday feeling I was looking for. This will be an annual Christmas classic for me.",
    "32": "I don't have much to say about this movie except that I didn't like it. The film was painstakingly unfunny with too many musical numbers that were all similar and too long. The expiration date for this film is plastered all over it with social media references, old memes, and pop culture jokes. The modern sexually driven jokes weren't very funny and felt out of place in a Christmas movie. Overall this is an awful movie, but it wasn't necessarily all that bad. The overall moral of the story was nice, but unoriginal. The ending was also dissatisfying, but the upside was that getting to end meant that it was almost impossible for them to do another musical number; which was nice.",
    "33": "I tend to find Apple TV+ content of a higher quality compared to other streaming services, and Spirited definitely did not disappoint. In fact, I'd even say it beats the original Christmas Carol and even Home Alone.The storyline is strong, with a great balance of excitement and calmness to suit everyone. It flows well, and you can see what is happening at each step. There's a definite structure and it allows the show to engage into each scene well.The characters are all well developed and have a great background. I love that the 'flashbacks' give you an insight into each character's past, and that you learn about each other's stories throughout the film. There's the innocent, serious, kind and excitable.The technique and lighting in the film is truly spectacular, each scene is very appealing to the eye and is full of emotion and passion. I especially loved the ballroom scene, plaza scene and the unredeemable scene and I found the torch effect marvellous. It actually made me tear up.However, the highlight of the show for me was the music selection. The music, custom made for Spirited, is simply outstanding and far better than even some chart Christmas songs. They all have great lyrics with meaning, background music and are all positioned very well throughout the film. It feels like a musical, but at the same time it doesn't. The dancing is great and everyone just fits in.Even though small, I love the diversity in the film and the inclusion of the LGBTQ+ couples and flags in the background. It's really encouraging to see even just a small amount of representation included in a Christmas movie and this is a step forward to normalising LGBTQ+ relationships in society.Perfectly crafted, heartwarming and festive Christmas film which is set to become a legacy in our household!",
    "34": "This is so far the best modern day re-creation of a Christmas Carol I've ever seen! This was spectacularly done in modern times! At first when I viewed the trailers, I thought it was just going to be nothing much, but just Will Ferrell and Ryan singing, knocked my socks off how good it was! The songs are catchy and witty, and go along with the story. Meanwhile, the story is heartfelt and actually legitimately has soul in the movie, and is actually trying to teach important life lessons about what it is to give someone a second chance who is done nothing but bad deeds in their life. This movie actually tries a lot harder than I was expecting. The world they create behind the scenes how everything works is really exciting an interesting to see, with a purpose behind it all! This is a great fun watch and so and creative!",
    "35": "I watched the film without expectations and damn, it was a ride! Honestly, the first part of the film was overwhelming and also from someone who haven't seen Christmas Carol, it was hard to follow. But I got the gist of story when Will finally haunted Ryan. And I easily got attached with their characters. There was really something meta with how Ryan was bringing his character and Will was the on script guy. For the first time in years, I fell with the romance storyline of Will and Octavia. Like i was wishing I have something like they have. But back to Ryan, you can see his denial with things that he was able to see and pushing it back and I like it for his character. He saw the possible future and did what could stop it. And when I thought that was the ending, it had a twist and also a delayed one. Definitely unexpected and it was incredible. Also like how self aware the film that it is a musical. The cast was perfect! Ryan and Will should definitely do more films together! Do it again AppleTV.",
    "36": "I should say there are a select few musicals that I like so I'm already giving this a lower rating, but even with that aside, this movie was dreadful! I really wanted to love it...hell I would have been happy if it was okay! The songs were so painfully boring and so one note. I'm sorry...I love these guys but not this movie. Musicals to watch: Moulin Rouge, Rocky Horror Picture Show, Mamma Mia (all), Mary Poppins and several others with good music and story lines... just not this one. This movie would have been better without music. Also I was done with my review about 100 characters ago but I'm forced to waffle on!. DONE!",
    "37": "I'm not a fan of musical films. Either be a full-on musical or film, not both. The last musical I saw was La La Land, and I only enjoyed it by fast-forwarding past all the musical numbers, and luckily they were grouped apart and not a big part of the film's runtime. But it was hard to do that with this film because there was so much of it and it just pops into a musical mid-scene without warning. I found that overbearing and annoying. What little was left of an actual movie was fun and funny and well cast and performed. If the producers decided to take this talented cast and keep it entirely as a comedy, and replaced all the musical numbers with more funny scenes, I would've enjoyed this much more. But as is, it's only a generous 6/10 for the funny moments and the great casting and performances. Bah humbug.",
    "38": "Spirited is a 2022 American Festive Musical comedy starring Ryan Reynolds,Will Ferrell and Octavia Spencer. Based off A Christmas Carol the movie is about the Ghost of Present(Ferrell) who is sent to Earth to help a businessman named Clint(Reynolds). What follows is singing and dancing along with Clint believing in himself more. What drew me to this film was for its 2 main stars Ryan Reynolds and Will Ferrell. Both actors are hilarious in their films and it was nice seeing both of them singing and dancing(I'll get to that in a sec) in a film. My only gripes with this film was the songs were forgettable(like Disenchanted) and the story is just boring. The pro is the cinematography was nice.Would I watch it again well only for the festive season that's it.6 out of 10.",
    "39": "I loved this movie, it was everything you would want from a Christmas movie with their own take on the classic Christmas carol story by Charles dickens.Great to see Ryan and Will in a movie together both are fantastic, all the characters are really likeable and I can imagine they had a great time filming as this really showed when watching, the songs are great and really catchy even if your not a fan of musicals I would still watch, I watched with my partner who does not like musicals and he loved it too.I was smiling and laughing all the way through! Watch out for the Easter eggs!Merry Christmas and enjoy.",
    "40": "It's almost Christmas, so you know what that means. More terrible holiday dreck from the Hollywood crap factory.Will Ferrell dusts off his tired routine one more time while co-star Ryan Reynolds squeezes the smug-paste tube, coaxing out another dollup of his bread and butter shtick.Spirited represents nearly everything wrong with contemporary films. It's a lazy, witless and overlong appeal to the lowest common denominator. Featuring D-level production values, bland musical numbers and a cast that seem to be there only for the check, it's an absolute slog and a chore to get through.Everyone involved here deserves to get coal in their stockings this year.",
    "41": "It's the most wonderful time of the year and here comes a new player in the battle of screen time during your holiday movie watching. Spirited was a fun retelling of the classic story \"A Christmas Carol\" with a little bit of a twist. I would sat that the music and the effects they used in the movie were the best parts of this movie for me. Of course, the chemistry between Will Ferrell and Ryan Reynolds was very fun to watch. The two of them are very upbeat and seem to be the best at improvisation and I began to wonder if certain scenes were a battle of who can be funnier.If you are on the fence about watching this movie, watch it. Grab some popcorn and your loved ones and watch an entertaining Christmas movie, after you rewatch The Santa Clause, Home Alone, and Jim Carey's How the Grinch Stole Christmas.",
    "42": "Really don't understand the low rating for this. It's totally full of Christmas cheer, great songs and choreography, funny jokes and great performances all round. Sure, Will Ferrel is really just being, well Will Ferrel, but hey that's what he's good at!Based on Dickens' Christmas Carol, it adds a few twists here and there, but it's really the quirky songs and dance routines that make it enjoyable. Sure, it's no Greatest Showman in terms of unforgettable songs, but they are catchy and made me tap my feet along with them.One minor criticism is that I think it's a little long and probably needed to be about 15-20 minutes shorter.Leave your worries behind, pop on that Christmas sweater and enjoy.",
    "43": "Our family loved this. Fun, funny, entertaining, with just enough adult humor! My wife and I don't understand all the negative reviews. Have fun, relax, grab your favorite beverage, and don't overthink it.Will and Ryan had great chemistry. The supporting cast (which did WAY more than \"support\" the leads) did an amazing job. Should Will and Ryan get a Tony for their singing...uhm no...but that is part of what made the movie so fun.As far as being \"predictable\", I don't know of a Christmas / Holiday movie that isn't. So, to bag the movie with an ultra negative review for that...seriously chill out.Like we said, relax, tune out the troubles of the world, and just have fun with this movie, and you will enjoy the ride.",
    "44": "The writing is absolutely terrible, just awful. They spent all of their budget on Ferrell and Reynolds. Production quality is incredible, beautiful. Cinematography and musical numbers are well down. Very pretty overall. Sets are nice. Lots of autotune on the singing, but whatever.The writing really made this unwatchable and cringe-worthy. The actors did a good job making it slightly better, but even they seemed to be aware that the words they were speaking were basic, not-funny one-liners.We did not even finish the movie because no one was laughing or enjoying it. My husband fell asleep.Watch Elf or Charlie Brown instead.",
    "45": "If you like musicals, Christmas, and Dickens than this is the movie for you! It's now my second favorite Christmas movie. The story is great, the choreography and songs are awesome, and Will, Ryan, and Octavia completely blew me away in their roles. The soundtrack has been running through my head since I last watched it. We even get a cameo from Judi Dench that makes you chuckle. I hope we see a future collaboration with Will and Ryan. There are even a few winks at previous Christmas movies included. My 20 year old son watched it with me and agreed that it's an instant Christmas classic, we'll have it on our Christmas movie rotation every year. Enjoy!",
    "46": "I moved my rating up this year. This movie is more awesome each time you listen. The best adaptation of a Christmas Carol. Musicals are not my first choice but this is fabulous. Ryan, Will and. Octavia are fantastic. Uplifting and comical.I have rewatched several times and the music has started to be catchy. This story is such a twist with the perp being an impact on the 'angel'. Each time the movie gets intense a comic relief comes making it viewable to teenagers.I would like to see this purchasable for year after year viewing. This has a good strong message of caring about your people you interact with.",
    "47": "Musicals are definitely something I dislike and I usually try to avoid them like the plague. I am also not necessarily fond of Christmas movies. But the Ryan Reynolds / Will Ferrell combo intrigued me and I thought I'd give it a go. I'm glad I did because I had a really good time and even though I didn't love the singing bits, I really didn't mind them at the end of the day. I also had a few good laughs along the way, and everything is wrapped up in a pretty decent production. It's definitely predictable and doesn't offer much that hasn't been done before but for once I'll keep my bah humbugs to myself and will recommend this movie!",
    "48": "As soon as they sit down in the pub... you can see what's coming from a mile away, and it's absolutely glorious. Couldn't help but smile pretty much all the way through.It's obvious that the film doesn't take itself too seriously right from the start, poking its tongue out at other musicals, but there is an underlying moral.The music is unmistakably Paul and Pasek and it's brilliant. If you like The Greatest Showman you'll love the songs.Take it at face value and it's really enjoyable, although I do love pretty much anything with Ryan Reynolds or Will Ferrell - and that probably says more about me than anything else...",
    "49": "As a Will Farell fan I got a few laughs out of the movie, but this one was difficult to see due to constantly facepalming myself. Is it a movie or is the whole thing a prank on an actor? A prank on the audience? What was the motivation behind this movie? How could they wake up every morning and go to the set with any kind of motivation?This movie had more wtf moments than anything I can remember seeing. Unfortunately I couldn't watch until the end because I felt I was going insane. Things happens without reasons. Sometimes they sang for no reason. The script is a mess, the Message is strong.",
    "50": "I was originally doubtful then I saw just how far past goofy this movie goes. And a musical? Oh, please, no. No singing please! But then there were the dozens of Easter eggs and previous Christmas Carol references to discover. 127 minutes of convoluted time lines and dimensions, trying to grasp onto some string of continuous perceptions only to finally realize ....you never will. You're in the middle of a giddy, wild, Sean Anders' retelling of A Christmas Carol and there is no keeping up. You'll either hate it or sit back and enjoy the ride. I'm adding it to my yearly Christmas rotation along with Elf, Scrooged, and A Nightmare Before Christmas.",
    "51": "The story is actually clever and well-written, with a good dose of comedy and heart to boot. Will Ferrel has further cemented himself in our Christmas lore, and his chemistry with Ryan Reynolds is energetic and fun. They could have cut a few songs; despite the film's self-awareness and tongue-in-cheek approach to the singing and dance numbers, it lagged in the beginning. They saved some of the better songs for the end, and the plot gets moving about halfway through. Bottom line, the musical numbers are a few too numerous and not particularly memorable, but aside from that you'll be pleasantly surprised by this flick. I will be watching it again at some point.",
    "52": "Will Ferrell - Ryan Reynold's comedy musical makes up for another entertaining Christmas movie. Will Ferrell plays a ghost from Christmas past who is in search of his annual unredeemable soul and finds him in Clint (Ryan Reynolds). Redeeming his soul is the agenda year and after a little nudging, ghosts of past, present and yet to come start with their year long research & preparation to redeem Clint. But he is one tough nut to Crack & will he be redeemed right on time for Christmas is what this movie is all about.With ever funny Will Ferrell & the charm of Ryan Reynolds, they got the casting right. To speak of the negatives, while the choreography was neat somehow the production design during all the songs left a lot to desire & felt there was use of too much green screen. Plus the movie is bit longer with a little over 2hrs runtime & they could've easily trimmed it by 20-25mins for better impact. They still get it right as it's all christmassy & this indeed is that feel good movie one expects to see during this period.",
    "53": "OMG! This was hilarious and very entertaining!! The best version of A Christmas Carol, ever!! Will & Ryan were a fantastic pick for the main characters. Their chemistry, dancing, and singing were phenomenal. I've never laughed throughout an entire movie until now. This movie will put you in the Christmas spirit and have you dancing and singing along. The remaining cast were also great. The comedy was heavy throughout. The song lyrics were spot on. We will watch this every year at Christmas time with our entire family. Really, truly a dynamic duo. The only thing can make a Part 2 better is to add Mark Wahlberg. Splendid!!",
    "54": "I had to watch this with a friend. I thought it would never end. The film is far too long, not particularly funny and the song and dance numbers were tiresome.Will Farrel is good but that's about it. Here are the other bad things about this tiresome movie, 2 hours taken out of my life which I will never be able to get back.The song and dance routines are very cheesy and they feel like they will never stop.I didn't feel that it should be on the big screen. This feels like a Hallmark TV movie.The film is shot perfectly and does look great, but that's about the only other positive I can think about this movie.",
    "55": "Ryan Reynolds, who emotes \"I am so gifted & wonderful\" all the time, joins the equally smug and smarmy Will Ferrell in this sad effort to milk money out of the Charles Dickens classic Christmas tale. The two giant egos of Ferrell and Reynolds don't really mesh well into a humble tale of Christian virtue, holiday cheer, and financially downtrodden families.Just the fact that Reynolds and Ferrell make more in a day than everyone else working on that movie earns in a year makes it hard to see them as sincere examples of altruistic love and charity. Even worse are the musical numbers, that were probably composed by computer software.",
    "56": "Would have, should have, could have been fantastic but the singing and dancing made this almost unbearable. And I love a good musical. This isn't that.Nor is it a comedy - despite the great cast. They do a great job but the final product is truly cringeworthy.Tells the story of those who bring the \"past, present and future\" ghosts to a person who needs to be redeemed. Led by Scrooge himself.The core concept has true potential but honestly I've never seen such a disaster of a movie emerge from something with such possibilities.If it were not for my kid I would not have lasted past a few minutes in. Save yourself the time and cost if you need to purchase if.",
    "57": "'Spirited' tells the story of the Christmas Past (Sunita Mani), Present (Will Ferrell), and Yet-To-Come (Tracy Morgan) - three ghosts who attempt to sway misanthropic jerks of their selfish ways in the span of one Christmas night. When Present becomes set on showing Clint Briggs (Ryan Reynolds) the error of his ways, the story takes a strange turn: can a 200 year old ghost really change a corporate dick?First, not a huge fan of musicals, but this one is kind of amusing. The film is largely based on the Ebenezer Scrooge story from Charles Dickens, 'A Christmas Carol', and often is self-aware that it is a musical. The script is solid and the flow is decent, but most of the focus is on the two main leads, leaving very little of the supporting cast to explore. Overall, a worthwhile seasonal film to share with the older children.Worth a watch!",
    "58": "My wife and I chose to start our Christmas movies with this one. \"Spirited\" is a movie that Ryan and Will can make BECAUSE they're Ryan and Will. The move was \"unredeemable...\" We even talked mid film about turning off. But we could not take our eyes off the car crash! We get the premise. But it's not worth two hours of your time! Yes, there were a few minutes and scenes we thought were ok! Octavia Spencer does a good job. But overall, the songs and dances were silly and overproduced. The film isn't written well. If you have a choice, make a better decision and choose something different. Save yourself 2 hours you'll never get back. You could probably get more out of watching the original \"A Christmas Carol\" again! We're not scrooges... I guess we just expected more from a couple of our favourite actors.",
    "59": "I see a ton of movies, and it has been ages since I've heard so much laughter and applause in a movie theater. I attended a screening of Spirited during Regal's Mystery Movie Monday, where no one in the audience knows what they're seeing until the movie actually starts. I had never heard of Spirited before I saw it and had zero expectations. No spoilers, but I will tell you that the entire audience applauded when the movie ended, then stayed for the previews and applauded again when the previews were over. There was not one person in the crowded theater who was not smiling as they left. Spirited is a happy movie starring beautiful, talented actors. The singing is fun. The dancing is phenomenal. The costuming is clever. The story is funny, thoughtful, and precious-in-a-good-way. What's not to love? I only wish it had opened in more theaters so I could see it again on the big screen, but I can guarantee I will be watching it multiple times on AppleTV+. We'll done, Apple!",
    "60": "Could not make it through this bloated misfire of a Christmas movie. This felt like it was made in a laboratory to construct a tiresome, conspicuously inclusive Xmas movie, and in doing so it's devoid of any humanity, heart or soul. Its theatrics reminds me of the Cats movie. Trying too hard and knowing too little about what makes a good festive film. And a terrible waste of some very talent actors. I also don't think the creators knew what they wanted to do with this movie. Frequent out-of-place foul language means it's definitely not gonna be seen as a family film, and yet, it is filled with childish moments. Ultimately, there are a few great songs and amazing/ inventive dance sequences.",
    "61": "Will Ferrell is one of the unofficial kings of Christmas thanks to his portrayal of Buddy the Elf nearly 20 years ago. In 2022's Apple TV+ original 'Spirited,' Ferrell gets another crack at trying to claim the holiday as a new age ghost of Christmas present.If there ever was a Christmas movie that was mismarketed, it's this one. 'Spirited' is a long, drawn out musical that stretches the limits (and vocal chords) of its cast. While Octavia Spencer impresses as a conflicted executive assistant, Ferrell and Ryan Reynolds remind us why they are actors and not singers, no matter what they may think of their abilities.'Spirited' is an unnecessarily sugary sweet, over-the-top production that tries too hard to be a holiday mainstay like 'Elf' before it. Just be sure to have your noise-canceling headphones nearby.",
    "62": "Musicals are divisive- and they address this in the first scene. There are so many great jokes a rewatch is needed to catch them. I'd like to imagine this movie was based on John C Riley lording over his musical turn in Chicago over Will F. And Will was like dude - hold my beer- I'll see you a musical and raise you tap dancing with Ryan Reynolds. Even if that's not how it happened this is our new family holiday classic. Little Larry and the gang knock it out of the park. Stay for the end credits too, you don't want to miss one note of this modern family Broadway production level masterpiece. Good day!",
    "63": "It's \"Riverdance\"! No, wait. It's \"Oliver!\" No, wait. It's \"Cirque du Soleil\"! No, wait. It's every musical that's ever been written. No, it's the embodiment of Andy Warhol's prediction that \"Everyone will be world famous for fifteen minutes.\" I mean, oh my god, every singer and dancer in NYC was used in this production, and it looked like they had all taken happy pills. And... budget? Sky was the limit. No matter what the cost, Apple TV said: \"Let them have it!\" So, uh, yeah, wow, tons of big giant sets and big stars, and singing and dancing and laughing and... And yet...\"Spirited\" looks and sounds like the creators ingested hallucinogenics and said, \"What if...?\" It's like a boomerang inside a giant bouncy house. It ranges from insane to hysterical to ludicrous to outrageous to pathetic to stupid to \"wow, that was pretty good!\" to, \"WTF were they thinking\" to facial reactions only seen on people who are desperate, panicked or high. Or desperate and panicked. And high.\"Spirited\" takes the beloved \"A Christmas Carol\" and drags it unwillingly deep into some other universe that has its own rules, and assumes (wrongly) that its audience will happily go along for the ride. It also has decided that while \"diversity\" among cast members is essential, the entire universe is still essentially run by a straight white man (Ryan Reynolds, who, yes, is hot). A thesis could be written about what is not right with this movie, with elements ranging from: A cast of thousands does not make a better movie; endless chatfests between your leads (Ryan Reynolds and Will Ferrell) does not mean your audience will be engaged; we love Octavia, but she can't really sing; who was the woman in the hideous orange wig at the end (we basically forgot about her); and, perhaps most importantly: does Will Ferrell look like he's emoting or about to morph into a serial killer? There were fun moments, perhaps the best of which was \"Good Afternoon\" - hysterically funny, except for the massive number of \"singers and dancers\" all desperately mugging to get their moment in the sun (exceptions made for Dame Dench, who makes a brilliant cameo). There were thoughtful, intelligent, Broadway-esque songs (\"The View From Here\") sung, bravely, by Octavia Spencer. There were other songs which were not memorable, interspersed between interminable scenes where my husband and I looked at each other and said, \"What are they going on about?\" There was also the extremely questionable use of a child's death to get \"Clint Briggs\" (Ryan Reynolds) to rethink his strategy of telling his niece how to become popular at school. The vast number of people involved in this film truly boggles my mind. Also, it boggles my mind that someone not only greenlighted this, but apparently gave the production carte blanche for stars, sets and anything else that could remotely be needed for this bloated madness. I cannot say that this didn't have laughs; it had a lot of them (many unintentional). I cannot say that it didn't capture my attention (but it took about an hour for it to do so). I cannot even say that I won't watch it again, because if one can look past the myriad of mistakes and problems, there were some flashes of great entertainment. Mainly, though, it's fascinating to watch just from a \"huh?\" perspective.",
    "64": "Love the humor combi of Will Ferrel and Ryan Reynolds. Love that the musicals are maintained fun. The movie also maintained the christmas theme. Just love love love this movie. All my favorite stars are in it too. Perfectly balanced. Pls keep doing more movies like this.This is such an exciting movie for the family (for kinds 15 and up, because of some of the cuss words hehe) other than that, it gives lessons, adventures, magical creatures etc. I hope i've covered everything as I am not very good with reviews. In fact, this is the first time i created an accnt just post a review. HOPING FOR SPIRITED 2!",
    "65": "It appears that the ghosts of Christmas Past (Sunita Mani), Present (Will Ferrell) and future (Tracy Morgan) are at work every year saving one person at a time. The film opens as they are saving a Karen (Rose Byrne). They have a rather large department of people and BTW this is a musical for those that love flash mobs. Other people who were changed included Dolly Parton and Colonel Sanders. While scoping out their next person to reform, they bump into Cliff Briggs (Ryan Reynolds) who is a PR man. Will Farrell wants to do him instead as he is a real influencer, a combination of \"Mussolini and Seacrest.\" Jacob Marley (Patrick Page) claims Briggs is a lost cause. \"UNREDEEMABLE.\" Farrell insists. The afterlife is no match for Ryan Reynolds who plays is cocky comical self in a battle of wits against Will Farrell who is also trying to find himself.This is an enjoyable twist, if not a spoof of the Dicken's classic. Octavia Spencer plays Cliff's assistant. The Judi Dench cameo was priceless.Guide: No F-word. Implied sex. No nudity. Will Farrell gives us the finger at the end.",
    "66": "This is a fresh and witty twist on the classic tale. I won't spoil the movie and tell you what the twist is, but it's very interesting to say the least. The musical part doesn't disappoint, there's many beautiful numbers in this movie. I'm a little surprised that Will Ferrell can sing THAT good. This is a very good Christmas movie. Not so rigid and PG 13 as usual, which makes it better than the others. Don't worry, you can still watch it with your kids. There's no actual vulgarity, just a little reflection of what we all see and hear every day but had to pretend it didn't exist to be polite. There's also a bittersweet final plot twist at the end of the movie. Which makes this movie even better than it's predecessors. Just watch it! You won't regret it!",
    "67": "Thoroughly enjoyed this gem of a Christmas movie! Pleasantly surprised by the singing and dancing talents of Will, Ryan and Olivia. Will Ferrell solidifies his status as a multi-faceted talent. Ryan Reynolds was at his funny and charming best. Great 'bro-mance' chemistry between Will and Ryan. Several laugh out loud moments. A meaningful message and timely moral of the story. Catchy songs and great dancing. I was worried about the length but it moved along well. My co-watcher hates musicals but reported enjoying herself. Best feel-good Christmas movie I've seen in a while. I'll keep this one in my annual holiday repertoire for sure!",
    "68": "A few minutes in and my first thoughts were \"if you are going to do a musical scene, don't cut it to add dumb jokes\" and a \"I have a tramp stamp on the front and the back\" line is the kind of crap I would expect from a Sander's movie.. But Jolly Rogers does this get better!! In fact, I haven't enjoyed a production as much as this one.It is truly and utterly enjoyable XMAS release! The efficiently presented characters and their development, production, choreographies, camera-work, the contagious energy, the impressively memorable songs, the merging of reality and musical, and the story-telling simply blew me away! The hard work, care and respect for the viewer is palpable.. in a way I thought was no longer possible. Every actor shines, and Octavia Spencer gets a truly good role for once!!I see myself re-watching this every year or so, if not for the brilliant songs alone.",
    "69": "Well, for starters I am ecstatic that so many young dancers were employed for this movie. They need the work. Speaking of talent....there are actors that can actually sing. They exist and they are awesome. Will Farrell really can't, Octavia Spencer does better than J Aniston did (on The Morning Show) and Reynolds is talk singing ie: Rex Harrison in My Fair Lady. If you're going to make a musical, hire stage actors. The days of Marnie Nixon voice overs are gone. The writing is good and the fx and the scenery. All cool. I even liked the goofy story. I still can't decide if Ryan is hot or not, it's really weird. I get it, big names sell, that's why Ashley Hamilton was played by the most wrinkly beta boy I've ever seen. But everyone evolves. Musicals require actors blessed with gifted vocal cords. Hire those people. Or maybe bring back the vocal fakery. While giving the artist credit. What a mess. It's entertaining but just imagine if your favorite stage actor were singing..sigh.",
    "70": "RATED 8/10\nLanguage: English\nMedia Partner: Apple TV+\nRECOMMENDEDThe first plus point is the lead characters and cast. The second best is the music and their placement. There are some brilliant scenes where they poetically gelled with Christmas and celebration.There are some overdose of sentiment scenes and bit stretched scenes add the speed breakers to the movie flow. The unredeemable sequence is very thin and not so convincing. As this is base for the movie, it make the audience bit out of the flow.This is not perfect entertainer, but good enough to watch with family on holiday. Worth the watch.",
    "71": "This movie is fine. It's a cute concept. What I find frustrating is seeing the same faces over and over again when we all know there are SO MANY talented Broadway dancers and actors that could do a far better job without charging $20 million for their salaries. I get Apple TV+ was looking for faces that could draw in new viewership but I felt kind of tired as I watched this because I can't remember a time when Ryan Reynolds played a character that wasn't just Ryan Reynolds... Or when quips weren't expected to the point of predictable...Anyway. This movie is fine. It has some cute moments and some funny jokes. But there was a soullessness to it that seems ironic given the topic of the film.",
    "72": "NOT a movie for kids. Let's start there, lolSpirited is a fun fun fun Christmas movie. Wholly unexpected, totally amazing. I was prepared for cheese, got strikingly well done comedy and dancing and acting and song writing.Ryan and Will feed off each other perfectly. While clearly not musical performers, they did a good job. Octavia was lovely. All of the actors, really - just so well done.I was thrilled by the level of musicality. The choreography was STUNNING.I don't know who or what happened to make this Christmas Miracle happen, but I hope they do more fantastic projects in the future.",
    "73": "Others rated it who say they normally don't like Christmas movies liked this one because it's not much of a Christmas movie. Most of the movie is singing, so not much of a plot. I didn't care for it. I'd say the funniest part of the whole movie was when the guy ran into the post. So that tells you how funny this movie was. They really didn't need to twist \"good afternoon\" to mean a bad thing. Now I'm never going to say it again. They also didn't need to add the finger in the end. There's enough shoes that have that crap in it. Overall, I wasn't impressed and won't be watching it a second time, and definitely not worth paying for.",
    "74": "I was excited for this movie. I love a christmas movie and a musical so the fact that both would be combined sounded amazing. But I feel that the music wasn't very good. None of the songs felt emotional or left an impact on me personally. The three main stars were good and the movie's saving feature, in my opinion. It felt a little long and the plot wandered before getting to the main point. Overall, I feel this movie could have been so much more but it was ultimately quite forgettable. On the other hand, it isn't the worst Christmas movie I've seen by any means and does have some entertaining moments, which makes me feel like it's not a waste of time to watch. In sum: it's okay, but a little bit of a let down.",
    "75": "OK. Full disclosure. I hate musicals. I love music. I love drama. Putting the 2 together is like putting fish on bicycles or about as much use as a chocolate teapot.Why take two of the best comedic talents In the world and get them to sing and dance? No really, why?Also I can live without another retelling of Christmas Carol. Honestly, the royalties that that this Chuck Dickens must be getting over writing this one book must keeping him in quills and parchment for life!!I am writing this while watching it. I am missing absolutely nothing. I guess Apple must have cut some huge cheques for Reynolds and Ferrell. You have been warned.",
    "76": "Instant classic! Worlds top actor, global icon & most innovative dancing you've ever seen!! This film is an epic journey to a land of happiness filled with laughs, lessons, & riveting storyline. The classic tale seamlessly integrates itself into our modern day technology driven world.Oscar level writing & the performances were of that Caliber too. If more films boldly created experiences like this the world would be a better place. Elated to have experienced in theatre and want to see again at home. Traditionally musicals are boring, repetitive and lack flavor, however I found myself singing aloud and dancing in my seat. Breakthrough performances that are touching & songs that you'll be singing year long to yourself.",
    "77": "I wasn't expecting much, I mean what else could they do with this story?Will and Ryan pair well together, so much, I'm hoping they make another buddy movie together!A nice breakaway from the traditional repeat Christmas movies you watch every year an 100 times better than any Hallmark or Netflix Christmas movie!I will admit that some of the storyline and jokes are definitely for the older crowd. We watched it with my 16 year old son but if he had been 13 or below, we probably would've turned it off and waited until he went to bed to finish.Definitely a Christmas movie that will make our yearly Christmas viewing list! Enjoy!",
    "78": "Ok it has a lot of music and dance though its Revive the old soul , morality , values is not things we can see in comidy movie today , I not say that i love this class but it has been so long that i haven't pick this taste in such a pretty good effort .Ryai reynold man i love your works i don't know how or who you are in your life but that selfish clent who make allways the setuation for him self though the best thing that i love about him is his best Christmas, thats make\nme really was disappointed when they give the child that present his past the puppy .Thank you for Reading this With all my regards MR. Amg.",
    "79": "I came in to this with fairly low expectations, and was pleasantly surprised. There are some laughs here, but also some good dramatic moments. The musical numbers are fun, but not songs you'll get stuck in your head. I think I would have trimmed a couple numbers, and shortened the movie by about 10 minutes. It does feel like there are several endings. I could definitely see this being a new Christmas classic that people watch around the holidays. It's the best movie Will Ferrell's been in in quite a while, and this is one of Ryan Reynolds' better roles. After seeing this you'll think twice before you wish someone Good Afternoon.",
    "80": ". . . film buffs and Tinsel Town pundits are ferociously debating whether this year's major Holiday Time musical remake--SPIRITED--will garner more of the coveted gelded statuettes than last year's recycled song & dance spectacle, WEST SIDE STORY. On the one hand, the latter picture's director--Steve Spielberg--is better known in some circles than the producer\\writer\\director of this season's melodious extravaganza, Sean A-n-d-e-r-s. Even this site's spellchecker favors Steve. However, it is important to keep in mind that STORY only managed to walk away with a single statuette, despite racking up seven nominations through its massive publicity campaign. Can SPIRITED match STORY's lone win in the Best Supporting Actress category? True, Dame J-u-d-i D-e-n-c-h was snubbed at this year's Golden Globes for SPIRITED, but hers was a non-singing role. Octavia Spencer, on the other hand, demonstrates that HER pipes can feel pretty pretty, as well. Do not be surprised if Mr. Ferrell and Mr. Reynolds join Octavia on the winners' podium shortly.",
    "81": "Bouncy music numbers, well done singing (sans Will), clever witty comedy, a feel-good ending you see coming a mile away. All for a movie trying to be the modern Christmas Carol \"with a twist\". Unfortunately it comes down to deceptive morals, bad (morally) characters, and no real resolution.The core concept of the Christmas Carol, and it's relation to Christianity, is that a person needs to choose to reform. That in order to do good and become a better person, they need to take a first step. Spirited says thats nonsense since you can't change all and once so there's no point and it's ok to be bad so long as you do some good works occasionally. That doing anything is acceptable as long as you get what you want it's not clear how your bad actions affect people. This is straight up evil presented as good.",
    "82": "Not really funny. I found myself saying out loud at one scene about 30 minutes in, \"That's the first funny moment of the movie.\" (Which is surprising given the fact the two main characters are known for their humor.) I started counting how many funny parts there were from that point on because I was waiting for it to rise to the caliber these two actors are known for. I counted only three funny bits throughout the movie, and here they are:1: When the Marley haunt leaves, one of the weights hits Reynolds in the face.2: When Ferrell's character gets frustrated with Reynolds, he freezes time and slaps him in the face.3: When Ferrell tells Marley \"Good afternoon\" in a high voice.",
    "83": "If you liked Bill Murray's Scrooged you'll enjoy this. I'm a sucker for a good Christmas movie that is more than just a rom com. A good Christmas movie needs beautiful sets, charismatic cast and a story line linking in a lesson on Christmas spirit. This movie has it all. I wasn't sure I would be a fan of the music aspect but it added more humour to an already delightful movie.The ending has left someone with a bitter taste in their mouths but I think it's perfectly written because the whole point is a sacrifice isn't a sacrifice without a cost. They do try to tie it up with a bow showing he is able to pop back and forth and I think that eliminates any real sadness the audience could feel.This movie is fun, engaging, and well worth a watch. I don't know if it's something that I'll rewatch religiously every year but it will get another viewing soon.",
    "84": "Spirited definitely works better as festive comedy than a musical and it's run time may be a little too long but it's still a really good postmodern reinvention of A Christmas Carol that delivers all the fun, feels and unique ideas you'd expect from this premise.Will Ferrell plays mostly to his awkward strengths whilst showing off some pretty good dancing, a solid singing voice and great chemistry with Ryan Reynolds who also plays to his strengths whilst offering a nice reminder he's more than the sum of his quips.Sean Anders' direction is really good, the film is suitably colourful and warm with musical numbers of an impressive scale but the CG is hit and miss. The songs by Benj Pasek and Justin Paul are enjoyably fine, super energetic and joyful in the moment but nothing too memorable or truly catchy.",
    "85": "The movie showed promised with an unique twist to A Christmas Carol! However, each time the story started to unfold and gained your interest, the actor burst into song! It ruined a good movie plot, with terrible music, dance sequence that did not fit the storyline and mostly actors who could NOT sing! When you create a musical, you don't hire Ferrell and Reynolds to be your leads!Love the idea of Scrooge being the Ghost of Christmas Present but is still haunted by his past wickedness. The obvious giveaway was \"Jacob\" being in charge of the annual Christmas haunting, but still a nice and unexpected story on the onset of the movie.I wish they would recut a version and take out all the singing and have a movie that could be rated much higher and become a new Holiday Classic!",
    "86": "If you enjoy reading my Spoiler-Free thoughts, please follow my blog :)\"Spirited efficiently applies a Christmas formula. Harnessing the undeniable, palpable chemistry between Ryan Reynolds and Will Ferrell, along with original holiday tunes filled with the typical humor from the actors, Sean Anders delivers a musical entertaining enough to entertain the average spectator.Not all the songs succeed, nor their timing in the story is always the right one, and the generic narrative doesn't exactly help with the surprise factor. Still, I'm happy enough with the essential message that people can, in fact, change for the better.\"Rating: B-",
    "87": "This thing was all sizzle and no substance, a tired retelling of A Christmas Carol just packed to the gills with forgettable songs and generic dance numbers. If they were going for a Christmas classic, they missed by a mile because there was no heart beating in the chest of this monster, just sly quips and asides. It's trying to be too cool for its own good, with both Ferrell and Reynolds regurgitating the same old chops we've seen a dozen times before, adding nothing new or fresh. The Christmas classics mentioned earlier may seem simple, maybe even maudlin by today's standards, but that makes them all the more heartfelt. I couldn't discern anything heartfelt in this movie, just contrived and calculated to elicit an \"emotional\" response.",
    "88": "\"Spirited\" (11/18/22, 120 mins, Apple+) stars Will Ferrell and Ryan Reynolds in a definitely different take on the Cmas classic. This could've been something you'd want to see annually but it's warped by Hollywood's liberal/progressive values yet again, but if you're under the age of 25 you probably don't even know or care. Anyway, the storytelling is further marred by it being a musical, and even that's forced. It's mostly karaoke-quality singing especially when done by Will and Ryan and even the characters often exclaim \"oh no, not another one.\" Will Ferrell, sporting a facelift, seems to be the only one decently cast for this. Ryan is way over-qualified and Octavia Spencer - just how did they talk her into her role?! Again, this could've been Great with better casting and much less singing.",
    "89": "Everyone in this movie seemed to genuinely have fun with the story and their characters. Reynolds and Farrell played perfectly off each other and the songs where just spaced out the right amount.Sit back relax and enjoy the show people.The \"twist\" is fantastically delivered and leads to one of my favourite songs in the entire movie.My only negative is what was becoming the best song in the movie got interrupted and never ended.Will definitely become a regular in the cycle of Christmas movies in our household.Hopefully apple doesn't drive it into the ground with unnecessary sequels or spin offs like every other well made movie gets these day.",
    "90": "I only found out about this film after seeing the poster, it sounded like a modern retelling or twist on the Christmas Carol story, and I was interested because of the star of Elf being in it, so I went to the cinema to see it, written and directed by Sean Anders (Sex Drive, Horrible Bosses 2, Daddy's Home). Basically, for nearly two centuries, Jacob Marley (Patrick Page) and the Ghosts of Christmas Past (Sunita Mani), Present (Will Ferrell) and Yet-To-Come (Loren G. Woods, voiced by Tracy Morgan) have led a team of afterlife spirits who help and redeem a human soul or \"perp\" every Christmas (\"That Christmas Morning Feelin'\"). The Ghost of Christmas Present has been eligible for \"retirement\" for decades, and despite being tempted by the promise of settling down and having second chance at a human life to make up for his own past failures, he refuses to do so (\"Present's Lament\"). The spirits look for a new soul to redeem, they have their sights on bossy hotel manager Mr. Alteli (P. J. Byrne), but Present believes it is Clint Briggs (Ryan Reynolds), a renowned controversial media consultant (\"Bringin' Back Christmas\"). Marley insists that Briggs is an \"unredeemable\" soul, but Present believes that his redemption could have a \"ripple\" effect, making him a force for positive change in humanity. The Ghosts begin a year of research on Clint, preparing for the annual haunt. As Christmas approaches, they visit Clint's headquarters and meet Clint's assistant Kimberly (Octavia Spencer) and Clint's niece Wren (Marlow Barkley). Wren wishes to be class president, and Clint suggests she should tank her grades and post an unflattering video of a classmate who is running against her. Kimberly finds the video but feels guilty about potentially posting it and almost quits her job, but ultimately does not (\"The View from Here\"). Things get more complicated when Christmas Present is unexpectedly seen by Kimberly. They start the assignment, but it quickly goes awry when Clint interrupts Marley (\"The Story of Your Life (Marley's Haunt)\") and easily seduces Christmas Past, forcing Present to take over. Clint is dismissive of Present and resists his past memories, particularly that of his ex-girlfriend Nora (Aimee Carrero), who broke up with him over his selfishness, and his older sister, Carrie (Andrea Anders), who asked Clint to raise her daughter, Wren, while on her deathbed. Present realises that Clint's case requires an unconventional approach, so he takes him back into his own past, revealing that he was once Ebenezer Scrooge, the only other unredeemable soul to go through the program (\"Good Afternoon\"). Marley is furious and orders Present to \"stick to the script\" in finishing Clint's redemption. Present brings Clint to Nora, who is happily celebrating Christmas with her husband and kids, but Clint deduces that Present longs for a happy family life himself, and that he has feelings for Kimberly (\"The Story of Your Life (Clint's Pitch)\"). Present dismisses the idea and then shows him Wren's classmate's reaction when he sees she posted the video. He then finally forces Clint to relive his sister's dying request to raise Wren, where Clint turns her down and passes the responsibility onto their younger brother Owen (Joe Tippett). Present prepares to leave Clint with the Ghost of Christmas Yet-To-Come but Clint forces Present to confront his own fears of whether he was truly redeemed, since he had only lived for three weeks after his encounter with the ghosts and convinces him to consider retirement and return to Earth (\"Unredeemable\"). Present does so, he and Clint wake up in Clint's apartment, and Present asks Kimberly out on a date (\"The View from Here (Riverwalk)\"). Clint is visited by Yet-To-Come and shown glimpses of the future, including the suicide of Wren's classmate. Clint is shaken by this vision and runs away the haunt but is intercepted by Past and Yet-To-Come, who force him back to Earth. Returning to his apartment, Clint and Present race to stop Wren from posting the video. Kimberly catches up to her and stops them, explaining that she told Wren not to do it and that she is quitting her job. Present is jubilant and waits for Clint to receive his congratulations from the ghost crew but is confused when they do not arrive. Clint explains that all he did was redeem a mistake and that he hasn't changed but convinces Present that life is still worth trying and offers his friendship. Present, convinced he is unredeemable, tries to jump in front of a bus to return to the afterlife and his job. Clint pushes him out of the way and time freezes before the bus hits him. The spirits arrive to finally congratulate him (\"Do a Little Good\"), redeeming himself by saving the life of another. When time resumes, the bus hits Clint, and he is killed. Clint is reunited with his sister Carrie but doesn't want to leave Present behind, and he makes a proposal to Marley. Several years later, Clint has assumed the role of the Ghost of Christmas Present and is in a relationship with Past. He is expanding the program to include other holidays, take on more perps every year, and Carrie is part of the staff. He also regularly visits Present, now going by Roberto, who is married to Kimberly with two children, and he continues to help his friend with advice on redeeming souls. Wren has grown up and has been accepted into Stanford (\"That Christmas Morning Feelin' (Curtain Call)\"). The end credits include the full cut song \"Ripple\" (which is ironically one of the best songs). Also starring Jen Tullock as Wendy, Rose Byrne as Ms. Blansky, Gavin Maddox Bergman as Oliver Twist, Dame Judi Dench as herself, and Jimmy Fallon as himself. Ferrell is alright as the semi-superior of the spectres, Reynolds is okay as the amoral PR guy, their attempt at a bromance is reasonable, and Spencer is likeable as the morally challenged assistant. I agree that this movie is messy, it lacks focus on the plot and the singing ability of Ferrell and Reynolds is not the best, but the songs (the same lyricists as The Greatest Showman) and the dance sequences are energetic and colourful enough, it made me titter a couple of times, especially the \"Good Day\" joke (a way of saying \"F off\" in the Victorian era), and the Christmassy feel is strong, it is an average seasonal musical comedy. Worth watching!",
    "91": "I thoroughly enjoyed every moment of this film! Great cast and the musical with comedy and the more modern twist of the classic Scrooge tale I just thought was perfect. Will Ferrell and Ryan Reynolds compliment each other's acting so well, and I'm their usual way, they had me laughing out loud at some bits, but then really buying into the emotion of it in others too. It's uplifting and just something a bit different which I think is the best thing about it.It's only a shame it's only for Apple TV subscribers as I think this would have been a great cinema release in comparison to the other rubbish released at the moment!This film definitely put a smile on my face this Christmas Eve - thank you!",
    "92": "Spirited is literally everything I wanted from a Christmas musical and so much more, it is so, so good, I truly adored this Apple TV+ original and anyone who is a fan of musicals should check it out, you'll be treating yourself to an amazing time.Wow, Ryan Reynolds, I truly cannot get enough of that man, I will watch anything and everything he is in, he puts on a truly brilliant performance in this and his chemistry with Will Ferrell is absolutely unmatched, this film truly takes the viewer on a beautiful journey about redeeming yourself that made me cry inside.The musical numbers were absolutely spectacular, they were both marvelously choreographed and truly brilliantly hilarious, even though this movie was 2+ hours it somehow managed to just keep me wanting more the entire time.Spirited gets an A.",
    "93": "This is a modern musical take on the Christmas classic Dickensian tale, A Christmas Carol starring Will Ferrell and Ryan Reynolds.It is well done with neat effects, lavish song and dance numbers aplenty, fresh comedic takes on love at the holidays and full of heart with all things family.It is as fun as it is endearing.There is a fascinating twist involving the origin of Ferrell's character and his actual identity in the film and from whence and where he actually came from.Ryan Reynolds always does what he does best and does it here as well, and that is, basically being Ryan Reynolds. But here he also sings and dances and does both quite well.My favorite song in this production is, Good Afternoon! This is an entertaining and funny bit as well as a running gag throughput the remainder of the movie which makes it all the more enjoyable.Are there better movie versions of A Christmas Carol? Yes. Of course.I love Disney's A Christmas Carol, The Muppet Christmas Carol, Scrooge, and Scrooged.Are there better movie musicals? Absolutely.La La Land. Moulin Rouge for starters.But this is a nice, comedic Christmas musical very much in the holiday spirit and should be experienced as such.And it should be seen and heard in the theater.Maybe go to a matinee. Good Afternoon!",
    "94": "This was great fun.It is over the top, corny, sickly sweet and full of niceness.My take is that the musical pieces are over the top on purpose - as alluded to by several characters. It is meant to be cheesy. Its meant to be self aware and mocking the genre.There are references to lots of other movies and musicals all over the place, but if I had to classify it I'd say its part traditional scrooge, part scrooged (the Bill Murray movie) and part greatest showman (so much so I was expecting Jackman to make an appearance).Its very meta in places. Its self referential.The songs are funny and over the top.The three leads are fantastic.The whole thing is played with much gusto.And this is coming from someone who loathes musicals.Its also very funny. Ferrell was born to play the role he is playing here. Reynolds is close to the type of character he is known best for - but it works well (thats not a criticism - I think he is very well cast). Spencer is perfect - bringing some heart to proceedings.Don't take it too seriously - its fun.",
    "95": "There isn't much deep things to say about this movie. It's a new spin on The Christmas Carol, it's a comedy musical and it's incredibly enjoyable.In my opinion it starts a bit boring but then it really picked up when the story actually started to happen. It brings something original to the iconic Christmas Carol, it's funny and the songs are catchy and fun.If you're looking to watch something Christmasy and you like musicals this is a must watch. Absolute delight for a family, even though I'm single and I watched it alone in my couch while eating crisps lol.My only negative opinion is that the humour can be a bit cringy sometimes but that's okay, it made me laugh too! 8/10, I'd definitely recommend. Well maybe not if you don't like musicals and people bursting into songs or Christmas.",
    "96": "I don't like Christmas movies, I don't like musicals, and guess what was the Monday mystery movie... yup, a Christmas musical. So clearly I'm not the target audience, but I try to watch everything so here we are. So many people walked out as this was the Monday mystery movie, it was actually disrespectful. I saw a leak post earlier saying it was going to be spirited so I was a little mentally prepared and actually tried to enjoy it.Pretty upbeat just like any other Christmas movie. It starts out as a kid's movie, guess most musicals are, but still has some 'dirty' jokes as it goes on. Runtime's way longer than the actual plot was due to the singing. It got a couple good laughs; at times felt more of a comedy than musical. A good blend of Reynolds and Farrells humor, if you're a fan of either you might enjoy it.Actually could have been more bearable for me if it wasn't a musical, every time I was about to forget it is someone started singing; after a while there's longer periods between the songs, and other moments when songs are squeezed together, mostly at the beginning of the movie and at the end. So there actually wasn't as much singing, you almost forget it's a musical in the middle.I think the camerawork and production set felt like it was set up on stage so it felt like a theatre play. Songs aren't as catchy, I only recall if two that had me.The story is pretty predictable on how it's going to end, it's just the journey of getting there. My favorite parts were when the singing was abruptly cut, singing aside its a decent movie. I just want to say you don't have to make a Christmas movie every year, it's almost impressive how they keep churning them out. I don't think this is a terrible addition, but Love, Actually is still the only Christmas movie I actually love.",
    "97": "Seriously...people have given this movie low ratings because they just don't like musicals (then don't watch it). Or it's too long (it's not). Or they failed to research the movie and thought it would be family appropriate (it's really not).I have it a perfect rating because this movie is funny, witty, and a nice fresh take on a worn-out story. The whole concept of a 'behind-the-scenes' look at 'A Christmas Carol' is brilliant.Will Ferrell and Ryan Reynolds are hysterical as they play off of each other...Reynolds plays up the 'I am awful, I know it, and I am not doing what you say' to Ferrell's 'you will be redeemed if it's the last thing I do' attitude perfectly.And yes, there is singing. And dancing...oh so much dancing. Because it's a MUSICAL. The songs are funny and the dancers are awesome.And don't forget the gem that is Octavia Spencer. I was so happy to see her in this film.Give this movie a chance. You won't regret it.",
    "98": "Christmas movies are already upon us, and major streamer Apple TV hopes they have a new holiday classic in \"Spirited,\" a big-hearted-but-clumsy riff on Charles Dickens' A Christmas Carol with two of the most likable movie stars alive. \"Spirited\" is like a big goofy puppy in how much it wants you to like it, and that eagerness to entertain can be its greatest strength and biggest weakness at the same time. It's overstuffed, cluttered, way too long, and ignores some basic tech elements like coherent editing and production design. The team thinks they have a perfect choice in a Vancouver hotel manager who yells at janitors, but the Ghost of Christmas Present (Will Ferrell) runs into a speaker at the hotel named Clint Briggs (Ryan Reynolds), realizing he is the white whale. Briggs is a social media manipulator, introduced singing a song-oh yeah, this is a full-throated musical-about weaponizing the war on Christmas for profit. Ferrell's ghost becomes obsessed with redeeming Clint, even as the other spirits (Sunita Mani plays Past and Tracy Morgan voices Yet to Come) get sidelined. Surprisingly, \"Spirited\" becomes as much The Ghost of Christmas Present's tale as it is Clint's, as Ferrell's character wants to leave it all behind and become human again, especially after finding an unexpected reason to rejoin the mortal coil. Despite all of those flaws, \"Spirited\" is a hard movie to slam. There's a \"let's put on a show\" energy in the performances of Reynolds, Ferrell, and Spencer that's easy to like. No one is phoning this thing in (even if Ferrell might have been served by another singing lesson or two) and that kind of energy can be infectious. Holiday movies don't have to be perfect. We kind of like them when they're a little rough around the edges, something that can boost the mood of an entire family over winter break as they've turned off their critical weapons and just want something that goes down easy. In that \"spirit,\" this one works. All of this is told through the hyperactive energy of what feels at times like a draft for a stage musical both in function and form. Musical numbers explode with choruses of backup singers/dancers playing to one side of a set as if they're on a stage. The sense that you're watching a filmed stage musical extends to the production design, which often looks like cheap sets or green screen backgrounds instead of actual physical spaces. And the writing has that Broadway tendency to hit a few of the same beats over and over again, especially in the final acts of the film, which push this overlong musical to over two hours.",
    "99": "You hope for a Christmas movie to warm your heart like a cup of hot chocolate with marshmellows by the fireplace on a cold December night, but Spirited was more like entering the mall and hearing a Mariah Carey Christmas song for the 20th time of the season, so that's not so bad.Will Ferrell & Ryan Reynolds' chemistry is what elevates it above average despite the lively & colorful musical numbers this felt slightly overdone & overcooked. At the end of the day, it made me laugh and made me feel happy. A fun modern twist on the classic story.Another big positive is the music, for fans of musicals there is a lot to unpack here and surprisingly both Ferrell & Reynolds can hold their own singing and dancing. So I'm not going to be a Grinch here and say I didn't like it, because I did. It's just... a bit much at times.6.5/10.",
    "100": "The good: The production is well done, with a decent mix of singing and speaking - with one not overstating the other. There's no outstanding musical number but all the songs are serviceable to the plot / characters. Props also for trying to do something different.The bad: The film's muddled messaging and plot are probably what brought it down mostly for me. The film literally jumps between story and character threads making the film feel aimless and lacking a consistent arc. The movie drags in the third act with inorganic scenes popped from an SNL skit feeling tacked on to each other as the movie jumps to where the plot demands it be. It's also not that funny. You'd think with Ferrell and Reynolds there'd be some comedic gold. But really, it's just a couple of nice-looking rocks scattered throughout the film's 2 hour runtime.Summary: You can see what the film/musical was trying to do. But the lacklustre singing numbers, excessive runtime and muddled messaging really hinder the film. It is an ok musical which tries hard to be 'spirited' but ends up lacking a soul. I've watched it once, and that's enough for me.",
    "101": "It was a showing at Regal on 11/7. I had 0 idea what movie I was about to watch. Credits; Will Farrell. \"Hey this should be interesting.\" Ryan Reynolds. \"Farrell + Reynolds, this might be super good.\"Bottom Line: Movie was comedic and touching. You'll laugh and tears will well up occasionally.Cons First:\nSometimes jokes were pushed. They were ok but didn't fit and weren't necessary.Sometimes movie jumped/cut unnaturally. It wasn't horrible but wasn't as natural as it could have been.Pros\nI don't really like or care for musicals. Music and dancing were surprisingly good and didn't feel forced. A little bit forced in the beginning, but changes in first act.The relationships between various characters were deep and they developed. Even the relationship between \"New Scrooge\" and his Ghost of Christmas Past/Present.The plot keeps you interested because it's unpredictable, but what happens makes sense.The plot fits our world now \"politically\". It shows all sides and doesn't claim there's on answer. All sides have something good to them. Let's focus on seeing the good in people. Let's improve our bad qualities.",
    "102": "The premise is fantastic. It owes a lot to Scrooged and Golden Era screwball comedies. It is quite smart and funny. The singing, dancing and acting is competent. And the direction of the musical numbers is innovative.But that is the main issue, it is over-the-top with too many sound-alikes tunes that it just didn't need. And the typically super-positive P&P songbook is cloyingly annoying and, at this point, downright passé. Yes, the movie was supposed to be a feel-good affair but cramming this amount of ridiculous optimism into it pushes the story into Hallmark territory. Oddly, most of the songs seemed like knock-offs of Rachel Bloom without the irony, cynicism and wit.Oh, and despite the plot being all over the place, it is also kinda predictable.The Buddy joke was great. I think I will go watch that movie to refresh my memory of how a great modern Xmas film should go.",
    "103": "I really feel that this was good modern twist on the Dickensian tale. I was a little sceptical of a comedy duo, and the musical aspect, (which I do like).. Was it really going to be better than the Muppet Christmas Carol?I admit that a musical will get me more often than not. I think though, that it was totally the right move with the casting choices and well written to reflect the modern tale.I think that it has a definite stage feel to the filming. There is a loss of the art of singing and dancing films having said that, it's still fun and I think it should hold up for a good couple of years..If I were to say much more it would have to have spoilers.Will was redeemable in this.Octavia was as beautiful as ever.The cameo's were fun too.Good Afternoon!",
    "104": "Will Ferrell created a modern Christmas classic in Elf and one turns up here as well.Now Ferrell has teamed up with Ryan Reynolds for a musical remix of A Christmas Carol.Ferrell plays the Ghost of Christmas Present who works on the unredeemable to mend their ways. His latest target is social media executive Clint Briggs (Reynolds.) He is selfish, snarky and brash who manipulates social media to divide and embarrass people.His latest foray is to use sneaky tricks to get his niece elected as school president. However the Ghost of Christmas Present and his team step in and spirits Briggs away to a journey of self discovery.Briggs is not alone in this journey. The Ghost of Christmas Present finds that he can interact with Briggs personal assistant Kimberly (Octavia Spencer.)Spirited is a convoluted mess of a film with way too many musical numbers. It even makes a joke about the number of songs it has.It is overlong and gets tangled very quickly. As a modern reworking of the Scrooge story, it cannot hold a candle to Bill Murray's Scrooged.",
    "105": "Even though this film stars my two favorite comedy actors this century, I didn't have the highest hopes given their recent output and the premise. However, I was pleasantly surprised with the end result as this was the most enjoyable new Christmas movie I have seen in ages. Spirited is a fun twist on the classic Christmas Carol formula filled with many inspired numbers and comedic wit.Pasek and Paul lend their excellent songwriting skills to give some musical cred and most of the songs are quite catchy and clever. There's a real Greatest Showman vibe to a lot of the music, which is a good thing. Ferrell and Reynolds are a dynamite pairing and play off each other perfectly. The good afternoon number was definitely the highlight and one of the best sequences I've seen all year.The film does run a little long and there are probably a few too many songs, but the positives far outweigh the negatives. Spirited is ultimately loads of fun with some genuine thoughtfulness to boot. Assuming it doesn't get marooned on Apple TV+, this should become a new Christmas classic.",
    "106": "Best Christmas comedy movie in years! Really good!People criticize the music but do you ever remember a songs from a musical? The songs are made to bring the story forward. And the music in this movie does it really good!Will Ferrell makes the movie really fun without his usual illogical humor (which I love though). Ryan is his usual sarcastic character.What caught me is how they bring forth the story in which the plot twists gradually. It's a brilliant \"sequel\" to the Scrooge story and the quote I will bring with me for 2023 is: \"your sacrifice would have no meaning if it had no consequence\"Another thing to mention is the way this movie is inclusive without trying to shove an agenda down my throat! Really thought that was fresh and I didn't leave with a feeling of being manipulated. Well done! Other movies who tries to be inclusive could learn a lot!",
    "107": "This movie was fantastic! A fresh look at a classic tale led by two hilarious actors. The humor was irreverent and meta, which I loved. It looked and felt fresh.The dancing and singing was top notch, too (not just the leads, but the whole cast/chorus). It somehow took all the best parts of musicals and yet managed to tease itself about being a pastiche of musicals without being mean. This had to have been written by theater nerds like myself. (Can we talk about the Howard Hill flavor in the Christmas tree number? *swoon*)And I have to shout out the cast/chorus again. With such big names heading this, they probably don't get the applause they deserve. They were amazing!The leads were pretty good - honestly way better than I expected (except for Octavia Spencer because I already knew she'd be incredible). I don't think I've heard Ryan Reynolds sing before, so I wasn't sure how it'd go. And Will Ferrell is a comedic genius - when he's in the right film. He can sometimes play the exact same character over and over. Luckily, this film was the right one because it allowed him to show heart, gravitas, silliness, and depth.The costuming was intensely good. The costumes told a story as much as the writing did. And now I totally want that Santa bomber jacket.I just finished watching it for the first time and now I'm going to go watch it 30 more times.",
    "108": "I caught an early screening and listen, I'm not into musicals but this has the perfect balance of singing and regular dialogue. Lots of fantastical singing and dancing in the beginning, a nice break between and picks back up at the end.The cast does nothing but shine in this instant holiday classic. You think you know what's going to happen but the film has a wonderful way of disrupting the typical story.Ryan Reynolds and Will Ferrell have a lot of chemistry together and it makes you feel all warm and fuzzy inside.There are a couple of bangers you might find yourself humming later and possibly looking for the soundtrack.For kids, there's a couple of \"scary\" moments so I recommend pre-viewing if your child is extra sensitive.I highly recommend spending money on seeing the theatrical release if possible and be sure to watch through the end of credits.Lastly,\nDo yourself a favor, watch this (in my opinion) sure-to-be-academy-award-winning film and have fun!",
    "109": "What made me interested in this movie was that it was taking the story A Christmas Carol, by Charles Dickens, and doing something different with it by making the characters aware of the story and getting to see how the spirits do their job; after watching this movie, I had a fun time with it. The Christmas movie Spirited (2022) was a fun time with catchy songs, a nice Christmas feel to it, and Ryan Reynolds and Will Ferrell are great together; the movie takes what you know about the famous story, A Christmas Carol, and shows you what it is like behind the scenes with the spirits, which is done in a cool way.Will Ferrell and Ryan Reynolds are both great in the movie, with them both being equally funny; I did like Will Ferrell as the ghost of Christmas present who wants redeem people and at some point, settle down with someone when he chooses to retire, which is why I liked how he does his job and trying to deal with certain problems involving his past or Clint Briggs trying to know more about him and what he wants. Ryan Reynolds as Clint Briggs has done things that effects his family or the company he runs, but as the movie goes on you see why he did these things and that he had a difficult past; his performance leads him to be very funny, but also gives heartwarming scenes if needed. Also, Octavia Spencer was incredibly good in both her performance and when she is doing a musical number, plus you understand her character and what she goes through working for someone who does not make good choices during the Christmas season.I like the idea that the ghosts of Christmas past, present, and future did not just redeem one person, like in the story, but they help redeem other people who are jerks throughout the years during the Christmas season; plus, what happens to a spirit when it retires and how they turn into spirits I found interesting, along with seeing them putting memories together for a specific person for their job. The songs were catchy with well-done dance choreography; there was also nice cinematography in multiple scenes in the movie that looked pretty, and the effects were also not bad, especially with some use of a green screen.Spirited (2022) is that bad of a movie to watch around the holidays; the movie has a great comedy and singing performances from Ryan Reynolds and Will Ferrell, catchy songs that are nice to listen to, and a nice fun Christmas feel; along with some touching heartfelt moments. If you want a Christmas musical to watch, and you like actors Ryan Reynolds and Will Ferrell, then you enjoy this movie; this is not going to become a Christmas classic or anything, but it will be entertaining and a fun movie that people should have at least given a shot.",
    "110": "I was hoping for a fun comedy with two of my favorite comedy actors, Ryan Reynolds and Will Ferrell. How disappointed I was...The bad: the jokes arent good. That's a real problem, when one makes a \"comedy\". I didnt laugh out loud once. Some smirks. That was it.More bad: this story is disjointed. It lasts WAY too long (over 2 hours!). That's a comedy NO NO. It really gets kinda tedious.Isnt there at least some warmhearted Christmas spirit? There is a Christmas spirit, but a totally chewed out one.Arent the songs any good? I wasnt moved a bit by them. I mean, who would go to the cinema to watch Ryan Reynolds sing songs?Quite a disappointment. Definitely NOT a comedy. And the songs s*(k!",
    "111": "I mean it's alright, it's a pleasant enough movie, you have Will Ferrell being Will Ferrell, and beside him you have Ryan Reynolds being Ryan Reynolds... it's all they know how to do at this point.So what is it?It's fine, it's watchable, it will be promoted excessively in an attempt to make it more popular, it's a straight to tv hallmark style manufactured Christmas movie.So what is it not?It's not a classic, it's not memorable and you won't watch it more than once, it is never going to be a famous Christmas movie.It only exists to give people like Will and Ryan a pay check and for Apple to promote it to get their cut from the pliable masses.",
    "112": "As a Brit my favourite Christmas Carol is the T. V version with Patrick Stewart - it is (a bit like Britain) gritty, grey, grim and totally endearing.Spirited is not!This is unapologetically Hollywood.It is big and brash and bold, with scores of dancers high-kicking their way across the screen as the scenery explodes in the background.And it works!This is a lot of fun!I should be bothered that this film disregards the message of the original story and substitutes its own.But it is self aware enough to know this, has a joke at its own expense, and has zero F's to give anyway.This allows the story to go off-piste and even after seeing hundreds of versions of a Christmas Carole I was surprised and entertained.This is well cast, everyone seems to be having fun and the effects are ramped up to 11.The only issue I have is with the ending.Without spoiling anything -it feels cheap to say that your actions have to have consequence to matter - then removes all consequences.That aside this is a true fun spectacle that will get added to my Christmas roster.",
    "113": "When I sat down to watch the new AppleTV+ Original Holiday Film SPIRITED (starring Will Ferrell and Ryan Reynolds) I thought I'd be watching your typical \"buddy film\" where 2 opposites learn to work together and bond as friends while learning the true meaning of Christmas.And...I got that...but it was wrapped in a charming, musical \"take\" on A Christmas Carol that was funny, poignant, uplifting, self-aware, sincere and completely surprising.And...yes...I said MUSICAL.So let's start with the songs written by Benj Pasek and Justin Paul (Tony Award winners for Broadway's DEAR EVAN HANSEN). They are perfectly suited for the affair going on in this film and they tailor the songs to the capabilities of \"perfectly acceptable\" singers Ferrell and Reynolds. The fact that they are aided by Broadway performers such as Patrick Page (HADESTOWN) and Singer Dancers like Sunita Mani and this film moves along in a \"spirited\" fashion. This musical could easily be adapted to the stage - and I'm sure it will be in no time at all.Director Sean Anders (THAT'S MY BOY) knows exactly what kind of entertainment he is making and does not shy away from that - in fact he leans into the musical elements of this film, often having his performers commenting on the fact that they are about to break into song.Anders, wisely tapped Chloe Arnold (the video SYNCOPATED LADIES) to choreograph SPIRITED and she pulls no punches, breaking into FULL Broadway dancing (including \"Jazz Hands\") with just the right amount of irony and sincerity sprinkled in.This helps Ferrell and Reynolds move through a better-than-expected script that treads familiar territory, but is as comfortable as a well worn Christmas Sweater. They are accompanied by the aforementioned Page (Marley) and Mani (Christmas Past) as well as the voice of Tracy Morgan (Christmas Yet-To-Come), amongst others.Special mention needs to be made of the always good Octavia Spencer who sheds her \"best friend\" role for a romantic lead (who sings!) and she NAILS it! It's great when a very talented individual gets a chance to showcase tools in their performance kit and Spencer shines throughout.An unexpected surprise, SPIRITED got me into the Holiday mood quickly and, I'm sure, I'll be showing it to friends and family at the Holidays for years to come.Letter Grade: A- (it does drag a little bit in the middle)8 stars (out of 10) and you can take that to the Bank(ofMarquis)",
    "114": "I had high hopes for this as 2 of my all time favourite actors are joint leads but I couldn't even finish it!!I don't think I even made it to the halfway mark.A more realistic score would be 2/10 but I added 2 for Will and Ryan.Also since when did you have to write an essay in here to leave a review. That's silly!I said all I needed to say in half that many characters and if people just wanted to leave drivel that wasn't actually a review they certainly wouldn't bother logging in to type out 250 characters!Please review your need for such long reviews, a short succinct review is far more readable than this long winded essay I've been forced to write!!I NEVER READ LONG REVIEWS, I WANT SHORT SHARP QUICK REVIEWS.",
    "115": "I purposely refrained from checking the rating on this movie before I watched it because that can reallly cause an automatic bias for but I think the makers of this movie really nailed this one and I was SHOCKED to see such a low rating because to me this is an instant Christmas classic!I had no idea it was a musical until the first song started. Usually I'm not a fan of musicals but the music was incredible, with lots of winks to the camera and fun little borderline fourth wall breaks, very funny and a real return to form for Will Ferrell as far as his comedy goes.Ryan Reynolds's plays a very complex and interesting character and his arc isn't what you expect from a Christmas \"change your ways\" type movie.There was a twist at the end that I didn't see coming either.At the end of the day it's an original twist on a Christmas classic and you really need to give it a chance, it's very very good.",
    "116": "Spirited (2022) is pretty good. For being a Christmas musical that is based off something that has been retold countless times, this film actually feels pretty fresh for the most part.Charles Dickens novella 'A Christmas Carol' (1843) is easily a Christmas classic story and the many retellings over every medium of entertainment has made the story almost unbreakable from Christmas traditions. This has led to many great and not-so-great versions of the story. This film is a pretty good version as it expands the original story into the digital age with the Ghosts being part of a cooperation with the intent on redeeming people who need redemption. The modern details and even parodying of other stories makes this musical worthy in its own right.Some of the jokes feel forced or stale but every character seems so likeable that you will enjoy it. The musical portion is fine. While not likely to have any future classic Christmas songs, the musical numbers feel alive and charming.Overall, its a good film even if Christmas and musicals may not be your thing. It takes on the challenge of being modern while still trying to keep a natural feel to the story. If its the holiday season then give it a watch.",
    "117": "This movie was over the top in all the right ways. It lit a spark in my heart which I haven't felt since I was a little kid. A hilarious, and enjoyable experience. It was everything a recreation of A Christmas Carol should be and so much more. Surprisingly satisfying to watch. Now I'll explain the gushing praise: It addresses a serious issue which many people in our society face on a daily basis, in multiple creative and inventive ways while pointing out the flaw in the logic of thinking any person is irredeemable. While the movie calls them irredeemable, one could easily translate it to popular internet terms like canceled. It directly addresses how condemning and ostracizing someone simply for being human is wrong. Humans must be allowed to make mistakes without facing eternal damnation if we want them to grow into better people. Props to the costume, choreographers, whoever wrote those dazzling songs and the script which lit a spark in my heart. Also to the actors, who I'm down playing because I'm bias and they're some of my favorites. Well played. I also want to point out the lighting and set designs set the perfect tone for each scene. Fantastic. There is one star I did have to take away is because of the company which produced the film... but at least they put something good into this world. I loved that the movie had a resolution and that it both was and wasn't cookie cutter while also making fun of cookie cutter movies. Many stories and movies these days keep with the cookie cutter outline while completely lacking moral or resolution, I'm really glad this didn't. I went into this movie thinking it was going to be horrible, but I deemed it Christmas Movie Marathon day because we're quarantining and I wanted to get my kids minds off it and this seemed like it would be the perfect distraction. It was, but not just for the kids. To all who helped make this movie: Thanks for the laughs, the distraction from our woes, and the tiny spark you relit in my heart. It's been a while since I felt that... P. S. Please make more unique none-cookie-cutter movies with morals and logic. Happy Christmas, and Merry Holidays.",
    "118": "Oh,my! Another musical with Will Ferrell??? And this time, with Ryan Reynolds??? What???This is not the first time I have seen Will Ferrell doing a musical film and to be honest, I like all that he did! From the Elf, Euro Vision and now Spirited?! All great and fun films for the whole fambam!But this is the first time I have seen Ryan Reynolds doing a musical. I did not expect he's gonna nail it!The teaming up was good. Both were fun and suit their characters. Not only they can make you laugh on this film but they can also make you cry.Great story indeed. There is a moral lesson you will learn.",
    "119": "To quote a certain Will Ferrell character... \"I love Christmas. Christmas is my favourite!\".To add to that quote, I also love Will Ferrell, I also live Ryan Reynolds and I have no shame in admitting that I also love musicals.Despite all of the aforementioned love, I just could not get into this film. Something just didn't sit right at all.I found there to be very little in the way of laughs. I mean, my wife made me endure an episode of 9-1-1 afterwards and I genuinely laughed more at that than this. Which is both surprisingly odd and sad given the comedic talent in the film.Credit where it is due though, Ferrell and Reynolds can both hold a tune even if they are a lyrical shambles.",
    "120": "I've been laid up with a broken leg, so perhaps that may account for a bit of my restlessness, but this movie is flat out way too long! Will Ferrell and Ryan Reynolds are both great at being Will Ferrell and Ryan Reynolds in most things. Elf is my favorite Christmas Movie and that's nearly entirely because of Ferrell and the stealth genius of Favreau. (okay, and Bob Newhart and Zooey Deschanel)This rewarding of celebrities that can carry a tune, by offering them a lead in a musicals should really stop. This really should've been called, \"Fa La La Land\", as not one lead could hold a note for more than a second, unless it was featured as a party trick and the end of the songs. This gave a sameness to most of the numbers, (although, \"Good Afternoon\" was a hoot) and showed Reynolds to have pitch but not musical training at all. That goes double for tap numbers, so carefully filmed, in an attempt to obscure that those 3 months of crash-course lessons was a year too short. Oh, and speaking of filming, these musical numbers are easily the most chaotic and random I've ever seen on film. Giant wide shots galore and seemingly not focus on anyone or anything in particular.I get celebs are needed to bring in the big buck, its what has almost ruined B'way and the Tonys for the past 25 years, but just brining Octavia Spencer in isn't enough. There have got to be big names with big musical talent, and if there aren't..... this could've easily worked better as a shorter, non-musical comedy. Didn't hate it, wouldn't watch it again.",
    "121": "Will Ferrell and Ryan Reynolds have always been enjoyable leads on-screen to me. Hearing they were doing a Christmas musical did pique my interest, but even though I like them, it never screamed must-watch. After sitting down to check it out, I'll say that I'm very happy I watched it and I had a good time with it, but it's definitely not perfect. If you're looking to watch a movie with a lot of holiday spirit and musical numbers, Spirited may just be the movie for you. Here's why I recommend this one, even though I have issues with it.In this loose redo of A Christmas Carol, the ghost of Christmas present (Will Ferrell) journeys to try and change a man that has lost his way as a person, Clint Briggs (Ryan Reynolds). Deemed unredeemable, he truly believes he can change him for the better. This leads to a lot of musical numbers about family, the holidays, and many other cliched topics, but they all work pretty well for the most part. Anytime Reynolds and Ferrell had numbers together were easily the standout moments for me. There is also some solid humour sprinkled throughout and the overall experience was just fun. Where I feel the movie fails is in the editing department. This film is far too long.Not that it made me dislike the movie by any means, but Spirited did not have to be over two hours. This film felt as though it needlessly dragged on and found ways of making the story longer, just so that more musical numbers could fit in. In between some of the musical numbers just felt boring and uninteresting at times. That may sound like a huge complaint, but I still enjoyed the majority of the movie. I don't usually say that a shorter movie is better, but I feel like 20 minutes could've easily been shaved off here.Overall, Spirited cares about the material it's replicating and therefore delivered a fun experience. For being an Apple TV+ original, it's great, but this is one I kind of wish I saw at the theatre, simply because it feels very theatrical. The life lessons are all the same (for the most part) in terms of comparing it to the classic Christmas Carol story, but they work here as well because care is put in to make you feel for these characters. By the end of the movie I had a smile on my face and walked away happy that I watched it. It doesn't break any new ground, but I think people can have a good time with this one. It has some dark moments, but that's what A Christmas Carol is as well. It's not exactly for families, but adults can definitely have a good time.",
    "122": "I wasn't sure what to expect but this was so fun sweet mostly smart and just an amazingly well done musical! This movie asks what if the christmas carol was a large tech/Hollywood corporation (which is a little weird) but executed it as a Ryan Reynolds movie/a will Ferrell movie/a high school musical-but in the best ways. Also reminiscent of zoeys extraordinary playlist. Had some great music and songs too! They really used the music to tell the story and incorporated the musical parts seemlessly into the film as a whole.It does have some cringey current references like \"Karens\" and trolls and dangers of social media and how \"divided\" people are and how easily people become divided, that will probably be dated in not too long. And not that addressing these topics is bad, but kind of does it in a way that just repeats what everyone's already said about it without actually challenging the issues, except for a few instances when characters made an individual personal choice to represent their character growth. I mean it did follow through in those moments, but to me still felt kind of shallow. But they did make up for it in some of the really deep meaningful songs that Will Ryan and Octavia had. I also wish they fleshed out uncle/niece relationship a bit more :/ but understand why they didn't.",
    "123": "Spirited is a fresh new take on Charles Dickens' Christmas Carol, paired with beautiful visuals and comedy. The film is incredibly entertaining, but misses the mark a bit in regards to the music and storyline.Spirited follows the story of the Spirit of Christmas Present (Will Ferrel), on his mission to reform Clint Briggs (Ryan Reynolds) and his heartless ways. With the help of Past (Sunita Mani) and Future (Tracy Morgan), the spirits hatch a plan to teach Briggs about the error of his ways. Through a series of events, Briggs turns the tables on the Spirit of Christmas Present and together they re-examine their past in order to live the lives they always dreamed of.Spirited is a fun and upbeat film, but the music leaves much to be desired. Ferrel and Reynolds are excellent comedic actors and every scene that they are in together is super entertaining and funny. Although they are great actors, neither of them is particularly musically inclined, so unfortunately, many of their songs and musical numbers fall flat. However, one musical number that I really enjoyed was the \"Good Afternoon\" scene as it is filled with great choreography and energy, which makes it really fun to watch. The concept of the film is so clever and refreshing, but its downfall is that the plot has a lot of holes in it. There are a lot of plot-lines that are introduced, but never followed up on, which leaves the audience hanging with questions regarding the storyline. Plus, the consequences that Clint Briggs has to his \"cancel culture\" concept lack impact. Spirited has a lot of jokes relating to current pop culture and news, which makes it lose its timeless quality, as many of the jokes may be funny today but will not make sense for future viewers. It also has a lot of curse words and adult jokes, which makes it a little less family-friendly. The visuals in the film are all beautiful, especially in the scenes with the Spirits and their office and also in the \"transitions.\"Spirited addresses the negative impacts of social media and finding yourself. The scenes regarding social media and cyberbullying are very impactful, especially for teenagers and younger audiences. Parents should be aware that the film has a lot of curse words and adult jokes, which may be inappropriate for younger viewers.I give Spirited 3 out of 5 stars and recommend it for ages 12 to 18, plus adults. It is available now in select theaters and will be available on Apple TV+ beginning November 18, 2022. By Emma D., KIDS FIRST!",
    "124": "Spirited is a 2022 American Christmas comedy film directed by Sean Anders, and written and produced by Anders and John Morris.It loosely strives to retell Charles Dickens's 1843 novella in high is the original, fascinating and frightening \"A Christmas Carol\" and is probably a satire of the various adaptations since including the excellent version by The Muppets.The film stars Will Ferrell - who has made some great comedy films as well as some stinkers (guess which this is) and Ryan Reynolds who is famous for being Deadpool and buying a bad football team in a small town near Liverpool.It's football, not soccer.So I started to watch and my suspicions about how bad this was were fulfilled when I realised it is a musical. A musical. SMH.",
    "125": "This movie has everything! A fun musical that makes fun of itself, with a sweet story, humor, emotion, and all of the qualities of a great Christmas movie. The story has enough twists to make you invested in the characters and wanting to know how it will end. My wife and I watched this with our 14 year old and we all loved it.One of my favorite moments was how the extras would break out into dance, like a flash mob. The over-the-top musical numbers totally worked, and added to great story! Excellent writing and of course Ryan Reynolds's and Will Ferrell are brilliant together. Great chemistry and thoroughly entertaining to watch.It's our new favorite Christmas movie that we'll watch every Christmas for sure. Thank you for bringing such a joyful, fun movie that was brought smiles to our faces.Funny and heartwarming; we'll acted and choreographed; extremely well written and great message for everyone who feels unredeemable.",
    "126": "Spirited is the best Christmas Movie my wife and I have seen in many, many years. In fact it is also one of the best movies in general, that we have seen lately, too.The story-line is a fresh & new approach and extremely well written and performed. In fact the whole movie would make a terrific live theater musical performance! The musical scores were perfect and catchy already, as were the lyrics. If it were a live performance musical, my wife and I would go to see it this very minute!Every aspect of this movie is top notch!I can't think of anything about it that is less than 10 Stars! The music, dancing, story, singing & acting are all fantastic.We have already seen this movie a few times and each time is better than the last. I encourage everyone to see it & decide for yourself ! Be sure to watch it to the end as the final song and dance routine are entertaining and wonderful, & make a real splash!If we can purchase it, a Spirited \"Disk\" will eventually take a prime position in our Holiday movie collection! This movie is one of the best! Loved Ryan Reynolds and were surprised at Will Ferrell's ability to act in a more serious role. (Well, serious compared to his normal \"over the top\" humor.Best movie for them both in showing more of their abilities! Octavia Spencer was even better than her already wonderful acting. Her singing was great and her performance (acting and singing) really rounded out the other two Leads, as well as the storyline.For that matter, Patrick Page, Sunita Mani, Loren Woods, & Tracy Morgan, really everyone in this movie did great! We were pleasantly surprised and enjoyed it all! As I mentioned, watch for a live musical performance of it in the years to come.",
    "127": "If you like humor, an excellent script, great acting, fantastic songs and choreography, and a completely unique twist on a classic theme, you will LOVE this heartwarming movie. I'm not a pushover. I'm critical and picky as heck. I rarely watch anything with less than a 7 rating and generally I will bail out when a script doesn't make sense. This movie hit every mark possible. I love smart movies - movies that are well-crafted and this is definitely one.Anyone rating it less than a 7 is a Scrooge. The complainers are not the target audience for this film! If you don't like musicals, why would you offer a rating? Do you regularly watch film genres you don't like just to torture yourself?I like tight plots and I won't watch the many series shows because they drag out what can be put into a much shorter film. I found the 2- hour running time went by quickly thanks to an engaging plot with many great elements and wonderfully intertwined subplots.Personally, I love music but I'm not a big musical fan. However this film was perfectly on target for me. The songs were very well crafted though not particularly memorable. The lyrics were excellent. The choreography was excellent. The directing was excellent!The humor was very good too. My wife and I generally dislike Will Ferrell's style of comedy, but we both agreed he was likable in this. I credit the script and Ryan Reynolds mainly. Heh. However, Ferrel was well cast for this part.I rarely write reviews but this movie deserves a way better rating than a 6.6! And we watched it on February 4th so it wasn't exactly in season.I found myself wishing we had a watch party of friends and family to share this with. It was that good and that much fun.If you liked \"The Greatest Showman\", (which is rated 7.5) you will probably like this just as much.",
    "128": "Okay, with the exception of Dr. Horrible's Sing-Along Blog, I hate all musicals. They feel forced and heavy handed. They all suck.Except for Spirited. It started off a bit contrived, but man it picked up and never came back down. Without posting spoilers, the music numbers (and even the sudden breaks in the singing) were all well placed, well thought out, and perfectly timed.This was a great modern take on the classic Dickens story and honestly almost as good as Scrooged (that was a masterpiece). There are a few bits of innuendo that adults will find funny but will go over small kid's heads.I hope that they eventually put this on Blu-ray or 4K. It will be a great addition to my annual Christmas viewing collection.Good afternoon, and Merry Christmas to all!",
    "129": "\"Spirited\" is a wretched film. Yes, the starpower is great. I am a huge Will Ferrell fan, Ryan Reynolds fan, Octavia Spencer fan. Patrick Page, who plays Marley, is awesome. It is for the actors that I gave a zero-star film an extra star.The problem is the script and the direction, both of which are disastrous. The movie has no idea where it's going. There's terror then weak jokes then the suicide subplot then the online bullying subplot then a so bad it hurts \"dance\" number in Victorian England with Reynolds' Cockney accent so bad he makes Dick Van Dyke in Mary Poppins sound like native Cockney speaker Michael Caine.And, look. If you can't sing or dance, you can't sing or dance. Maybe the musical comedy form is not for you.'Spirited\" takes a classic tale, \"A Christmas Carol,\" puts the plot through a blender, and comes up with the mess you'd expect.This is just inept filmmaking, so bad I believe that the positive reviews are plants. I can't believe anyone enjoyed this mess, except the mother of the director / script writer, may God have mercy on his soul.",
    "130": "The low reviews from critics and my fellow IMDBers are patently absurd. I'm sorry, but this movie is freakin adorable. We all know \"A Christmas Carol\" and we've all seen the numerous takes on it... this is without question one of the cleverest and most creative versions, as Dickens' classic is turned inside out for a \"behind the scenes\" musical about Christmas redemption.Will Ferrell and Ryan Reynolds are terrific, and hats off to them for taking a chance on a singing and dancing Christmas adventure. The original songs are amazingly clever and perfectly suited to the story. The cast, top to bottom, is stellar. It's family-friendly with VERY few exceptions, and joyfully suited to anyone and everyone (exactly the people who should see this).I almost didn't watch this because of the crappy reviews. So glad I did. Please ignore the critics and watch this. And \"Bah Humbug!\" to the haters...",
    "131": "Good afternoon (watch the movie to understand what I really mean). A musical version of Charles Dickens' story of a miserly misanthrope who's taken on a magical journey starring Will Farrell and Ryan Reynolds.This remake was done in a very good way. Ryan and Will's performances were amazing as their chemistry together was very evident. In addition to all the other characters that added to the story.The movie was pretty funny too being filled with jokes for the little kids while having some adult humour here and there. The effects were really on point; there wasn't too much that it would look fake but also there wasn't too little.The story was quite interesting. It had some twists, that were kind of not expected, to differ from the original film. It also included some pretty nice messages for the kids that weren't too annoying for the adults watching. The movie was also filled with alot of songs and amazing choreography which was pretty entertaining.The downside with this movie is that it doesn't stand out. Alot of other movies can beat it in multiple categories. However, it is what a lot of people might need at this time of the year; a light and fun Christmas movie.Score: 7/10.",
    "132": "Who would belive a project like this would be perfect for Will but it is, its almost like its written for him.Will and Ryan can sing yeah I cant belive it eitherHowever, who really shines in this movie is Octavia Spencer whom I would like to also call a main character of this and is so excellent in this that she draws focus from the actual main characters.Fun for the whole family, great vibe thru out the entire movie, with a message, great written songs and everything is incredibly well performed.The only bad thing I have to say about this is that it feels abit too long, feels like they could cut of maybe 20mins of it.",
    "133": "Wow, but this is all over the place. Based very loosely on the Dickens' character from his \"A Christmas Carol\" story, Will Ferrell is the Ghost of Christmas Present who now works for \"Jacob Marley\" (Patrick Page) trying to save irredeemable souls from purgatory. This is where Ryan Reynolds comes in. He is \"Clint\" - a successful influencer who is about as ruthless for his clients as it possible to be. \"Present\" concludes that if he can save him, then he can make a real difference to the future (despite the fact that he appears, already, to have rescued Dolly Parton!). Anyway, this is where the story gets a little more interesting. Rather than cowering in fear at his apparitions, \"Clint\" decides to turn the tables a bit and before we know it, he is challenging his protagonist to justify what he is doing and why. Unfortunately, though - and despite the presence of the usually reliable Octavia Spencer - the whole thing just peters out all too quickly with some predictably slapstick humour and a few rather dull piano/guitar ballads from an out-of-sorts Messrs. Pasek and Paul that have some potent lyrics now and again, but those are largely overwhelmed by the fact that Reynolds cannot sing and Ferrell fares only slightly better on that front too. It also has no idea how to end, so it has three or four goes by which time I was a bit bored by it all. It's been quite a while since I noticed people leaving a cinema screening, but quite a few abandoned this. Nothing beats the Albert Finney/Leslie Bricusse \"Scrooge\" (1970) for me, and though this iteration of the timeless story might work better on stage - much of it is very theatrically stylised in nature (especially the dance numbers) - I am just going to stick with that.",
    "134": "I subscribed to Apple TV just to see this movie and thank god it wasn't a flop...Let's start with the actors. Ryan Reynolds is great as always just as Will Ferrell. The characters they play are also good but nothing too special. The best part of this movie is his meaning and yes it's not the musical itself. The criticism of society and especially of the Social Networks is just great and well staged and packed in this musical.I know it's a musical but there are still too much songs that aren't always that good. I also had high expectations on the quality and quantity of the jokes cause of Ryan but these expectations were sadly not fulfilled. On top of that the Ending was not the best so enjoy especially the first, second and the half of the third act.It's a good Christmas movie to watch as a family but don't expect the absolute best jokes. Just have fun!",
    "135": "A new, big-budget Christmas movie for 2022 and a pretty enjoyable one at that. It tempts Will Ferrell back into all things festive for the first time since \"Elf\" and yes, an in-joke is duly present and correct and adds for good measure Ryan Reynolds as his co-lead.The movie is a slightly odd mix of \"A Christmas Carol\" meets \"The Greatest Showman\" as it centres on Ghost of Christmas Present Ferrell trying to win over to the angels irredeemable bad guy Reynolds, a go-getting boss so bad that he gets his P. A. Octavia Spencer to oppo-research the teenage school rival of his young niece, with disastrous results as things turn out.Helping Ferrell is a veritable army of back-up staff who remarkably are all able to sing and dance like professionals, their numbers headed up by their big boss Jacob Marley played by Patrick Page and the two other famous Ghosts from Dickens' imagination, the first, of Christmas Past a rather randy young female and the second the dreaded silently-pointing Ghost of Chrhstmas Future.There's lots of energetic singing and dancing, some good special effects and neat comedic touches too, plus it helps that Ferrell and Reynolds can both hold a tune as well as cut some shapes on the dance floor.It may run on about twenty minutes or so too long but on the whole, it added nicely to our yule-tide fun and with it beginning to look a lot like Christmas, I can recommend the film to anyone looking for a feelgood Christmas movie this year.",
    "136": "Lack of Story\nThere is no story in this movie, just scenes strung together with easy-to-forget songs. I think the writer thought, after seeing \"La La Land,\" that it would be easy to create a wonderful musical screenplay. Wrong. It's easy to create a terrible musical screenplay.Exposition and More Exposition\nExposition, a movie no-no, is a bullet to any audience's head. Exposition *in a song* is a bullet to any audience's heart. Both styles of exposition appear in this movie, so I guess we're dead and dead again.Unconvincing Characters\nThis movie's characters don't feel like real people, or even real dead people. They feel like cardboard cut-outs made to say things by the screenwriter.Lack of Action in Non-Song Scenes\nIf standing around is entertaining to you, you will be entertained by the non-song scenes in this movie.Lack of Imagination in Direction of Scenes\nA director needs a fertile imagination to create a good movie. If the action of a scene is unoriginal or uninspiring or unconvincing, the audience's attention drifts. Making a movie is not just filming people speaking words, it's filming the choreography of life in a unique world.Low Production Value\nIt looks as if every charmless, spiritless scene was shot in one take.Shockingly Bad Production Design\nThe production design is so awful that I'm sure it's not the Production Designer's fault but the fault of someone forcing the production designer to make horrible choices again and again. In other words, I think the Production Designer did a brilliant job of creating terrible visual landscapes.Shocking Bad Editing\nEditing mistakes are offered up to the audience on the silver platter of the silver screen. It's hard to blame the editor, though, as the script is a mind-numbing word-salad. If the editor cuts from one shot where nothing interesting is going on to another shot where nothing interesting is going on, what's the difference?$20,000,000\nRyan Reynolds reportedly received $20 million to appear in this hopeless, dispirited movie. Will Ferrell reportedly received the same salary. Why either of these great actors said yes to this lifeless script is beyond understanding. I'm not even going to insinuate that their decisions were influenced by the formidable salaries offered, as they each could have appeared in a much better movie for the same amount or more.Don't waste your time or money on what is certainly the most boring film in recent years. Don't let your head, or your heart, be the target of exposition, the cardinal sin of screenwriting.Have a wonderful day, and have a heart-warming Christmas.",
    "137": "Loads of stars, including a bizarre cameo by Dame Judi Dench, but too many flat moments to drum up more than a barely average holiday movie.Critic's reviews average about a \"5\" rating, although one well known reviewer claimed that only \"smart and savvy viewers\" will \"get\" the movie. Nothing like being called dense and stupid by a \"pro\" who makes a living critiquing other people's work.To date, Scrooged with Bill Murray remains the best (though flawed) updating of Charles Dickens classic, A Christmas Carol.There are some terrific effects, good chemistry between Ferrell and Reynolds, great choreography and the expected positive message.But the three core stories, redeeming Reynolds' scroogey corporate shill, resolving a juvenile junior high competition dilemma, and fixing Ferrell's conflicted Christmas Present ghost, all have significant problems.Reynolds' character isn't believable as a heartless con artist, and because we KNOW how the story is supposed to work out that lack of belief removes all tension.The \"pivotal\" junior high dilemma and potentially deadly butterfly effect set off by Reynolds' meddling feels incredibly forced and trite. And the fact that ALL of the grownups drawn into the \"nefarious\" plan disagree with the ploy, but STILL allow it to go forward, sucks out any stakes that might have existed.And Ferrell's character revealed to be an iconic Christmas story character turned from awful to good is essentially dumped into the middle of the film in such an \"oh, by the way...guess who I really am\" way that there is zero shock and awe.Ferrell and Octavia Spencer have no romantic chemistry either, which snuffs out the supposed ultra passionate reason Ferrell is willing to give up the job he loves, for her.The songs, and the singing, are average, which is surprising because the talented writers behind the songs gave us The Greatest Showman.And lastly, the messed up scene where Reynolds' bad guy succeeds in corrupting Ferrell's Christmas Present ghost feels wrong in every possible way. The two delight in conspiring to pull mean pranks on townspeople, create chaotic destruction around them, including intentionally blowing up a building with a bomb. And yet Ferrell somehow stumbles back into his altruistic character's path with more ultra familiar Ferrell-isms. This entire scene (in a two hour and fourteen minute movie) could be eliminated and not change any of the following scenes, or the final outcome of the story.Dumb.But Hollywood has shown us that regardless of the talent onboard, a bad story and troubled concept can't be saved.Skip it the next time you see it as you're scrolling for holiday viewing.",
    "138": "Anyone who gave this movie a bad review either didn't really watch it or they just have no understanding of what a great musical/movie is. One review stated \"Rose Byrne was a wonder\"!? She was only in the first 2 minutes of the film and was over acting purposefully for the role. I love Rose Byrne but her role in this is far from wondrous! The musical numbers were spectacular! I was inthralled from the first song to the last. I wasn't sure what to expect from Will Ferrel's and Ryan Reynolds's singing but I was pleasantly surprised! Their passion for this project and the amount of work they put into it shines through in their singing and dancing. I also loved how they gave a new modern take on the classic Christmas carol. The story is cohesive but also has some surprises which I really enjoyed. This musical is funny without being too crass and emotional without being too sappy. I am a person who loves movies and musicals and this was a perfect blend!! Watching Spirited will definitely be a Christmas tradition for me and my family from here on out. If you hate musicals, then maybe don't watch it just to post a negative review.",
    "139": "I went into this movie not really knowing anything about what was to come. And, in the first few minutes, I found myself absolutely giddy at the thought of a Christmas Carole BTS type of film. Especially as a massive fan of the classic story.Then, Will Ferrell and Ryan Reynolds started singing.Now, I'm a huge musical fan. I was the first in line for movies like The Greatest Showman. But that only works with people who know how to act in a musical theater setting. Putting mega stars into a musical number does not make a musical number great.But, in contrast to Lala Land, it's not all that bad. The choreography and harmonization is actually pretty amazing. And Ryan Reynolds isn't a horrible singer at all, he hits some great notes. However, you could put broadways biggest stars into this movie and it still wouldn't make sense to me why it was a musical.The story is genuinely intriguing and the comedy is genuinely funny. Especially with Ryan Reynolds and Will Ferrel at the helm. So the musical numbers just draw me out of the story and feel awkward and out of place.This movie would be so much better off as a non musical film.",
    "140": "Spirited can't seem to be able to decide which it hates more, Christmas, musicals, or you the audience.Musicals are not for everyone, but truly great musicals have a broad appeal. Spirited is neither great nor remotely appealing. These musical numbers are written so blandly that the film tries repeatedly to circumvent criticism by having its own characters complain about them during their performances.Spirited forgoes the timeless sense of wonder and eerie existential dread of Dickens' classic, and instead opts for loud, over complicated dance numbers and production design. (Apologies to the dancers here, who do a phenomenal job, but only serve to add to the constant visual assault.) There are no moments of quiet reflection in Spirited. It's a ceaseless stream of smirking, unfunny, current day catch phrases. A holiday film complaining about disinformation and baby boomers in the first 20 minutes is painfully unfunny today, and will become increasingly so a year from now.There is much ado over updating timeless classics for the coveted \"modern audiences.\" What's lacking though, is an understanding of why works such as \"A Christmas Carol\" have stood the test of time specifically due to their very relatability to every generation for nearly 200 years. The writers of Spirited have very little idea how to relate to \"modern audiences\" or any other audience for that matter. Ryan Reynolds' character is vilified as being devisive and polarizing on social media, but then the film gleefully attacks only one particular half of the American public.To undergo a retelling of a classic literary work, a prerequisite should be (at a minimum) to have some understanding of the original work. These writers don't even understand who Jacob Marley is. Why would he be the first spirit Reynolds meets? They have zero history. Wouldn't his dead sister be the more sensible choice?Alas no. That choice would require thought, and Spirited doesn't want to think, not when it can simply reinforce the prejudices Apple TV creators already have about most of America.Ultimately, Spirited is insulting, but if you'd prefer the ghost of Christmas past have sex with Reynolds rather than reminding him of his past, then perhaps this is the film for you and your family. Otherwise, copies of Dickens' original are still available.",
    "141": "Up. Down. All over the place.This movie couldn't quite make up its mind what it wanted to be and where the story would go. It has painful cringey moments and then is fantastic.The first 25 minutes are the hardest because Will Farrell is doing his \"Look at me strain extra hard to be funny\" shtick. It's when he stops that and is serious in the character that the comedy and the poignancy comes out.I love that they sang with their real voices - pre-recorded, but definitely their voices. Octavia Spencer has a GREAT number with \"The View From Here.\" And there is a nice nod to \"Thank You Very Much\" (from the 1970 movie musical \"Scrooge\") with the \"Good Afternoon\" number - there is also one of the greatest cameos ever.It's only when Will Ferrell plays it dead serious that this movie really works - it brings out exactly what this movie needs. At times it is way too over the top, but those are the moments you're really liking everything, so you just let it go. A little tighter, a little less frenetic, and someone to better direct Will Farrell in the first 25 minutes and this would be the perfect movie.",
    "142": "Ok, I'll admit it - I like musicals, and I like Christmas movies. I even like WF and RR. Yet I'm absolutely baffled by the glowing reviews of this Christmas musical.I had a lot of time to think \"what went wrong\" while watching this endeavor. The premise isn't bad - there are actually some clever lines and plot twists in the film, and the leads are all likeable - so why didn't I like it?First off, it's a terrible musical. Objectively, achingly, terrible. Every time you find yourself getting into the story, the characters break into song! Now, you may say this is the case with every musical - but if you interrupt an promising storyline with an insufferable, mailed-in musical number, it is no longer a good story or an enjoyable holiday musical. Did I mention the songs aren't any good? Wait five minutes, there's another!It might actually have worked if it hadn't been a musical. I truly believe the leads just wanted a vehicle where they could sing and have a good time, but this feels like a combo of bad improv and bad musical theater. Maybe they should have tried a stage show first and worked out the kinks. At least they gave a bunch of performers a job for a little while.Giving it three stars for my expectations (and the occasional fun nuggets, there are a few) and my gratitude for my family agreeing we don't have to watch it for holidays to come.",
    "143": "It seems like 'A Christmas Carol' is just such a good story that all of the adaptations, even the ones you wouldn't expect, have some amount of enjoyability, and on some level, a genuinely good story.While this movie would maybe be overshadowed by some of the other Christmas Carol films, it's definitely still got that nice Christmassy feeling, and I can't deny it managed to put me in the holiday mood, even if I was trying to resist!On top of that, Will Ferrell and Ryan Reynolds made a surprisingly charismatic duo together, and I was really pleased to see that Will Ferrell felt a lot more 'Elf' than 'Holmes & Watson' here.Unfortunately, my biggest problem with the film was the musical numbers. It's a shame, because the songs aren't bad songs, and you can clearly see that there's a lot of work going into the performances, sets and choreographies, and some of them are sort of... fun.However, each time someone starts to sing, you get a sinking feeling because it's clear that the story is going to grind to a halt for 5 minutes. To make it worse, the songs themselves are mostly repeating things that we've just heard in the previous scenes, which makes the problem with the pace much more unavoidable.Despite that though, I actually enjoyed the movie, and I'm very grateful to it for getting me into the Christmas mood!",
    "144": "So you can imagine I was eagerly anticipating this movie with the added bonus of Will Ferrell AND singing AND dancing AND my unmolested toothbrush.I really admired the unique take on the classic Scrooge story, with some BTS of how it all works. Reynolds as a slimy, conscious-free, 8-Chan contributing, GQP asshat is great. His character truly nails a core strategy of certain :COUGH!:gop:COUGH!: political parties in getting their base so fired up with rage that it literally short circuits their ability to do any critical thinking. It's also nice to see him in a nice suit as opposed to a blood stained lycra onesie and not looking like hemorrhoids on a Sharpei's prolapsed anus, after being in a horrible fire.However (you knew this was coming), the musical aspect fell flat for me, and I don't mean just notes wise. Neither Reynolds nor Ferrell are Broadway musical caliber singers, and the music seemed written with that in mind. It allowed them to sort of talk/sing their way through it, without anything too difficult or frankly (awful pun intended) noteworthy.None of the songs were particularly catchy, clever or memorable. Frankly the singing TikTok the two of them did was far more catchy than anything in this movie. The dancing/choreo was much more impressive.While I appreciated the ending (no spoilers), I just didn't buy it. There just wasn't really anything leading up to it to lead me to believe it was realistic for that character.Would I like to see a sequel? Hell yes I would! (See title) However, given the singing abilities of the leads, since you can't get fancy with the music, at least be clever with the lyrics. Channel (or better yet, HIRE) Lin Manuel Miranda for something more worth of all the great actors that were in this one (and hopefully the second).",
    "145": "The first time I saw this movie (in 2022) I might have only rated it a 7 or 8. In fact, I think it started slow for me and I didn't even know if I would watch it all. I'm glad I did, and when it was over, I thought it was pretty good. I liked it, but I wouldn't say I loved it. Not then.Watching it a year later, it has really grown on me and after my second viewing, my rating would have jumped to a respectable 8 or 9. But now, after having seen it a couple more times, it's a stone cold 10 for me. For one thing, the music is fantastic (not that I've ever really been very into musicals). You can almost miss some of the clever, sharp wit for all the fantastic music. I think that's why it's imperative to watch it more than once. Also, the roles have been cast so cleverly. There isn't a single character who seems right for their role in name, but it's brilliant how perfectly it works out once you're watching it. I've seen this movie multiple times this month and will 100% watch it again before Christmas next week.I look forward to being able to sit down after a long day to watch a movie, but it's a busy time of the year, so that only happens a couple times a week - so the idea that I would choose the same movie more than once says more about the film than my words could ever say. It's a fun, modern twist on a classic story that results in a charming movie with snarky humor, a solid message, and great music. What's not to love?",
    "146": "Spirited is a DREADFUL film, and does nothing to honour the great and revolutionary work of Charles Dickens' 1843 story.There have been many good films based on this tale, starring Bill Murray, Alistair Sim, George C Scott and even Michael Caine and The Muppets. This however, can not be counted in this list.If you like the story of 'A Christmas Carol' at all, do not watch this garbage!It shows nothing of the great, moral tale of changing your personality, your hopes and dreams and accepting all those around you. Changing your character from a miserable being to a happy, thoughtful and kind person.A truly AWFUL film! Why was it ever green lit and made at all?",
    "147": "I love every genre of movie there is. I love a good musical, I love comedies, and I simply adore Christmas movies.But this was just a grind.We had to keep checking how long it still had to go because it was just so bad.Its not at the level of CATS bad - that has to be the worst movie ever made.But it is definitely a close contender.Whatever possessed Ryan Reynolds to appear in this is beyond me. Even he couldn't save it.Its not even a feel-good movie to watch with the family - its an adult adaptation of the famous Dickens story that goes off on a tangent and dulls the original message.Save yourself 2 hours that you will never get back and avoid this at all costs.The cringeworthy feeling everytime they break into song is just not worth it.",
    "148": "Good afternoon movie watchers!I obviously missed the memo that this was a musical. But that's alright, I don't hate musicals, but definitely do not seek them out, but I can't say no to a Ryan Reynolds and Will Ferrell team up.A legit funny and good feeling Christmas movie. The mere fact that they named the \"Karen\" Karen at the beginning was hilarious. Did Reynolds just take his red jacket from his Wade Wilson character and make a couple adjustments? Ferrell almost went full 'Elf' near the end, which may have been purposeful because they put the Easter egg in there right after.Ryan Reynolds is a Vancouverite, as am I, and I was happy to see Vancouver get some screen time on a feature film, even if it was brief.A predictable ending along with a possible plan for a sequel, but that didn't necessarily take away from anything. You could just see that's the direction it was heading halfway through, if not earlier.One thing I realized while watching and took away, was a comment from Clint Briggs when he says to read the comments below to discover mankind's true nature. I read the comments below way too often and need to stop. Because as we all know, it's often just negative energy and can be full of hate. Rarely anything good comes from the comment sections on the Internet unfortunately. It's a good thing there are none for IMDb reviews.",
    "149": "First of all this was not a good movie.So far off of Charles Dickens. One of the worst renditions if A Christmas Carol ever !The movie line was all over the place cruddy written.The songs and dance routine we're of the high school caliber. Sound mbly to me !You would think having two guys like will Ferrell and Ryan Reynolds it be funny and great , but it was not ! Lane humor thrown in the mix of Lane acting made this unbearable to me.Took me 3x to even get though it !I have to say this for the movie is , Now the Green Lantern has moved up the ladder for Ryan Reynolds. So I guess that's a good thing !"
}