{
    "0": "I have lost count of how many times I have watched this wonderfully written and acted Christmas romance themed classic film. At least once a year so that would be at least seventeen (17) times now. Great songs, a superb cast from top to bottom, heartwarming romances, and of course a must see \"FEEL GOOD\" ending.It is most deserving of a perfect 10 for 10 IMDB rating.",
    "1": "Any picture that can have me rooting for Rowan Atkinson (who I usually detest as Bean, actually) has to be very well-crafted for my part...Rowan was the Angel Of Conscience in the film he helped the son of the just-widowered Liam Neeson's character by pass Customs to pursue true love of a little school-mate who happened to be a fine young Afro-American girl(this was where love did not know Race... Color-Blind), but he did everything to make Alan Rickman as the publisher think twice before he effed up his marriage for a bit of materialistic fluff! (The gift-wrapping sequence in the department store was annoying, hilarious and Bean-esque all at the same time w/o conflicting.. Amazing!!)Bill Nighy as the old rocker who discovered platonic love was marvelous; Hugh Grant (brother of Rickman's wife in the flick) as the goofy good PM who effed up Billy Bob Thornton's \"Bushy\" prez was superb and I liked the girl from EastEnders as his love interest, it shows true love knows no class! Love knows no language was shown in Colin Firth's attraction to his Portuguese assistant when recovering from Romance betrayed - another aspect of love, actually...Kiera Knightley and her weird triangle was a great twist, I thought the white guy had a crush on her husband not her! Ten stories linked in the weirdest ways and showing that love is Universal! As for the tunes, they were sublime and it was weird to see Bill Nighy's send-up really did do well in the UK Xmas charts! The Power of Love, actually!",
    "2": "This was a lovely script, and I was surprised I hadn't heard much about this movie before I caught it on HBO. I turned it on to keep myself company while working and ended up glued to the screen. I really enjoyed it.The movie is a series of vignettes about several different people that seemingly have no connection to one another, although by the end the connections are finally all present and accounted for. There's a fair amount of subtle satire and a generous portion of irony; the characters are quite human and often don't do the right thing. I was caught off-guard by the incredibly successful results of the trip to America, but I laughed pretty hard and decided I wouldn't have written the script any other way. Not everyone ends up getting what they want, but then again that's love, er, actually. Nice little film.",
    "3": "Some parts of the movie are very sentimental, but Love Actually is a well-directed and well-acted film. The script is intelligent and funny, and while the story is a little confusing, as there are so many characters, I highly recommend this. The direction by Richard Curtis is very good and well paced. I think the film's main strengths are the acting and the well-developed characters. The standout is Bill Nighy, in an unlikely but actually hilarious role. Though Emma Thompson and Alan Rickman are very good as well, in one of the more interesting stories. There is also Laura Linney and Liam Neeson, two talented actors, if you see the two of them in Kinsey you'll know what I mean. Keira Knightly, Hugh Grant and Kris Marshall also delight. In conclusion, look out for this film. I was annoyed a bit by Rowan Atkinson, but I really like this. 9/10 Bethany Cox",
    "4": "Love Actually is a lot like actual love---it's wonderful until it isn't. Then everything blows up, leaving you to pick up the pieces of your devastated reality.Relax. I'm only kidding. Love really is wonderful, even the struggles. The movie Love Actually, not so much.The first 30 minutes or so are downright hilarious, featuring a mix of charming British humor and broader appeal jokes as well. The setup of each storyline features likable characters in relatable situations. You root for everything to work out. You want all of them to be happy.Then, through no fault of the characters, you change your attitude. Instead of rooting for the characters, you become apathetic, at best. Why? Because the movie makes every story nauseating with irritatingly manipulative music, cuts to closeups of hopeful or gleeful faces to force viewers to elicit the \"hooray\" emotions. It's all very painful and frustrating.The movie is called Love Actually (which is a great title, by the way), but so little of what occurs in the movie can be passed off as something that would actually happen. A more appropriate title would be Love Fantasy.Thirty minutes into the movie (again, the beginning shows promise and is mostly delightful), all the believable buildups have morphed into shameless fairy tale-like sequences. It's all a bunch of love at first sight silliness. Sorry if this sounds too harsh, but there is no love at first sight. The very concept is shallow and supposes a fundamental misunderstanding of what love is. There can be attraction at first sight, or lust at first sight. But not love.The most ghastly instance of using music to manipulate the viewers comes during a scene when two people, who have never spoken a word to each other because they don't speak the same language, develop feelings for each other. That is an interesting idea that could have been quite moving if handled deftly. Instead, the moment is a bit more blunt. The music indicates that the man develops loving feelings for the woman when she takes off all her clothes to jump in a lake. Viewers are led to believe that the man felt little for this woman until he saw that she looked good in her underwear, after which he fell in love with her.So, I guess the message is that you can love someone that you've never spoken to as long and the other person is attractive. It's basically a different version of that thing in movies when the dorky girl takes off her glasses then everyone realizes that she's beautiful and then the main guy character can love her now. The biggest difference between those two cases is that the dorky girl removing her glasses moment usually happens in a movie that clearly isn't taking itself too seriously, whereas Love Actually is posing as a movie that represents realistic love. That's sad to me because many viewers, especially the impressionable young ones, may walk away from this movie confusing attraction for love.Since I'm unleashing all my gripes with this movie, I may as well mention one more. This one didn't so much make me mad, as much as it confused me. It is also kind of funny in a way. I'm talking about the portrayal of the U.S. President (the movie takes place in England). It casts him as this arrogant, smug, woman harassing pig. Basically, he's a bully. So, when one of the British characters stands up to him, the music swoons once again, indicating to the audience that they should be happy that the American jerk couldn't push people around anymore.To be honest, I have no idea if this is the perception that people in England have of Americans. Perhaps it is, and the viewers from England really did applaud this moment. But I personally found it all to be laughably cheesy.That's a pretty accurate summary of my take on the movie overall---laughably cheesy. I'll just leave it at that. I recommend that you take a hard pass on Love Actually.",
    "5": "Love Actually (2003): Dir: Richard Curtis / Cast: Hugh Grant, Liam Neeson, Laura Linney, Bill Nighy, Keira Knightley: Supposedly a portrait of love featuring husbands, wives, grandparents, children, and various friends and relatives embracing in love. That is a fine picture except that it regards broken relationships and a false sense of love within infidelity. So it isn't love actually. Yet the film works due to detailed characters and circumstances. Director Richard Curtis barely holds the dozen or so subplots together but they flow with great detail. Ensemble cast includes Hugh Grant as the new Prime Minister of Britain who is overpowered with feelings towards his coffee steward. Liam Neeson plays a recent widow helping his son cope with love. Laura Linney plays a secretary trying to attract a co-worker but her cell phone is constantly ringing due to her brother being in an institution. Bill Nighy plays an ageing rock star who knows just how bad he is. Colin Firth plays a writer who falls for his Portuguese maid. Keira Knightley plays a newly wed who discovers that her husband's best man secretly had a crush on her. Great ensemble cast help keep the subplots interesting along with numerous superb locations that present different feeling. It doesn't always work due too delusional views of relationships that are the work of fiction if anything. Score: 8 / 10",
    "6": "I´ve watched \"Love Actually\" many times, maybe 9 or 10. I just love this movie! I think that it contains great acting, comedy, love in various forms, a well written plot and no, it doesn´t hurt that the movie also is about Christmas, one of my favorite holidays. It´s very possible that I´ll never ever will stop enjoying \"Love Actually\".I just can´t choose a favorite character in \"Love Actually\". I like Jamie, Aurélia, David, Natalie, Karen, Daniel, Sam, Rufus and many other. It´s easier to say which 3 characters that I dislike. That is the U. S. president and Jamies brother and girlfriend.I´m really looking forward to watch this movie again! It deserves to be watched many times if you ask me.",
    "7": "This was a most intriguing film. There are of course other reviews of it here, but the one common theme that seems to exist in all reviews is the simple fact that you can never please all the people all of the time.For myself I loved the film and the way that all the stories were intertwined. You could spend ages just trying to work out where the various connections between the story lines actually were.But there were two very special moments for me in this film. One was where Mark (Andrew Lincoln) finally told Juliet(Keira Knightley ) how he REALLY felt about her, through the medium of the messages on the cards, (surely many of us have experienced that sort of unrequited love), the other was the brilliant brief speech given by the Prime Minister (Hugh Grant) to the press conference at which the American President was present. (Both of these appear as quotes elsewhere on this site.) I felt that it was a very brave move on the part of the writer (Richard Curtis) to allow the Prime Minister in the film to state what so many ordinary British people are feeling about America and its politics right now. I also feel that we, the British, are finally beginning to move away from under the Hollywood shadow, and are starting once again to produce some really excellent films of our own. And for me, this film just underlines this fact. May this trend continue. Claire Rosemary Jane.",
    "8": "It is very funny and very touching, while at the same time showing also how some relationships fail to take off, and others destroyed or nearly destroyed, so there is food for thought there as well. I get in a good mood every time I see it, and think it is one of the best rom-coms ever (hence the rating).Recently the director have uttered weird stuff about the lack of diversity, and yes, there is no teuton knight for the golden-haired goodess, which would be true diversity in this day and age, and there is not a single actor from Korea, China or Japan, so, fair enough, it lacks in diversity. But does that really matter? In K-dramas or Chinese movies there are hardly any white people, and so what?Leave classics alone!",
    "9": "This film is an odd one in my household. Although my wife is a rather famous romance writer, for once I actually liked a romantic film more than her. I think the reason for our divergent views is that in most romance novels, all the nice people get the love of their lives by the end of the film. However, in LOVE ACTUALLY, some do but others do not. So, if you need to have a romance where everything works out perfectly, this is NOT the film for you. However, if you are like me and don't mind a bit of ambiguity about the characters, then you are sure to love this film.This story is a complicated film where there are many different stories occurring at the same time just before Christmas. What ties this all together is that the various stories all relate to each other somehow. In other words, this film is about people and their friends also have separate stories that diverge. I rarely have seen this type of film work so well.I could spend a lot of time talking about all the plots but I won't bother. Part of this is because there isn't enough space here to adequately do it and part of it is because there are tons and tons of very thorough reviews already on IMDb for this film, so I don't want to plow familiar ground. Read these longer reviews if you are interested in a play-by-play analysis.Instead, understand that some of the romances work out perfectly, others are uncertain and others are heart-breakers--just like in real life. In fact, that's the beauty of this film. While you really can't believe all the plots (some are very, very far-fetched and silly), all the people talk like real people. And the romances are just so adorable and sweet you can't watch this film and keep a dry eye. Plus, in the cases where the romance fails, I liked them as well because they all had wonderful object lessons for us all.Amazingly acted, directed and written--this is one case where a popular film actually deserves all the hoopla. In the UK it's sold like a bazillion DVDs and I can see why.By the way, there were only two things about the film I did not particularly like. First, the Prime Minister's love interest (Natalie) was a lovely woman but repeatedly throughout the film they made fat jokes about her. This made no sense, as she was gorgeous and the comments tended to reinforce the stereotype that a beautiful woman must be stick-thin--like Keira Knightley. Even if she was overweight, which she wasn't, this is gross to say and the film made it seem cute or funny to do so (not just with her but with a Portuguese lady as well). She was curvy and even if these gross comments were true, women are supposed to have curves and not be anorexic!! Second, the scene where the little boy runs through security really, really annoyed me. In reality, the kid would have either been shot or arrested and the airport would have been shut down--yet the movie shows no consequences for this insanely stupid and selfish behavior. Neither problem ruined the film but they did detract from my enjoyment of an otherwise brilliant movie.",
    "10": "Forced myself to watch it since people kept telling me \"I haven't lived if I haven't seen this movie\". Literally falling asleep. So cheesy. So boring. How is this rated so high?",
    "11": "Love Actually follows several different couples in various stages of their respective relationships. It happens to be around the holidays and has become known as a 'Christmas' film, but I think that theme is mild enough that anyone can view and any time of the year. In general the performances are solid and most of the individual couple stories are fine as well, It can feel a bit pandering at moments but not so much that it prevents the good from coming through. For me there is one scene with Emma Thompson alone on the screen that moved me very deeply and that I have not and will never forget.",
    "12": "A stellar cast is drawn together for...what? For the biggest load of tripe I've had the misfortune to sit through in a long time.Hmmm...Romantic COMEDY? Laugh...I thought I'd never start - and I was not wrong. Not a chuckle, not a titter was raised. Humour of the middle-class dinner party variety doesn't work for me. Lame, obvious jokes and cartoon characters abound. \"Common as muck\" Natalie swears in front of the \"upper-crust\" Prime Minister and we're supposed to find it funny? Charming? Believable??? PREPOSTEROUS?! LOVE? If Richard Curtis thinks his threadbare characterizations and superficial plot lines constitute or represent love in any meaningful way then he is bonkers, actually.Utter rubbish. Disney for grown-ups.",
    "13": "This is one of the worst British films ever made and I'm staggered it has such a good rating here - no accounting for taste I guess. Why is it so bad? It's cloyingly sentimental to the point of being vomit-inducing: the characters are all middle-class and boring, wrapped up in their own self-obsessed tedium. London is re-imagined as a heavenly place which it isn't. Hugh Grant plays himself yet again - ah the tedium. The jokes are unfunny. The direction is patronizing and condescending. It's also too ambitious for its own good. Director Richard Curtis has attempted (attempted being the operative word) a romantic comedy that apes the multi-narrative structure of Altman's Short Cuts. It fails miserably to weave the stories together as Altman did; instead some stories such as the Laura Linney one remain unresolved as if they don't matter to the overall naffness of this terrifyingly awful film. The musical segments are also cringe-inducingly bad. I wish Curtis would have shown some restraint.",
    "14": "I don't know what it is about this movie. I love the cast and the incredible acting. I just for some reason need to watch it a few times a year. I love how the pornstar characters are still so nervous about kissing each other even though they have had a visual relationship.and still are so nervous to kiss for t\nhe first time. And the absolute respect he gives her even though they have seen each other nude,and how he doesn't assume anything about her and sees her for who she is not assuming she is just some girl who gets naked for anyone.",
    "15": "A - Great - movie about love. love. love. Different kinds of people at different stages of their lifes meet, develop new relationship, renew relationships.Great actors serving a great director to deliver delightful cross-stories, full of very rich, funny, original, scenes. Among others, Hugh Grant is perfect as Great Britain's first minister while the \"hidden lover\" declaration to Keyra Knightley is both incredibly sweet and heart-breaking.It's puzzling to see the difference between US and international box office about this movie. This is dedicated to love, sentiments, freedom, managed through subtlety and delicacy. DO not pass it, this is a definitive must-see!",
    "16": "9/10 - touching, heartbreaking, and hilarious holiday delight",
    "17": "Just watching this again for the umpteenth time and every time it makes me smile and at times cry. A real feel good film!",
    "18": "Of course this rates a 10. It's been gaining in popularity for 20 years and is now universally accepted as a classic. If you can watch those closing credits without tearing up, you are more hard-hearted than Scrooge himself. It begins the holiday season for so many people and for me, anytime I see that it is available, I'm waiting on the couch. As soon as I finish this review, I will be tuning in to Peacock to see it for about the 15th time. My daughter even bought me the screenplay as a Christmas gift one year.In this age of cynicism and anger, this beautiful movie reminds us that love actually is all around. And aren't we lucky that Richard Curtis captured the magic for us all?",
    "19": "A great all star cast and writing is fused together with this Christmas holiday movie. The director and writer, Richard Curtis, did a terrific job. It begins in an airport and ends there. The cast included the wonderful Alan Rickman; Dame Emma Thompson; Colin Firth CBE; Rowan Atkinson CBE; Hugh Grant; Laura Linney; Liam Neesam OBE; Martine McCutcheon; Bill Nighy; Billy Bob Thornton and more. A young boy falls in love after his mother has died during Christmastime. We don't even see Anne Reid and Frances De La Tour at all due to the edits. The film director could have made two movies. Alan Rickman and Thompson played a long term married couple. Laura Linney's character is an American woman living and working in London, England with a mentally ill brother. I wished she had a happier ending in her life. The film is heartwarming tale of life and love in London, England when you wanted to live there. Bill Nighy was great as an aging rock star. Atkinson has two scenes pivotal to the plot. There were just so many story lines going on that could have edited in writing first hand. Still it's a happy film overall.",
    "20": "Silly film. A torture to sit through. There is not a single character whom I find appealing. Crude, when it could be clever. Obvious, rather than truly emotional. The wedding ceremony at the beginning is ridiculous, as are many scenes to follow. Being that, for some reason, IMDb will not allow concise reviews, I will continue to type until it is deemed I have a lengthy enough post. Well, I will continue to type as many sentences as I can. Hugh Grant as the prime minister? Gratuitous profanity, that distracted from the dialogue being spoken. Perhaps, not being British, I just don't \"get it.\"Everyone I know loves this film - I am quite puzzled.",
    "21": "What a surprisingly warm and lovable movie this is, everything falls in place in the end, if there is reincarnation I hope that I will be born again in this film, I love it .!!!!",
    "22": "Over the course of a few weeks leading up until Christmas, various friends and relations fall in and out of love and examine their relationships.This is what's generally known as a feelgood movie, but it had the opposite effect on me. It's not really about being in love, it's about the happy, giddy feeling of infatuation - it neglects to mention all the deeper emotions and complications which arise when you are in love with someone, and whenever it looks like it might start to get close to that (a grieving widower, a wife who suspects her husband has fallen in love with someone else), it makes sure it moves quickly onto something lighter. It's very badly written - vacuous and predictable, and somehow both unnecessarily vulgar and repellently sickly-sweet at the same time - which is a shame since its writer-director wrote some of the best British TV comedy of the eighties. Visually, it's tedious, and its soundtrack consists entirely of bland love songs. Its only asset is its huge cast, but since none of them have anything interesting to do or say they are mostly wasted. Big stars like Neeson, Rickman and Thornton are just plain slumming, Grant does his insufferable usual charming Lord Snot routine and most everyone else is just a Pretty Person. Only Linney and Thompson come close to drama and only Nighy (as an ageing Rod Stewart-type lothario rocker) says anything funny. If you want to see a real movie about love, made by grownups, watch any of the films of Ingmar Bergman, John Cassavetes or Nicolas Roeg, not this bland, superficial, ingratiating pap.",
    "23": "It's Christmas time and we see the love/relationship stories of several couples. There's all sorts of people - married people, single people, young, old. There's even the Prime Minister. The movie shows them falling in love, and, in some cases, falling out of love.Unoriginal, superficial, predictable and cheesy. Every romantic-drama cliché is on display, and repeated several times. Even worse, the whole romantic angle seems so superficial, like the movie should be called an infatuation-drama, not a romantic-drama.The only interesting story was the one involving a divorce. That at least felt real and gritty and had some originality. The rest seem like fairy tales for young girls.Has some funny moments but these aren't enough to save the movie.",
    "24": "One of my all time favourite movies. Those opening lines from Prime Minister Hugh Grant always catch me \"Whenever I get gloomy with the state of the world, I think about the arrivals gate at Heathrow Airport...\"I caught it on TV again this Christmas and watched it yet again. I seem to watch it every year and enjoy it, always finding one of the stories more significant than the others depending on what's going on in my life at the time. This movie always gives me a laugh and leaves me feeling good. Why don't they make more movies like this?",
    "25": "This has just about every British actor that I love most. The pairings are fantastic. There's a story for everyone. I love them all! I watch this a few times every year because it's so good and the soundtrack is amazing.",
    "26": "There are some romantic comedies that could be used as a blueprint. Or maybe some directors should just watch them, before they bring out their bog standard version of \"man loves woman\" and vice versa. This episodic tale of ... well \"Love actually\", has great actors in it (Bill Nighy, Keira Nightly and so forth), that make the most of even small stories and screen time.While this set around Christmas time, this is also a hint, that you shouldn't take the movie too seriously. The romantic factor in the stories works and every kind of love gets a stab at. It is a feel-good movie, a movie that speaks to the heart and actually achieves to send this message (again, too many shallow rom-coms, not here/this one though!)! I'm cynical too, but sometimes it's nice to have movie, that shows you what different meanings love can have and how love is perceived by different individuals!",
    "27": "After seeing this I wanted to inflict actual bodily harm on Richard Curtis. I'm not joking. I really, really did. Love Actually is the vilest, most ghastly, most putrid film I have ever seen. It is appalling. The nadir of Curtis's output, it is a toe-curling abomination. Where to start? What about the pure, undiluted cynicism of the enterprise, evident in everything from the music to the manipulative sentimentality to the use of children to the Christmas setting. It's a film with no heart, no structure, no sense, just a series of orchestrated, contrived scenes, augmented by the odd stale comic line (eg 'Now I can only get into dresses that belonged to Pavarotti') and utterly stupid improbabilities. To go through those would take way, way too long. And what's with the use of bad language in the most inappropriate of situations? Do not see this vomit-inducing turkey of a movie, especially in a couple if you're a man because it may well end your relationship, which would actually be quite ironic, eh Mr Curtis?",
    "28": "Finally something fresh for Christmas.  Sure, it takes 20 years to determine whether a film becomes a classic.  Trust me: the ingredients are there: Character chemistry, fresh writing, memorable antics ... It's a feel good film and a mirror for whether you've got the right stuff in your own love life.  \"Classic,\" agreed Frank Capra's spirit, \"just in time for (every) Christmas.\"It's the first chick flick (they make no bones about it) that's 2 hours 8 minutes long where 'No One' gets killed and 'nothing' explodes that I actually liked.  Scratch that. ... Loved Actually!If you miss it in the theater (huge mistake), know you'll be seeing it again for decades to come right around this time of year.  ... enjoy.",
    "29": "Its totally different to most others in the genre, it stereotypes the clichés and then mocks them beautifully, it explores different types of love, couples, married couples, kinship, business relationships, etc. There's actually eight stories in this film, some cross over, some blend together and some stand alone, but they all play wonderfully; and the humour is consistent from start to finish.Littered with top names, and scripted by the brilliant Richard Curtis -Love Actually breaks the mould of the romantic comedy genre while remaining totally appealing to the fans of the tradition.10/10 Brilliant.",
    "30": "Love is tender.... Love is kind.... Love is a felling that you must feel to express. This film manages to take several tales seldom told, and weave them into a timeless classic. The Beatles may have said \"Love is all we need\", had they seen this film the title would have been changed to \"Love Actually, is all we need\" My hat comes off for the Writer, Director of this piece. This was an effort worthy of career in the industry. A+, 5 Stars and two thumbs pointed towards the sky.I think this movie will be come a Christmas staple and every years it comes on your will realize that more and more of these actors have gone on to critical acclaim. Get in on the ground floor of an amazing film. With love, actually, your motion picture monkey!",
    "31": "A film where the spark of loves, embraces many, and where you be fully absorbed unto the end.......",
    "32": "I just adore this movie. Every year I watch it multiple times at Christmas. So many stories all woven together seamlessly with highs and lows across the emotional spectrum.There's a nice mix of actors and they all fit their roles so nicely. The exploration of love and what it means to different people along with what it can cause us to do is all covered.Even having watched it so many times I still get lost in the different storylines and even forget some only to suddenly remember them part of the way through.If you haven't already seen it then do yourself a favour and watch it!---------",
    "33": "I have to say, I've never been too happy about British humor, I've always been more fond of the American humor. This movie has turned it around; while not always being laugh-out-loud funny, it is persistently funny, throughout pretty much the entire thing. I can't say I was bored at any point in the movie; even when it isn't funny, it isn't boring. And this is definitely the best movie I've ever seen about love. At the beginning, a lot of the characters are alone and lonely. At the end, most of them are with their love, having found the 'one and only'. I enjoyed every aspect of this movie, Hugh Grant being his typical British charming self, Keira Knightley being her adorable sweet self, even Rowan Atkinson's small, yet funny character amused me. This is not only for couples, or people who have found true love. It is most likely enjoyable, at least a little, to everyone. Whether you like British humor, wonderful music, or romance, you won't be disappointed. This movie has all three, and plenty of each. This is for anybody who likes funny movies, romance, and isn't too easily offended. 10/10",
    "34": "I re-watched this last night, as is my yearly tradition. This movie has it all, laughs, tears, things to anger you, all set around Christmas. This is actually eight different love stories intricately woven together into a wonderful single film, with a six degrees of separation theme involved as well as almost every character is connected to at least one other character in the film. If you can make it through this movie without laughing aloud a few times, or shedding a few tears, then you are inhuman, much like the Grinch before his heart grew. This is star studded with some of Great Britain's finest actors and is just as good on the tenth viewing as it was the first.",
    "35": "\"Love actually\" is a nice movie. You can see love in different ways, observe people's feelings, and understand what people can do for their loved one.It also has a pretty good cast. This film follows the lives of eight very different couples. With it you can believe that a miracle really happens, because someone can even fly to another country, learn another language, just to see their love, to ask to get married knowing that she can refuse.So, It's romantic, funny and everything happens at Christmas. I highly recommend watching this movie, especially if you can watch it with your loved one. It will bring you a good Christmas mood and you will enjoy it!",
    "36": "English actors and movies just have it. I don't know what it is but they got it.'Love Actually' brings a ton of charm and wit. It has those happily ever after stories, the tragic ones, and those that drive you nuts.Eight may be a lot of legs, but so is eight different love stories in one movie! Nine if you include Billy Mack and his fat managers bromance. You may not get as much closure as you'd like in all these stories, but there's still enough with the rest to make it a great film, and a Christmas one at that. Though, at the end I'm left asking, what about Miss Dunkin' Donut 2003, doesn't she deserve love?'Red Nose Day Actually' is a really nice add on 13 years later. It makes you smile and compliments the original.",
    "37": "A long time ago i went to see Love Actually only to indulge a certain lady. It turned out it's been one of those romantic comedies that captured the essence of the genre. Not only that i went out of the theater in good spirits, i've seen it several times since with repeated satisfaction.So what is this movie about? Obviously, the title explains it all and might even summarize the plot. It tells several love stories and covers more or less all variations. Yet the best thing with Love actually is that it vibrates with positive energy without becoming cheesy, stupid or vulgar.",
    "38": "The nicest thing about enjoying Love Actually at the holidays is that it stays current.This is our family's standard holiday movie. It's just fun.",
    "39": "Richard Curtis may well be best remembered for co-creating sitcoms such as 'The Vicar Of Dibley', 'Blackadder' and 'Mr. Bean', as well as penning sketches for 'Spitting Image' and 'Not The Nine O'Clock News', but he has also made a living out of making movies such as 'Notting Hill', 'Four Weddings & A Funeral', 'Bridget Jones's Diary' and this. Curtis' Christmas rom-com 'Love Actually' rocked the world when it first hit the cinema screens in 2003, winning numerous awards to its creator and its stars.I feel I need not go into great detail about it as its synopsis has been pretty well listed on here and indeed other sites. My review mainly concerns my opinion on the performances of the cast and the quality of the writing.I didn't see 'Love Actually' until a year after its release when it was repeated on a satellite movie channel. Though it did not strike me as a wonderful film, far from it, I was rather taken with the thoughtful message behind it, the message being that even in a world full of hate, war, greed, intolerance and destruction, in the words of the famous song ( which is sent-up here ), 'love is all around'.Impressive in their parts are the late Alan Rickman, Martine McCuttcheon, Hugh Grant ( in what I consider to be his only decent acting role ), Emma Thompson, Bill Nighy, Gregor Fisher, Sienna Guillroy, Martin Freeman, Joanna Page, Kris Marshall, Billy Bob Thornton and Heike Makatsch.Not so memorable. in my personal view however, were Colin Firth, Liam Neeson, Rowan Atkinson, Laura Linney, Rodrigo Santoro and Olivia Olson.Many of the cast seem to have profited from the success of the film. Emma Thompson later landed the lead role of the kids' comedy film 'Nanny McPhee'. Bill Nighy and Gregor Fisher both appeared together in the 2010 assassin comedy 'Wild Target', Sienna Guillroy was awarded the role of Jill Valentine in 'Resident Evil: Apocalypse' while Billy Bob Thornton gave us 'Bad Santa'.'Love Actually' is sometimes hard to follow at times but on the whole I liked it and, whilst not the biggest favourite of mine, there were some fine moments in the film which made it memorable.This year, a short sequel was made for 'Comic Relief', reuniting its cast, minus Gregor Fisher, his character having been killed off, much to the dismay of many of the film's fans.",
    "40": "Remember what Diana Ross said: \"Can't hurry love, you just have to wait  Love don't come easy, it's a game of give and take\"Well, according to \"Love Actually\", love can come easily and quickly, count five weeks till December 25th... and you'll get it.I remember the first viewing was with my best friend precisely at the end of December 2010, we wanted to watch a gangster film but, after filling our stomachs with some cans of beers, we decided to loosen up a bit and give a chance to the most improbably enjoyable film: a Brit Rom Com  and after more cans of beers, we were ecstatic. For me, it was the most feel-good and warmest romantic comedy my heart ever experienced, I almost wanted to hug my buddy and open my heart to him. The feeling lasted.I saw it again, two weeks ago. I was left perplexed. I didn't even want to finish it. The magic disappeared. And I was almost ashamed of my initial reaction. Guess what was the only parameter that changed between the two viewings (besides being sober)? This time I was married. And this time I saw the film with my newlywed wife, and what my heart 'experienced' the first time, was 'endured' the second. In one year, I believe I learned one thing or two about love, and more than anything, about commitment. I know \"Love Actually\" is meant to be a kaleidoscope of all the love-induced situations that ever graced the silver screen for pure dramatization's sake, but this leads to underdeveloped stories canalized by a succession of painful clichés. \"I love you\" might be one of the simplest and most touching words ever said in a lifetime, it's also the most intimate and I'm not sure everyone would make a declaration of love in a crowded place.And I can go on and on with all the situations that rang false in my book. Mourning a wife's death is a devastating experience that can't be swept off just because Junior is in love with the most popular girl in school, no matter how creepily smart he sounds. Being betrayed by his wife and brother is the kind of humiliations that would severely knock out any grown-up man, and I'm not sure all it took for Colin Firth's character was a non-English speaking Portuguese housekeeper. I'm not sure it takes a girl taking off her clothes in slow motion to create a love at first sight, when lust would be the most appropriate reaction.Love is not just like that, and love is not \"just like that\" (snapping fingers). And \"Love Actually\" consists on a successions of wannabe witty romances that would have made Woody Allen roll over his grave, if he was dead. Oh yeah, and the whole thing is packaged in a dazzling celebration of post-9/11 post-modernistic political correctness which is a real insult to reality. A young man is in love with his best friend's wife, and we should just \"oooow\" about this because Keira Knightley is just so irresistible. The betrayed friend happens to be black like many other secondary characters that embodies the so cinematically convenient idea of differences that 'make no difference'. I never care about racial minorities' depictions in films, but since the film was obviously desperate to prove its open-mindedness, then why not featuring Indians, Pakistani, Arabs or Muslim characters for that matter? Oh yes, of course, they don't celebrate Christmas.The racial thing is just the tip of the iceberg, that -in fact- betrays an extreme shallowness in the script.One of the Prime Minster's assistant is black, and can easily be regarded as beautiful or ugly, following the tastes. At one point, she referred to the PM's secretary as fat, when she was just voluptuous and quite frankly had more sex appeal than her. But we're supposed to see Natalie as the ugly duckling while she's really attractive. Natalie is ugly by cinematic standards, just like her foul-mouthed language proves that she comes from the 'worst part of London'. Enough to make her unlikely romance with the PM (Hugh Grant, ladies) happen  Well, this was one of the most blatant cases of useless manipulation since the romance between a head of state and a secretary was already good material.I can't believe I missed these details the first time. But at least, it makes sense considering the way the stories are handled, some end happily, some very happily, and 'foursome' lucky dorks, the Christmas miracle happened.\"Love Actually\" betrays more what it tries to be, than what it actually is. Not any movie can have the wit of \"Four Weddings and a Funeral\" and the warmth of \"Annie Hall\" so the film can only exploit the magic of Christmas and a penetrating music to beg us to feel good for archetypes, you know those formulaic \"You'll laugh! You'll cry!\" slogans.And they're all here, the workaholic architect, the lonely writer, the office's slut, the wife (Emma Thomson) who endures the infidelity of her husband (Alan Rickman) with dignity, the climactic race to the airport for a simple declaration of love, all the multiple story lines tying up at the end in the most artificial ways (did the stories all need to be connected?). The movie tries to satisfy everyone, with interracial love, kids' crush, international love, class loves, infidelity followed by divorce, infidelity followed by reconciliation.Yet, the film is so politically correct that it didn't even have the guts to ruin the 'Family' feeling by having a gay couple in the storyline, so we have a Rock star who prefers to spend Christmas with his manager, two body doubles pretending to have sex is one thing, but is a gay couple for Christmas asking too much?",
    "41": "Slice of life. This is for the young ones who think that with age you will have maturity and you will be self-assured when it comes to love :).",
    "42": "Somehow it almost seems like people are blind who like this movie. Either that or they somehow ignored the 95% of the movie that's crap and only remembered the 5% of \"feel good\" parts.I watched it because someone on a podcast I listen to said it was her favorite movie and she's watched it more times than she can count.I like \"good\" romcoms, maybe even mediocre ones. I remember enjoying Crazy Stupid Love for example. I remember enjoying My Best Friend's Wedding. So I was assuming this would be along similar lines. Boy was I wrong.There's 9 stories and almost all of them are crap---A British guy that believes if he goes to the USA he'll get laid. And guess what, he goes straight from getting off the plane to a bar and 4 hot roommates pick him up for a foursome. He then brings a 5th home to England and a 6th for this best friend in England who the moment she gets off the plane walks up to the friend and starts kissing him.WTF?!?!?!---A Writer who falls in love with his assistant, who happens to be 16yrs younger than him. They don't speak the same language. They hardly interact with each other. But somehow the movie claims they fall for each other. Nothing is ever shown to convince us of this except one moment where the girl undresses to jump into a lake to rescue some papers. That's not love that's lust, actually---A man in power over a woman has her fired because he has feelings for her. That's called sexual discrimination. Oh but it's okay because on Christmas eve he seeks her out. Please run this by some SJWs and see how that goes.---Girl interrupts sex with the man of her dreams who she's been longing for over 2 years because of a phone call. Any normal person would have pulled out the battery or turned off the phone. We're supposed to let this go because of \"reasons\". It was ridiculous---We have a boss who tells his subordinate to go hit on some other employee. We also have an employee who spreads her legs to try to entice her boss. Both of these would be called sexual harassment but because it's a \"romcom\" suddenly we're supposed to turn off our brains?---We have a best friend not along longing for his best friends bride / new wife but even going so far as to tell her. In what fantasy world that ever be a good idea?---On top of that it has 3-4 formulaic musical numbers. You know you're being manipulated when they pop on some old popular song and spend the next 3 minutes of filler with the song trying to transfer your affection for the music to the movie.---The mildly good arcs were maybe the aging rock star and Liam Neeson and is son's story though the love at first site moment toward the end was most more drivile.---Based on several lines, scenes, and actions in the movie it's clear the writers of the movie really should have titled this \"Lust, Actually\" Every romantic relationship in the movie is entirely based on physical appearance and sexual desire. None of it on love, appreciation, affection, respect. I'm all for lust but there's no balance here. Love is never shown, only lust.I guess I was lucky I missed it when it came out in 2003. I feel worse off for having had the last 2 hours and 14 minutes of my life wasted by this bad poorly written movie",
    "43": "Minor spoilersThe title of the movie, in full, is Love Actually Is All Around, which tells it all. It's an amalgamation of many stories, with a common theme, love. Of this type of movies (I don't think it's big enough to be called a genre), the one I like best is Playing By Heart (1998) which, by comparison, has a little bit more to offer in stories, characters and coherence, as well as a brilliant coup in the end that ties everything together neatly. Love Actually is nevertheless an enjoyable movie, particularly in the holiday season. Also, a movie with British accents is always a refreshing experience, even though it is not a Shakespeare, Shaw or Wilde adaptation.\nFor me, the movie starts with a powerful vampire (I just saw Underworld a week ago). Bill Nighy, considered by many as the best of the lot in this movie, is however not the whole show. What I would like to do is to rank the stories/relationships in the movie by purely personal preference.1.  The love story in which language barrier is demolishedThe relationship between Jamie (Colin Firth) and Aurelia (Lucia Moniz) is one of beauty in simplicity. The play with the language barrier is quite clever. Firth, who played a marvellous Jack in The Importance of Being Ernest, is all sincerity and gentleness here. Don't know how they discovered Moniz, but her exquisite charm is quite irresistible. Together, they make the most beautiful pair (visually and romantically) in this movie, and get my gold.2.  Friendship is love, and love is friendship   The silver I award to a pair of business partners who, unknowingly until the sparkle of Christmas magic, has become life-long, loyal friends. The ambitious title of the movie simply cannot be fulfilled without a couple of old guys having a few beers on Christmas eve in front of a TV set watching.whatever (the movie says porno, but an NFL or European Cup game will do just as well). Must not forget to mention the outstanding performance of Bill Nighy.  \t3.  The `self-preservation' silent, unspoken loveThis is a bit of a dark horse choice for bronze, but I do find Mark's (Andrew Lincoln) silent devotion to Juliet (Keira Knightley) rather affecting. Maybe it is because of the scene at Christmas Eve, his one and only attempt, in a somewhat clumsy but at the same time cute way, to express his love to lovely Juliet. 4.  Father and stepsonHad this been father and son, this would have much less impact. Unrelated by blood and probably starting as total strangers, Daniel (Liam Neeson) and Sam (Thomas Sangster) develop a bond and relationship that grew initially out of a mutual love they shared, and then a mutual love they lost. Funny rather than tear-jerking, warm rather than sympathy-courting, the relationship between this pair is nevertheless touching in many ways. Acting is great: Neeson, yes; but the boy!!5.  Middle life crisisThe story of Harry (Alan Rickman) and Karen (Emma Thompson) is probably played out every single minute around the world, through a couple of centuries. What makes it stand out here is superb acting, sensitive treatment and a forgiving spirit befitting the Yuletide season.6.  Prime minister's fling`Youth must have its fling' is favourite G&S lyrics, used in both The Mikado and The Pirates of Penzance. The Prime Minister in Love Actually, however, despite Hugh Grant's youthful look, does not exactly fit the description of `youth'. Fling he must have, anyway, with housemaid Natalie (Martine McCutcheon). Besides being way overdone since Pretty Woman, the reason why this Cinderella story doesn't sell me is that McCutcheon I do not find particularly appealing. Given a very similar situation, I would prefer Jennifer Lopez in Maid in Manhattan any day.  7.  The inexplicable obstacleThe story of shy Sarah (Laura Linney) and almost-as-shy Karl (Rodrigo Santoro) would have ranked much, much higher, especially after that magical dance that many of us will relate to, with treasured personal references. It's as if the scriptwriters can't bear the idea of having all the stories end happily, even when Christmas is all around. Otherwise, how on earth can it be explained that a sister's devotion to an emotionally handicapped brother can come between such a beautiful love affair. It's an insult to the two characters, as well as to the audience.8.  The love god in the wild, wild west Colin (Kris Marshall) the love god's is a farce that this movie can do with or without. In Christmas spirit, I'd say we keep it.Finally, I would just like to mention that there is a great deal of references in this movie, particular to the music of the 60's and 70's, from the unabashed used of `Both Sides Now' to the subtle mention of `Alone Again, Naturally'. It's a pity that they don't actually play this ballad by Gilbert O'Sullivan, one of the most beautiful songs ever written.",
    "44": "One of the classics, best feel good movie, great characters and casting was perfect and to add in the Christmas theme, winning formula.",
    "45": "One of the best Christmas Rom Coms along side the likes of Die Hard and Lethal Weapon",
    "46": "This quilt of a romantic comedy has all the elements of a modern classic, and knows very well how to pile them on. Richard Curtis' script is clever without trying to be too clever, and he manages to rein in his abundance of characters and relations in a satisfactory manner, at least when taking into account that this after all is a genre-movie. It's possible to get some interesting and perhaps even heartfelt perspectives on life and love out of this, but most of all Love Actually is about good old-fashioned British comedy. Self-mockery, awkward situations and shortcomings. Ingredients that make you feel better about yourself afterwards, and perhaps even willing to accept some cheesy, sentimental romance to boot. Yes, it's manipulative - delightfully manipulative.",
    "47": "'Love Actually' is a typical British romantic comedy film with a long list of well-known stars. This film is all about love and consists of several different stories that demonstrate love and relationships and how different people behave in their relationships. (We see the prime minister strike up a relationship with an intern, a writer falling in love with a non-English speaking foreign girl, a married woman suspecting that her husband is cheating on her, and many more scenarios similarly and globally linked. It's a super-sweet film, and if you enjoy films with a so-happy-they-are-sad ending, then you will like this one. Do not bother if you do not care for this genre of film because you will be bored.",
    "48": "The first movie i enjoyed so very much and on my repeat Christmas list annually.",
    "49": "Always I was impress for its force of seduction. Sure, great cast, lovely stories, impecable craft. But , an other detail remains real significant - the feel to be your story. To be part of it. Nice and powerful. This could be the basic reason to see , time by time \"Love Actually\" not only as beautiful film but as a personal trip across memories.",
    "50": "Just caught this one on DVD. It's one of the most self-indulgent, overdone movies I've ever seen. A huge, nearly formless, undisciplined mess. There are scenes in here that, if viewed as short clips, are kind of funny and work fairly well, only to have every shred of their credibility leeched away by director Richard Curtis with some unbelievable and patently false follow-up moment.The result is that characters move from the realm of real, identifiable people to soulless plot monkeys in the flicker of a few frames and a music cue. This is not the fault of the actors, who struggle valiantly to connect to their characters, but they are all eventually undone by Curtis' desperate preciousness.How can Curtis be praised for his humanistic touches when he absolutely refuses to allow his characters to exist as real people?Horrible plot thread example No. 1: Within a five-week period, a writer, (Colin Firth) is betrayed by his girlfriend and brother, goes to France to write a book and falls in love with his Portuguese house keeper with whom he's had only the barest of conversations due to a language barrier; he finishes the book, learns enough Portuguese to ask her to marry him - all while never once seeming to be in any sort of anguish or psychic pain due to the betrayal...Wrong! False! LIE! This relationship is DOOMED! It's fraught with delusion and warning signs; and yet Curtis insists that its all cute and evidence of the wondrous mystery of love.Horrible plot thread example No. 2: Within the same five-weeks, Liam Neeson buries his wife, is told to `move on' by a friend, and apparently seems to have done exactly that in meeting a Claudia Schiffer look-alike (played by Claudia Schiffer, how precious) at his son's Christmas pageant. So any of you out there mourning the death of a wife or husband, the message here is that if you haven't paired up again within a few scant weeks, just get over it and move on. It's been a whole month already and you are boring us all with your `grief,' which Curtis would seem to define here as self-indulgent blah-blah-blah. And for you others out there, if a friend or relative is dealing with the death of a partner, you are, by Curtis' logic, probably entitled to start mocking them within a few weeks:`How's it going, Joe?'`Not so good. My wife died a few weeks ago. The house seems so empty.'Then you come back in that high-pitched mimic voice. `The house seems so empty. The house seems so empty! Well cry me a freakin' river!'I could outline more plot threads just as horrible, but why bother? Suffice it to say that it is a sorry state of movies when I can recognize deeper and truer levels of humanity in Ron Perlman's Hellboy character than I can in any of the people here (barring the Alan Rickman, Emma Thompson story thread; they survive relatively well).The more I think about `Love Actually,` the angrier I get. It lies and lies and lies about human nature. The fact that it is rated as high as it is on this site depresses me as deeply as the movie itself did.",
    "51": "LOVE ACTUALLY (2003) **** Hugh Grant, Emma Thompson, Liam Neeson, Colin Firth, Alan Rickman, Bill Nighy, Keira Knightley, Laura Linney, Rowan Atkinson, Andrew Lincoln, Martine McCutcheon, Thomas Sangster, Olivia Olson, Rodrigo Santoro, Lucia Moniz, Martin Freeman, Joanna Page, Billy Bob Thornton, Denise Richards, Ivana Milicevic, January Jones, Elisha Cuthbert, Shannon Elizabeth, Claudia Schiffer. Utterly charming valentine to romantic comedies, romance and love – not necessarily in that order – from acclaimed genre screenwriter Richard Curtis (in his directorial debut) as a valentine of sorts to hopeless romantics and those who don't know better. Interweaving several plot points amongst a dozen or so characters including Grant as the British Prime Minister who is falling fast for his tea&crumpet server McCutcheon; his sister Thompson who is in a possibly rocky marriage with Rickman who is mulling over having an affair; Linney as Rickman's associate who is pining for fellow co-worker Santoro; Neeson as Grant and Thompson's recently widowed brother and stepfather to the young Sangster who is experiencing his first pangs of true love in the form of coed Olson; porno stand-ins Freeman and Page courting one another shyly; Nighy as a fading rock star trying to cash in on an oldie but a goody for a holiday comeback; and lastly Firth as a writer recovering from a troubled break-up falling in love with his comely assistant, the lovely Moniz. Set during the holidays Curtis wisely milks the emotions of the season with his crackerjack cast, sharply witty and surprisingly poignant screenplay and an effortless ease with the back and forth of each vignette perfectly paced and skillfully observed. An instant classic and one of the very few movies I actually felt good about myself for seeing immediately after – truly enlightening and uplifting. A choice soundtrack including Dido, The Pointer Sisters and The Beach Boys sure doesn't hurt either. Very funny, romantic and altogether perfect! One of the year's best films.",
    "52": "Multiple over-lapping stories reflecting the many faces of love - young, unrequited, fulfilled, soulful, carnal, betrayed, improbable - all taking place in the weeks before Christmas. The film is fun, clever, very well written, and has an excellent cast. The cross-cutting between stories takes some getting used to and viewers either have to pay attention or follow one of the various plot-summaries on-line - but it is worth the effort.",
    "53": "Love Actually is an almost perfect comedy. It tells many different stories simultaneously and every single one of them is engaging and funny. Because of the multiple plots the spectator doesn't have time to get bored. The different scenarios are quite diverse and depict people of different ages, cultures, wealth. Therefore, there is a high likelihood that the spectator finds at least one of the stories relatable. Every character goes through ups and downs but the movie rewards us with a feel-good ending, which makes it a perfect Christmas and family movie. I truly believe that love actually is a benchmark for all comedies and Christmas movies out there.",
    "54": "I can't even fathom the amount of times I've heard people rave about Love Actually. Its one of those movies that people say they watch every year and how much they love it. I even started watching it last Christmas and just didn't make it all the way through for one reason or another. Honestly, you really have to be in the right mood to watch the film because in many ways despite it following a very predictable recipe, it is a very uniquely styled film. Love Actually is very British starring a host of very famous British actors and being set in London with all the quirky dialogue you'd expect from a British film. Its a film with multiple stories all happening at once and intersecting in small ways which some people really like. I actually think the movie maybe overdoes it with the multiple story lines because as good as everyone is and each story has its own merits, some are lost and you're left feeling like some of the characters' issues are unresolved. Still, its a funny, quirky, emotional film with a ton of familiar faces and great characters. Love Actually is unapologetically a seasonal special for adults. Nudity, bad language, sex and mature themes abound in the film which is unusual for a \"Christmas\" movie but why not? Adults deserve a movie for them exclusively. Still a lot of the mature content is perhaps almost unnecessary.Talking about a cast like this is really hard because it is the definition of an ensemble cast. Its a whose who of British actors with a few Americans thrown in there too. I will list some of the more significant characters and actors. Hugh Grant (watching this made me realize how much I enjoyed him when he was in his prime as a comedic actor), Emma Thompson (always amazing), Liam Neeson, Bill Nighy (small role but absolutely adore his insane character), Gregor Fisher, Colin Firth, Martin Freeman and Joanna Page (though I could have done without their story entirely. Its unnecessarily adult and changes the tone of the movie.) Andrew Lincoln, Kiera Knightley and Chiwetel Ejiofor star in a sub-plot that I didn't particularly care for either. It could have not been there and made very little difference. Laura Linney, Alan Rickman, Martine McCutcheon, Rodrigo Santoro and Thomas Brodie-Sangster round out the main cast. I think I've really covered the main people that at least have significant screen time. As I pointed out I felt like a few of the stories took up more time than necessary and sort of cut into the stories that you really wanted to see more of like Liam Neeson's storyline with his step-son and Hugh Grant's story. Both of those (for instance) could have made their own film.Its amazing that this was Richard Curtis' directorial debut and he wrote the film as well. I also have to mention that Curtis (who has only directed two other movies since this one) directed the AMAZING (one of the best films of last year) About Time. He knows a thing or two about evoking emotions and he uses this top notch cast extremely well. I do sort of get why people adore this movie so much. It has a lot of very memorable scenes and while it is based around Christmas, it doesn't shove the idea down your throat that its a \"Christmas\" movie. Its a subtle holiday film that deals with multiple versions of what \"love\" is. For the romantic in all of us, you'll definitely enjoy it. It didn't floor me, in fact considering its reputation I thought it could use a little fine tuning here and there. It felt sloppy at times. Still I enjoyed myself, had some fun, and I totally get why people rave about it. Maybe the expectations were set pretty high. Definitely check it out for something a little different this holiday season. This is technically my first Holiday film for 2014 and I love my Christmas movies!! 7.5/10",
    "55": "I'm a pretty cynical person but this movie helps remind me of how important the live in my life is. I've watched it countless times and each time, it gets better. Family love, friendship love, partnership love makes this film so readily available to everyone. It hits in all the right spots from STELLAR acting to phenomenal writing and directing. My only gripe is the lack of diversity but the director and writer has even publicly agreed with that. The score is iconic, the plot is so loveable, the characters redeemably quaint. I honestly question people who dislike this film or haven't seen it in the 20 years it's existed.",
    "56": "This film has a lot of charming little stories that all come together. It's all very \"feel-good\". Each story is nice in its own right but all together it is more than the sum of its parts.",
    "57": "Love actually is probably one of the most positively uplifting films of all time. No one should go into this expecting something bold or novel or profound. It is shallow, trite, naive, and confounding. But it is also charming. Indeed The films strength lies entirely with allowing us suspend our disbelief and be absorbed by its charm. When attempting to judge the film with a disinterested eye, many flaws emerge. The film is too long yet too short- there are too many characters vying for screen time in a 2 and one quarter hour long romcom(most romcoms are 1 and a half hours long). I would have much preferred it if the film were less ambitious and stuck with just 3 characters, maybe the Collin Firth, Hugh Grant, and Keira Knightley characters, for I feel these characters' stories were the most charming of them all. The film also has a tendency to veer towards corniness and sentimentality, and much of the dialogue is terribly average. But I don't care. Especially for the first hour or so, Love actually succeeds in persuading the massive cynic that I am in being absorbed by the film. And that for me is an achievement for any romcom.",
    "58": "Man, we REALLY loved these interwoven epic dramas in the 2000s, didn't we? As with many anthology films, Love Actually is a hit-and-miss outing that is nothing more than the sum of its individual parts. Thankfully, the hits (porn stand-ins, Linney's brother, Rickman and Thompson, Neeson and his son, Nighy) do outweigh the misses (travels to America, Knightley and the best-man, parts of the Grant and Firth stories).",
    "59": "Seeing this every year it never stops being emotional effective of joy and some sadness . These short stories have a nice blend of characters and the Cast is amazing! The music is also key and sets the mood perfectly !",
    "60": "This is one of my new favorite movies. I don't know how i have been living without this movie. A kind of original plot and an all star cast ,i mean, we are talking: Keira Knighley, Laura Linney, Hugh Grant, Liam Neeson, Emma Thompson, Rowan Atkinson, and TONS of other huge celebrities. This is a real heartwarming movie. Tons of humor and beauty for the whole family (well, if they are aloud to see it). All leading up to a great climax. And it shows some of the beauty that the world does have. And that love ACTUALLY is all around. I swear, if you don't see this movie, someone will kick you. Ask any one around. I was talking about this today at school and it was one of my teachers favorite movies. It also kind of redefines stereotypes and everything. Please, if you see one movie in your life, let it be this.",
    "61": "It made me laugh, it made me cry, it made me smile, hug everyone, tell everyone how much I loved them!!! I think the music is the true soul of this movie. Cheers for the director!!! So many beautiful films he's been doing for so long!!! There was no need of marvelous photography, neither splendorous costume...but every detail was placed perfectly. Excellent actors and performances. It was a very good combination of experienced ones and some others one had never seen before. I liked very much how the director showed how open minded the English people are, by the way Liam Neeson talked to Sam and some other aspects on other dialogues as well (related to sex) It is remarkable also the way they mention the American society. Not criticizing the people and the culture, buy yes the government. CONGRATULATIONS ENGLAND!!!!",
    "62": "Conclusively, without doubt, undeniably, unmistakably, unquestionably and irrevocably THE worst movie I have ever seen in my life.The only reason I was able to sit through it is that I couldn't look away from this horrific car crash that injured so many fine actors (not to mention a handful of appalling no-names).On the few occasions that my nausea subsided, it was brought back with a vengeance by the unbelievably bad music selection, the piece de resistance being the primary school's blood-curdling rendition of Mariah Carey's 'All I Want For Christmas'.Every time you think the film can't get any worse, it somehow manages to, which is quite a mean feat I must say...",
    "63": "This is absolutely one of my favorite movie of all time and whenever I'm feeling nostalgic and want to see a bit of London, then this is the film I watch. All the characters and stories are intricate and in a light heart funny way. I am just simply stunned by the performance and stories and how every lasting they are, I can watch this every year and it never gets old. I love the plot, the London scenes, the whole comical story and message behind it all and how it blends into one that has become a favorite with our family. This movie packs a lot in two hours but it works. It hits hard and I would consider it a Christmas classic.",
    "64": "It's overly sweet, like most romantic comedies tend to be, but it's got a great (but oversized) cast, who are lots of fun. And it takes some fresh turns. Solid family Christmas flick.",
    "65": "Here is a comedy that goes a notch above most good comedies. It somehow manages to juggle a whole bunch of characters and their stories over the course of the movie, all with satisfying resolutions. Now, I won't say that everything the movie does is perfect, because there are some choices that bother me. The most prominent example being the boy who pines for his best friend's new wife. Also, the guy who goes to America to meet girls was too over the top. But overall, it's very likeable and gives a lot of talented people some fun stuff to do. The highlight? Bill Nighy. It's always going to be Bill Nighy.",
    "66": "I find Love Actually (2003) is very lovely, Because the stories are very heartwarming, and the British Christmas movie itself is very popular in the USA. The characters are very likeable. The story writing is very charming, endearing, clever and witty. Also it is better than Christmas Cupid (2010). The Billy Mack's festive cover version of Love Is All Around is called Christmas Is All Around is rather witty, clever, catchy, awesome and it's sets in during Christmas time. Jamie's relationship with the Portuguese girl called Aurélia is very sweet and heartwarming. As well as the British boy called Sam's relationship with his American Classmate called Joanna. I'm giving this a 10/10 and Merry Christmas.",
    "67": "I wouldn't have given the movie 9/10 but for the pathetic group of the offended. They're creeping in everywhere it seems. A light hearted inoffensive movie with some gentle laughs and digs at relationships can apparently offend some to the point of wanting the thing banned. I would rather they directed their attention to the virtue signalling, racially and gender appeasing rubbish that is being touted lately. That's what offends me.",
    "68": "Love Actually is actually really good. The versatile ensemble cast is all-time great. Love Actually's actually an excellent Christmas movie even though it has nothing to do with Christmas but people are desperate for good Xmas movies because there are just not enough of them to go 'round it seems like but you just have to take what you get. Love Actually's actually really funny too. I adore Love Actually! It's a British hit. I love Laura Linney. She makes the movie with her performance. Good stuff. This is how you do intertwining character stories in a romcom with a bunch of stars from the United Kingdom. I especially like cutie Martine McCutcheon as Natalie. I wish she did more Hollywood movies she's great. LA is actually a classic Xmas movie that you can rewatch again and again. It's good basically. With a lot of Xmas cheer.",
    "69": "I'm sure everybody has watched this movie at least once at this point. I'm just here to gush about how this movie has become a part of tradition over the years. I watch this movie every year on Christmas day. Today was one such day.",
    "70": "If you're feeling under the weather, it will always bring a smile, a laugh, a giggle.Full of happy sad and giggle moments the whole way through.A Warm Fuzzy Movie.",
    "71": "Love Actually is an amazing romantic-comedy about all of the different aspects of love. It engages with unrequited love, lost love, parental love and family love. It does this through a number of different narratives and characters, which all, for the most part, work very well off each other. Mostly, none of these narratives are under or over- represented. This is partly due to the great ensemble cast consisting of Emma Thompson, Alan Rickman, Andrew Lincoln, Keira Knightly and Rowan Actkinson amongst many others. For me, Rowan Actkinson was undoubtedly the star of the show. His comedic timing is just excellent.Read my full review here: http://goo.gl/2TiY6F",
    "72": "There is a special place in hell for haters of this movie. It's the backbone of Christmas. It's beautiful. It's lovely. It's heartwarming. It's heartbreaking. It's English. I love it.",
    "73": "What Love Actually set out to do was fairly ambitious. 9 some-odd separate love entanglements that converge at 1 time and place over the course of a couple weeks. It's not easy to juggle all of those relationships and develop them beyond a superficial understanding in a 2 hour runtime, but for the most part, Love Actually manages to do that (though it does not pull it off flawlessly). More notably, the relationships in Love Actually do cover a large gamut of variety and we're not left with a feeling of redundancy even with a multitude of couples and love triangles to keep track of.As far as love stories and rom-coms go, Love Actually is a fine watch. The storylines of Writer Jamie and Portugese Housekeeper Aurelia are classically feel-good in a cliche, yet unstale sort of way. The story of Stepdad Daniel and Son Sam are as heartwarming as the relationship between Son Sam and Crush Joanna are adorable in a way that only young young love can be. A step down from that are Rockstar Billy Mack and Manager Joe, who fit in the story, Juliet, Peter, and Mark, who are uncomfortable to watch, but not the end of the world, and then English pick-up artist Colin Frissell and his American lasses that are along for a nice throw-away laugh. There's also Prime Minister David and Maid Natalie, who make for a real uncanny valley dynamic of attraction. At the very bottom of the barrel is the Boss-man Harry, his wife who deserves much better, Karen, and the home-wrecking secretary Mia. I don't know what to say about this triage, I feel like the entire tonal atmosphere of this movie was marred by the constant marbling of infidelity, with Harry/Mia being the worst offenders. Lastly, there are Body Doubles John and Judy, and Coworkers Sarah and Karl, who, while technically have their loose ends tied up, are ultimately forgettable and unsatisfying respectively.The strange thing is, though this movie as a whole keeps everything together and makes for a viewing experience many would consider a classic, each individual storyline is nothing superb (not even that of Jamie/Aurelia which I think was the strongest) but together, they are woven in such a unique manner, that it does make for a very symbiotic web of relationships and artful story. In all, not a bad film, but if you're after a Rom-Com with multiple storylines and love triangles, Crazy, Stupid, Love does it way better.",
    "74": "One of the worst films its been my misfortune to see - I saw it for free and still wanted my money back. Smug middle class trash and one of the most manipulative films it's been my misfortune to sit through. The opening 9/11 reference was unbelievably crass and offensive and it was downhill from there. The saving grace was Laura Linney but her character just seemed to be discarded when Richard Curtis couldn't seem to contrive a way to get her back into the plot. Robert Altman and Paul Thomas Anderson have both shown how multiple storylines can be handled to amazing effect - evoking a genuine emotional response from the audience. Richard Curtis just strings together a few popular scenes from his other scripts, desperately trying to squeeze a laugh or tear from the audience. Depressingly this is one of the most successful UK films ever - despite having little or no resemblance to any London that actually exists. I think the audience's reaction will be different in hindsight when, on a second viewing, they realise they've been had.",
    "75": "Spoilers herein.I am a sucker for date movies: I laugh and cry - especially cry - along with the rest. And then feel violated afterwards by the asymmetry of reward: they get my money time and a piece of my soul and I get useless platitudes.This case is no different so far as formulaic and trivial romance. That's the nature of film love. But I did get something different here that made this worthwhile: competent writing for once.And yes, much of the writing - the structure I mean - is formulaic, but it was so well done. The matter is ordinary, but the manner of the machinery was novel.This film follows several recent experiments in presenting several stories that annotate one idea. The principle is that film abstracts and reduces, so if you want to get depth, you have to combine several reductions. `13 Conversations About One Thing,' `Things You Can Tell By Just Looking At Her,' `Ten Tiny Love Stories' and several others follow this route.The idea is that there is one prototypical woman, or couple. What you see as narrative are different dimensions of that. The problem for the writer is one of folded structure. Each individual story has to engage and have a dramatic arc, because that's where the viewers' attention will be. But the whole composition has to be woven into one experience, and that needs traditional cinematic shape as well.To help with this, the writer Curtis has pulled a number of tricks:-this is a piece of film writing, so some of his characters are in film (the sex body doubles) or writers (Firth) or in publishing (Rickman and his company including Linney). The Nighy character is a performer as well, often on TeeVee and provides the structural link to...-the tremendously effective integration of song and narrative. Song interfaces with the story in as many ways as there are stories: as traditional background, as a plot point: Joanna and Billy Mack, as a plot action (the kids, Grant's two adventures), as both in the Joni Mitchell bit.. And on and on in so many ways this could be as varied with song narrative as `Citizen Kane' meets `Singing Detective.'-The art of `bracketing.' That's where you set outposts that are intended to be different and unsuccessful so that the middle is raised. For instance, the `love' is bracketed on one side by the absurdly fantastic Wisconsin sequence and the heavily U.N. Date- movieish Linney problem with her brother. These were supposed to stand out, be different in tone and outside the main machinery.Other bracketing is obvious: the easy sex/love (Liam meets Claudia) and the seemingly impossible in the rock star's. This latter is emphasized in his sexy vixen video. And again between the love without sex (the love for the best friend's wife) and the sex without love (the body doubles).Yes, this is all known and taught. But it is good to see it all pulled off.The director Curtis pulls a great strategy:-write something extremely tight-get the most talented and independent actors possible-get out of their wayOne can see that the acting styles here are incoherent. They clearly do not spring from one mind, rather reflect whatever philosophy that actor has. This would be a flaw in another film, but here, the whole idea is to have different dimensions as part of the whole.Ted's Evaluation -- 3 of 3: Worth watching.",
    "76": "Love Actually has become the butt of many jokes, as representing unashamed corniness. And it does contain a lot of corn. It's a very white, affluent, rose tinted view of society. And I'm not a fan of Keira Knightley. But the film is entertaining and it does attempt to explore different types of love - unrequited love, a childish crush, love between an English man and a Portuguese woman, and cheating. Most of the characters work, for example Laura Linney's love for her ill parent, Bill Nighy as the aged rock star who is close to his agent (but the film stops short of saying they're gay), Hugh Grant as the Prime Minister who falls for an employee, and the sex scene stand-in actors who fall in love. Of course there are the lovely real life scenes of families reuniting at an airport. It is a very good natured movie, and it's nice to watch something free of the cynicism we see too much of.",
    "77": "After having loved Richard Curtis' work that I've seen so far (About Time, Vincent and the Doctor, Mr Bean, a little bit of Blackadder) I really did not expect to dislike this film as much as I did.It's a nice concept. Lots of small stories all intertwined with one another showing that love comes in many forms is a great idea. Unfortunately, the predictable outcome happens: none of the stories feel developed enough to be impactful on their own, and for me didn't add up to a greater whole.What I hated was the insufferable behaviour that's seemingly rewarded by happy endings. I'll forego my usual spoiler-free reviews and list a few examples below:\nColin is a completely unbearable and desperate character and it seems insulting to suggest that American girls would instantly fawn over him for the fact that he's British.Hugh Grant's Prime Minister is charming sure, but firing a servant who was come on to by a position of power, then accepting an apology from her for what happened is mental.I'm a big fan of Thomas Brodie-Sangster, but here he is written like an awkward adult instead of a realistic child (also how on earth did he outrun those grown security guards at the airport).Finally, the Peter, Mark and Juliet storyline is very dumb. What the hell was Mark thinking? You wait until your best friend gets married to the love of your life, while creepily filming just her at the wedding. Of course this, once exposed, is treated as a not-so-creepy thing. And then the audacity to show up at the door with a scenario planned for one of the two people that could have answered is just nonsensical.I do get why people like this movie. I think it's good that the preposterously ideal outcomes for some of these stories is balanced by some that don't turn out quite the way everyone would hope. These ones usually have great acting (Emma Thompson and Alan Rickman are as incredible as ever here). Bill Nighy's storyline, while weirdly more disconnected from everything else, is quite funny, and he really goes all in on the role.But this film just did not sit well with me.I'm not usually cynical about cheerful films (Paddington 1 and 2 are absolutely wonderful).Love Actually was nauseatingly sentimental, with underdeveloped characters and weirdly creepy storylines that haven't aged well. It's a shame.Vincent and the Doctor is still incredible though.",
    "78": "Britians handle the emotions very well. I love britian fun films and this is one of the category.good screenplay, not boring, no vengeance only love. And I love actually.",
    "79": "I had expected from this film a relatively undistinguished, harmless little romantic comedy. What instead unfolded was two-plus hours of the most unremitting, insulting, film clichés imaginable.The film consists of nine simultaneously-running subplots. Each subplot manages to be absurdly implausible, yet predictable at every turn. Among the worst: One tracked a geeky fellow who was convinced that the way to turn his romantic life around was to impress American girls with his English accent. Each scene of that plot consisted of something like the following: \"I'm going off to the US, where the chicks will think I'm a coolly sophisticated Brit!\" (His friend): \"You're crazy!\"\"California girls here I come!\" \"Stop!\" And so on.And on.In the \"payoff\" scene, at film's end, he does, in fact, bag three hot American girls in a bar. Why this scene was worth endless repetition along the way is a mystery.Another similarly repetitive plot involved two people performing together in a porn film. They strike up a conversation and start forming a tentative relationship. The \"joke\" is that these strangers are being sexually intimate, yet are acting like awkward teenagers as they stumble their way to going out on a date. They're porn stars, but they're shy! Isn't that funny? Ho ho ho! This might have an amusing one-five-minute-scene joke, but this film stretches into a film-long subplot, complete with the male rejoicing over getting a good-night kiss from his new love. Barf.Perhaps the worst one involved Colin Firth. Betrayed early in the film, he's heartbroken. He is assigned a non-English-speaking housekeeper, whom it takes exactly two seconds to discern will be his romantic salvation. This subplot builds to a supposedly climactic scene where he, with a big crowd in tow, descends upon a restaurant where she works, to propose marriage. He awkwardly declares his love, shots of all of the other diners looking confused and expectant, she says yes, then everyone breaks out in applause and there isn't a dry eye to be found. Argh. This film didn't even bother to construct a buildup to this climactic moment. The two characters have barely a few verbal exchanges prior to this scene. And the film uses all of the other clichés: her brusque Mediterranean father in the crowd, her sister egging her on, etc. None of these people were actually developed characters. They are just insulting stereotypes thrown in for the final set piece.In another subplot, Hugh Grant plays a newly elected British Prime Minister. He doesn't bother to act differently from the way he normally does, the same stammering, yet somehow debonair, Hugh Grant character that he always plays.He walks in off the street to 10 Downing, and is introduced to his staff, one of whom, again, can immediately be identified as his eventual love interest. Power Prime Minister falls for humble servant girl -- how romantic! Who would have thought?The Prime Minister's scenes seem to have scripted by a 10-year-old. It's hard to depict politics or diplomacy more childishly than most mainstream films do, but this film manages. Grant is shown meeting with his Cabinet, with dialogue along the lines of: \"Mr. Prime Minister, you really need to get tough with those Americans.\" \"No, I don't think I will. Like it or not, America is the most powerful country in the world, so I think we'll just have to be nice to them.\" Yes, it's about that sophisticated. But soon the evil Americans show up, led by Billy Bob Thornton, looking hickish and sinister, another example of the film's relentless caricaturing. There is soon a negotiating scene that goes something like: (Americans, haughtily): \"We will be continuing the policies of the previous Administration.\" (Brits): \"But they are bad policies!\"But the Americans won't bend, so \"bad\" policies it will be. (Ah, the simple logic of film. Let's have good policies instead of bad ones -- Brilliant!)Later, when in private discussions with President Billy Bob, Grant steps out and returns to find the Prez nuzzling his housekeeper. So, the Americans are not only unreasonable negotiators but lechers, too! At the next press conference, Hugh's backbone stiffens, he emphatically declares that the Brits aren't going to be pushed around anymore.Cut to shots of applauding, grateful Brits, wiping tears from their eyes. No kidding.The writing is adolescent from start to finish. Supposedly about romance, it was about anything but: It was about how many times the writer/director could haul out the same tiresome, insulting, manipulative stereotypes and syrupy music.The film begins with shots of people embracing at airports. It's a clue. The writer likes the image of love, but isn't terribly interested in what goes into it.We have a new plague among screenwriters: Richard Curtis. He also gave us Four Weddings and a Funeral, which was similarly, though not quite as spectacularly, awful.Is it really the case that filmgoers will find such dreck droll and clever if only it is dressed up with a British accent? There seems to be no other explanation for this man continuing to be given financial backing.",
    "80": "I hate romantic comedies. I detest them. You can list the actors I avoid watching: Hugh Grant, Sandra Bullock, Richard Gere, Julia Roberts. Romantic comedies make me cringe and I avoid them like the plague so you can imagine the foul mood I was in when I was forced to watch this film.And the introductory voice-over by Hugh Grant as we watch an airport full of people hugging made me want to commit an act of violence - either against the people who forced me to watch this film or against myself just to end the torture.Then the most unbelievably shocking thing happened. Bill Nighy and Gregor Fischer came on screen, mocking one of the most hated love songs in Britain, \"Love is all Around\" and I found myself getting sucked into the film.By the time I reached the end of the film I found myself facing the impossible, there was one romantic comedy out there that genuinely is a comedy and actually likeable. No-one was more shocked than I.Many different kinds of love are covered (although not all kinds), there's 8 storylines and the biggest cast list I've seen in a long time. Somehow, it works. You'd think it wouldn't, I know I certainly didn't.\nIf you're looking for a full-length story, this is not the film for you. It snap-shots the important events leading to the resolution of the couples involved, nothing more. If you want a classic romantic film, this might not be the film for you. This is funnier than most straight comedies I've seen in recent times, however (I'm just as harsh a critic of comedy films as I am of romantic films).It's not trying to be the meaning of life, it's not trying to look at the big picture. In fact, it's only trying to do one thing, and that's say positive feelings crop up in the most unexpected places or are more prevalent than people think. One of the storylines, one that is cited constantly in reviews as one of the failed storylines with a sad ending is actually bittersweet. It doesn't end with failure but the failure of one type of love in favour of a different kind.This film isn't perfect, I'll never find the perfect romantic-comedy because I hate the genre so much, for example, one of the storylines did annoy me intensely and yet ironically still made me laugh in places. However, the flaws in the film are vastly outweighed by positives. It's superficially complicated but is really a very simple film.  It makes a statement: \"love actually is all around\" then shows why it makes that statement and doesn't attempt to do or be anything else.And like the fact it covers different kinds of love, it covers different attitudes and portrayals of it - so a couple are realistic, a couple are classic fantasy, a couple are pure comedy and a couple are pure rom-com tradition.I have seen no reviewer give this film a middle-of-the-road review, and I've read many reviews. I think, in the end, Love Actually is up to the individual. It's like Marmite. You either love it or you hate it.Speaking as a cynical, misanthropic, Marmite-hating, Romantic-Comedy hating member of the human race, I actually liked Love Actually.",
    "81": "Love Actually is a great movie with several well developed story lines that all come together nicely and a terrific cast that can be both comedic and dramatic. It certainly wasn't an easy film to make and I'm sure the studio must have considered it a huge risk, telling stories from several characters in the space of two hours, with all of them having little to no connection with the others, but it worked, Richard Curtis clearly put hard work in to this script and gathered a very impressive cast to make it a hit. Of course, with the amount of stories there are, some of them felt underdeveloped, I found Alan Rickman and Emma Thompson's to be one of the most compelling, but in the great their story dosen't get any proper closure, Colin Firth's story felt very tight, I would like to have seen more of him with Sienna Guillory, but with a film as crowded as this you are going to feel underwhelmed with certain parts. The films cast really is terrific and is the main reason why a story as complicated and messy as this really works, Liam Neeson shines as a step dad hoping to cheer up the son of his deceased wife, Emma Thompson is delightful as a wife questioning her own decisions, Alan Rickman astounds as a confused husband, Hugh Grant is terrific as a prime minister who discovers love for the first time, every actor puts all their heart in to these roles and they are all a delight to watch. However, the best performance for me would have to be Bill Nighy, who shines in every scene as Billy Mack, playing a character in no way similar to any role he has done previously, he plays a straight up pompous musician, and he does it ridiculously well. Always a fun film to watch at Christmas time, Love Actually is funny, emotional and very sweet, I would recommend it to anyone looking for a good comedy or romance film. Set one month before Christmas, we follow the lives of several people falling in or out of love. Best Performance: Bill Nighy",
    "82": "It has been a long time since I have seen a movie so rich in character that I did not want it to end. Love Actually is not a love story, it is a story about love. Love that reinvents itself, multiplies itself, opens itself up, and even devastates.I am sure the film has its critics who say it drips in buttery corn. But when you are able to retreat inward and let it take you over, it is impossible not to feel. It is a rare treat - a film that makes you feel. During the process I was sad and happy and relieved. I was turned on, turned off, dizzy and grounded.I was in love one time and it reminded me of that. The power of cinema can be that amazing, it can be that intense. The title of the movie is, perhaps, meant to confuse. Yet I believe it is designed to ask. Love Actually is ... what?Is it lust? Or a deep appreciation of the past? Can it be conquered by language or political barriers? Race? Infidelity? Age? Can it be all of the above plus more? Maybe a mingling of several?It is rare for a film of great acting to be married to a terrific script. Yet it is something else for it to speak right to the audience; not talk at them, not try to sell them a film. Let them experience the film. Let it wash over them little by little until there is nothing more of them left.**** (A)",
    "83": "In London, from five weeks before Christmas up to a month after Christmas, the lives of different persons are linked by love. The Prime Minister (Hugh Grant) and the member of his household, Natalie (Martine McCutcheon); his sister Karen (Emma Thompson), her husband Harry (Alam Rickman) and Harry's secretary, Mia (Heike Makatsch); Harry's employees, Sarah (Laura Linney), a woman with a serious problem in her life, and the designer Karl (Rodrigo Santoro); the writer Jamie Bennett (Colin Firth) and his Portuguese maid Aurélia (Lúcia Moniz); the grieving widow Daniel (Liam Neeson) and his son, Sam; a porn actress and her colleague; the singer Billy Mack (Billy Nighy) and his manager; the just married couple Peter (Chiwetel Ejiofor) and Juliet (Keira Knightley) and their best man Mark (Andrew Lincoln); a British young man that travels to USA, trying to score women in that country. \"Love Actually\" is a delightful homage to love. There are different situations, some of them dramatic, others funny, sometimes touching but never corny. The interconnection of the stories has a perfect timing. The cast is a constellation, highlighting the shining beauty of Keira Knightley and the nice role of Hugh Grant. There are many wonderful moments, such as the collective interview of the Prime Minister and the American president; or the moment when Karen finds that her Christmas gift is a CD of Joni Mitchell; or when Mark declares his secret love for Juliet; or the relationship of Daniel and Sam; or when Daniel meets Carol; or when the manager of Billy makes a comment about Elton John; or the narration in off in the beginning of the movie. I believe I could list many other magnificent moments, but better off the reader of my review rent or buy the DVD and have a good time. My vote is nine.Title (Brazil): \"Simplesmente Amor\" (\"Simply Love\")",
    "84": "Love Actually is a romantic comedy film directed by Richard Curtis. The film stars an ensemble cast.The film revolves around eight couples and their tryst with love.A pleasant and heart warming film and the best part of the film is that despite of a huge number of cast every character is been given the equal weightage and importance and it doesn't feels that if any of the story is left incomplete or not been given equal importance.Acting is superb and almost all the characters were chosen wisely and acted perfectly.Screenplay of the film is very simple and straight and probably a little drawback of the film as the film becomes too predictable. The comedy in the film is awesome and keeps your funny bone tickling. The climax of the film is predictable and good.A must watch romantic comedy film and one of the best romantic comedy film.",
    "85": "This movie does come off as a bit shallow, and it contains characters who are one- dimensional caricatures of themselves. But guess what -- this movie is clearly in the romantic, holiday fantasy genre -- just like It's a Wonderful Life and A Christmas Story are. And most people love those movies, so I don't get all the negative reviewing of this film. To me, this movie is clearly a fantasy piece, and as such it should not be subject to all the driveling negativity that would better be directed toward something terrible that masquerades as serious dramatic work. Would the British PM ever go knocking door to door with just one bodyguard? No Way! Do Londoners actually care what song is \"number one for Christmas\" more than Americans do?? (I'm seriously doubting it -- who other than a few teenagers and record promoters actually cares about charts?) This is clearly a work that's not to be taken as a \"serious\" movie, though it's seriously fun if you'll take it for the fantasy that it is. I love this film. Despite the clearly fantastic story lines, I like the characters, and the amazing A-list cast does a great job. I caught it first in theatrical release, then I watched it three times back to back on a plane to London because the other choices were the abysmal \"Cheaper by the Dozen\" and \"Duplex.\" Since I've caught it on HBO, and I've quickly realized it's one of those movies you can watch repeatedly when flipping channels for a quick \"pick me up\" that only fantasy movies can provide. My favorite movie of that sort is Groundhog Day, if that clues you into my argument. The multi-threaded storytelling in this borrows from the likes of Magnolia, and the fact that it's a light hearted holiday theme flick place that device in interesting contrast. I see Love Actually as a new holiday classic.",
    "86": "Love Actually is a collage of stories centering around people living their intertwining lives in the weeks leading up to Christmas. It's also something of a Who's Who of British acting at the time of its release. Almost every single British actor worth note is in this pile of droppings. Power of Christmas, I suppose, for I see no other reason for them to debase themselves like this.So what exactly is wrong with this film? Well, the few upsides first. It is a nice looking film. The locations are nice, the stories are varied, some even interesting, and it has that Yuletide feel to it. And the actors are talented. There are some truly nice scenes and good character moments. But that's because the actors are so good, not because the script is worth anything.And the stories are terrible. Some are merely bland, like the one containing Bill Nighy and Gregor Fisher. Some are just wrong, but in a funny way, like the one with Kris Marshall. But the vast majority of them are more than a bit cringe-worthy. We have over-sexualized prepubescents, a best man wooing after the bride, an adulterer, an import bride and far far too many dudes lusting after women based solely on their looks. And this is supposed to be a Christmas movie about the concept of love. Give me a break!The only decent story, where I actually bought the chemistry and thought it kind of sweet, was the one containing Martin Freeman and Joanna Page. And their characters are porn stunt doubles. That should tell you something about this film.",
    "87": "What I love most about Love Actually is how grounded and human the storylines feel, how there aren't any big spectacles, only human drama and well written characters with actors who cares. You see the passion in Richard Curtis' writing and direction, he delves into different aspects of love as shown through the lives of eight very different couples in dealing with their love lives in various loosely interrelated tales all set during a frantic month before Christmas in London, England.With an ensemble cast, composed predominantly of British actors, many of whom had worked with Curtis in previous film and television projects. There are so many well known actors in this film, I'll bring up my favorites. Alan Rickman, Emma Thompson, Hugh Grant, Keira Knightley, Colin Firth, Liam Neeson, Thomas Sangster, Bill Nighy, Chiwetel Ejiofor, Andrew Lincoln and Laura Linney. They are some of the actors in this large ensemble. Everyone gives a terrific performance, truly. The cast executed the dialogue and jokes perfectly, bringing warmth and laughs to us.Love Actually was a box-office success, grossing $246 million worldwide on a budget of $40-45 million. It received two nominations for the Golden Globe Award for Best Motion Picture - Musical or Comedy and Best Screenplay. In the BAFTA award, Bill Nighy took home the award for Best Actor in a Supporting Role, whilst the film was also nominated for Outstanding British Film and Best Actress in a Supporting Role (Emma Thompson). The film has proved more popular with audiences than critics, becoming a modern classic and well known in pop culture. In my opinion, the cinematography and editing needs some extra praise, truly fantastic work.I rewatched this film with my girlfriend just a day ago and actually liked it more this second time than my first viewing which was back in 2014 I believe. Richard Curtis have created a film with such heart, showing us so many forms of love, what love ultimately means to people. Some of the characters struggle of falling out of love and some fall in love, you could also say the film is about fate and especially true love. My girlfriend ended up loving the film, afterwards, it made me think of romantic films in general and how most Romantic-Christmas themed movies are unoriginal and too cheesy (which works at times) but Love Actually is so much more. In the hands of a different director/writer, it could have been a failure. But instead, Richard Curtis created a brilliant romantic-drama and a film worth watching each Christmas. There's not much of a Christmas spirit, it's just set during the weeks prior to Christmas Eve, and that's why it works so well. It's about these people we get to follow for 136 minutes, who could easily be anyone you meet on the street.",
    "88": "I got Love Actually for $1 at a garage sale in 2017 I waited until January 2018 to see it, and I fell in love with it as I watched it! I've seen it about half a dozen times since!Love Actually has 9 plots that go back and forth about love in London at Christmastime. Usually I would sit down and summarize each one, but instead I will suggest Googling Daily Dot's ranking of the plots and immediately discuss what I enjoy about the movie as a whole.Romantic comedies are hit or slight miss for me. Religious convictions aside, I think it's stupid for sex to advance the romances in these movies.People fall in love because of who they are, their character, their beauty-inner and outer, likes, interests, etc. and NOT BECAUSE THEY BANG EACH OTHER AFTER BARELY KNOWING EACH OTHER!Love Actually does have some sex in it(Hence it's R rating), but there are all kinds of love in the movie. For example, a stepfather named Daniel gives his stepson advice about how to get to know his love, showing a father-son bond. Daniel also asks if the crush is a boy, hinting that he loves his son no matter his sexual orientation.One woman has a boyfriend AND a mentally unstable brother, and she sacrificed her dating life for her brother. She could have done the cognitive and gave up her brother, but she knew family came first and her brother mattered more.There is also some homosexual love, pointing out that romantic love comes in multiple forms as well.Aside from the love aspect, other things make Love Actually fantastic. The movie's no Citizen Kane, but every moment is so entertaining and well written.Ignoring a pointless plot with sex scene stand ins, there's not a thing I'd change about the movie. (I don't love that plot but I've been less annoyed by that overtime.) To me, Love Actually is perfect. (You'll get that later.)By definition, Love Actualy isn't a masterpiece, but it is a masterpiece to me. It's so fun and endearing, no words can satisfy my admiration for it. When it comes to it's subject matter, this is love....actually!",
    "89": "What I appreciated most about Love Actually was that for the most part, it realistically looks at relationships happy and sad, successful and unsuccessful, with a future and without.  It addresses different forms and levels of love, sometimes straightforward and carefree, sometimes complex and contradictory.  There are schmaltzy happy moments and touching sad ones, moments of great strength and moments of foolish weakness.  The movie is made up of many threads, and of course some threads are stronger than others.The most interesting parts of Love Actually are the times when it addresses the tragic situations where love is self-sacrificing, contradictory, or fragile.  One character's unrequited love is revealed as a noble sacrifice made for another's happiness (the method of finally achieving closure and moving on, however, could only work in the movies).  Another character is shown to be caught between conflicting duties that will, we are led to believe, prevent her from ever being truly happy.  And the strength that a third shows when love is shown to be fragile and her world collapses around her is tragically inspiring.These noble, tragic threads are interwoven with lighthearted comedic ones to produce a fabric that holds together well.  While some characters have to fight for their love, others have simple, happy, straightforward relationships, with love (or whatever) falling in their laps like a parcel from Santa Claus.  And the purely comic moments, like Rowan Atkinson's appearances and Hugh Grant's Christmas-caroling bodyguard, are delightful in and of themselves.There are of course plenty of nits to pick.  Hugh Grant doesn't make a very believable Prime Minister, and even his very pointed speech to his American counterpart -- especially relevant in light of Bush's recent state visit to England -- don't redeem the odd casting.  Others in this forum have commented on the number of fat jokes in the film, and while I agree, I feel I should point out that the entire point of the first such joke is that the character who has fallen for the \"fat\" girl clearly doesn't think of her as fat, and doesn't understand at first who the other is talking about. It's true that calling her fat is ridiculous; she's only large in comparison to Keira Knightley, who must be carrying some vital organs around in her handbag because there's certainly not enough room in her torso!  But that one time would have been enough; the \"fat\" theme gets tiresome later on in the movie.  I also agree with those who have said that much of the nudity is completely unnecessary to the plot, and that at least some of the comedic threads in the movie are formulaic and unoriginal.In the end, I feel that Love Actually is for the most part a thoughtful and entertaining look at relationships, which does not shy away from taking the bad with the good.",
    "90": "This review written 12 years after the release.The nice thing about belated reviews is that we the reviewers can stop all the pretence and coyness.By now we realize that our views -- over a decade after the fact -- matter not a whit or a jot, so we can say what we feel without worrying about offending another IMDb member or the producers or any of the stars.So I will just say it: BRILLIANT.Possibly the best anthology Rom-Com ever done. Sets the bar for all other such features. From the opening with Bill Nighy (who astonishingly did a vampire series just after) to the closing, this is the most fun you are going to have outside of a theme park or an adult ranch in Nevada.Every country on the planet has given this type of film a whirl, and probably there are even now film students who think the US nailed it (maybe with one of the old O HENRY anthologies?) They are all wrong. This is the king of the hill. To paraphrase Nighy's character, IMDb members who gave it less than a 10 are ... rubbish.",
    "91": "Love Actually is a phenomenal Christmas movie. My family and I watch it every year several weeks before Christmas and then on Christmas Eve. Due to our traditions, we celebrate Christmas on Christmas Eve rather than day yet I digress. After the wonderful success of this film there have been many like it, but it still doesn't have the character development and beauty that this one has.It is funny, touching, and endearing. Although parts could have been better edited and characters could have been removed, it still is a fantastic watch. I have seen some of the other stories that were originally planned, and those should have been added. I long for the day where a remastered version is included with the original cut, which was over three hours.This film has inspired American versions that attempt to be wholesome and romantic entertainment yet the movies fall flat. I saw two, by chance, at an early screen. Audience members were leaving complaining of plagiarism. This movie is original, and Curtis is a great writer of romantic comedies.This movie is rated R in America. There is nothing in it that is really that bad. There are the occasional swear words, and that is about it. This movie is a great Christmas movie for you and your family.",
    "92": "Love Actually is a film much like an Island paradise, set in an ocean of pitifully tepid romantic comedies.(It's not my style to negatively criticize any form of art so you won't see any examples or bad reviews here. But you likely can surmise which ones I'm obliquely referencing).Love Actually comprises a dozen or so examples of couples who are either in love, falling in love, or have recently lost love. Therefore, if the subject matter of love, heartache, humor and Christmas aren't your cup of tea (although ironically this is a decidedly British film), then you're better off watching The Holly and the Ivy (1952) or White Christmas (1954).I won't bother summarizing Love Actually. There's hardly anything I can add to this splendid film that hasn't been said before. But I will reiterate that Love Actually is generously filled to overflowing with a miraculously diverse, talented cast. The lineup is humbling: Hugh Grant, Emma Thompson, the late Alan Rickman, Laura Linney, Martine McCutcheon, the incomparable Bill Nighy, and a brief flicker of screen time for Billy Bob Thornton.Although Love Actually takes place in London during Christmas, it's not a genuine holiday-themed film. The plot isn't difficult to follow: Love is everywhere, and often lurking where and when you least expect it. The message here is that love is blind, and I pray it stays that way.Love Actually was originally released in the United States on November 24, 2003, and a week later in the United Kingdom. Surprisingly, it received mixed reviews among fans and critics even though it earned a respectable $246 million US dollars worldwide against a modest budget of $45 million US.No spoilers here as usual, but I will reveal: Look extra closely at the Barbie dolls that Elizabeth wraps up as gifts.",
    "93": "I like the thinking behind Richard Curtis' concept for \"Love Actually.\" Why tell one Christmas love story when you can tell eight? Everyone loves Christmas, everyone loves love, and if you can tell eight stories that are all related but about something different, you're bound to have everyone who sees the film relate to at least one of the story lines. It sounds sort of gimmicky when put in those terms, but with good writing and some great actors, \"Love Actually\" works and is surprisingly enjoyable despite a high cheese factor.\"Love Actually\" is sort of the ultimate British-American romantic comedy. When you put Hugh Grant, Keira Knightley, Bill Nighy, Emma Thompson, Liam Neeson, Alan Rickman, Laura Linney, Colin Firth, Rowan Atkinson, Billy Bob Thorton (and then some) all in the same billing, it's ridiculously impressive. You almost can't fail. I mean, at one point there is a scene featuring a sort of negotiation between Grant, the prime minister of the U.K. and Thorton, the president of the U.S. If the demographic for this film isn't overstated with Christmas and romance already, that certainly ices the cake.The story lines are for the most part all good, but with eight of them, they all don't have to be. You pick the ones that you like and you stomach the ones you don't as much because you know they won't last long enough to bore or annoy you. Some people will like the more comedic ones like Bill Nighy as a recording artist trying to re-ignite his career with a hit Christmas single and some will like the more straight up romance like when Firth, an author, tries to communicate his feelings for a Portuguese woman who doesn't speak English. Fortunately, it's not disjointed either, so you don't feel you're watching several different films. Christmas time helps set that tone, but in general the mood the film is consistent in all the story lines.Like most romantic comedies, there's always a cheese factor, but the better ones make you forgive the cheese. For the most part, \"Love Actually\"'s cheese is very forgivable. Towards the end it gets a little out of hand, but you are so immersed in the story lines that you let it go. The humor of the film is also so strong that it also earns your appreciation regardless of how much you like romance.As far as film concepts that seem like romantic comedy sell-outs are concerned, \"Love Actually\" is probably one of the best. It's diverse but cohesive and funny to all senses of humor. It has a killer cast and of course good heart and strong themes. So as much as you might think you're watching just another romantic comedy about Christmas, \"Love Actually\" at least convinces you that for the time you're wrong.",
    "94": "Love Actually (2003)This huge network of feel good stories could have been sloppy and sappy. Oh, heck, it is sloppy and sappy, and that's why it's so lovable. And great, in its own way. A whole slew of top notch actors give really sincerely spot on performances--all of them rather brief in terms of screen time because there are so many stories here, but still satisfying.What is there not to like about a movie where almost everyone succeeds in overcoming something, mostly loneliness? The point of love actually is actually just love, and falling in love, and making what love they already have meaningful. There are relationships that makes sense, like Laura Linney's heartbreaking nurturing of her mentally challenged brother to the detriment of her own love life. There is the painfully realistic and mature marriage between two sophisticated educated professionals, Emma Thompson and Alan Rickman, with their varying levels of sincerity. And there is the Prime Minister of Britain himself, played by Hugh Grant, who falls in love, and resists falling in love, with his secretary. Throw in a more drab if pretty-ish Keira Knightley, a wonderfully love-sick Andrew Lincoln, and the oddly adult relationship between Liam Neeson and his cute cute stepson and it gets more and more layered up and fun.While certainly the film is well known here in the U.S., it is practically a national treasure, from what I gather, amongst rank and file Brits. This is a thoroughly British movie, to be sure, and more lovable for it. For one thing, they have removed all the pomp and security machinations around the Prime Minister, so he seems just like a regular lonely guy who goes to work and gets coffee. Then there is the key scene where this Hugh Grant P.M. stands up to the visiting American President, and it's a great rah-rah moment.While not all the actors are British, most are, and some very much so, such as Bill Nighy who plays so dazzlingly well the aging rock star on the comeback. The terrific British comedian Rowan Atkinson has a couple of key roles that are brilliant. And so on. Of course the President is Billy Bob Thornton (Arkansas) and Linney is a good old New Yorker (bless her) and there is Claudia Schiffer who is international somehow, but born in Germany.All of these people are interconnected in ways that really don't strain the plot. (A wonderfully excessive chart of all these, with French text, oddly, is clickable on the Love Actually wikipedia page.) The writing and directing are both the work of one man, Richard Curtis, who has directed only one other film but has written a slew of them (and who is only British by means of the Empire--he's from New Zealand). But if the direction is solid, the writing is sublime. Yes, it doesn't strive for Shakespeare level profundity, and it doesn't reach it, either, but it's really smart, snappy, believable, funny stuff. That will also get you in the gut if you let it.",
    "95": "Some feel that this perennial favorite film, LOVE ACTUALLY, is a response to the global devastation and fear that the September 11, 2001 created - a deeply felt longing for a return to peace and for acknowledging love. That may have influenced writer/director Richard Curtis to create this series of stories, but whether that is the case or not, this cinematic miracle has become a holiday must see and relive-experience for many of us.The stories - and there are many of them - are set in England the month before Christmas and are as varied as the feeling of love itself: a has-been rock star ultimately discovers his true love is his male manager (Bill Nighy and Gregor Fisher), the Prime Minister finds attraction to a feisty employee (Hugh Grant and Martine McCutcheon), a desiring female longs for a fellow employee but owns her love for her ill brother (Laura Linney and Rodrigo Santoro), a married couple deals with adultery (Alan Rickman and Emma Thompson), a writer discovers true love in a Portuguese maid (Colin Firth and Sienna Guilory), a newly married couple cope with an ambiguous friend's attraction (Chiwetel Ejiofor, Keira Knightley and Andrew Lincoln), a father advises his young son about going for love (Liam Neeson and Thomas Brodie-Sangster) and more.Not only is the story well written and directed and full of Christmas spirit, but it also is superbly acted by an outstanding cast. Get the feeling of love that we need to embrace: try LOVE ACTUALLY. Highly recommended for repeated viewings.",
    "96": "Not everyone depicts Love on celluloid like Richard Curtis does. Curtis, a legend in his own right, delivers a delightful tale on Love in his 2003 blockbuster 'Love Actually'. I enjoyed myself, as the 10 odd separate love-stories unfolded. 'Love Actually' Follows the lives of eight very different couples in dealing with their love lives in various loosely interrelated tales all set during a frantic month before Christmas in London, England.'Love Actually' is sweet, heartwarming & unmistakably charming. I was involved in the stories, not once they felt unwanted & none lacked pace. They all gel well with one another & the core nature of its tales, depict Love in an engaging manner.Curtis's Screenplay is ambitiously mounted & he leaves no stone unturned here. 'Love Actually' is amongst his best written Screenplays to date. Curtis's Direction, on the other-hand, is first-class. Michael Coulter's Cinematography is excellent. A Special Mention for Craig Armstrong's tuneful Score.Performance-Wise: 'Love Actually' forms a strong ensemble & expectedly, all the actors are in great form. But the ones who stand out are Liam Neeson (Fabulous), Hugh Grant (Charming, as ever), Colin Firth (Restrained), Emma Thompson (Top-Notch), Bill Nighy (Flawless) & The Late/Great Alan Rickman (Superb).On the whole, 'Love Actually' works from start to end.",
    "97": "For months on end, I've had this movie recommended to me on numerous occasions. Why? Well, I like romcoms. Why did I avoid it? Dunno. I felt like it had too many characters and stuff and I guess I just avoided it because it feels weird for a romcoms to have multiple love stories going on at once.Was it good? Hell yes. Oh, lord yes.There were so many heartfelt stories in here. Each character had their own problems or aims which drove the plot forward. There were moments to laugh at, moments you'd look at and just say aww, and moments that tugged at your heartstrings till you'd tear up just a little but not an embarrassing amount. Moderate amount of tears. Totally not a lot. Totally not.The narratives were intricately woven and they flowed perfectly. The character's simple emotions drove their complex and incredibly deep decisions. Seriously, the depth of some of the characters' choices in this movie is astounding. Everything was driven by love and nothing else.Another interesting thing about this film is that love in this context isn't just romantic love. It's all sorts of love. There's love between friends, family, etc. It's a marvelous movie and I can't put everything about my feelings towards this film into words.I'd love to give it a 10, but there's one glaring issue with this film. Not everyone gets a happy ending. Is that bad? No. Not at all. It's realistic and it gives the movie a bit of a grounded touch. I'm just too much of a romantic to see that as a pro rather than a con.9/10. Could not recommend it more. Its a one of a kind film.",
    "98": "My deserted heart will always love you. Maybe now you have a person by your side, or today we are still alone for Christmas, don't be sentimental. There are always a lot of unsatisfactory people in life. I can't love the person I want to love. I miss important people every year. These regrets all seem like a test given by God. Even in the days of empty windows, there are traces of love. My deserted heart has always planted grass for you. After breaking through the iron shoes and looking forward to it, I believe true love will come.\n10 groups of CPs, 10 pairs of lovers, 10 paths of happiness, from civilians to prime ministers, from childhood to old age, there are always miracles on the road of love people who have watched Mordern Love will love this one too.\nFestivals are not unique, because there are people who love each day full of hope. This is probably also the most touching part of this story-there are thousands of kinds of love, and life with each other is happy.\nI couldn't help crying several times, cheering for the protagonist, for myself, for every kind of life. Especially worth chewing carefully ~\nAll I want for Christmas is you. Christmas gifts, I only want you.",
    "99": "Driver Stu from \"The Adventures of Pete and Pete\" once said, \"When love comes, you better pull over to the side of the road and open your doors, cause nothing in this life matters more.\" The strange and funny thing about love is how it can just happen when we least expect it to, when we feel very little to no control over our lives, when it seems at almost the most inconvenient time it just simply happens. Just like the seasons of nature it is an element vitally needed so not just can the world be nurtured to continue to grow and thrive but our own spirits.This film is one of my favorite romance films but also an honorable mention in favorite Christmas movies. The film is sort of an anthology by its nature as the stories are focused on multiple individuals whom all somewhat are in the same place and sometimes connect and intersect with each other, but the theme is the same which is about love.To me this is one of those romance films done right for one thing each of the stories like in any anthology are short which means there's no filler and sub plot nonsense which is what plagues a lot of bad rom coms and make them forget what movie they are.Most importantly though they each keep their eye on the ball, each of the stories knows who they are and what they want to say and be which is part of why the stories and characters in them to this day are endearing and timeless. Ok, not everyone of them one or two I can leave out but like with all anthologies it's all a matter of your preference.The cast consists of an all star cast which most of the time isn't always a good mix as it's been known when most films which consist of all-star casts don't always equal good movies. But fortunately, this film is one of those case where it does, personally I feel an all-star cast film can work where you use each of them right and well but also have a good story.Though believe or not, this film didn't consist of an all star cast as only half of them were major leaguers and most others we're either unknowns or minor league players, this film was sort of a launch point for them. It makes watching the film even more interesting seeing a face or two getting their start, and anyone that has seen it before at the time thinking who knew.I'll just say a few of the stories I really like as there are a lot of them.Jamie and Aurelia: Colin Firth is just great as Jamie, I like how in the film he sort of looks like Richard Castle, ok not really but from his haircut and the way he's dressed, even a little of his character is a bit similar to that character.\nHere he's a guy a bit on the introverted side, he's a little down on his luck as he has writers block or on a losing streak as he's had one bad book after another.It's also funny how his a bit of a slob as his desk are always in disarray as we see papers are dis or unorganized but also a bit of a caffeine addict as he has a series of coffee mugs pileing up his desk, this sort of reflects his whole life and even love life is in total disarray.But of course, his luck is just about to change when Aurelia comes into his life. She is played by a lovely actress, Lucia Moniz whom hasn't really done any other movies outside of her region afterward. Anyway, I really like the chemistry between the two is just beautiful as both are from two different worlds.The relationship is somewhat ironic as his profession part of what it's about is communicating with everyone around you by putting your ideas out there. We see that Aurelia really is good for him from not just making his house more livable but helping him become more assertive, do what he must do.One interesting moment is when he visits his family which I'll admit was something that came completely out of the blue. This scene works well in two ways, I really liked that look on his face which is exactly what we're all thinking, and it says, \"Wait a minute what am I doing here.\" He realizes he's not where he should be that his place is with Aurelia. But also, it was sort of the broken fourth wall joke as that look is someone that suddenly walked into the wrong Christmas movie, like a scene that was just inserted at the last minute which was the point and joke. What he does at the last minutes are beautiful, I won't say anything else about this except it show both truly are on the same page.Mark and Juliet: This is another which is a small one, which involves Juliet and Mark played well by one of my favorite actress Kira Knightly and Andrew Lincoln whom weren't stars at the time. This one is simply about unrequited love; we see in one scene where Mark inadvertently fudges up a wedding video for Juliet and her husband Peter played by Chiwetel Ejiofor before he was a star.We see Mark is a guy that has always harbored feelings for Juliet but never said anything as he was too afraid to. Which is understandable for some people it's really doesn't come easy and it's not so much fear of being shot down but being misunderstood. Or even simply the fact in life you let certain things get in your way which is an easy thing for all of us to do because hey life happens and dilemmas don't solve themselves; but also, simply not believing in oneself enough. It can also be a painful dilemma and cross to harbor as it leaves people wondering what could have happened if they did make a move.Though we know it might not have made much difference as Juliet doesn't feel the same way about him as she'll always see him as a friend which is also understandable too because that's also part of life as one doesn't always feel the same way or anything more about the other, it's just simply not in the cards.But the final minutes of the story result in a timeless scene which has been parodied a lot over the years. But this scene was obviously an homage to \"A Hard Day's Night\" which of course is the cue card scene. It's just really sweet because he never says a word and he doesn't need to because in each of the cards he presents he is expressing his feelings for her but also shows how he's begun to become more assertive and find love of his own. This also goes with another quote from \"The Adventures of Pete and Pete\" which is \"If love is true, really true it doesn't need an answer.\"Prime Minister and Natalie: This one of course involves Hugh Grant whom at the time was somewhat the king of romance movies. Here he plays a prime minister of the UK, it's that simple story of the man that has everything except love. And there is his secretary Natalie played by Martine McCutcheon whom I think is cute and hot, it's too bad this actress didn't have a little more afterward as she's a capable one.The interplay between both Prime Minister and Natalie is just sweet as we see both are struggling to maintain a professional relationship, but we see that cracks are forming. Both already know what they feel for one another but have not just been unassertive about those feelings but have never felt or made time for them, as we see both are too busy maintaining and living a lifestyle but not a life, hence the fact Prime Minister's real name isn't known because he has no life outside of office. This makes both sympathetic as we see it's can be a very lonely and two-dimensional existence, sure you have success but as they say what good is it without happiness, to me that can be a waste of life too.I really like it when we see the Prime Minister finally being assertive or has been given the push to it when a high ranking political member sexually harasses Natalie and the Prime Minister in a speech defends her which shows he not just shows the strength of his integrity but also how strong his feelings for Natalie really are. When the payoff happens it's just sweet because it shows how the one you love is closer than you think but also putting your feelings out there for the other isn't as hard as it seems.Love can happen everywhere to anyone, throughout the holidays.Rating: 4 stars",
    "100": "The Richard Curtis I like is the man behind the big belly-laughs in TV's \"Black Adder\" and \"Vicar Of Dibley\". Quite how he morphed into the purveyor of ludicrous, over-sentimental tosh like this I'll never know, although I think the lure of the mighty dollar might have had something to do with it.Mixing the supposed \"feel-good\" factor of a latter-day Christmas film to an overblown hymn to love, while meant no doubt to induce a warm feeling inside, instead turned my insides out. Here in a Britain about a million miles detached from reality, Cupid's little arrows strike out at everyone from the prime minister himself to porn actors and even, God bless, the little children. It's all set to a corny soundtrack, a new song on every two minutes or so it seems, usually consisting of poor cover versions of standards.I don't know which set of cooing couples I thought the least of, but for sheer sickliness, the exchanges between Liam Neeson and his 10 going on 40 year old son take some beating. Worst scene though, in an overcrowded category, has to be Emma Thompson silently over-emoting as she realises her husband is thinking of having an affair. I wish Dorothy Parker hadn't already coined the phrase about running the gamut of acting emotions from A to B, although I'm not sure Miss Thompson even got past A, so toe-curlingly embarrassing is her \"big\" scene.Honestly, to these eyes and ears, not one actor shines, although as I think I've made clear, I believe the fault is in the writing. There's also some unnecessary vulgarity, loads of ham acting and a direction style which tries to lead you by the nose to Christmas nirvana. No, this Christmas turkey can go and get stuffed as far as I'm concerned, its one small saving grace being that it singularly failed to launch former soap star Martine McCutcheon to movie stardom. Well, that would certainly be high up on my Christmas wish-list any old year.",
    "101": "Hmm, let's see... according to Richard Curtis, all American girls are airheaded nymphomaniacs, all Portugese are poverty-stricken kitchen staff, all black people in England want to be middle-class white people, working in p0rn is no different from working in any other area of showbiz and provides a decent living to even the slightest member of the crew, the Prime Minister spends Christmas chasing skirt and would be unaware of where his sister worked, the 'dodgy' area of Wandsworth is populated totally by white not-quite-so-middle-class families, the record-buying demographic of the UK consists mainly of the mentally deficient, British airports continue working at full capacity with no holdups right up to Christmas Eve, high-powered frumpy British wives forgive their husbands' infidelities all the time - especially at Christmas, middle-aged men become gay after becoming disillusioned with years of one-night stands with women... I could go on. If you are prepared to accept premises like these without question, then please, go ahead and enjoy 'Love Actually'. To people like me who don't turn off their critical faculties at the sight of Hugh Grant, Emma Thompson, or Joanna Page's lady bumps, this movie is plainly the work of a group of white, middle-class grammarschool boys who decided to add every ingredient they could think of to appeal to an audience they obviously hold in the deepest contempt. Characters straight off the cereal packet; to call them stereotypes would be to insult hard-working stereotypes.",
    "102": "Love, Christmas, London, England Richard Curtis, the talented writer of the very successful Four Weddings and Funeral, Nottting Hill, and Bridget Jones' Diary, and one of Mr. Bean's the creators, wrote and directed Love Actually, and what a directing debut it is. The ultimate romantic dramedy, the film that is not ashamed to be sweet, heartwarming, and outrage romantic. Love Actually talks about love, romances, break-ups, moving on, and does it admirably. This is the film I can watch over and over - during Christmas time or spring time, or summer, and it always brings warmth, humor, laughs, sadness, and yes, Love that is everywhere, just look a little closer. This is the film that makes me smile and even brings the tears to my eyes - all at once. Love Actually gives romantic comedy its good name back. It is a very good movie - sometimes, close to perfect, gorgeous, sweet in the good sense of the word and always lovely.First, and foremost, I admire the film for outstanding (and I mean it) cast. Some of the best British and American and European actors (and there is also simply gorgeous Rodrigo Santoro who deserves a special mention) play twenty or even more Londoners who were hit by the Cupid's arrow during the Christmas season of 2003 in absolutely stunningly looking, lively and bright London. I won't be original if I say that the funniest character belongs to Bill Nighy as once super-famous rock star (in Keith Richard's type) who is making his comeback with an old love song that he is turning in the Christmas super hit. Another outstanding performance belongs to divine Emma Thompson. She brings depth and real emotions into her and Alan Rickman's story of the marriage in crisis. Laura Linney's story of love that was so close and possible but not meant to be was also very well told and acted.This time, Liam Neeson's story as a newly widower with the young step-son who is desperately in love with the most popular girl in school, touched me the most. After recent untimely tragic death of Neeson's wife, the mother of his two sons, Natasha Richardson, the story feels the most poignant and sweetest. The scene during Daniel's wife funeral, his speech celebrating Joanna's life, moved me almost to tears.Yes, it is a long movie and it tells the stories of 20 people or so who all happen to live, work, fell in love, sometimes have their hearts broke in London that I've never seen so bright and lovely as in this picture - perhaps, because the stories start five weeks prior to Christmas and end on Christmas night. With so many intertwining stories, not all of them are equally good. Some could be dropped, leaving the movie shorter, leaner, and perhaps better but even the way it is, Love Actually deserves its place on such top lists as Best of 2003, Favorites, and Favorite Romance. It is beautiful and magical - just like the season during which it takes place.",
    "103": "Richard Curtis is a terrific writer. I'm not convinced he can write anything properly dramatic or serious, but he has proved again and again that he has a wonderful knack for comedy, where his television work on the likes of \"Blackadder\" and \"The Vicar of Dibley\" has occasionally outshone his fantastic work on films like \"Four Weddings and a Funeral\" and \"The Girl in the Cafe\". Curtis is also a good fantasy writer. No, not fantasy in the Lord of the Rings sense, fantasy as done in Capra's \"It's a Wonderful Life\". \"Love Actually\" is a beautiful, touching, and genuinely affecting romantic fantasy in which the bits of humor work extremely well.\"Love Actually\" works so well as a narrative for several reasons, one of them being that it's fairly unique. The easiest way to describe it would be 'interlocking', but that would sadly put it in the company of trash like Paul Haggis' abortion of a movie \"Crash\" and Inarritu's similarly unsuccessful \"Babel\". \"Love Actually\" is best described as a series of vignettes about various varieties of love.The star-studded cast don't exactly have to act their hearts out but they work perfectly together, Liam Neeson and Bill Nighy being the most affecting actors in the film. The film is not especially remarkable visually, but it is satisfyingly well-shot. Curtis' script is nothing short of brilliant, at least until the final scenes. If \"Love Actually\" has flaws, they come in those final scenes. They are certainly contrived, but the rest of the movie does such a good job drawing you in that you barely notice it at the end. This is a remarkable film, one that is hard to forget.9/10",
    "104": "It's a multi-storyline movie about love. It opens on an airport arrival. It's a promising start. At least, it's a rare place to start, and it's a great place for love and reunion. Then it goes on to talk about 9-11. The calls from the people are almost always one of love rather than hate. It's a heighten call to action for a simple rom-com. They want to show that love is most powerful emotion.I like some of the stories. Mostly I found them formulaic and nothing original. However I am profoundly distracted by Hugh Grant as the bachelor Prime Minister. He is still playing the same character as his other movies which makes the Prime Minister too silly. For a movie with such a vast cast, there must be somebody more fitting to be the PM.The saddest thing about this movie is that it may have inspired more of these multi-storyline love stories. Only they are getting more and more insipid. If a love story is good enough, it should be able to fill a whole movie.",
    "105": "I'm a guy and I actually love Love Actually. It used to be one of my favorite movies, but then I realized it's a little flawed. Nevertheless, Love Actually is a delightful movie.The plot centers around numerous London romances, and love in general, around Christmas Time, all in different forms.Liam Neeson is a recently widowed stepfather, who's stepson, played by Thomas Sangster, is in love with a girl with the same name as his Mom.Neeson has a sister played by Emma Thompson, who discovers her husband, played by Alan Rickman, is cheating on her. They are also related to the Prime Minister, played by Hugh Grant. He's in love with a new secretary, who is shamed by others for being a little overweight. (This family tree reveals that the little boy with a crush is related to the Prime Minister.)There are more plots, including, but not limited to: A man coming to America to get laid, sex-scene stunt doubles who fall in love, and a rock star who falls for his manager, who is also a man.As I said, Love Actually is delightful. It has wonderful acting- from the older actors like Liam Neeson and Emma Thompson, to the younger ones like Thomas Sangster and Olivia Olsen, who play lovers in the Disney cartoon Phineas and Ferb later on in their careers.There are also wonderful moments throughout, like a proposal scene near the end between 2 people who speak different languages, or a scene when Hugh Grant dances around his office, to a scene involving the song All I Want For Christmas, to a funny cameo from Rowan Atkinson.The best part for me, however, is how Love Actually portrays love. In the world, it comes in many forms. We see eros kind of love, but there is sibling love, and stepchild love. We see straight couples and gay couples. And then there are consequences for breaking this kind of love, such as cheating. Some love stories get happy endings, and other ones do not.And that's what LOVE ACTUALLY is. It's not perfect, and it's not always romantic. Note, I am NOT saying that affairs are love, but it is a sad reality within what once was love.My complaint in many romance movies is that couples have sex and suddenly they are in love. Or they barely know each other, and they suddenly must be together.Love Actually has this flaw too, and some romances are too rushed (9 plots is apparently too much drama for 135 minutes), but there is so much more real love in this film then I have seen in most movies based on a Nicholas Sparks novel.Love Actually is not a perfect movie, but I have seen it numerous times and it's a delight each time. It has great romance, great characters, and great humor. And it's one of the best romantic comedies I have ever seen, despite its flaws. When it comes to romance movies, this is love, actually.NOTE: Unlike most Christmas movies or rom coms, this is Rated R for graphic nudity and profanity. Please know that before going into it!",
    "106": "London, England, and it's the run up to Christmas, and we are in the company of a number of couples dealing with the joys and problems that love can bring.We open with a narration from Hugh Grant who tells us that when he is troubled by the hate in the world, he thinks of the arrivals area of Heathrow airport. A place where loved ones greet returning loved ones, a place that indeed showcases a strand of love in its joyous form. He further ventures that when the aeroplanes hit the twin towers on 9/11, as far as he knows, all those phone calls from those sadly involved were messages of love, not hate. Pertinent musings that although somewhat sombre for an opening, sets it up nicely for what Richard Curtis (writer and director) wants to say.A roll call of fine British and Irish actors, and American Laura Linney, lend their considerable talents to Curtis' ensemble piece. The structure is surprisingly simple considering the number of stories being woven together, the result being that there is sure to be a story in there to either love, or, yes, even hate. Is it sentimental? Of course. Is it as stuffed as a turkey on Xmas day? Naturally. Does it stretch credibility in some strands? For sure. But only the coldest of hearts could truly decry that Love Actually is all around. Very often it's funny too. Curtis, following on from writing credits such as Four Weddings And A Funeral, continues to show himself to be a very fine writer of comedy. None more so than with Bill Nighy's past his sell by date pop star, Billy Mack. There's something for everyone in here, indeed there's likely to be something that many can associate with.It's a lovely affecting film that should hopefully perk up those that get blue around the holiday season. With perceptive writing, some excellent acting (Nighy, Emma Thomson, Colin Firth et al) and a soundtrack of some worth, Love Actually is a winner. 8/10",
    "107": "The half dozen or so love stories that comprise 'Love Actually' are neither highly dramatic nor emotionally earth-shattering in nature - and I suspect that this is exactly how writer/directer Richard Curtis intended it to be. This epic paean to the glory of romance involves, for the most part, run-of-the-mill (albeit middle or upper middle class) Londoners just trying to find a little happiness for themselves in the arms of that one true love.Hugh Grant, as the newly elected Prime Minister of England, unskilled in the ways of romance, leads a large and gifted cast through this roundelay of love, actors of no less a stature than Colin Firth, Liam Neeson, Emma Thompson, Laura Linney, Alan Rickman, Billy Bob Thornton and Rowan Atkinson, just to name a few. They all portray characters in various states of romantic upheaval. Some are headed towards blissful, happily-ever-after endings, while others suffer the pangs of jealousy, infidelity and unrequited love. The best thing about 'Love Actually' is that it doesn't take itself too seriously and it isn't afraid to take its time introducing and developing its large roster of characters. The film, as a whole, has the kind of unhurried, laidback charm that one expects from a movie with Grant in the lead. The worst thing about the film is its over reliance on those fairy tale 'only in the movies' moments that seem to be an integral part of virtually every romantic comedy that comes down the pike these days (there's a scene set in Wisconsin that is so lacking in basic credibility that I was absolutely positive it would turn out to be a dream of one of the characters. It didn't). The film culminates in a jaw-droppingly bad scene near the end in which a young boy crashes through airport security with full approval of his beaming stepfather so that the tyke can tell a little classmate of his who is boarding a plane that he loves her. The sequence is a bit tough to take in this post-9/11 world, especially when the violins start swelling, cuing our tear ducts to well up in approval for this horrific stunt. There's also a bit of gratuitous America-bashing in Thornton's portrayal of the President of the United States, a rather mean spirited diversion in a film whose tone is otherwise all sweetness-and-light. It's perfectly fine for American films to portray the president as a venal, lecherous bully, but it takes a certain amount of gall for a British film to do so.'Love Actually' suffers the fate of many films that attempt to write large on too broad a canvas; some of the characters and stories inevitably turn out to be more involving and compelling than others. That is simply the nature of the beast. I certainly wish that the troubled marriage of Rickman and Thompson could have been explored in more depth, since Thompson provides the few moments of genuine feeling and heartbreak in the movie. And certainly one or two of the other lesser stories could have been dropped from the lineup with little or no harm done to the film overall. Given that limitation, however, it must be stated that 'Love Actually' succeeds more often than it fails. This is partly because the cast is so appealing and partly because much of the writing is really very funny. The choice of background music is occasionally obvious, though the songs frequently make wry and witty commentary on the action taking place on screen. 'Love Actually' is definitely a long movie (135 minutes to be exact) and it does leave a few loose ends untied at the closing credits. But that, perhaps, is as it should be. Life, after all, leaves some loose ends untied as well.",
    "108": "Who doesn't love Love Actually? I know I do. It's such a sentimental, goofy, overblown pile of mush and I love it even more for all those reasons. Not to sound sappy, but a lot of the situations and character interactions it entails are blunt, awkward truths made even more hilarious by an even more awkward cast, and encapsulate the true meaning of Christmas. Not all the couples work out, not all of the individual stories end well or in satisfaction for themselves or the audience. But you know what? That's life, and they make the best out of what they have at this special time of year, which is what it's really about. To balance it out, not all of them end like that; some turn out splendidly for the characters, leaving them beaming. Some learn tough lessons that are necessary for growth, some find love in storybook fashion and others are simply there for coming relief. And what comedy we get, tearful drama as well, delivered by an astoundingly massive cast of British legends, speckled by a few familiar Yankee faces as well. Liam Neeson plays a grieving father whose son (Thomas Bodie Sangster) is sick with love. Neeson's sister (Emma Watson, grounded, real, heartbreaking) deals with her irresponsible husband (Alan Rickman, incapable of a false note). The newly elected Prime Minister (Hugh Grant in flustered, fumbling glory) is attracted to his cute secretary (Martine Mcutcheon) and aloof writer Colin Firth feels pangs for his Portuguese housekeeper who speaks not a word of English. Laura Linney has a steamy office romance with Rodrigo Santoro whilst dealing with an ill sibling, Bill Nighy is hysterical as a cynical pop star learning what old age means, Keira Knightely, Chiwetel Efjor and Andrew Lincoln are involved in a subtle love triangle, and there's all kinds of interwoven people including Martin Freeman, Desmond Askew, Elisha Cuthbert, Ivana Milicevic, January Jones, Claudia Schiffer, Shannon Elizabeth, Denise Richards, Sienna Guillory, Billy Bob Thornton as the sleazy US President and a priceless Rowan Atkinson as the world's weirdest jewelry salesman. It's a big old circus of Christmas spirit with all kinds of different motivations, desires and relationships, which reach a festive fever pitch of a finale as all the stories escalate into giddy yuletide melodrama and cathartic god times that are impossible to not smile at. An annual watch for me.",
    "109": "What a charming movie this is. It's not perfect or anything, and probably gets a little too syrupy towards the end, but it's romantic, funny, and the star-studded cast is outstanding. Weaving through so many story lines could have left the viewer confused and unsatisfied with any of them, but director Richard Curtis pulls the right strings and keeps us entertained from beginning to end. There are just so many wonderful scenes and lines. Andrew Lincoln's card scene with Keira Knightley. Colin Firth watching Lúcia Moniz walk out of his life, and then later both of them learning each other's language. Thomas Sangster, the little boy, talking to Liam Neeson about the \"total agony of being in love\". Hugh Grant the Prime Minister going door to door to find the sweet and sometimes foul- mouthed Martine McCutcheon. And on and on.The movie is filled with all those little moments we can identify with – secret longings, flirtation, and first kisses – but also those that are bittersweet, and those that disappoint us. The overall theme of the movie, that \"love actually is all around\", even though we often focus on the incidents of hate in the world, is inspiring. The shots in London are gorgeous, and the comic relief provided by the aging rocker Bill Nighy is funny. It is a feel- good movie and bound to be criticized, but it's OK to feel good once in awhile :), and this is certainly one of the better done romantic comedies.",
    "110": "There really aren't a lot of movies about love. There are a lot of romances, but the focus is always on the star-crossed lovers. There are star-crossed lovers in this, but the focus here is less on the characters than it is simply on the power of love as it sometimes appears in unexpected places, and as it sometimes rekindles itself after lying dormant. Sometimes we're recovering from love, sometimes love is from afar and unrequited; sometimes it's just a true and sincere friendship. But it's there. As Hugh Grant says in the opening narration: \"love, actually, is all around us.\"I have to confess that I'm generally not a fan of these movies that feature separate story lines that eventually intertwine. I like my movies to have a little more focus, and these movies often seem blurry instead, as you wait (often impatiently) for what you know is the inevitable moment when the various stories will intersect, and everything will be revealed. This movie, however, I enjoyed. There were, in fact, several story lines: an old rocker trying to make a comeback; a recent widower dealing with grief and his young stepson who's head over heels for a classmate; the newly elected and single British Prime Minister who's smitten with a member of the household staff; two porn actors who fall for each other on the set; a recent divorcée who falls for his maid with whom he can't even communicate with because she speaks Portuguese; a newly married couple - and the man who secretly adores the new bride; an older man being pursued by a co-worker who wonders whether to pursue her or stick with his marriage. There might have been others. Usually I would say that's way too much to include, but somehow it all worked here; the stories blended together well and complemented each other. It's a very diverse group of people, all connected by being essentially from the same town. No one relationship really dominated in the story, although the three that really stood out for me were Hugh Grant's role as the Prime Minister (the slightly confused by love character being perfect for him), Liam Neeson as the recent widower dealing with grief and helping his stepson with love and Bill Nighy as rocker Billy Mack, who adds the most comedy to the movie as he releases a Christmas album that he knows is terrible - which he tells everyone, much to the chagrin of his manager. Other lovers in this included Colin Firth, Emma Thompson, Laura Linney and Alan Rickman. There are also small (and non- romantic) parts for Billy Bob Thornton and Rowan Atkinson.The characters are basically all likable and pleasant, and you really find yourself hoping that love works out for all of them. It's not really a tug at your heartstrings type of movie, and while it's about love it's not what I would call a \"chick flick\" - there are too many situations faced by the respective male characters that I could relate to for it to be that. I suppose it's a bit too sappy at times, but that's in keeping with the subject matter. It's a pleasant movie - and at times it's very funny as we watch the various relationships work themselves out. (8/10)",
    "111": "Well this movie is actually...excellent. It includes lots of characters who are all in love in their own special way and the whole story is set in London five weeks before Christmas. We meet Billy Mack (Bill Nighy), old singer who tries to get back on top with help of his loyal manager Joe (Gregor Fisher); David (Hugh Grant) has just become the new Prime Minister and he instantly falls in love with his new personal assistant Natalie (Martine McCutcheon); Karen (Emma Thompson) and Harry (Alan Rickman) are married couple with their own problems; Sarah (Laura Linney) is women torn between a man she loves and her sick brother; Peter (Chiwetel Ejiofor) and Juliet (Keira Knightley) are fresh married, but Peter's best friend Mark (Andrew Lincoln) is in love with Juliet; John (Martin Freeman) and Judy (Joanna Page) met on shooting of porn movie; Jamie Bennett (Colin Firth) moves to France after he found out that his girl is cheating him with his brother and there he meets Aurelia (Lúcia Moniz), young Portuguese woman; Colin Frissell (Kris Marshall) hopes that he'll find 'normal' girl(s) in America; and finally there is Sam (Thomas Sangster), who is young boy and also in love, which makes a problem to his stepfather Daniel (Liam Neeson).So many characters and so many actors that are beautifully composed in this movie. All that is achieved Richard Curtis in his directorial debut. His story is for everyone. I think that lots of people could find themselves in this characters that are full of life and very real. Maybe the only characters that are little stretched are the ones of John and Judy. It's hard to believe that porn actors are so shy like they are both presented. But here Curtis makes fun with everything. That's why I love Britons so much. They smile to others equally as they smile to themselves. \"Love Actually\" rises above many romantic movies because it has great story, capable direction, top class actors and magnificent soundtrack mixed with some old and some new songs. I really can't talk about all the actors in this movies cause it would last for days; instead I'll mention only two: Bill Nighy and Emma Thompson. Nighy brings breath of fresh air to his character while he's making fun with his manager, his own hit song and Britney Spears. Emma Thompson, ah Emma Thompson. She makes acting so easy, makes you feel that anyone could act. She's so natural and believable, such extraordinary actress. There is also lots of cameo roles (Billy Bob Thornton, Claudia Schiffer, Denise Richards, Sienna Guillory...) and one hilarious appearance of Rowan Atkinson as jewelery salesman (he's like Christmas ghost, you know when he helps young Sam).Well, I almost forgot to say what is this movie about (at least how I understand it). It gives us a message; that we must search and struggle for love, we must make sacrifice, just like Jamie and Sam for example did, while Sarah choose the other way (her brother) and she gave up. Actually everything is said in the beginning; there is enough love on this world (great idea with airport arrivals). Actually, I advice you to watch this movie. Actually, I gave 10 to it, cause it's so much better then any other romantic movie I've ever watched. Or I could just say, love actually.",
    "112": "Because I found myself gagging at this cavalcade of middle class self-satisfied dross and needed the sick bag when I saw Emma Thompson on the screen. Add to this a cameo role for Rowan Atkinson and we're in business.Yes, it's the return of Richard Curtis. You remember him, surely? He was the one who made us all laugh with his film about posh people who said \"f***\" a lot. Then there was his follow-up film about posh people who said \"f***\" a lot. Not forgetting the one about posh people who said \"f***\" a lot. Well, he's back, still not presenting us with anything approaching a genuine human emotion and yes, posh people do indeed say \"f***\" a lot. Well, to be fair, only a bit this time around.Because Curtis has at least branched out, making this the most watchable of his luvvied-up monstrosities by presenting us with a series of vignettes. Naturally, we get Hugh Grant and his \"I'm posh, whoops, I've said f***, and here's a dead pan take to a blatantly obvious social juxtaposition\" shenanigans. To be honest, I do quite like Hugh despite myself, so he doesn't produce the biggest allergic reaction. Neither does Thompson, who gets the most depth, and the story that doesn't have a happy ending. Probably the biggest non-starter is the sweet rendition of All You Need Is Love which then unfolds into a full brass band playing in the church. Well, imagine that! A full brass band! In a church of all places! How I laughed.Some have actually criticised Curtis for not splicing his vignettes together successfully enough, like they're watching Robert Altman or even Kurosawa. For God's sake, it's just some tatty comedy for posh people who don't get out much, it's not supposed to be art. Yet while I give the writer/director some slack there, it must be said that not all of his pieces actually go anywhere. Particularly of note is the one with the talented Kris Marshall, who dreams of going to America where he believes all US girls will want to sleep with him because of his accent. So he goes there and... four US girls sleep with him because of his accent. And the punchline is...?Despite coming out of the noxious All You Need Is Love scene, Keira Knightley and Andrew Lincoln do come off better than most, Lincoln because he gets to, like Thompson, show something beneath the self-amused surface, and Knightley, well, just because I would. Big time. Other highlights include two pairs of bare breasts, Bill Nighy in parts, two pairs of bare breasts, some gratuitous cameos, two pairs of bare breasts, an okayish yarn for Colin Firth and two pairs of bare breasts.But this is the wacky, zany world of Richard Curtis, a land where everyone is a great British eccentric, and even the sole working class character (Martine McCutcheon) and her family are just offbeat and loveable. It opens by allying itself with the events of September 11th, an event nicely re-alluded to at the end by a so-so scene that shows lax airport security. This is a world where everyone talks, hugs and can find true love... just as long as they're straight, able-bodied, middle class and good-looking. \nYou do have to question in what reality the Prime Minister's nephews and nieces would go to the same school as the kids from the roughest end of town, though thankfully with Nighy's \"Christmas Is All Around\" life didn't imitate non-art. On the one hand fairly amusing, on the other a smug self-reflexive reference to his own Four Weddings and a Funeral, the real record-buying public saw the film's No.1 Christmas single barely trouble the top thirty. It's a small phyrric victory in a war of bland.",
    "113": "Sugar, syruppy, a contrived bawdy romantic comedy for Christmas with paper this characterisation an none of it ever rings true.Set in London in the run up to Christmas, we see a range of characters all linked to each other in some way.The newly elected Prime Minister (Hugh Grant) falls for his teal lady Natalie (Martine McCutcheon) and when the President of the USA fondles of her, he loses his cool and stands up to the US President.Karen (Emma Thompson) is the Prime Minister's sister. When she finds out that her husband Harry (Alan Rickman) has bought an expensive gift for someone else she is heartbroken. Harry has had his head turned by their open flirting of his secretary.Grieving widow Daniel (Liam Neeson) gets to bond with his stepson Sam after the death of his wife. Young Sam fancies a girl in his school who is flying out to America soon.Colin is a friend of a film production assistant who flies off to America to find love, he goes straight to a bar and scores because of his English accent.Swirling in all these and other stories is veteran wild living singer Billy Mack (Billy Nighy) attempting a comeback by releasing a Christmas single.Richard Curtis inspired by Robert Altman has thrown a confection together some of it sticks better than others but a few of the segments just look creepy. The two body doubles in what increasingly looks like a porn film is not funny. The best man at a wedding who always fancied the bride comes close to being a marriage wrecker.I did find that the film's sickliness and tawdriness works better at Christmas.",
    "114": "Where to start on this superficial, overly-sentimental piece of garbage?The blatant sexism? The total lack of any developed characters? Hugh Grant as prime minister?The flaws are too many to count, but I'll just go over some of my biggest problems with this piece of junk ...1. There is not one single character that is even moderately developed. We are flooded with all these situations in which these humanoids are supposedly falling in love, or already in love, with each other yet we have absolutely no idea why, nor in most cases do the characters seem to know either. Writer falls in love with maid. Let's not bother with the fact they've never spoken a single word to each other (they don't speak a common tongue) and don't know each other at all. She looks good in a bathing suit. Apparently that's all that's necessary for a guy to ask a girl to marry him (and for her to say yes). Superficial garbage relationship #1.Prime minister falls in love with his secretary. Do any of us know why, other than the fact she likes to swear in inappropriate places? No, of course not. That would require writing and actual ... you know ... story. Superficial garbage relationship #2.Office-worker lady is in love with a co-worker. Do we know why? Do we get to know either of these characters at all? Of course not. That would once again involve actually developing a story. All we know is the guy looks like an abercrombie and fitch model. If there's any other reason to love the guy, we sure don't know about it. Superficial garbage relationship #3.Dude is in love with his best friend's wife. Sure, she's Keira Knightley and therefore hot as hell. Do we have any other idea why this guy is in love with her, and willing to hit on his friend's wife behind his back? No, of course not. Once again, apparently all we need to know to is that she's hot ... the end. Superficial garbage relationship #4.2. Bizarre misogyny. Almost all the relationships in this movie involve some extreme power differential b/w the male and female. The guys want the hot chicks because they're hot, the hot chicks want the old fart guys because ... because ... I'm not sure. Because they have good jobs I guess. There's also an inordinate amount of time where one of the hot chicks is bagged on repeatedly for being \"fat\". Note this is a girl that could only be considered \"fat\" in the movie-make-believe world. Even in that world it still doesn't make any sense. The term \"fat\" is one of the last that would come to mind when describing her and I spent more than a couple minutes scratching my head trying to figure out why characters were making fun of her physical appearance. On any other universe she's a solid \"9\". If this girl is lucky to have a relationship because she's \"fat\", all I can say to the rest of you women out there is you might as well shoot yourselves, cause she's hotter than 98% of you. 3. You know how in a good romance movie there is often that one point where the characters finally have their big connection which fulfills the build-up of the movie over the first couple acts? This movie just skips all the stuff involved in actually telling the story of relationships and just has the sappy payoff ... in every scene of the movie ... over and over again. While watching this wreck I couldn't help but feeling that the writer just took the payoff scene in his top 50 favorite romance movies and just wrote them all into one movie. Too bad he left out all the stuff leading up to the payoffs (character, plot, theme, etc) that made them work in the first place.Pure junk. One of the worst movies I've seen.",
    "115": "This movie is such tripe that I now understand why a movie that was supposed to be so good did so poorly at the box office. Because the general public knows an over-hyped, shallow, vulgar, piece of crap masking as 'romantic comedy' when it sees it. I should have known that something was up when the credits were barely over & Hugh Grant is narrating about love and how there really is so much love in the world and that we just don't notice it and then he remarks on how the victims of the World Trade Center when they were making their last phone calls to family had nothing but love in their hearts not hatred which is probably true but seemed a very strange choice to use in the beginning of a romantic comedy. Apparently it was a portent of things to come.The movie shoves characters and story lines into our faces without any story development and then expects us to care as every clichéd trick in the book is used to squeeze an emotion out of us. My primary emotion throughout the movie was disgust. On top of this was coarse language totally out of place in a quote un quote light romantic comedy.So many story lines throwing so much out at us and we're supposed to be amused and engaged by all of this. As usual with \"multi\" story lines, after the first story is presented, the rest only serve to interrupt and distract or force the audience no matter how unwillingly to choose which storyline they prefer.It's a shame about the movie. There are some good story lines, some fine performances, Laura Linney in particular but again, the movie just jumps in without warming up it's audience so that by the time starts reaching it's dramatic peaks, you're too p***ed to care.And now we get to really bad part of the movie. Hugh Grant practically doing a parody of his on screen self is absolutely, atrociously bad as none other than the Prime Minster of England.He's totally unbelievable in the role.Billy Bob Thorton as President of the United States in a cameo role gives another great performance as a sleazy Clinton-esqe type.Unfortunately the film also includes a rather silly scene where Hugh Grant as the Prime Minister at a press conference with Billy Bob's President makes a rather dumb statement to the press about how the UK is although a small country, a great one and the US has been a big bully so the UK is going to be tough too. Seriously. This is presented as a serious political \"moment\" in the film. Besides the fact that the political statement is totally out of place in the film and besides the fact that UK's Prime Minister is standing strong and tall as an ally of the US despite criticism in his own country, besides all this, it's just another incredibly stupid moment in the film. This is one very strange movie.",
    "116": "A rating for this movie of 7.8 is ludicrous. I'm glad to see that *some* others besides me finds this to be, well, drivel. And sexist. After watching this, what little respect I had left for Richard Curtis has been shredded good and well. It's a conundrum to me why this movie was such a success (no, actually it isn't: it's because of all the big name actors in it - no other reason. Well, except for the fact that most people have no taste); in my opinion it has all the hallmarks of a disaster. It is pretentious and over-sentimental, and in many scenes can't decide if it wants you to take them seriously or not. There are good bits here and there, but they are swallowed up by the tastelessness of the whole. I feel sorry for the frequently excellent Colin Firth that he's primarily getting known for horrendous comedy crap like this and that Bridget Jones tripe.3 out of 10.(Having said that, I must remark that the song towards the end by that kid, Olivia Olson, was fantastic. All I could think was \"Impossible! No 10-year-old can have such a voice!\" But she has. I'm certainly going to get her debut album when it comes out, that's for sure.)",
    "117": "Love was everywhere except my living room where I viewed this piece of crap.I haven't seen an ensemble cast movie this bad since 'America's Sweethearts' -- and this had better actors.There was no character development, no plot line other than the fact all of this junk happens around xmas. The 'jokes' are forced as are the emotions. There is no visible conclusion to the scenario with Rickman's character's marriage and with all the talk about deleted scenes I hope there was some sort of close, but I would rather have my eyeballs sucked out than sit through any of the 80 minutes of director's cut. When it comes to the anti-American stuff  who cares? We're portrayed as a country of lust filled vixens and an over sexed president, that's not so bad, but I would hope to think someone as nasty as Billy Bob never gets elected. For the reviewer who wrote 'For romantics only'  get over it. If you think this is romantic then you probably still live with your parents and attend junior high. Yes, we go to the movies for the escape, but not for lobotomies. As for the person who wrote the kid running through the airport was lucky he wasn't shot, my husband and I were rooting for the security guards (and hoped they were packing AK47s).The people who enjoy this schmaltz and give tripe like this high ratings should be drowned actually.",
    "118": "Not being a huge fan of romantic comedies, I felt somewhat dubious about watching Love Actually, but I was enrolled almost immediately after the film began. With all the hatred going on in the world today, it was gratifying to see a film that is all about love - falling in love, being in love, and falling out of love. Written and directed by Richard Curtis, the film is not only about the ecstasy of young love but about love in all forms, between brothers and sisters, parents and children, and even best friends. Performed by a great ensemble cast that includes Emma Thompson, Colin Firth, Alan Rickman, Rowan Atkinson, Liam Neeson, Hugh Grant, Bill Nighy, Marlene McCutcheon, and others, It is often silly and over-the-top but its British laid back humor keeps it from being sappy and the film has a freshness and vitality that makes you think (at least for a moment) about going out and seeking to find or renew the experience one more time.Of course, Love Actually is primarily a comedy but it has enough moments of genuine heartfelt emotion in which tears are not inappropriate. The story takes place in the weeks before Christmas which is a season where love and peace are supposed to be more than just New Age clichés. While there are a lot of characters to keep track of, several relationships stand out. There's the love between the widowed Daniel (Neeson) and his 11-year-old stepson, Sam (Thomas Sangster) who provides advice to the boy who has \"fallen in love\" with a girl at school who does not even know that Sam is on the planet. We also look in on the life of Britain's new Prime Minister (Grant) who bears a strong resemblance to Tony Blair. Grant plays the PM in the suave sophisticated British manner of another Grant – Cary, as he pursues his secretary Natalie with some significant reservation.In another, the PMs sister, Karen (Thompson) is afraid her husband Harry (Rickman) will leave her for an attractive coworker, Mia (Heike Makatsch). The office also knows that two of their coworkers, Sarah (Laura Linney) and Karl (Rodrigo Santoro) are in love but are too inhibited to let the other know. One of the best realized segments is about Billy Mack (Nighy), a washed-up rock singer who is trying to save his career by promoting what he acknowledges to be an awful pop-song remodeled for Christmas. Yes, there is more, perhaps too much more, but for me it was so heartwarming and endearing that it could have kept going until it covered all the romances in the world. Can I say that I loved it? Yes - actually.",
    "119": "Let me just start by saying that I expected alot from this movie, with actors like Colin Firth, Alan Rickman, Emma Thompson, Kiera Knightly, Laura Linney, Rowan Atkinson, Bill Nighy, Liam Neeson as well as the one and only Hugh Grant you can't possibly go wrong.The movie lived up to my expectations and exceeded them immensely. From start to finish this (just over two hour movie)amazing movie keeps its audience entertained with non stop laughs, tears and overall enjoyment.I must admit that since \"I am Sam\" I have never left a movie feeling as happy as I did with Love Actually. It has a good, positive feeling about it which really is the centre of this masterpiece.The storylines sound confusing but really they are simple to follow and comprehend. 8 different love stories that interwine and end on an amazing climax on Christmas Eve. The actors, the story, the scenery, the overall spectacle of this brilliant film have definately added it to my top 10 list alongside The Shawshank Redemption and The Green Mile.For a feel good, funny, dramatical masterpiece I strongly recommend it to anyone and everyone.A Solid 9/10",
    "120": "I had never been interested that much in this movie as I thought it would have been sickly sweet (and I personally hate this sort of movies). However last March I finally got around to it and I saw it. My opinion suddenly changed as I thought this movie had some funny moments and some serious ones. And I don't think of it as an holidays movie.The plot is a bit complicated as it follows many different people that prepare themselves before Christmas. What ties all together is that the various stories all relate to each other. In substance this film is about the people in the posters and their friends have also stories that diverge. And it all works so well.Since there are already 1,190 reviews to date for this movie I won't talk about those stories as it's one of those movies that is aired lots of times on TV.I liked most of the performances, expecially those by Hugh Grant, Liam Neeson (in a different sort of role), Alan Rickman, Emma Thompson, Colin Firth and even Rowan Atkinson in a small supporting role. And it gives also a nice message of hope (especially in this dark period) and also that love is all around even in the smallest things.Overall, a very well made Christmas movie. And this is one of those rare cases where an overplayed movie is still loved after all these years and it's easy to see why.",
    "121": "Like most guys I would never have seen this movie on my own or with male friends. However my girlfriend was in town and I thought a romantic comedy would make an ideal movie for us to see together.I had heard about the reference to 9/11 made at the beginning of the movie and was dreading having to sit through that part. However I was pleasantly surprised to note that the reference was very minor and not particularly cringe worthy either so I am not quite sure why it annoyed some people so much.As regards to the movie overall I quite enjoyed it and would definitely recommend it as an ideal date film. A lot of the reviews here have disparaged the movie because they thought it was too glib about love and very unrealistic. But I think you have to accept that the movie was made to make people laugh and bring the spirit of love into the Christmas holiday period. If you watch the film in that context then it does its job admirably well.However for me the best moment in the film was the press conference given (standing side by side) by the American president and the British Prime Minister. I actually felt like standing up and cheering when Hugh Grant (as the Prime Minister) finally tells the American president to his face and in front of the worlds press that Britain will no longer kowtow to American wishes but will have an independent view of its own.Considering that America is the biggest market for movies it was extremely brave of Richard Curtis to write this scene and he deserves a lot of credit for portraying the American president as rather loathsome and putting into context what the `Special Relationship' really is all about.As Richard Curtis must have known the movie had done okay but not great in the States. However it has cleaned up here in the UK and I'm sure will do very well in the rest of the world too.So Bravo Richard Curtis for standing up for your principals; you are a hero!",
    "122": "My sister brought the DVD of Love Actually home for Christmas, claiming she had seen it somewhere and that it was fantastic. I checked it out and it seemed just...well, you know...like the average romantic comedy chick flick hooey-looey horse crap that Hollywood has piled on us for the last eighteen millenniums. Shrugging it off, I didn't pay much attention. Well, this New Year's Eve 2006 on the eve of 2007, we had lots of people over and we all sat down and watched it. Now before I continue, anybody who knows me well enough knows that I am an absolute complete SUCKER for romantic comedies. It's just that, well, I haven't found a good one in a long time! Well, let's just leave it at the fact that I found it, and I hit the jackpot to be honest. Mix the movie \"Crash\" with \"The Breakup\" with \"Napoleon Dynamite\" with \"Bridget Jones's Diary\" with \"The Terminal\" with \"It's a Wonderful Life\" with \"The Family Stone\" and you get LOVE ACTUALLY, the ultimate romantic comedy as the DVD cover boasts. A multi-plot storyline simply about a group of unique individuals trying to find love in foggy Londontown at Christmas time, Love Actually features a stellar all-star cast that includes many, many well-known actors and actresses. In the movie, you get to experience all kinds of love from a different point of view: love between two hardcore porn stars, a young boy hitting on the most popular girl in school, the British Prime Minister and his secretary, an English author and his Portuguese maid, and a million and one other unlikely combos. The result is clear: a funny, feel-good, heartwarming, and above all romantic movie that all can enjoy...not just the romantic comedy suckers like me.",
    "123": "Love Actually is a must re-watch film that will always hold pride of place in my film collection.Cleverly made, this film has an abundance of characters in it, with their story lines and lives all intertwining at some point within the film\nThe cast is stellar.Lately I have read a few fan theories about the film, that makes me want to do another watch to explore those further.Love Actually has it all, the laughs, the intrigue and the tears.I have never hated two characters - Rickman and his secretary - so much in my life.For anyone on the bandwagon saying this film is outdated and even sexiest, please get a life.This film portrays love from all different perspectives. It is perfection."
}