{
    "0": "I have to admit that I had to watch Family Switch over two viewings. I found it sickly sweet and couldn't cope watching it in one hit. It's the typical oops we have switched bodies but something has to change in the family dynamics before we can be switched back scenario. I can't say that we need 'another' one of these films. If they were hoping it would be some holiday classic, I think they might have somewhat missed the mark.Don't get me wrong, I didn't hate the film, I just didn't love it either.Ed Helms was good in it, and so was Jennifer Garner and even the actors playing their kids. But it just felt like it was missing something, or maybe I am too old and jaded for this kind of film anymore.",
    "1": "Seems like this movie has a lot of bad reviews on here, but I completely disagree. I went in with little expectations, because unfortunately Netflix movies are hit and miss. But I liked it. Yes, the switching of bodies has been done a lot, but I thought the writers and actors did a great job of differentiating it from other storylines. It's wholesome and family friendly. There are only so many times you can watch the same family holiday movies. The casting was spot on and the actors seemed like they were having fun. It's definitely one I could watch again.I appreciated that the sister was the jock and brother the nerdy smart guy. It's usually the other way around.",
    "2": "I was surprised to learn that the film had three separate writers. Although the plot appeared simple, the movie, despite featuring familiar faces, lacked any profound meaning. I typically seek out movies that hold a special place in my heart, like \"Jingle All The Way\" and many others, but contemporary films often fail to evoke that emotional resonance. One scene felt cliché, attempting to be inclusive by featuring every ethnicity and non-binary individual on one couch, potentially diluting its impact.Regarding technical aspects, the cinematography is minimal. While the aerial view of Los Angeles from 3400 feet is visually striking, it doesn't contribute much beyond that. Despite being advertised as a holiday movie, you will notice there isn't much in the film that reiterates this.",
    "3": "A movie about body switching is not supposed to be realistic and I can accept that. I can accept that the dog switches places with the baby and begins walking on its hind legs, I can accept that the daughter in her mother's body would gorge herself on ice cream for no reason other than flatulence, I can accept that the mother in her daughter's body would pass up an easy chance to win the soccer game to care for another player, I can accept that the boy in his dad's body who can't play a guitar at the beginning of a song is able to shred by the end of the same song (alongside Weezer no less), BUT what I cannot accept is seeing snowfall in Los Angeles like we saw at the end of this movie! The characters pretty much didn't acknowledge it or comment how weird it was. Like at least pretend it's cold outside! It's not like they were in Big Bear, they are supposed to be in LA somewhere. The snow was more far fetched than the whole body switching concept. I was on board with the craziness until the snow started falling.",
    "4": "I would avoid this cringeworthy movie at all costs. Is this suppose to be a feel good movie? Hey family, let's ruin each other's lives BUT HEY! WE LEARNED TO LOVE EACH OTHER! The dad enters the son's body and completely effs up his college interview for Yale because somehow a grown man acts like an irresponsible teenager while the teenager acts like the adult. Oh and let me blow a huge soccer opportunity for my daughter because I can't kick a ball two more feet before I help the injured girl. Oh and the daughter, I just have to fart in front of my boss because even though I'm a teenage girl, I can't hold my gas like I'm a 6 year old. But hey, LIKE MAGIC everyone gets their wish.Doesn't feel like a good family movie. It sucks.",
    "5": "Family Switch is a 2023 body swapping comedy starring Jennifer Garner,Emma Myers,Ed Helms, Brady Moon and Rita Moreno.Directed by MCG(Charlie's Angels along with its sequel and This Means War),the story follows the Walker family, Jess(Garner),her husband Bill(Helms), their 16 year old daughter CC(Meyers), their 14 year old son WYATT(Moon), and their 2 year old son Miles who are all slightly unhappy. CC wants to make it big at the soccer tournament, Wyatt gets bullied in school and has a crush on a girl named Ariana,Jess works at a firm and Bill is also working.However things take a turn for the family as they attend an event at the Griffith Park Planetarium and meet a mysterious woman(Moreno)who takes a photo of the family,as she overhears them arguing and wishing that they could swap places. Once that happens the nuclear elements split and recombine; Jess's mind is in CC's body (and vice versa), while Bill's mind is in WYATT's body (and vice versa) along with their baby Miles and their pug to swap bodies too.While CC and Wyatt try to navigate the impossibly complicated world that is adulthood (responsibilities, skills, fears, ambitions), Jess and Bill must work their way through the insanely intricate network of rites of passage (bullying, soccer games, music, parties, romance) that comes with being a teenager. Will they undo the swap before they are stuck as each other forever?. Overall its a silly movie that has been done before (think of Freaky Friday only its the entire family that gets swapped and not the mother and daughter) meets 13 Going On 30) and you will enjoy this movie.Also features a cameo from Howie Mandel(Americas Got Talent,and the voice of Gizmo from Gremlins) and King Bach(who appears in Bart Bakers parody videos and also made an appearance with Dhar Mann).Not a bad film.",
    "6": "Films like this I tend to tolerate more than enjoy. I almost felt embarrassed for Ed Helms and Jennifer Garner when they were called upon to do the teenage roles, I thought Emma Myers and Brady Noon were more comfortable in their adult characterizations than their reversed parents. The funniest bits were provided by baby Miles in the switch with pet dog Pickles. Granted, the humor was provided by CGI, but it was effective enough to be hilarious. What I couldn't get over was the casting of Rita Moreno as the gypsy-type character, Angelica. At ninety-one, she had as much energy as any of the younger players and looked remarkably fit. The soccer skills displayed by Emma Myers were incredible as well, I kept wondering if it was really her performing her own stunts. As a family film the movie passes muster well enough, just not something a Western and noir film fan like myself found particularly interesting.",
    "7": "This still counts as a Christmas film despite only being set in the days leading up to it. I thought though it was a pretty magical film. Of course we know the story of big and freaky Friday but it is as Jess says a unique situation as a whole family has not been swapped before. Even dog pickle's and the baby get thier turn. I liked the acting here and it didn't feel cheesy like it is in some other holiday films like this. Garner. Helms and the two chil actoes were enjoyable and each of their goals you knew nothing would go right. Overall family switch was a nice holiday film and one certainly worthy of a re watch.",
    "8": "Wow. That was horrendous. Ridiculously forced and plot holes everywhere's poorly acted and truly just terrible. Unrealistic and unoriginal.I'm really disappointed in these usually great actors that they did this film. Even my 9 year old was like wow, this is bad can we watch something else. A band teacher and marketing professional in a multi million dollar home in LA? The flow of the movie is off and predictable and the predictable bad chain of events is forced. Come on Netflix. Do better. I know you can.Don't waste your time this holiday season trying to get through this waste of Hollywood film.",
    "9": "There is nothing redeeming about this movie other than to say that Jennifer Gardner looks like she hasn't aged in 30 years. Otherwise, Family Switch has nothing to offer. The story is ANOTHER body switcheroo premise just like the previous numerous SWITCH movies that are out there. There's nothing amusing or funny in this script even though there was plenty of opportunities to write something clever. Heck, comedian Pete Holmes had a bit role and they wasted a chance for his character to spice up the movie, but nope. Anyway, in the bigger picture, I didn't think people watched Ed Helms movies anymore. Jennifer Gardner is closer to the edge too because of this dog. Pass on this one and go clean your toilet instead. The experience will be better.",
    "10": "It's that very special time of year when every network starts to pull out their reserves of impossibly cute Christmas movies. Some of them are good. Some of them are bad. Family Switch lies somewhere in the middle. The body switch genre has been done a bunch of times before but I did enjoy how both parents switched with both of their kids. (I won't get into the baby and dog thing which was just their for sight gags) The body switch is bad enough but it also happens when they all have pretty important life changing events about to happen.This is likely going to get alot of mixed reviews because it is silly. It's a Christmas movie and most of them are. It's the silly movie time of year. But the movie also has some real things to say about family. And how parents and children relate to each other. Even if this isn't your usual kind of movie it isn't horrible and at least worth the watch. It's Christmas after all.",
    "11": "After reading a few reviews on here and accross the Internet, I decided to actually give it a go all the way through. One reviewer said it was lots of dog urinating and lots of farts from eating ice cream, however that was limited to one or two occasions of one or the other.I felt some emotion from watching this title, which always makes my ratings higher when I feel lifted by some emotion. I know some of this film is silly but so wasn't American Pie silly if you had an IQ above 120. I saw a great film once called clueless, which was much better than this but simular high school halls, sports teams, parties and family residences. So think about all that with mom being daughter pop being son baby being dog and all vice versa, good laugh for 90 minutes.",
    "12": "Yes we have seen the concept of intergenerational body swaps innumerable times. Yes there are the usual tropes. Yes it can be silly.But this movie is actually infused with the spirit of Christmas.We teared. We laughed. We smiled. We nodded knowingly. We laughed hysterically. We felt warm and happy at the end of it.All the leads were good but I found Jennifer Garner and Emma Myers particularly good. Ms. Garner really showed her comic skills.This will not make best picture but it will make my annual list of Christmas movies. After all if you can't get sentimental or mawkish at Christmas then when?",
    "13": "I didn't plan to watch this but I was having a very bad day so you know why not. It's great. Easy to watch. It's unbelievably cheesy. There's some moments where I did pause and I was questioning the process but you know overall it's a good silly heartwarming sugar filled family Christmas movie.I love the nods they inserted in the dialogue. I thought the acting was good. I especially liked Wyatt as his dad. They delivered the comedy pretty well which was similar to the typical humor for these types of films. Nothing too over the top but out there. I laughed. I even cried during the more serious moments.Special mention for them adding in bloopers! I missed seeing those and took me back watching films when I was younger.",
    "14": "The movie doesn't take itself to serious and I had a good laugh through-out many of the scenes. The characters all did their roles justice and I just loved getting to know them and their situations. Yes, the genre has been done many times and isn't anything new. That doesn't mean this movie is bad. If you have a craving for a few good old fashioned laughs you can get them while watching this movie. Overall the movie doesn't try to hard and still manages to be originally funny and succeeds in making something old into a new fun experience. The ending felt a little blunt but the rest of the movie was good and worth a watch if you are in the mood for funny feel good movie.",
    "15": "Just forced myself through this movie, egads. The absolute best part of the movie is Rita Moreno. It is so wonderful to see her in movies. The bad part was there was not enough RM in the movie. The plot is the same old blah, blah, blah body switch movie. There is nothing new here. The acting feels forced, the attempt at comedy feels over the top forced. Jennifer G reprises every movie role she has ever done. I have nothing against her, she seems like a genuinely nice person, but as an actress she lacks any kind of range, like watching white bread soaking in milk. This role would have been better suited to a comedic actress with depth. Ed Helms was good, better if the lead was someone with.a more multifaceted personality. It would have been better to have had Ed Helms as a widower and Rita Moreno as the grandma switching bodies.",
    "16": "After watching this, I wondered what dirt these people have on Rita Moreno. She isn't in the movie a lot but I felt for her. She doesn't deserve to have this credit on her list that will just sully her name.The editing is very poorly done in this movie. The most glaring error is characters entering a building in one outfit and the next scene, they are in a completely different outfit. And let's see if anyone can explain the changing hair from straight to curly for 2 of the characters. I can only assume that the film editor was drunk when this movie was put together.And the point of these types of movies is that the character in the switched body has to 'learn' something in their 'new' body. What would an infant learn from switching with the family dog and vice versa. Oh wait. That was supposed to be funny?Don't bother with this movie. It is the worst of the 'switch' movies.",
    "17": "Ok so I was extremely excited to watch this flick because of the talented leads but what unfolded was my worst nightmare.This film is written like one of those 90's films we used to love because of how weird and unique the plot was but this film has absolutely nothing new to offer. We have seen everything before and even the screenplay and dialogues are stale and dated.Full points to the actors for trying their best to salvage whatever they could of this absolutely terrible plot and screenplay but even God wouldn't be able to save it.Direction is as dated as the plot points.On the whole it is a torturous and difficult watch..",
    "18": "Okay, we all know what this movie is about even before the movie starts, right?. So you might raise your eyebrow thinking...here we go again... I know I did, until the characters in the movie made the joke about themselves, and the other movies like this One, That's when I realized they knew what they were doing. And it was funny.Of course it's a fantasy, it's a Christmas movie don't expect this to become the next Home Alone, this won't become a classic...\nBut I'm sure it's going to be a movie to watch when you are already fed up with Die Hard, which I consider one of the best Christmas movies ever.This one is cute, heartwarming and funny.Some of the CGI sucks, but it doesn't matter here.",
    "19": "I don'tind when Hollywood rehashes old ideas, but when an old plot is used and completely butchered as in this movie then I lose all respect for the industry as a whole. This movie proves what is wrong with Hollywood today. Utterly ridiculous storylines and storytelling. It's supposed to be a Christmas special with a lesson of love, or something, but all this movie does is insult the audience. Nothing is funny, nothing is intriguing, nothing is build up or let down. Just the same stupid plot, thats been told a million times before, being told stupidly. Open it, click the dislike button and move on to something classic.",
    "20": "Its that very special time of year where all the networks start putting out their reserves of impossibly cute wholesome Christmas movies. Some of them are good. Some of them are bad. Family Switch lies somewhere in the middle. I mean the body switch comedy genre has been done plenty as well but this has both parents becoming their children (I won't get into the baby and dog switching) on the eve of all of them having pretty important life changing events happening.This is going to get a lot of two star reviews from professional reviewers because it is silly and no new ground is tread but no new ground needs to be. It has the right amount of funny moments. The right amount of heart warming moments. Is it perfect? No. But it is worth at least watching once.",
    "21": "We must understand that this type of film is a family comedy where we are not going to find the best plot or the best performances, since its purpose is not that, but to entertain, forget the problems or tiredness of the day. This movie is set at Christmas time only at the end of the movie, it does have a plot that has already been repeated on other occasions, such as the body changes, only in this one it happens in the whole family even in the dog and the baby (I think That was the worst part of the movie, and the other worst part was the bully student who was like 40 years old haha). However, the message of the film is beautiful, fulfilling its objective at this time, it tells us about how a family, although together, are really separated without understanding each other and without respecting each other's challenges, as is often the case. Family responsibilities and many things are done to make the family happy, having a happy ending where we are taught that each member of the family faces their challenges and how we have to put ourselves in the other's shoes. J. Garner has become the mother of family comedies, she literally always plays the mother. It refers to 30 going's 13 and maroon 5. It is enjoyable if you don't go with very high expectations.",
    "22": "If you liked the movies Big, Freaky Friday, and The Hangover, you will absolutely love this movie. It's a smart, nerdy, witty, attention grabbing movie that is fun for the whole family. How can you go wrong with Jennifer Garner and Ed Helms? They are hysterical. (The bloopers a the end of the movie are worth the watch alone). And, bonus! Rita Moreno is a mysterious passerby that just happens to show up everywhere. Parents and teens alike will get a kick out of this movie. It speaks to all of us no matter your age. It's a feel good movie but not too sappy. Story is familiar but original and the acting is on point by the whole cast. Definitely a must see.",
    "23": "In this film, the Walker family gets to know one another inside out when a supernatural phenomenon leads them to switch bodies. Through the efforts of a kind guardian angel, a miracle occurs at Christmas when the Walker comes to appreciate each other.The \"switcheroo\" component of the film includes creative bits of business and comic gags, the funniest being the switch of the toddler Miles Walker with the beloved dog Pickles. But there were also excellent sentimental and romantic elements.The direction was outstanding with interesting locations and set-ups, the included a dynamic soccer match, a band competition, an interview for Yale, and a business board room.All the performances were standouts, especially that of Pickles! This was a heartwarming and endearing Christmas film that celebrated family values. It was a throwback to screwball comedy in the finest tradition of Hollywood.",
    "24": "The movie started off incredibly cheesy and cliche but we didn't mind. We love family night movies and they had a good cast but we were off to a bad start. When the parents and kids switched, they didn't do a good job acting as the other person. Jennifer garner was acting like she was a disoriented 6 year old. The Ai and editing was really bad at certain points. Almost similar to The Mask from 1994. We left it on despite the poor acting, editing, and filming in general but we drew the line when the mother's friends acted like 2 year olds and made the BROTHER AND SISTER KISS. Thats when we all drew the line. Turned the whole tv off and went to bed.",
    "25": "The double switch is just too much to handle. Unlike the earlier switch movies like Freaky Friday and Hot Chick I can't picture the switched characters in their switched roles. They don't act like their switched characters ie different ages very well. Not cleverly written to show the contrasts in behaviour. There is an attempt to show parents and children appreciating each other's positions. But it isn't moving.Jennifer Garner had a better movie to to act in 13 Going on 30. Ed Helms looks tired. The kids are not appealing. And why are they shorter than their parents by so much?Sometimes less is more. This movie shouldn't have been made. Just shows how the earlier movies of this genre were better.",
    "26": "This theme of switching bodies isn't so new in movies and series.. this is a real failed tentative to have a 2023 film like Freaky Friday.. But, seriously.. I cannot name how bad it is.. I wanted to stop in minute 7 and then I thought \"it CAN get worse\"..Than, in minute 24:35 it gets the worst it could: the family's babe becomes the family dog and vice versa.. Idk how it could be related to Freaky Friday in any respectful way.. It is to remember that the main older actors are good, tbh.. But the whole story, the very weak lines.. just awful.. Idk if it was this awful on purpose or if it was just a huge effortless failure... I didn't have an account on IMDB, so, no matter how bad a movie is, I never comment.. But THIS ONE was worth saving YOUR time of watching to it..",
    "27": "I belly laughed at this movie and found it to be great fun! Disconnected family swap bodies and find their way together again, appreciating what the others are experiencing. And a fun dance scene in between! I also loved Rolf's character, he was hysterical. Everyone fits into their role really nicely, and in a believable way. I also liked that they didn't slam dunk their swapped experiences right away, having to come together as a family at the end.I cracked up when the wine mom's came by and the swapped \"kids\" had to kiss. \"The Redman theory\" - DIED. And Pickles with their little helmet, I couldn't get enough.",
    "28": "Everything about this film is woeful. Please do not waste your time. I like a cheesy Christmas film, but this wholeheartedly the worst and most dreadful film I've had the misfortune of watching in my 27 years on this planet. \"Family Switch\" is an agonizing cinematic experience, lacking in humor and holiday charm. The film's attempt at comedy falls flat, leaving audiences cringing at its forced and awkward moments. Despite its presumably festive theme, the movie fails to evoke any Christmas spirit, making it a disappointment for those seeking a seasonal escape. The overall execution is subpar, making it a contender for one of the worst films in recent memory. The lack of genuine laughs and the absence of a festive atmosphere contribute to an unfortunate viewing experience that fails to leave a positive impression. Save yourself from this cinematic misstep and opt for more engaging holiday classics instead.",
    "29": "Family Switch is a McG movie on Netflix about the Walker family that stars Ed Helms and Jennifer Garner who play husband and wife. They end up switching bodies with their kids due to an astrological event when all the planets align. Their kids are played by Emma Myers who was Wednesday's best friend, Brady Noon and the twin babies Lincoln and Theodore Skyes. This film is familiar to other similar movies that were mentioned in the dialogue that include Garner's movie 13 Going On 30, Freaky Friday, and 17 Again. Although the script is nothing new the story and the actors made it fun to watch with cameos by Paul Scheer, Helen Hong, Ned Bellamy and Howie Mandel. This was our third Christmas movie of 2023 and the best one we watched so far. It was definitely enjoyable and worth watching with the family,",
    "30": "Within the first 10 minutes of the film the main characters were expressed as 1.) Hyperbolic tropes 2.) Deeply unfunny and 3.) entirely unlikeable. It felt like someone told chat GPT to write a classic christmas movie with \"freaky friday\" vibes, and what came out was a soulless piece of garbage that fully misunderstood the type of camp the people enjoy in crappy Christmas movies. This getting panned probably won't adequately communicate to the coked out studio exec who thought this was a good idea that AI won't be the future if the producers have bad enough judgement to make this garbage. Even if this was written by a real writer I do not blame them for this monstrosity. I blame Netflix's entire production team for forgetting why people care about movies and the stories they tell. This movie was written by writing a checklist of plot points on a post-it note and that's why it's so unforgivably uncompelling.",
    "31": "I have no idea why this movie gets these low ratings. It isn't anywhere near some top-notch Oscar-worthy quality, but so what? It's not supposed to be and it isn't pretending to be.What this movie is is a feel-good comedy with really good cast (they all do a really good job), excellent pacing and a script that has all you need in a movie like this - all the happy and sad moments you'd expect. Every single character is likeable and relatable and every actress and actor nail their role.This is two hours of fun and joy that will respect your time and make you feel good and give you a few laughs along the way. Perfect for the holidays.",
    "32": "Magical Holiday Delight: Family Switch Spins a Heartwarming Tale of Love, Laughter, and Christmas Miracles as Families Trade Lives!Family Switch brings a whimsical Christmas twist reminiscent of Freaky Friday as two families with contrasting quirks and lifestyles swap places.The heartwarming journey unfolds, fostering a deeper appreciation for love and understanding. This feel-good tale, adorned with Christmas music classics, delightful awkwardness, humor, and a seamless flow of love, is nothing short of a Christmas miracle. Packed with pop culture references, it's a solid watch that has me eagerly anticipating future Christmas traditions. Cheers to the magic of family bonds, and here's to a hopeful future!",
    "33": "They shouldn't have forced this movie to be a Christmas movie. Cause it didn't feel like one. Just because you're screaming, \"Hey, it's Christmas!!\", doesn't mean that we're going to feel the Christmas spirit. Besides, the story about 4 bodies switching minds (the other 2 were insignificant to the story) is just too confusing and messy to watch. Especially, if the actors cannot handle the transformation smoothly. I didn't get any awkward teen vibe from Ed Helms. Just him being his silly self. This movie was trying too hard mimicking Freaky Friday, but ambitiously adding two more sets of body switching. I guess they just chewed more than they can swallow. But then again, since it's almost Christmas and in the spirit of being kind and all that, I'm not gonna rate it lower than 5. Consider it Christmas magic.",
    "34": "So annoing that Wyatt is the exact copy of young Sheldon from the movie that has the same name and all the story is so predictable. To me it's like \"let's make a movie about the Christmas by putting some famous actors, cutting pieces from other popular movies because Christmas is coming so we need to create some content, bad or not, people love to see some snow, globes, a so called \"winter story\" and we will definitely take advantage of that\". I think that this movie is like the song \"All I want for Christmas is you\" sung by Justin Bieber but you just keep listen the Mariah Carey version every year because the lack of authenticity is simply boring.",
    "35": "I read some of the reviews, and I am somewhat surprised by the harshness. I found the movie sweet and light and just enjoyable. Not every movie out there has to be cinematic art. Sometimes what you need on a rainy weekend afternoon is to curl up in front of the tv to enjoy something lighthearted and wholesome. Yes, the switcheroo bit has been done sooo many times, but hey, so have many superhero movies and I don't see anyone complaining (seriously, how many Spider-Man movies do we need?). No, it was not a particularly clever plot, but I fully enjoyed watching the actors chemistry, and dare I say, found myself laughing out loud in some spots.",
    "36": "Found myself laughing a few times at this movie which surprised me. Kids will love it ( especially the dog and baby switch) will definitely watch again. 10/10. I thought it was gonna be another cliche film about a family arguing, hits breaking point and boom the switch happens then they make up and all is well ( which yeah this still kinda does happen) but what is different is that it is actually funny plus the music/ soundtracks were great. Nice that is a Christmas based switch this time but it's not shoved in your face that it is a Christmas film so you could watch anytime year round, actually forget it was supposed to be a Christmas film at one point lol will definitely watch again.",
    "37": "Why did I give this a two star rating? I like the actors... the writing, directing, pacing, and everything else, was unwatchable garbage. Lazy writing was so obvious, you couldn't see anything else. Nothing was funny. You wouldn't laugh, even by accident. A huge waste of time. Stay away from this steaming pile of manure. What else can I say? Not much else. If you're a fan of these actors, save yourself the pain and agony, do not watch this. A train wreck is horrible but at least it will keep your attention. I am writing this as this \"movie\" is playing in the background. Yep, it really is that bad.",
    "38": "The problem with this movie is that ... wait for it... it gas already been made! Freaky Friday is a classic and is much much better than this. Don't get me wrong, the acting is not that bad and Jennifer Gardner has always been a sweetie, but come on! 80% of the jokes we already saw 20 years ago. Yes, Freaky Friday is 20 years old, I feel old now!But seriously the way they look in the mirror, the way she sees that her daughter has tattoo, everything is the same... you could have thought of some original jokes or something. And in the end, you did it way worse than the original. Definitely worse.",
    "39": "I have not laughed so hard in forever. I love Jennifer Garner, she is so cute and hilarious. This is the best people switch movie ever. I can't wait to watch it again with someone who enjoys these type of comedies. I loved Howie Mandel's cameo. When I was literally laughing out loud I was thinking of Howie in Walk Like A Man. I dont think I have laughed so hard since watching Walk Like A Man with my bestie all thise years ago. This is one of my top ten laughing out loud films. Funniest parts for me are the baby and the dog, I was dying. I had tears i was laughing so hard. It is a great family film. Give it a chance, it is epic! I don't think you will regret it.",
    "40": "The moment I laughed the most was, when they really tried to convince the audience that a GIRLS HIGHSCHOOL SOCCER GAME fills an entire stadium... that was also the only time I laughed, because apart from that, the movie is full of clichés, forced diversity, virtue signaling, boring and unoriginal ideas as well as bad storytelling.The moral of the story is kind of nice, that a family should stick together, but the whole movie feels like desperately trying to make the audience laugh without doing or saying something remotely funny.I didn't expect a lot of a goofy family comedy starring Ed Helms in the first place, but I barely made it through. Only reason it didn't get 1 or 2 starts is, because the characters undergo some sort of character developement and at least there is a wholesome moral to the story.",
    "41": "The swap genre has been overdone and this film adds nothing to it. I could say I haven't been this excited to see Jennifer Garner in a film since \"Yes Day.\" but that would be a lie as all she does are family \"B\" films. Ed Helms is his mediocre self. The kids did pretty well. I like Brady Noon as Wyatt and I fell in love with Emma Myers when she was charming in the \"Wednesday\" series. We are introduced to a family who each have a life changing day tomorrow and then they swap and everyone goes into a panic. They need to obtain a special lens and time is critical as the planetary alignment will not last. On the boring and predictable side of things. Outtakes at the end were the best.",
    "42": "It's not the greatest movie ever. However I am so thankful and excited that we can watch it as a family, be entertained, laugh and not hear all the cussing that seems to be in every other movie!! It's got some serious parts and some funny parts with good messages weaved throughout of how to support your family members. I think Jennifer Garner was charming in the movie and the dance scene is a great throwback and fun to watch. I'll admit the dog and baby was a little odd for me, but that is a background storyline of the movie. I was entertained enough to go back and watch 3 times after being interrupted with other things.",
    "43": "I was initially a little cautious because the switch concept has been done many times and I thought it might just be a bit same same. Decided to watch it for the leads and I am glad I did. There was some new takes on old ideas and it worked well. Lots of laughs and feel good moments. Nice festive theme. Some expected plot points given the nature of these movies but they still made it fun and had a few different things thrown in. It will definitely be on my December / Christmas movie watch list. Was a good family fun movie, great cast as well with funny great supporting actors. Lots of fun back and forth happening. Worth a watch.",
    "44": "So many clichés...and even a tasteless taunting of a couple (Harry and Meghan who have been bullied for years by the toxic British media - did Murdoch produce this)?Making soccer sound like a woman's sport when it's the biggest sport in the world and the men's teams and Workd Cup still have a lot more prominence.Middle class couple living in a mansion (no wonder poor immigrants in poor countries want to come here). The nerdy son.The typical car chases...Rita Moreno a small saving grace as she has her charms. Another dig at liberals. What trash. It's very very bad. Christmas movies are usually bad, but this...",
    "45": "So many cheesy holiday movies to scroll through. I thought this may be yet another. Instead, we chose to watch this with my kids who range from age 7 to 15. I saw each of them laugh, including myself and my wife. While we each have different tastes in comedy, I literally saw all of us interact with this movie. This is what film is all about. How it makes you feel. Ed Helms and Jennifer Garner were perfect together, along with their on screen teenagers. The characters were exaggerated, yet likable and it made for a truly fun movie. Truly fun to watch and literally \"laugh out loud\" funny! This movie isn't for those critiquing films alongside The Godfather or other Academy Award nominated films. This is a movie to snuggle under a blanket, sip hot chocolate and cringe, laugh, and stare at each other to see their reactions. Enjoy!",
    "46": "Yet another sanitised comedy where actors delivering safe and sanitised jokes (where there's a need to underline that it's a joke else people might get offended or something?! At this point why bother?). Maybe it was funny on the script? Who knows. Execution is not funny but forced to sound like it's funny.It's not funny really, it won't even make you smile but shriek in your sit feeling uncomfortably weird thinking something is wrong with you. While in fact it's just a bad movie. Switch to something else and don't feel guilty about it.We gave up after 15 minutes. Life's too short to force yourself to watch a bad movie.",
    "47": "It was fun and lighthearted. It was clean which I appreciate so much. I enjoy all Jennifer Garner movies and liked the rest of the cast.That said, the characters didn't commit to their roles. They were so worried about giving Garner screen time that even after she switched with her daughter she continued to act like the mom many times. CC's character did the same. It seemed they were confused which role they were playing and went back and forth. Lots of cinematography mistakes too. Chair frontwards in one scene, backwards in next kinda stuff. Little inconsistencies and annoyances.Not believable of course but not why you watch a movie like this. Glad we watched it, but they could have made it better and far more consistent.",
    "48": "Super fun Christmas family movie! Hilarious casting, full of cliches nicely executed which make you laugh out loud, underlines generational gaps and sets you Xmas mood! For all the haters out there its not a \"movie for oscars\" chill down! Don't look for deep/blockbuster-ish movie. It is fun, whimsical and entertaining enough to keep me mostly hooked throughout its 101-minute duration. Hilarious treat featuring a team of actors who undoubtedly had a blast together, which translates onto the screen. It's a Christmas movie for God sake! And its perfect for families and not only! \"Too cute to hate\" Enjoy!",
    "49": "A Christmas happy movie so it should not be too strict on it, but I think similar stories have been seen? Freaky Friday, 13 going to 30... anyway this movie should be watched without much pressure and having fun? The story is about the Change of space which made the whole family switched their bodies ( it's fun that the baby switched with the puppy), and when they are in others body, they would just know how hard their life is and gotta understand each other more. It's fun with some warm reminders to the audience. And at last they are having the last chance and switched back to original one. Happy ending-~~",
    "50": "If you want to spend your evening watching something funny and light , I would definitely suggest it. It's not something you haven't seen before. There are too many movies like this. However, since it's holiday season and this is a Christmas movie, it's nice to spend your time watching it especially if you have kids. The movie shows a family of 5, switching bodies. Apart from the comedy parts you kind of notice the struggle that parents have and how their life changes after becoming parents and how many sacrifices they do daily without telling their kids. At the same time you see how children are trying their best in their own way and some times parents don't see it but also how many things they hide because they feel that they will be judged by their parents. At the end , everything turns out smoothly of course as it is a comedy but even though it seems silly, it actually makes you feel nice.",
    "51": "It's a lot of fun to watch with the family, or even alone.I feel like there could have been a much better ending, with the team's Scout at the end telling CC that \"We need someone with a good heart.\" It was a little forced.Rita Moreno's character could have been used more in the film, not just as a lunatic who is ignored.The film's CGI is good, too good for a Christmas film.The actors managed to make an impressive character change.I hope they get more roles for other films. Especially Emma Myers and Brady Noon, they performed very well.This was my first Review on IMDb, enjoy the film.Sorry for any English errors.Merry Christmas. <3.",
    "52": "...Emma Myers is so goddamn cute here and she steals every scene she's in, so I'm giving a one star more. She's literally the future queen of our hearts, but the world doesn't know this yet.But often I felt like I saw this movie 10 times before somewhere, there's literally nothing new here, the joke, the puns, the scenes, there's nothing in this movie that seems it was made in 2023. It looks more like a bad direct-to-dvd comedy movie we used to watch in the 1990s.Cinematography, the thing that is literally gone from the big cinema since '1917' movie and 'Dune' is non-existent, which is to bad for a Dolby Vision movie.But, it's kinda ok, because Emma Myers saves the movie.",
    "53": "This movie wasn't bad, but the chemistry at the beginning was not great, and the older switch movies were better.But I have to admit.... The word gag when they mention all the other old switch movies was the most clever thing in here.....\nFreaky (Friday), Big, 17 Again, 13 Going On 30.... Clever!Besides that, it wasn't bad and got better as it went on. Very reminiscent of We're The Millers and the last New Vacation Movie.The acting was good as time went on... Definitely a good holiday movie.Love that Netflix has the great content and you don't have to go out of the house to see movies like this.",
    "54": "I have seen worse bad movies and this is a bad movie. It is cookie cutter christmasy freaky friday with the added twist of the whole family switching bodies. Shallow, dumb, unfunny and.catered for children who have and never will discover nuance. Still it is not the worst. Mainly because the whole cast is quality a-list actors, including the kids who know how to work a script no matter how unbelievable or hallmark-y it is. The jokes do not land, the story does not grip but you still somehow buy it and get a bit immersed at times even believing for.a second that the bodies are indeed switched. That is however the best you can say about this movie. Recommended if you have family over and want to watch a flick that is as harmless as can be. Besides that skip it, you wont have missed anything of substance.",
    "55": "Based on other reviews, we thought we'd enjoy a cute holiday, family movie. From the beginning the writing and storyline were awful. So many inconsistencies and irregularities that make you say, wait, what?There are 2 older teens and a baby. Random. Aren't Jen & Ed a little old to play parents with a baby? And the baby. Ugh. First he's in a partial coma on the sofa, then he's put himself in his highchair & made himself breakfast all on his own. The best is when the family pawns off the baby and dog on a strange quasi neighbor for like 2 days. Listen, I understand that it's not an academy award movie, but it really was painful and dumb. Find something else to watch. Watch paint dry. You'll thank me for this.Oh, and doesn't compare to Freaky Friday at all.",
    "56": "It is a fun, light hearted movie with a bit of Christmas to it.I'm not sure where so much anger in so many of the reviews comes from and I'm not sure what they are expecting from a movie like this. If you are looking for cutting edge or a hyper realistic story, then you should probably skip the body switching, Christmas family comedy movies.The first 20 minutes or so are a bit slow because they have to go through and setup the daily lives of all 4 characters but most movies take a bit in the setup. Fortunately, everyone is likeable and everyone is fun in their own way.Sure, it is basically predictable but, in reality, what movie isn't? It usually isn't about the end, it is about getting there and this one has fun with it.",
    "57": "Why, people, why all the bad reviews? This movie is everything you are looking for during the holiday period, and it's really a quality movie! The actors were amazing, the storyline is perfect, it's funny, naive and brings back childhood memories when movies were really good. You can relax and enjoy, and there is not a single boring moment. The entire family is convincing in their characters and there is not a single cringe scene. The German character was a real refreshment, and the actor stands out from the crowd, he is a real gem. I hope we will see him more and more, since he's already famous in Europe and in the US.",
    "58": "The only funny thing in this movie is the baby/dog scene, the rest of the script is just junk. I just wanted to pull through the cringe and get to the scenes that actually are not that bad. The acting was not bad at all but the script is just awful! This script belongs in the Hallmark channel, I can't belive Netflix and the two main characters agreed to shoot this movie. Way too cheese to even watch with your teens, the difficult moments the family had to thru at times felt like an A. I. wrote them, meaningless & full of bits and pieces from kids/Disney movies. All I can say is too watch at your own risk!",
    "59": "This movie was so fun. We couldn't stop laughing and smiling throughout. And the roles were played really well so that the ending was quite heart-warming too.Each character was well defined and the acting of the different role-plays between each of them was really well done too. I feel like you could tell that the actors enjoyed making the movie together, and hope to see more like this. More serious, dramatic, deeper movies have their place, but movies like this have their place too and we sure were happy with this one. I enjoyed watching this with my wife and would gladly watch it with our kids too. I'm sure this will become a new holiday-season favorite for us for years to come. It kind of reminded me of \"Yes Day\" with Jennifer Garner, but with a holiday twist. Good job everyone!",
    "60": "I love ed and jen\nI love the idea of switch movies even if its an overdone formula\nSome scenes are funny and many dont make aenae rhings dont work at all. Like the dad being a rockstar to the dad being a nerdy music teacher, mmm kind if half a*** writing. Inknow ed is musical and love that about him\nBut his plot was not believable. They could have done more to use his comedic and musical talentThe dog and baby was completely useless didnt make senae they could have easily skipped that part which i guess they did for some laughs but cgi is terrible and it doesnt even blend into the storyline. Should have been omittedThe \"walkers never quit\" line is overusedBut ok for one night of chill fun with family.",
    "61": "There are a number of reasons why I watch this movie, but the most important reason is because of Emma Meyers. I would say that this movie is quite nice and humorous for me, despite the fact that the body switching narrative is pretty popular in movies. There are some jokes that are pretty cheesy, and there is a scene that is cringeworthy somewhere, but overall, I enjoyed it and I laughed pretty much a pretty great family movie. I feel like I'm watching Yes Day because the punchline is the same, and the plot is pretty similar. This is because they need to understand each other and learned their lesson in order to solve their problem together.",
    "62": "It's all forced jokes and the acting isn't good, I understand this is a kids movie but it's dry and plain. It's almost as if they ran out of ideas to make this movie. I really did not enjoy I stopped watching it. It bored me half to death watching the characters make unfunny jokes and look stupid. I don't understand the hype?! Overall I give this movie 1 star, really disappointing performance and horrible acting & jokes. The characters are also very very stereotypical such as the \"nerd\" and \"sports girl\" which both I found make me want to stop watching. The grown ups acting was fine but it's the kids that really ruin it aswell.",
    "63": "It was really disappointing how terrible this movie was because it was so hyped up on line. This was not good. It was a waste of my time. I should have watched a different movie. There were only two okay-ish jokes the whole movie. Just dumb, cringy, and not funny. Jennifer Garner was the only thing this movie had going for it. Very predictable. I guess if you want a movie to make fun of this is for you. It doesn't even feel like a Christmas movie. This feels like the type of movie where the actors just needed a paycheck no matter how bad the script was. The whole baby/dog storyline was stupid.",
    "64": "Well when I saw the cast of this classic structure family comedy I thought let's gift it a try. I then was only about ten minutes into this intensely poor creation and thought to myself.......did Ed , Jennifer and the rest of the cast read the script beforehand and if they did I hope they got paid mad money to do thisThe cheap overacted scenarios and exaggerated dramatics make this poor so so poor! I felt my soup leave my body and wish time would pass that I didn't have to finish the film.....I did most my Christmas shopping whilst having this on I. The back ground and still found the loss of soul painful.I did atleast find one positive. I finished my shopping.",
    "65": "I LOVED the film!The film idea was great, I really liked the Christmas miracle theme. The movie is really funny, I really liked the father and son mixed theme and let's not forget the mother and daughter I really liked their story to. I love the actors, can't believe that all of my favourite actors are in one film!!! Emma Myers as CC was just perfect, have nothing bad to tell about her. Same with Ed Helms and Jennifer Garner as Bill and Jess LOVED them in all movies and I still love them in this one. My FAVOURITE character in this movie is Brady Noon as Wyatt! All of the characters made me smile but Wyatt ( with his dads soul) made me laugh the hardest.I really liked this film and if there will be another part I would be very happy!!!!!If you haven't watched this masterpiece GO WATCH IT NOW!!",
    "66": "I knew I wouldn't like this movie, I knew I would not care for any of the characters and I knew it would suck. This \"Christmas Movie\" is just a body swap movie with slight christmas elemants and christmas songs. This movie has only a couple of good scenes and 1 funny joke. The characters are okay, and I understand why the kids hate their parents. Their parents really are the worst, the dad's fine... I guess.The mom is pretty bad though, she ruins just about every thing for CC. The dad also kinda sucks but not as bad as the mom, everything he does is kinda justified. But he does almost ruin the sons opprutnity to get a girlfriend, could have ruined their whole relation ship. He also ruins college for his son, but he tried, he did try. Everything does work out in the end, somehow, which is really one of the only christmas esc parts of the whole movei because Christmas Miracle.The best scene is a rendition of Santa Claus Is Comin' to Town. It's a pretty good rendition of the song and I really liked that scene, it was a sweet breath of fresh air before I was dragged back down into the depths of hell.Again the kids are in the right, sure they do some bad stuff, but the parents do far worse.2/10, watch this if you like tourturing yourself by watching terrible movies, you might even put this right below shrek the third, like me. Unless you are that kind of person, a youtuber, a critic, don't watch it... I mean it, don't, it's purest form of live action christmas movie tourture, that I know of. I hope I don't find something worse than this because I might just go insane watching. I almost went insane watching this, but tis the season, so I watched it. Never watching this again and yes I know people like it, but don't know how they do, because it sucks.Just watch a good movie instead of this hell-hole of a movie, just watch something like John Wick, or even jurrassic world, because jurrassic world takes place at christmas time, so because of family switch I am now gonna count that as being a christmas movie. Because god forbid I ever have to watch it again, this is my excuse for not watching family switch around christmas time. I am watching jurrassic world and John Wick, both much better movies and both of them are not even christmas movies. But they both have christmas elements so I will watch them instead, and I don't even like jurrassic world that much, it's just a much better movie.",
    "67": "The kid moved like Jagger. He used to but now he doesn't. He is grown up and thinks everything is lame now. Spoiler alert: that's what this movie is. Wasting ed helms and Jennifer garner. What's in your wallet? If this was released in the theater, then it'd be no money and this ticket stub. I know this becomes a freaky Friday but I had to quit this one early on cuz they referenced a terrible song from years ago. Another movie where the kids are too cool for school and everything is lame. It's bad enough people have to live this, why watch a movie about it? This is required viewing for the wine group so that you know what everyone is talking about.",
    "68": "Family Switch is what is and what it is... Is a decent family movie with a sprinkle of Christmas. Nothing new to see here with the storyline, but it is perfect for the younger teens and kid that may not have seen similar movies with the boday switch theme before.Don't watch this expecting to be blown away by anything to do with the plot or special effects, it doesn't try to hard to break new ground, but gives enough to keep you watching right up until the very end.Ed Helms is brilliant as always with some genuine laugh out load moments along the way, with solid performances from all of the main cast. Overall this gets an 8/10 from me.",
    "69": "It is really refreshing to watch a wholesome, family comedy. Even if it was done 100 times. I don't think there was a single curse word in it. I liked this movie a lot. I didn't feel an emotional attachment to the family, and I didn't care about their journey. Nothing made me hope they'd be okay again, but I do like the characters. Especially the soccer girl (CC). I also had a hard time keeping track of who's who. Like, who the parents, or kids were. I'd forget too easily there was a switch. It was off. The actors, especially the kids did a fantastic job. It was very funny, and enjoyable. The best part was the dance sequence. It was a good \"feel-good\" movie.",
    "70": "Netflix top 10? I turned it off after 7 minutes absolute garbage.Five hundred and thirty five characters to go before I can leave written review but I've said what I needed to say already, so I'll just have to keep typing until the required characters have reduced down to zero. When something appears in the Netflix top 10, don't trust it you should do some research into the flick use rotten tomatoes. If you going to make an awful film you need to ensure that there's a few take away quotes that are funny. Don't go 100% truffle in your pants not long now just forty characters to go before I can save this.",
    "71": "I was watching well ,intending to watch this movie but I was a bit unsure between weather would I watch it or not but then I give it a try so believe it or not it's worth watching. In start it maybe feel a bit unrealistic however the more you watch the movie the more you get surprised by the element of comedy and and the feeling of a family support and understanding. I usually din't write reviews but this movie was so so underrated by it's rating that I couldn't bare the injustice being happening with the movie. Moreover the movie is also a good piece for a family Christmas with all the family across the fire place, in front of a tv.",
    "72": "While i get this movie is trying to teach a lesson it does not respect all values. In this movie we see a $500,000 Pokemon card be just given away for a piece of glass that didn't even matter. Seeing as I am a huge Pokemon fan I am deeply upset with this and I am sure that other Pokemon fans would be too. If people don't understand what they are talking about they really shouldn't speak about it. This movie doesn't understand just how hard it is to have a real authentic 1st edition holographic Charizard and especially a PSA 10. I am very hurt the way they see Pokemon cards in this movie and really hope not to have to ever go through something like this ever again.",
    "73": "I don't understand why there are so many negative reviews. If you are searching for a nice family movie which some laughs and some nice moments, then don't hesitate to watch it. It is predicable but it is ok, you will still enjoy it.Will I watch it again? Probably not. My daughters also enjoyed it. It has some nice family moments, and has a nice view of how the mother sacrifices for her daughter without knowing. This movie also sheds light about how families are not bonding together and how each is distracted in his own world and the mom tries to fix this.As a conclusion, don't expect this to be the best movie, yet it is an enjoyable family movie, so don't care about the negative reviews.",
    "74": "Anything with Jen Garner in it. I'm game! Some scenes even made me well up! Must be going soft at my old age! Great family fun movie. Ignore the bad reviews. Definitely worth watching! Watch until the end for bloopers. The kids made convincing parents once swapped.It is similar to Freaky Friday, but this time it's the whole family who have been switched. There are some cheesy scenes, but it's forgivable. Jennifer Garner is a great actress. She can play any role! It does start off a little slow but the whole movie has laughs and tears for me at least. Give it a try. Everyone acted well in their roles overall!",
    "75": "This is a predictable but nonetheless entertaining edition of the kids/parents/old/young body swap movie. It's a little boring and cringey at times, yes, and almost has the vibe it was written by AI. But it actually does have some pretty funny moments and some weird and funny moments. Ignore the dog/kid thing because it is just dumb. Otherwise, a lot of the film's meager charm is thanks to the actors, including the kids. It's an easy if too long watch while you're doing something else and if you don't expect very much you'll be pleasantly surprised by some genuine laughs. It's not as tight as its predecessors and is very silly but, meh?",
    "76": "If not for Emma Myers and her likability, I would not have been able to sit through this regurgitation of an over-used plot. It is so obviously a desperate reboot of so many other movies that they actually make fun of that fact in one scene. The acting is horrible and the writing is worse. I actually feel sorry for Emma, as I think she had a promising career ahead of her; this movie may, unfortunately, be the exclamation point at the end of the career of everyone involved. I can honestly say I have never seen a worse movie than this (and I have seen \"Major Payne\"), but what I can't get past is that I have never seen such little effort put into something in my life. It's like an intern was given the chance to make a movie, but only had 48 hours to put it together. The only explanation I can think of is that someone influential was trying to do a favor for a talentless hack of a family member and dragged everyone down in the process.",
    "77": "This movie disappoints with its regressive portrayal of race, perpetuating harmful stereotypes. From cringe-worthy dialogue to caricatured characters, the film fails to challenge prejudices, opting for cheap laughs over social responsibility. A missed opportunity for meaningful storytelling, it perpetuates outdated narratives rather than contributing to a progressive cinematic landscape. The film's superficial attempts at humor only amplify its insensitivity, making it a disheartening reminder of the industry's responsibility in shaping cultural perceptions. With a tone-deaf approach to race, Family Switch leaves audiences questioning its lack of awareness and commitment to fostering positive change.",
    "78": "The movie started out strong but fell apart in the last 15 minutes, feeling rushed and childish.-The events in the last 15 minutes of the movie seemed to be a result of irrational coincidences, everything coincided to make the events happy. This is expected for a Christmas movie, but in this case, it felt forced and did not match the good impression the movie had created at the beginning. Overall, I enjoyed the movie, but it's disappointing because it had the potential to be much better.-It's great to see Jennifer Garner again. I love her and hope to see her in more movies in the future .",
    "79": "We feel it was too light on the Christmas. Could be more festive. Absolutely. Baby needs more character development. If you like undeveloped baby character archs, this is yer juice box to pop. Absolutely. UNREALISTIC TIMELINE OF EVENT RESULTS. Also, we think they should kiss more probably. Despite these objective drawbacks and concerns, we did enjoy the dog as a baby - it gave lolz. Absolutely. We also liked the yellow pants and big tie and feel it would be acceptable even as the mom. It really is. We feel soccer scout man might not be a Christian. We liked the empathy & music & glow (especially in school washroom). Bully with one sleeve was our biggest holiday joy. What a Lil gift he was. Absolutely.",
    "80": "This is a cute, feel-good movie that made me laugh out loud a few times and kept me entertained the rest of the time.This falls squarely in the genre of \"Disney-esque\" movies that take place during the holidays, with lots of festive bells jingling and ding-donging throughout the score.I wasn't expecting to raise my IQ by watching it, and of course I didn't. Nor was I expecting a transcendent work of cinematic art, and it wasn't.But the acting was solid from all characters, the premise (while ridiculous, as all of these \"body-swapping\" stories are, unapologetically!) remained pretty steady throughout, and although it was predictable and formulaic, it wasn't over-the-top corny. (Sure, it was a little corny, but not TOO bad.)There's even a cute dance sequence in the middle of the movie that turned suddenly sentimental and made me tear up for no discernable reason except that I am a pathetic sap, lol.I enjoyed it and would recommend it if, like me, you enjoy sometimes just turning your brain off for a bit during the holidays, and watching something that's basically the cinematic equivalent of a warm snowman-shaped sugar cookie.",
    "81": "In what can only be described as a cinematic stumble, \"Family Switch\" takes a well-worn plot - the old body swap routine - and manages to make it even more uninspiring. The premise is ripe for hilarity: a nuclear family, the Walkers, get their minds swapped at a planetarium. Sounds fun, right? Not quite. The execution is as dull as a Monday morning algebra class. Jess and Bill, thrust into the lives of teenagers, are reduced to cringe-worthy caricatures of teen angst, while CC and Wyatt, navigating adulthood, seem to have the emotional range of a teaspoon. It's like watching a sitcom that's lost its laugh track.Director McG, known for his kinetic and visually vibrant style, seems to have taken a vacation on this one. The film lacks his usual flair, with scenes playing out in monotonous sequences that feel more like a PowerPoint presentation than a movie. The humor, which should be the film's saving grace, falls flat. There's an attempt at slapstick, but it's so poorly timed it feels like watching a stand-up comedian forget the punchline. And let's not forget the plot holes - they're big enough to drive a truck through. Why does no one outside the family notice these drastic personality changes? The film doesn't seem to care, and neither will you.But the real letdown is the missed opportunity to explore the complexities of family dynamics and generational differences. Instead, \"Family Switch\" opts for surface-level gags and overused tropes. It's a film that feels like it was made on autopilot, with a script that could've used a few more rewrites (or a complete overhaul). In the end, \"Family Switch\" is a forgettable addition to the body-swap genre and a massive departure from the vibrant energy we've come to expect from McG. It's like ordering a sundae and getting a bowl of plain yogurt - disappointing and bland.",
    "82": "Jess (Jennifer Garner) and Bill Walker (Ed Helms) are a happily-married suburban couple, but they fear disconnecting from their kids. Daughter CC (Emma Myers) is the star football player. Son Wyatt (Brady Noon) is a science nerd. They with baby brother and dog go to the Griffith Park Planetarium. With a planetary alignment, a telescope, and psychic Angelica (Rita Moreno), the family get switched.This is old hat for Jennifer Garner and the movie refers to her movie as well as others. Ed Helms is playing the music nerd teacher although the back story is leading towards former rock star. That conflict does cause some problems. This is mostly fine but very derivative. Garner can easily switch from stuffy to childish. Ed Helms is a little ill-fitting for the role. For example, Brady Noon is trying to play the dad like a leather jacket rocker in one scene and it doesn't fit his other scenes. The dog baby switch would be funnier if the CGI isn't so Son of the Mask. Of course, there is a dance sequence and I like the premise behind it. As for the band tryout, I don't understand why Wyatt with dad inside doesn't just play the gig. He can claim that dad is injured and the son had been learning from the dad. I do question director McG's style. His brand of humor is very broad and very low hanging fruit. This has a few fine comedic moments but most others are lesser family fun.",
    "83": "Is this a masterpiece ? No.Does it deserve the bad critics? No.Let's take the movie for what it is: a light family movie you can totally enjoy during the period of Christmas.I watched the movie with my kids yesterday (10 and 8 years) and my wife.We all enjoyed. The jokes are not always crazy good but good enough to make us laugh and have a good time.The movie is obviously predictable but still, it did not bother me/us that much.I would still recommend to people with a young family. It's light, entertaining and as mentioned funny.Even for us as parents, there are some interesting messages (again, it's not deep but still, some nice reminders here and there that I enjoyed).Give it a shot unless light family comedies aren't your thing.",
    "84": "Family Switch is the typical Christmas time family comedy dealing with the Walker family. The parents sacrifice a whole lot for their kids yet don't understand what the kids are going through. Similarly the kids putting in their effort, don't realize what their parents go through. An argument leads to them wishing to live the life of the other person for a day and the wish gets granted. How the family get back together, understanding each other forms rest of the story while trying to switch back into their respective bodies.It's a predictable screenplay and McG doesn't try too hard but play to the tropes of the genre. The moment the baby - dog body swapping happens, it gets clear that entire bit will just not be funny. For the rest, the convenient screenplay makes it simple for them pull it off. It's the regular set of jokes, some work on their own, some the actors make it work while the rest simply stays flat. The short runtime is an added advantage as there is not too much melodrama once the characters realize what each other go through and from then onwards, it's a race to the film's end so that final body switch can happen.",
    "85": "Directed by McG. A runtime of one hour and forty-six minutes. Streaming on Netflix with a PG rating.The holiday season used to be big in this family's household. \"Jess\" played by Jennifer Garner tries to balance an important job while still keeping up with all her family duties.Her husband \"Bill\" played by Ed Helms gave up a promising music career but now teaches band at his local high school.These two have sacrificed a lot. \"Cc\" played by Emma Myers their oldest child and a soccer phenom. \"Wyatt\" played by Brady Noon the brainiac of the family. Who might be leaving to go to Yale as a high school freshman. With their toddler \"Miles\" played by Lincoln and Theodore Sykes. None of them realize or appreciate everything their parents do.Equally on the opposite side. \"Jess\" and \"Bill\" don't realize the amount of stress and pressure their kids go through. \"CC\" juggles school and sports. \"Wyatt\" juggles having bad anxiety but still wanting to go to college three years early. While still going through normal teenage high school issues like dealing with bullies and liking girls. \"Ariana\" played by Vanessa Carrasco to be specific.This is all about to change. When they go to see a once-in-a-lifetime astrological event. A mix between the alignment of stars and a mysterious woman they meet, \"Angelica\" played by Rita Moreno. They all wake up the next morning in each other's bodies. Even their youngest son \"Miles\" switches with the family dog.Everyone will get a healthy dosage of each other's lives and of course, this happens during a monumental life-changing time in each of their lives. Their neighbor \"Rolf\" played by Matthias Schweighöfer is holding down the fort and watching the baby dog switch or ru. The rest of the family will try and help each other out as best as they can. At least until they can figure out how to switch back. In this family-friendly holiday film.\"Family Switch\" was a good film. I like films like these. It taps into my cheesy side a bit but I like the ones that are done right. Plus I loved this cast.Rita Moreno needs no explanation. Jennifer Garner knows all about these types of films. They even allude to her previous film \"13 Going on 30\". Ed Helms is always hilarious in these types of comedies. Then you had Emma Myers who played \"Enid\" in the Netflix \"Wednesday\" series. Can't forget about Brady Noon who was in \"The Good Boys\". Even the cameos/ actors with smaller parts were cast right.It was a holiday family film but it didn't feel like it. It didn't strictly focus on Christmas. It wasn't that cheesy holiday film but still hit the quota on those types of film criteria.Now if more holiday films were like this I'm cool with it. I can be a bit of a Scrooge during the holiday season. It had the feeling of those 90's family films you watched while you were a kid but funnier and more enjoyable. It still has its moments of course but overall I liked it. You can watch this with the family or alone. I give it four mor fires 🔥🔥🔥🔥.#CosmoandtheMovieWithin\n#CosmoMovieBlog\n#CosmoLanier\n#FamilySwitch.",
    "86": "You know what ? The real sad thing in this day and age is that people expect 'realism' and 'drama' in films and sadly they've forgotten the escapism, entertainment and just a good time out watching the screen.I couldn't believe the low ratings for this movie ! ... I thoroughly enjoyed this ! ...Why ? Because it was FUN !! Whatever you do, DON'T expect a 'deep and meaningful' message, even though that comes across, but it's wrapped up in a very clever role play reversal of mum, dad and the kids chaotic attempt at finding themselves in each others bodies ( a bit of a new take on Tom Hanks 'Big' movie ) The acting of the different role-plays between mother, father, son and daughter was really well done and unlike a lot of comedy I see these days, I had a lot of GOOD laughs ! ( especially the role reversal between the French bulldog and the baby ! ) The concept of too many Christmas movies these days is so cheesy and syrupy but this (?) was just good old fashioned fun and a great fantasy ride and should leave you at the closing credits with at least a smile .... sure is a welcome change from some of the heavy stuff that films are these days.",
    "87": "I am not quite sure how to put my finger on what I just watched. Family Switch is one of Netflix's latest holiday films, but was it even really a holiday film? I am a fan of films like Freaky Friday and I even enjoyed The Switch, but the marketing for this film made it seem like a Christmas film, meshed with Freaky Friday. The film itself attempts to do just that but ultimately is just a Freaky Friday rip-off that just happens to take place at Christmas. The Christmas aspects of this film honestly just feel shoe-horned in to make the audience smile. I may sound harsh, but that was my entire experience watching this movie.The Walker family is trying to live their normal lives when an astrological phenomenon causes them to switch bodies with each other. The father and son switch, the mother and daughter switch, and their dog and baby switch (which were easily the most amusing scenes of the movie). The mother (Jennifer Garner) now has to attend school in her daughter's body and attempt to advance her Soccer career, while the father (Ed Helms) also attends school in his son's body, as he is trying to get accepted to Yale. The two young performers in Emma Myers and Brady Noon do a great job acting like Helms and Garner, but the reason to watch this film is to just watch the latter and have some fun. These two actors place themselves in the shoes of teenagers and I'll admit, they belonged in a much better overall movie.Where I think this film fails is in being a family movie. Yes, it is a very nice film for adults to sit down and watch with young kids, but there wasn't anything for adults here, even when it tried to. I found myself frustrated because it was trying to aim itself at both audiences, but in reality, it was just aimed at children. There is absolutely nothing wrong with that in the slightest, but the fact that it was very clearly trying to do both just annoyed me. A film like Freaky Friday would show the childish nature of the teenager in the adult body, but also get mature when the film requires it. This was just playful fun all the way through, even though there were real-life stakes at hand. I just didn't buy any of it.Don't get me wrong, I can see many families having a good time watching this movie, but I just don't look at it as a good movie as a whole. Also, as I said previously, the dog and baby steal the show here. I chuckled every time they had screen time because it was so corny and fun. Again, there are aspects of this movie that work, they just deserved a better story and dialogue to go along with it. Family Switch was also directed by McG, who over the years, seems to have fallen into the category of directing silly comedies. I enjoyed his older films in We Are Marshall, The Babysitter, The Duff, and Charlie's Angels, but I just don't see that same filmmaker anymore. I laughed on occasion, but the majority of this film didn't work for me. It's a hard one to recommend for me, but again, some families will probably have a good time.",
    "88": "Tl;dr Don't watch it except maybe as babysitting for your 6 yr olds (and even then there's so many better movies they could watch).I tried, I really tried, but this movie is so dumb and unfunny I couldn't make it through. Had to bow out about an hour in.In case anyone doesn't know what the movie is about: It's Freaky Friday: Family Edition. Instead of just the mom and daughter switching bodies, the son and father switch as well, how original!The plot is thus derivative.The characters are ridiculous, the son is apparently a genius who regularly gives advice to Elon Musk. The daughter is a soccer prodigy. Because a story like this couldn't possibly work with normal teenage kids...The humor is Kindergarten level: either the adults getting stuck in or on objects, or a dog peeing where it shouldn't pee, or \"I was born in 2008, I don't know what Star Wars is\", I'm guessing this movie takes place in the Netflix Cinmatic Universe where only Netflix exicsts as a streaming service (and they don't have the rights to Star Wars).The movie is just really really dumb, the body switch is triggered by some planetary alignment and when the characters look through a large telescope the planets are literally lined up right next to each other, cause the AI who wrote this was clearly instructed to write at a 6 yr olds level.The movie constantly has moments like this.Also Rita Moreno's character is the actual worst.In the end I gave this movie 3 stars, because I do really like Jennifer Garner and there was one joke that made me laugh.",
    "89": "The premise is fairly familiar - parents switch bodies with their children, and the structure is exactly what you would expect it to be, but what separates it from the films it references such as Big, 17 Again, Freaky Friday, and 13 Going on 30 (also starring Jennifer Garner) is that they gave room to let its characters breathe and apply a degree of verisimilitude to buy into the concept and the conflict. Right from the start, it appears that the people who worked on this had the mindset of either to go big or to go home, as a lot of it is fairly over-the-top, and comes across desperate to get a laugh from the viewer. The humor has its moments of attempted cleverness, but there is a lot of lowbrow comedy that diminishes the efforts to be smart. What doesn't work in the favor of the picture, is that the premise is presented three times in the story, and because the pace of it is very fast, and they're constantly trying to go for big laughs, there is not a clear enough focus and not enough time to invest in the relationships and conflict. I have not read the story this is based off of, so I cannot judge it as an adaptation, as a motion picture though I would have to describe this as being average at best, I probably would have rated it lower had it been released in theatres and I had to pay more than I do for Netflix monthly to watch it.",
    "90": "Ed helms and Jennifer garner prove there is nothing they won't do for a paycheck in family switch.Family switch seeks to answer the question no one asked. What if Freaky Friday was a whole family switching. The result is essentially a youtube cringe compilation. Mom and dad witch with teenage son and daughter. Baby and dog switch. The result? Age jokes that fall flat. Dumb jokes about fashion, lactose intolerance, pop culture references and terrible party movie cliches.Making matters worse. The movie presents a really odd series of stereotypes. As usual the family is wealthy with multiple cars and a classic sports car to destroy filming. They live in what is essentially a mansion. Yet both parents have pretty low end jobs they can just run away from and it's fine? I guess if your life depends on bill payments you can't afford to body switch?The movie is cliche and cringe. Kids want to grow up....but oh it's all too fast. Mom and dad are in a rut. But oh, dating in our teenage children's bodies made us feel young and in love( wtf?). 80s like house party scenes including people engaged in complete choreography shows no one on this cast ever went to a house party. Bad cgi baby and dog remind us those characters should have been cut. The end actually fixed nothing but hey. Group hug.This could have been fun. Simple jokes, physical gags, no cgi. Nice lesson about respect, understanding and sacrifice. Farts, fall down. Crazy work presentations that somehow works. Poop joke. Group hug. Merry Christmas.Is it family Friendly? Yes...as long as you don't as questions. Is it worth watching? No. Is it fun? If you like cringe....still no.If you're about to watch family switch, switch to a diffrent streaming service and watch something else.",
    "91": "The cringe just keeps on going. Jokes that have been stale since 2016, terrible stereotypes, and a defiance of scriptwriting rules such as \"show, don't tell.\"Jokes are forced, even if they don't make sense, or follow the character's original stereotype. A complete probability that the actors didn't even try the scenes as their original character before filming it as the switched character. That's how off the mark each actor plays their counterpart.The plot is a whatever shaped peg, hammered into a square hole. Like they watched all the other switch movies, wrote down all the beats and copied them verbatim.Like a parody of switch movies, but takes itself as serious as a heart attack. Unironically.I'm less than 40 minutes into this movie, and am writing this in the hopes to save someone a wasted hour and a half. So far, the movie hasn't improved.",
    "92": "This was a fun movie, even though the concept has been done before. (In fact the movie comes to almost a stop at one point as the cast rattles off easter egg titles of movies in which it's been done before, including one by cast member Jennifer Garner herself.)This tongue in cheek approach to the romp actually serves to burst any bubble of self consciousness.---So why watch it if it's been \"done\"?Because of the fresh and funny cast taking on the task, slick editing, and a great sound track.It's a beautifully put together little film with a lot of heart that resonates well with the holidays.Would recommend.",
    "93": "\"Family Switch\" sounds like a temporary title; you'd walk into a meeting room and pitch \"family switch\" and assure the producers you'd come up with something better. But no, the laziness of this film is so astounding, that upon realizing no one had this title before, the filmmakers (and Netflix) decided to just go with it and not really question why.I can't pretend like Family Switch is all that terrible; it crosses into \"so bad it's good territory\", particularly towards the end. The entire \"high school partying\" scene is truly glorious in how bizarre it is. The human interactions feel mechanical and strange, as if the writers had never been around humans before or been to a party. It was this moment when I began to suspect that this movie was in fact, not written by humans, but by an AI. (I'm only half joking)Because everything else feels like an amalgamation of everything you've seen before in every family comedy ever made. What, you're telling me this zany body switch just-so-happens to occur at the time when EVERYONE has this big thing they need to do, with major implications for their future? NO WAY. And, it just so happens that everything just kinda sorta works out in the end? Color me surprised.To be fair, I was actually pleasantly surprised by the performances. Jennifer Garner is pretty good here, probably because she's played this sort of role before. Emma Myers is also quite good as well, and surprisingly, the best out of the bunch. There are also some genuinely funny moments with the two of them, if they aren't a bit juvenile (I don't consider myself too refined for a well time fart joke).But Ed Helms and Brady Noon...what on Earth was going on with these too? I get Helms' character Bill (truly memorable name, I know) is simultaneously the lamest Dad you could imagine, but also impossibly charming and suave? I guess the idea is that in a teenager's body, he could be \"cool\" again, but it's never really communicated properly.Oh, and just to further my AI theory, this film is set at Christmas and is marketed as a \"Christmas movie,\" but I can't consider it one in good conscious. It's a film \"set at Christmas\", but aside from a generic \"appreciate your family\" message, this film has barely anything to do with Christmas. Iron Man 3 is more of a Christmas movie than this one.Still, I do think if you have some time to kill, this movie can be funny to watch in an awkward, cringe inducing sort of way. I guess that's fine.",
    "94": "After the fart scene I tuned off the movie.Painful to watch...\nEspecially considering great cast.I felt embarrassed 😳After the fart scene I tuned off the movie.Painful to watch...\nEspecially considering great cast.I felt embarrassed 😳After the fart scene I tuned off the movie.Painful to watch...\nEspecially considering great cast.I felt embarrassed 😳After the fart scene I tuned off the movie.Painful to watch...\nEspecially considering great cast.I felt embarrassed 😳After the fart scene I tuned off the movie.Painful to watch...\nEspecially considering great cast.I felt embarrassed 😳",
    "95": "For some reason every 5 years or so, a respected writer wakes up with the idea that they could write an original SWITCH type of movie, while coaxing some respected actor/actress to put their reputation on the line. Why not, Jennifer Garner did a SWITCH in 13 Going on 30, although she was with herself, but none the less that movie was a hit.I was skeptical to start, but again it's Jennifer Garner, and Ed Helms, who will knock out a tooth for a laugh, and I'm a fan of his as well. It's the holidays, and with this combo I wanted so bad to like it, BUT.....it's awful!!!! The only thing that would have made it worse would have been if I actually made this a movie to center around taking the family out for dinner, and paying to see this flop!!!My advice, order in and put on 13 Going on 30. It's safe, no matter how many times you have watch it you know you will laugh. For a night cap watch a few episodes of the Office. One last thing, block this film from advertising in the future, you do not want to be fooled. ITS HORRIBLE!!!!!",
    "96": "I wanted to write this review on behalf of all the reviewers who rated 3-5 starts.People nowadays expect all movies to be masterpieces and get disappointed otherwise. Another reason they dislike movies like this, is because \"They didn't get the same magical feeling like when they were watching similar movies as kids.\" The thing is that those movies were simple like this one, and that is actually what made them special! One reason that those movies felt magical was because we were kids!Sometimes all we need is a simple magical movie about Christmas and this movie definitely achieves that.I hope I helped you.Have a merry Christmas.",
    "97": "The switching is not a new idea, ok, but the movie is funny, CHILDREN FRIENDLY and really enjoyable!Not many films today like this, that you can watch with your 8-year old and your 15-year old and you all laugh! In my humble opinion it is worth watching at home, all together, with pizza or popcorn or whatever you like and get some good family time!I miss the old movies before all the cgi and fast dialogs and action that are everywhere today. Classic awkward moments and messed situations! Movies like this are missing today!Don't get me wrong, I don't mean that it's an amazing extraordinary movie but again, which family movie is nowadays?To summarize, I don't know what all the critics in here are \"hating \". Is it worth paying 4 tickets for your family to watch it in cinema? No! But guess what? You don't need to, it's on Netflix! So since you've already paid ENJOY IT!!",
    "98": "Look closer and one might discover that Emma Myers took time out from her role of Enid of the new cult classic Wednesday television series (2022) to become another girl this time or 'er mother in this new family comedy that loosely reprises Jennifer Garner from her starring role from 13 Going On 30 (2004) again playing a mother or 'er a teenager. There is still some doubt that Jennifer continues to look as great as she does in this movie or maybe she does. Rita Moreno, 10 days shy of her 93rd birthday when this television movie was released. She also has a co-starring role here as well as one of the very few performers to win an Oscar, an Emmy, a Tony and a Grammy, thus becoming an EGOT. Even Howie Mandel from America's Got Talent was retained to play a role in this fun, family movie. This predictable family comedy hits some nice emotional highs later in the movie and adds to the ironic chaos ensuing when members of this family offer up \"a multitude\" of displaced body characters. However, this movie misses the highest of marks by not offering the audience more subtle distinctive differences in age behavior that at times seems to make these characters act relatively the same age as themselves. There are a few times that the wrong character is given more scene attention at the wrong time for the context of the movie especially with the parents in their younger bodies not taking more charge absently mindedly as they would more likely do. Mostly this movie keeps it together with a good number of funny scenes with a reasonable plotline that remains consistently entertaining with a decent tie-up of loose ends. An enjoyable romp, if not a classic movie experience.",
    "99": "I am not going to discuss the plot as there is not much to even mention about. But the way this holiday comedy was directed that made me write this review.I do not know how Netflix always excels at putting up good cast and miserably fails in utilizing that talent. This one does not do any justice to Garner or Emma. The meeting in which she had to pitch and idea to the company, the director could have made it more situational comedy. He had many references from The Office, Parks and Recreation, Silicon Valley, Suits, Mythic Quest, The IT Crowd and many more funny shows and yet he came up with Garner munching on ice cream because now she is a football playing teenager and then she farts and makes a mess at the meeting. That was as predictable and silly as anyone can go.The baby comedy slowly transcends from being cute to bizzare and not funny at times.It does not feel like a Christmas movie or a Holiday special or even a comedy. Little efforts from the creators and this could have been funnier and little intelligent.1 * for the efforts from entire Netflix team including the Director.",
    "100": "Is it going to win anything? No. Definitely Not.Is it completely harmless light hearted family Christmas viewing? Yes.The cast put in expected performances to create a film with a cheery plot, character arc and slightly overdone key themes which allow this movie through its digestible run time.There is no exciting cinematography happening, anyone clicking on this on Netflix this holiday season isn't expecting an iMAX spectacle, and anyone who is might need to adjust their selection process. Yet, the Dolby atmos mix sounds acceptable in larger scale home theatres and its HDR vision representation isn't sore on the eyes.Overall?It's exactly what I expected. I enjoyed it for what it was.",
    "101": "Honestly, my wife and I have watched so many bland modern-day Christmas movies already this year, usually of the TV movie variety, that we were almost relieved to fall upon this family-entertainment comedy for light relief.Sure the plot reuses the old \"Freaky Friday\" body-swap routine, but this times extends the old switcheroo routine beyond mother and teenage daughter to include besides father and son and even baby and pet dog. This often means you have to concentrate a little bit harder on the dialogue to make complete sense of some of their utterances but do so and you'll be repaid by some humorous comic situations and amusing lines to boot.While a few of the jokes are of the old-fashioned scatalogical type, there are also some funny one-liners plus I liked the \"Back to the Future\" way they got around avoiding a brother and sister romantic kiss. Each member of the family coincidentally has an important set task in their lives to carry out, the father a live TV spot for his old-timer rock band, the mother a pitch for a major contract in her day-job, the daughter a trial for the girls' national football team and the son an interview to get into Harvard college.How they unsurprisingly botch these opportunities in their new personas and yet still manage to turn these negatives into positives by the end, courtesy of a little bit of Christmas magic dust sprinkled their way by visiting fairy godmother Rita Moreno, should raise a few smiles.With a really good soundtrack of many recognisable seasonal classics and nice performances by Jennifer Garner and Ed Helms as the frazzled parents, this fun feature will certainly keep you amused while the turkey's\na-roasting.",
    "102": "You have Jennifer Garner reprising her '13 Going on 30' type of role, Ed Helms playing himself, Emma Myers, who was in the new Wednesday TV show, Brandy Noon, the new up-and-comer recently starring in the new 'Teenage Mutant Turtles' movie and 'Good Boys', and also voicing characters in the newly animated 'Diary of a Wimpy Kid' movies. This movie is really cute and fun. Yeah, it's just another 'switch bodies' movie. The parents become the kids, and the kids become the parents; that's the twist in this one. Even the baby becomes the family dog and vice versa, which is pretty funny at times. They have a fortune teller causing all this, trying to meddle in people's lives until they learn to walk a mile in each other's shoes type of scenario so they can fix family issues amongst themselves, but I'm just a sucker for these types of movies; they're always fun to see. The whole Christmas theme doesn't add too much except for the fact that it's Christmas and it's the season of giving. Other than that, the Christmas overlay doesn't do much. And my biggest gripe about this movie is the title. 'Family Switch'? Come up with something a little bit better than that. Other than that, Jennifer Garner and Helms being themselves, and the new up-and-comer kids, are what really set this movie apart. The kids really do a good job playing people you've never seen before. And Emma Myers is really the standout performance among the group. She brings a lot of spontaneity to her performance. So if you want to see a cute, family-friendly Christmas overlay of 'Freaky Friday', it's fun for the whole family, just don't expect it to be something you haven't already seen before.",
    "103": "I laughed. I cried. Just the kind of movie you want to enjoy with your family over the holiday.Subtly pays homage to all of this genre's predecessors, while adding a new dimension through its intelligent story and wit. The acting was fabulous all around. Great editing. And very funny outtakes at the end - so keep watching those credits.Jennifer Garner has such depth as an actor. She is powerful in her action roles and heartwarming in the family comedies she has starred in. She was a big reason I gravitated to this film in a very crowded offering of Christmas movies this year.Ed Helms delivers a hilariously solid performance, and the kids were played by exceptionally strong actors. I'll likely watch this film again and again because it delivers exactly what you want a holiday film should - laughs, tears, and a thoughtful relatable story.",
    "104": "Not sure what the writer/director was thinking with some of the choices here (hint: the most awkward involved special FX and the baby). I love Jennifer Garner and 13 Going On 30 is pure magic and a classic, but why oh why did the casting gods get her to revisit something she's already done before and so well? I'm sure it was fun to film this but it's not so much fun to watch. It's.....awkward and awkward things happen.. At times I was even having trouble keeping the characters straight. This movie COULD have been so much better because the actors are all actually very talented, the kids are GREAT(!!), but the script/plot is not. I had trouble finishing the movie but came back to it hours later out of desperation for something to watch...and was left thinking it was just a bit of a mess. It certainly didn't have to be! I'm sorry J. G. decided to repeat something she's already done. She was 'good' in this but we've seen her do it before with MUCH better material and direction - therefore WHY OH WHY? I would not have done it! Only my opinion though. If you're in the mood to try watching it I'd say go for it and see what you think (especially those fantastic baby special FX) or, as another reviewer said \"Just go straight to 13 Going on 30 and skip this one\".",
    "105": "I love Ed Helms, and he certainly has his moments in this movie. The family dynamics is okay, the girl from Wednesday is great and the baby/dog situation is hilarious.That having said, the formula is very predictable. So basically the only way to understand your kids/parents is to become them, according to Hollywood. And miss Gardner knows best, since this is her second time.What also bothers me, and not for the first time, is the lack of realism. And I know, it's a movie. But still.Living in an amazingly large house, with a huge Christmas tree and at least 2 cars is probably average in the USA. Having a baby with 0 impact on your life (as a dad of 2 babies, I find it very hard to believe that a baby conveniently stays with a neighbor, like all the time, so you can sleep an entire night, go to work, go out etc. I would love to see the recipe of that life) seems very unlikely to me.And of course, EVERYTHING turns out to be okay at the end of this movie (hello Hollywood). Because we don't want to give the impression that's it's okay to not get selected, or get a promotion.After a week of clear blue skies and sunny LA days, it suddenly snows (wait, what?) because hey, it's convenient for the mood of the movie.And, as always, the perfect family ends with similar pyjama's.So yeah, too full of cliches and conveniences for my part. But also funny at times. See for yourselfToo short? Oh my it has to be longer. So please go see Oppenheimer.",
    "106": "It's a movie.It's entertaining.We all laughed. Great family fun!We decided to watch it a few days before Christmas and normally we have to find something appropriate for all ages. 5+. But if we find something for the younger ones to watch the older teenagers are bored and fall asleep.This movie we all laughed. And as a mom I even got teary-eyed at one point.If you're watching this to watch an Oscar nominated film then this isn't it. But if you are watching to enjoy yourself and have a few laughs.Bumping this one into a top 10 Christmas Movie for the entire family.Will recommend to others.",
    "107": "Aiming to up the ante in the body-swap genre, Family Switch has an entire household trade souls, with some exceptionally strained comedic results, occasionally saved by the talented cast's charm, and some fun cgi with the most junior members of the family.Unlike sharper entries from the past--the Jamie Lee Curtis and Lindsey Lohan remake of Freaky Friday sets a high bar--this attempt suffers from a common ailment of contemporary broad comedy: the writing is lazy and rushed, leaning on worn cliches and off-key shoehornings of modern youth idioms.A challenging college application interview in the movie aims to present its awkwardness as funny, but mostly comes across as just awkward. Even broad comedy needs the structure of wit to land.The cringe cherry atop this embarrassing cinematic cake is what may be the most shudder-inducing kiss ever filmed, violating two social taboos at the same time. Kudos to the actors in this scene for their dedication to their craft.Family Switch's disappointing story-telling is unfortunate, given the mostly capable cast, which includes the always game Jennifer Garner, and one of the best new talents of the decade, Emma Myers. Good actors deserve good writing. Since a future Hollywood attempt at yet another body-swap tale is inevitable, perhaps the makers of the next one will consider trading a mediocre script for one that's sharp, smart, and gives their actors much more to work with.",
    "108": "The family, after switching, reference several other movies with the same concept (body swapping) and still not one of the characters in this movie seem to even try to do anything logical or reasonable to get through the day together. They just stumble around being weird and saying and doing things that no person with half a functioning brain would do in the same situation.The cast are all good actors but the writing is just too terrible.Slapstick that isn't funny, jokes that don't land and the pacing is all over the place.(And apparently the mom is a superhuman who can fall down a flight of stairs with not even a single bruise? *sigh*).But the worst part, the sickening part of the whole movie, is a completely unnecessary scene with incest.There was no point and no reason for that scene.I'm sure it was written with the intention of pulling some grossed out laughs but if you stop and think about what is actually happening on screen you'll probably want to hurl as much as I did.They could've just walked away.Just. Walk. Away!Pure garbage.How they can market this as a fun, family friendly film, is beyond me.The ending was also bad. Almost everything with this movie is bad.Go watch something else, anything else, I beg you.",
    "109": "Apparently reviews can no longer be trusted on this platform!?Watched the movie, was really hard to get to the end. Told the kids to trust me that it will be good because of the actors involved?Boy was I wrong! Don't think my kids will ever trust me to pick Sunday night movies ever again?Body swap movies are historically fun to watch if you are my age when Big was the must see movie? But unfortunately nothing seems to have surpassed Tom Hanks in his breakout performance.Don't like to think that Jennifer has reached the final stage of her Hollywood career, but she's so much better than this pile of poo!Anyway six hundred characters is hard to reach on a review so peace out people.",
    "110": "In a cinematic landscape crowded with \"switch\" movies, this one follows the familiar formula of predictability, cheesiness, and cringe-worthy moments that I've grown weary of. As an adult viewer, the experience felt overly simplistic and lacked the depth I seek in a film. However, I can't ignore its potential charm for a younger audience.For children aged 6-12, this movie may prove to be a delightful, family-friendly experience. Despite its predictable plot twists, the film manages to impart valuable lessons on sincerity, strength, bravery, and the significance of family. The wholesome nature of the narrative aligns with the tastes of a younger audience, offering parents a safe and enjoyable option for movie night.One redeeming factor was the cast, which initially drew me in. The actors' performances were commendable, even if the material they worked with didn't showcase their full potential. This serves as a reminder that star-studded casts don't always guarantee a groundbreaking cinematic experience.In conclusion, my personal dissatisfaction with the movie stems from my adult perspective seeking more nuanced storytelling. Despite this, I acknowledge its merits in serving as an entertaining and wholesome option for families with children. This experience has taught me the importance of understanding a film's target audience before forming expectations based on the cast alone."
}