{
    "0": "I saw Freelance, starring John Cena-Barbie, The Marine; Alison Brie-GLOW_tv, Madmen_tv; Christian Slater-Mr. Robot_tv, Broken Arrow and Juan Pablo Raba-Peppermint, Narcos_tv.This is an action/comedy movie that leans more to the action side and is a little lighter in the comedy area. John plays an ex Special Forces soldier that has retired after his last mission where he got injured-his back got hurt. John is now married and has a daughter and a boring job when Christian-an old military buddy-comes calling and has a job for him. Alison plays a jounalist that is going into a war torn country to interview a dictator, Juan, and Christian wants John to provide security for her, saying it will be an easy gig. Of course, it's not, as a military coup erupts during Alison's interview and John has to act fast to try and save her and Juan. There are a few twists and turns before the conclusion and there are a few bloopers shown as the end credits start but nothing at the very end.It's rated R for violence, language and some partial nudity and has a running time of 1 hour & 48 minutes.It's not the greatest at balancing the action and comedy but I enjoyed it enough that I would buy it on DVD.",
    "1": "In silly action comedy \"Freelance\" ex-Special forces John Cena's bored with civilian life (married to Alice Eve) til his ex-boss Christian Slater (now running a private security firm) hires him to bodyguard journalist Alison Brie (always likeable) as she goes to interview flashy dictator Juan Pablo Raba (good) in his South American republic... where mercenary Marton Csokas leads a coup attempt, and twisty chaos, bloodshed & double-dealing ensues. It's poorly directed (especially the fight scenes) by the experienced Pierre Morel, but written engagingly enough by the debuting Jacob Lentz. It's light & forgettable, but passable enough entertainment for undemanding viewers.",
    "2": "This film reminded me of Dwayne's movie The Rundown with an overall picturesque theme of a Far Cry game. Compared to Dwayne's movie, this seemed like a lighter version of it with repulsive characters. Alison's character was that of a teenage girl with an entitled princess attitude, and John's was like a genetically blessed pre-teen who when asked to do something does it like an enthusiastic teen (hey buddy, wash the car please like thing), but nothing else goes behind those two eyes. Venegas character's flair reminded me of Aladeen from The Dictator film. I think the audience for the film was teenagers, and adults who hate teenagers that act like there is no real world consequences and are able to get away from the consequences. Is this worth of your money ? Spend it, if you really want to just laugh with a group of people even if the jokes are cliched, and see some 30 second ammo bursting sequences that could be seen while lazily swiping through movie clip reels.",
    "3": "This film is about Mason Pettis (John Cena). The beginning aspect of his life is shown from a first person view with narration. Mason is an attorney who went into special ops. He got shot down over Paldonia (a fictional South American African nation) and got injured and discharged. Bored with his life he takes a gig from a former special ops person. He must guard Journalist Claire Wellington (Alison Brie). Claire has had a fall from grace and has a chance for a comeback with an exclusive interview of President Venegas (Juan Pablo Raba) of Paldonia, the same person Mason was suppose to assassinate when his helicopter got shot down and two comrades died. He has mixed feelings. Things do not go well and Mason is in constant action with guys shooting at him unable to hit their target.The plot twists into a Corporate conspiracy film reminiscent of United Fruit Company. Trite Hollywood writing.Guide: F-word. No sex. Near nudity.",
    "4": "This is a movie that will keep you checking the time to see how much longer you have to endure, that is if you don't turn it off before the end. We have seen this a thousand times before, only with better acting and plot. Brie looks completely out of place in this style of movie, and Cena is just robotic.The movie does not seem to know what it is supposed to be, generic, confusing, unfunny mess, poorly casted. The movie's politics are so tangled that, by the end, you still don't know whether Venegas is a lying dictator or a benevolent leader. I'm not quite sure why this was ever made. Maybe it was just to keep 2 B class actor/actress busy.If you must watch because you are a Brie or Cena fan (you are going to be disappointed), wait till you get a copy on one of those free streaming sites, donate your money to a charity instead.",
    "5": "Billed as an action comedy this movie is light on action and void of comedy. This plot has been done before and it's The Lost City did it better - and that movie was bloody dreadful.Rough and tumble guy protects privileged women in the jungle Yadda Yadda - no one ever lives up to the original 'Romancing rhe Stone'\nJohn cena is hood although they don't give him anything story wise or script wise to really work with. Alison Brie is brutally under-utilised.... If they had let both actors go for it I reckon this could have been good but it was a snore fest. Not action, nor comedy... nor romance.... Just nothing sorry.",
    "6": "\"Taken\" director Pierre Morel's venture into South American political mischief with \"Freelance\" qualifies as above average despite some serious problems. First, former wrestler John Cena and co-star Alison Brie drum up neither much charisma nor chemistry. They are at odds throughout this 108-minute, R-rated chase thriller through the jungle with South African mercenaries on their heels while they try to protect a South American president from a takeover of his country by outside interests. \"A Hijacking\" scenarist Jacob Lentz serves up the makings of an exciting action-adventure opus. Sadly, the overall outcome is less than satisfactory despite Morel's first-class handling of the vigorous action set-pieces. Cena is cast as a second-rate lawyer who abandoned his true calling as a U. S. Army soldier after a helicopter crash in the same country he finds himself back in again left him disabled with a bad back and the memory of his buddies who died when their assault chopper was blown out of the sky. Happily married to Jenny (Alice Eve of \"Men in Black 3\"), our rugged protagonist Mason Pettits (John Cena of \"The Suicide Squad\") now has a family, specifically a mischievous little girl, Casey Pettits (Molly McCann), who complains about a little boy at her elementary school who pesters her for a kiss. Mason tells she punch him in his Adam's apple the next time he gets fresh with her. Predictably, not only does Casey punch the obnoxious boy in the neck, but Mason's advice also brings the wrath of his wife down on him for encouraging their daughter to perpetrate such un-lady like behavior. This incident prompts Jenny to ask Mason for a trial separation.Out of the blue, one of Mason's former Army buddies, Sebastian Earle (Christian Slater of \"True Romance\"), who has left the military and bankrolled a mercenary outfit replete with choppers, weapons, etc., but he finds himself short-handed when he agrees to provide a celebrity journalist, Claire Wellington (Alison Brie of \"Promising Young Woman\"), with a bodyguard for her trip to an unstable South American country to interview the president of an imaginary country Paldonia, run by a charismatic leader, Juan Venegas (Juan Pablo Raba of \"The 33\"), who Mason believes is the man who ordered the destruction of his chopper that killed all his buddies and messed up his back. Clearly, there is no shortage of plot or action in this handsomely produced thriller. Mason and Claire are at odds from the moment that they meet, and he resists her romantic advances because he is still in love with Jenny.No sooner have Claire and Mason landed in Paldonia and met President Venegas than a villainous South African mercenary, Colonel Jan Koehorst (Marton Csokas of \"The Equalizer\") and his soldiers try to kill not only Venegas but also Claire and Mason. The initial ambush occurs on a bridge in the jungle, and our heroes barely escape with their lives. Afterward, they plunge into the jungle, with Venegas as a guide and struggle to elude Koehorst and his pugnacious army of assault rifle toting fiends. Eventually, they arrive at a village where Venegas' friends provide aid and comfort. Ironically, Venegas calls on the opposition party later to help him, while his ministers and relatives in the government betray him with extreme prejudice. All along Mason has nursed grudge against Venegas because he believed the arrogant president responsible for downing his chopper and forcing him out of his chosen profession as a soldier. Much to Mason's surprise, he learns his latest nemesis Koehorst was behind the attack! Meantime, not only does Claire get her interview with Venegas, but she also live streams Koehorst's efforts to overthrow Venegas. In one instance, Mason knocks a chopper out of the sky with an impossible shot as it descends to obliterate both Claire and him. Eventually, Venegas and our heroes make it back to the capital where the Paldonian rebels join the fray and help Venegas and Mason defeat Koehorst. Naturally, everything swings back the other way, and the underdog Paldonians triumph over Koehorst and company. Sebastian Earle cuts his ties with Koehorst. Interestingly enough, Earle had exploited Mason's vengeful sentiments about the Paldonian president to persuade him to take the bodyguard job so he could assassinate Venegas. At the last minute, like the cavalry in a western, Earle and his soldiers intervene and eradicate Keohorst's army. Everything ends happily ever after Mason, and Claire gets her news scoop!\"Freelance\" is being marketed as an action comedy, but the comedy consists largely of the tribulations Mason experiences owing to his old combat wounds. Specifically, Mason's back injuries forced him out of the military. Several times Mason staggers about deliriously because he tumbles down stairs. Morel opens the picture with a fascinating montage of Mason's life that sums up his philosophy. Most of the action scenes are staged with vigor, but the contrivances undermine \"Freelance.\" As for its lackluster title, \"Freelance\" lacks bravado. Mind you, Morel's previous outing \"Ambush\" is far more exciting, but \"Freelance\" isn't a complete waste of time. The acting is robust enough, with a gregarious Juan Pablo Raba stealing every scene as the colorful President Venegas.",
    "7": "If you are in love with Alison Brie or John Cena and have a little less than a couple of hours to spare, is worth watching, otherwise is a very simplistic \"by the book\" script written by Jacob Lentz with a couple of unrealistic scenes and a vague narrative about who is really in charge of ruling the world. Freelance is the writing debut of television screenwriter Jacob Lentz and it shows. Alison Brie is a good actress but unfortunately it doesn't show in this movie, John Cena is very stiff and not funny at all, Juan Pablo Raba might be the only funny character in this movie. There's also a brief participation of Christian Slater.",
    "8": "Freelance is a funny, comedy action movie. Its fast paced and funny and was a great movie to wile away a cold winter evening. It's not going to win any awards, but I didn't want an award winning movie, I wanted something fun to take my mind off things and Freelance delivered.It takes a cut at the US' foreign policy too and the games they play to get their hands on others resources, but isn't too preachy about it. Cena and Brie are great on screen together and Brie is absolutely stunning in some scenes.A decent popcorn movie with laughs and action. Would recommend it to pass the time if you don't want to think too much.",
    "9": "The comedy in this movie is to say the least, strange, the more \"groosome\" jokes really hit the right buttons for me, but for other people I don't think they will, as for the rest they felt a bit out of touch or really not hitting the point either because of context or the way they were told in the first placeSkipping over the obvious \"bad guys can't aim\"(they just couldn't see Cena duhh) the action had both good and bad moments, some were really realistic in the way all the characters were build some were plain absurd for no reasonNow to the good and brilliant parts of this movie, the plot and characters, minor spoilers here, I did feel like each one of the members of the main cast were hitting the mark they were designed for, mason was while predictable (and honestly that was part of his design) a geniuene person his choices were ultimately obvious, but he's also a man of justice, he did what he felt was right not by overthinking or planning but by making the choices he new were right, in the way he knew was the right way (not going through the whole family plot, I think it should have had a bit more development, but since it wasn't the focus of the movie it also shouldn't)\nClaire was the weakest of the three in my opinion but I didn't pay much attention to her\nVenegas was the best, tbh, he was a good leader that while you can argue was a bit stupid really undelined the subliminal themes of the movie, power, it showed that not even a person in power can change the world we live in, ultimatley, everything is a game of opinions and of people who thrive for more, being smart won't get you out of trouble, but knowing that people together can change anything, not only that but also, you are just the protagonist in your own story, and that things happen way defirently that we actually belive they doThis made a nice paralel to Mason's own arc where a family couldn't change him but rather the very thing he craved for, a final stone lifted of his shoulders that let him to see the light of day and wonder under it.",
    "10": "The more I see John Cena, the less I want to see of him in anything. This guy is really smart in his career, but a horrible actor. Because he learned to act in wrestling where everything's purposely looking fake. And it translates onto the screen, and I feel genuinely bad for the rest of the cast in any movie he's in. Because in a good deal of them, they're actually really good actors, and he's just dragging them down.Like take this movie for example, it was funny, it had a good plot. I think all the actors besides him did a fantastic job. And yet, because it was centered around him, it was just bad. They have this exact same issue with a lot of transitioning wrestlers into movie stars. They don't know how to act on screen, and it ruins the whole movie.4/10, 4 for everyone else and the script. -6 for John Cena... again.",
    "11": "Written, produced, directed and possibly even acted by ChatGPT.An absolute travesty of a movie, where clearly no one cared about the end result in the slightest. The movie looks ugly and fake, the action might win a prize for how bland it is and if the writing/script wasn't done bei ChatGPT, I'd consider a career change.There is nothing good and not a single redeeming thing about this movie. The actual performances are also lackluster. If you don't already know her from her great role and performance in Community, you would never guess that Alison Brie is a professional actress, that does this stuff for a living.",
    "12": "The movie is so predictable and slightly entertaining, but Cena's mechanical acting is not very believable. The recurring underlying back injury he's supposedly \"hampered by\" doesn't have any consistency as he's agily running through the jungle, carrying a .50cal, jumping and leaping, wrestling paramilitary in the guard position didn't seem affected at all by said injury. It's not Cena's fault as the storyline is thin and the scenarios aren't realistic. The bumbling president of the movie that's the center of the coup is almost slapstick in his timing and delivery. The one redeeming quality is that the scenery and location footage is enjoyable.",
    "13": "Funny, action, witty, some sentimental parts. It kept my attention even though it was somewhat predictable. It's a good fun movie that doesn't take itself too seriously. Definitely fit the bill of you don't wanna see some crazy disturbing Halloween movie. Could use some more promo. I'm figuring most studios are angling for streaming for revenue now also. John Cena did a good job, and the Latin President was funny and witty. The female lead was great as well. Professional reviews have led me astray many times to the point I walked out of movies. This movie was entertaining enough for that thought to never cross my mind.",
    "14": "Of wrestler turned actor, man this was bad and I remember, the Hulksters Ultimate Weapn which lead to him being done with the mainstream film industry and hopefully this is the same for John Cena. If you want bad acting and bad action then you'll love this film! If you want good acting, good action, and good storylines then this isn't for you! I wonder why they try to shove John Cena down our throats all the time. Hopefully this will be the end of it. I think John knows it's the end also that's why he has made his way back to the WWE this last year cause he knows his time is short in the film industry.",
    "15": "Decent comedy outline and some really plausible performances but oh what a load of lazy writing. They even went to the trouble of getting a language coach for Marton Csokas and he does a fairly believable job of his \"South African\" accent (well, one that non-South Africans will believe, anyway).Major plot holes. Lots of major plot holes. And the tragedy is they aren't even material to the story and could have - for the most part - been covered with a few lines of dialogue or some slightly better writing. But no, they left them in to jar you out of your immersion and remind you it's just a damn movie.Clichéd characters aside, this could have been a lot more enjoyable. Instead it was just disappointing.",
    "16": "This a surprisingly well-written and well-directed John Cena comedy-action movies with all kinds of insights and roguishly clever surprises. Allison Brie showed me comedy chops I had no idea she had. Anyone who tells you that this is predictable and they knew all the twists and turnarounds ahead of time is lying. Marvelous use of Christian Slater as the head of a Blackwater-type of mercenary contractor. Even the ruthless South African mercenary villain has depth and charisma.Alice Eve adds more to her character than is written and chemistry between Cena and the daughter is perfect. Everywhere we journey we are surprised by who we meet and their refreshingly different perspectives in life. It's not the destination; it's the journey. Holding grudges is for losers. John Cena's character is the Boy Scout who doesn't really get any of what everyone else is doing or why. And we love him for his cluelessness. Enjoy the wild ride!",
    "17": "I really enjoyed Freelance; it's a circa '80s cheesy action flick, and I mean that in the best possible way. It reminded me of all the Van Damme, Arnold, and Stallone movies I used to watch growing up, delivering mindless action fun loaded with cheese and some humor-these movies were simple. Additionally, Cena, Brie, and Raba were a delight, especially Raba. They have decent enough chemistry and banter to forgive the movie's weaknesses. Critics were just too harsh; I honestly don't know what critics expected with this one. It's not a great movie by any means, but it delivers what it promised-mindless action fun.",
    "18": "John Cena is back with another action movie. And of course, he's following Dwayne Johnson's footsteps, which means the action must be followed by family comedy as well. Although it's not PG 13, but you still can watch it with your family. Just don't let your kids see this if they're still under 18. Cause there's nudity in it, even if it's not full frontal. The comedy is pretty funny and the action wasn't too shabby. The acting was also adequate, for most actors at least. I don't know why other people's comments were so harsh about this movie, but I believe that this movie doesn't deserve ratings below 6.",
    "19": "The John Cena character is almost believable, but thee Alison brie character just showcases idiocy; more female stereotype lunacy. Roger Ebert said it best:\n\"Freelance\" is barely a movie. Sure, it's got a budget ($40 million!), a semblance of a plot, and stars that you'll recognize, but none of it was developed beyond the bare minimum to get released on VOD and in a few theaters. It is a defiantly lazy work, a project that echoes better films when it's doing anything. The most impressive thing about Pierre Morel's film is how it takes two actors as generally likable as John Cena and Alison Brie and makes them such bland avatars for actual people that they fade into the dull background of action-comedy noise this \"movie\" tries to achieve.",
    "20": "Sucks the sweat off a dead man's balls, as one philosopher once said.There's very little to like about this movie. It's watchable, but given how daft it is, you'd want to actually enjoy it as a guilty pleasure. Except it isn't good enough for that.I'm no director, and I'm no writer, but this clearly feels as a waste of resources, and also a waste of time, because ultimately it isn't fun, it isn't thrilling, it isn't sexy, it isn't smart.Why does Cena run like a girl? There's no chemistry with Brie, why does she throw herself at him if that's not going to lead to a sex scene for us to watch?Overall, a rather sad mess. Like eating melted ice cream and soggy bread crumbs. You still eat it because you hate yourself, but you're not even enjoying it.",
    "21": "The first twenty minutes of the movie are in first person, and it leads to a lot of camera shaking. Next the characters are very flat, and and needed more development. All of the jokes seem to fall short, and it seemed like they were trying too hard to get jokes to hit. Finally all of the senes are predictable and unrealistic. One good thing is that the scenery is good, and it sometimes leads to a distraction from what is going on. All in all, it's a very boring movie and did not entertain me. While the price of $5 a ticket was good, it could not save this movie from the disaster that the plot had.",
    "22": "I liked it. It is the first movie i watch for John cena , i wouldn't expect more from him but I surprised from his good acting. Alison Brie is very pretty and emotional. The character of the Baldonia president is so funny. The story is good and accepted. It is good also to highlight the struggle of indirectly occupied countries for full freedom and independence and how much these countries are rich in resources but it is stolen by another companies or countries. The acting of all was good and it was a good thing to mix the comedy with action. The time of the movie was reasonable not too long..",
    "23": "The movie is actually better than I expected. I watched it for two reasons: Alison Brie. Sadly, I did not see enough of those reasons. But, John Cena, is quite good as is the guy that plays the president/dictator.As always Marton Csokas plays a great bad guy. As I say the movie is not bad. Don't expect much. It's kind of like The Runaway, with Dwayne Johnson. A lot of running around. A lot of shooting. But a great deal of blood. It's a fun watch. Unlike the most recent Sandra Bullock movie, which was horrible, but in the same vain. Overall it's a fun way to kill a couple of hours. Don't expect award winning writing. It's not going to win anything. Just enjoy it for what it is.",
    "24": "I'm a huge John Cena fan & enjoy most of his action movies which I actually enjoyed watching his latest one Freelance. His character was indeed both likeable & believable but some of his co-stars weren't as much. I liked how the movie started out with the narrative but somewhere along the way, it almost stalled out but luckily the action sequences kept it going. The movie had a worthy villain & at first, the plot seemed very familiar with other films of this nature meaning somebody real close may be betrying someone we like. However, that seem to change in a good way close to the finale. Overall this was a worthy action film withvbits of humor & compassion. I gave it 7 stars for the outcome.",
    "25": "This movie has an uneven tone with very likeable actors. They all do their jobs well. The action sequences are often and entertaining. This eschews the trope of putting characters together and that makes it interesting and refreshing. The main female character is neither arm candy or paired up unnecessarily. Overall an enjoyable way to pass time.This will never be a classic but the way it manages its main characters has stayed with me into the next day. I would call that a success.This is one to stream in a lazy day with good snacks. Cena continues to hone his craft and Raba is great. Brie is a great actress we don't see often enough.",
    "26": "Actually it was a nice movie I love it, funny and action in the same time I like the type of this movies so much, and Cena is just awesome man he know how to balance between the action moments and the funny moments I mean he make you laugh when he changes his faceial expressions, it makes you laugh and enjoy the movie more,Thank you Cena.Also I like the idea of the movie it was so cool and full of action and of course full of funny moments I mean it's even funny in the middle of the action moments and the end of the movie was the best for the movie I mean it was a realistic end for the movie, and yes i forgot to say \"welcome to Baldonia.",
    "27": "I love John Cena and I especially love John Cena in action movies but this one of course it was good but something was missing I think it was the whole flow..but it did have a lot of things common in real life like other countries getting the business of other countries acting like they know better than them....yeah that is true!! But still Allison Brie's character truly irritated me to no end I mean the brattyness just could not stop geez......the only person holding the movie together was John cena and it was truly sad because he truly tried but it was already bad. The action was lacking a bit and I cannot say it is the worst action movie.",
    "28": "Predictable. Seen it all before. Gratuitous violence. Played out themes. Yes, all true. BUT I loved it. I laughed which I rarely do at most films anymore. I stayed engaged throughout the entire film and paused it rather than just let it run when I went to pee or have a cig like I do with most garbage films. John Cena may not have much range as an actor (at least what we've seen so far but I'm guessing he has more) but what he does he does so well. I was unfamiliar with the other actors in this but am going to look up their stuff. This was fun to watch and I kinda hope there is a sequel. No, really. Was it Citizen Kane, no. Does it want to be Citizen Kane, no. I almost gave it a 9 which I have only given to maybe 3 films ever one being Shawshank but couldn't get there but still an great film.",
    "29": "Maybe I'm just in a merciful mood because I'm sitting at home with a nasty broken leg, but the film was reasonably entertaining. Yes, the plot is more of a series of scenes, and yes, the timing is often off and the choreography of the action scenes could use more polish, but it has everything a film in the \"goofy but funny\" category needs. The film is particularly driven by Juan Raba as an irritatingly likeable dictator who appears and disappears like a doped ground squirrel.What annoys me is how much potential is wasted. Much more could have been done with the idea and the interaction of the characters. But the film somehow doesn't know whether it wants to be cozy or snappy and what remains is an average action comedy among thousands.",
    "30": "LIKES:Fun Pace:\n-The movie does not take much time to build up to the mission at hand. It's a quick montage, a little showing of life similar to the Incredibles, and then right to the fun.-That momentum carries throughout the film, a comedic festival of shooting, dodging, and meandering that will be very entertaining.-Like a big YouTube skit, the movie just throws one section of jokes, rants, and actions to make you laugh, and to be honest, it's very fun.-The two hours quickly flew by and I found this movie just pure escapism, with limited struggles for getting caught up in some historical drama or political agenda talk that many movies thrive on today.The Story:\n-It's nothing amazing, but it's a wholesome story, and one that I think serves to anchor the ridiculous antics of Cena and company.-His character Mason is a solider, sort of, with a lot of issues I've helped people with, and that relevant factor and respect was great fuel for helping him grow in this crazy comedy.-The simplistic tale holds some self-discovery for me as an audience member, some important moral lessons that could be learned well right now, but never too preachy or getting lost from the main tale.-And some other characters do well to have their own tales have relevance, many crossing and further supporting the main story to help include all characters.-All of it had the comedic tone to it, with just some elements of sobering seriousness to help give a relief to the fun.The Acting:\n-Another cast of characters that are fun, but forgettable, Freelance's acting is in line with being a lot of fun for the feel of the film.-I start with Eve. She's not bad, she's just not that involved outside of one arc of the story. A great execution, with a good press on the pulse of real characters, she accomplishes much, but just needed a bigger part.Juan Pablo Raba was a great opposite to Cena. His character has a lot of qualities to him, and Raba somehow managed to hit every one in a fantastic element for my reviewer. He's funny, passionate, silly, suave, and charming, but yet corrupt, noble, brave, and a coward all in one. This wild card character is almost the star of the show for me and the acting and chemistry he has just really makes this character somehow annoying, but fun.-Brie is beautiful to start out with, and I just loved the looks, and costumes she owned in the movie. As for acting, her comedy roots shine hard, and stay hard, with a nice little twist that works for a better character than I expected in the first shots. Her chemistry is solid with both of her male travelers, and her outtakes are even better.-Cena is the star of the movie though, and he unleashes the full might of his comedy into one movie. The wrestler is silly, clumsy, and but cuddly, a man with who executes a trouble character well, and gives an actin punch.-It's like Fast and Furious X, stupid and simple, but now with more personality and surprisingly a more realistic scenario than the speed chase. Again, it's a lot of fun, it's silly stupidity, and I quite enjoyed it.The Comedy:\n-It's a stupid film, and nothing that is unique from what we have seen, but again it's enjoyable and simple waste of time.-Freelance is loaded with comedic components to whet your appetite, pleasing you with a lot of one-offs and situational humor that actually holds to my memory, probably due to how they built upon things with each joke iteration.-You want political humor that stays tasteful? Well this movie does it, feeling like a political cartoon without being too over complicated.-You want situational slapstick and physical comedy? It delivers! Cena, Raba, and Brie all get their fair share of hard knocks that had my buddy and me in stitches as they rolled about.-How about banter and insults? Yep, you've got that covered too! Puns galore fill the dialogue, alongside some incredibly diverse insults, pokes, and name-calling that have some witty placement.-I loved how well they jabbed at each other and how natural it went, even crossing into adult comedy, but never crossing too many lines or becoming fixated on it, until the bloopers. That was by far the best part for me in this film, and the highlight of the movie.Dislikes:Predictable:\n-This should be no surprise, but the movie was not designed to be unique or have the most thrilling story loaded with surprises, twists, and gut wrenching revelations.-The tale is weaker than I would have liked, a sort of afterthought that just seems built for finding the avenue to unleash jokes. And though it works, I would have liked a little more investment.-A little more suspense? Maybe adding a little more twist and uniqueness or some story to Brie's character to help? Something to make it more memorable, that started coming at the end of the film.-Even the allusions of the complex political game are sort of uncoordinated and wasteful, another element that would have worked to help add that spice.A More Memorable Villain:\n-There are a lot of \"villains\" in this movie, but there is one consistent one that I thought had more props from the opening start.-Sadly, this villain is stereotypical, with more threatening gaze and planning than actual bite that I wanted to see.-The end game gives him soothing of a presence and need for inclusion, but much of the film just overtakes him, and much of his involvement is lost to hasty integrations and one part of the plot that by that point was not needed.The Action:\n-Another thing that felt like an aside, the movie really struggles for action scenes that felt like they were awesome, cool, or even necessary for showing up.-Freelance's fights have some moments that are cool, but feel like failed comedic tools that did little to advance the movie or add suspense to the fun thriller.-Chase scenes are boring, shoot outs feel inconsistent and somewhat forced, and even the physical comedy is very staged and lacking the storytelling, comedy, or again excitement as it feels like an afterthought.-To be honest, it almost wasn't necessary, but the cute moments, some of the motivation, and dare I say some comedy lines saved this part from being a total flop.The Verdict:\nFreelance is a fun movie that has a lot of chops in the comedy department, despite how forgettable it may seem. The treasure comes in the comedy and just escape you have with this film, not bogged down by any heavy plots, over intense horror, or even ultra-violent comedy that seems to be the trend. Instead, it's a movie that balances some decent storytelling, with a lot of good chemistry in ribbing, puns, and variety to feel like three friends stuck in an awkward situation. A pace that is not too fast, nor too slow, it handles the simplistic story with ease, gives those moments to settle down and teach lessons, and reset before more madness happens. It is a bit silly, it's stupid for sure, and it needs some work in the memorable moments and action, but at the core, Freelance is just a fun movie night in to laugh and enjoy. I'd say to hit the theaters, but I think this one is going to be favored for the comfort of home in case it's too silly for you. My scores for all this are:Action/Comedy: 6.5\nMovie Overall: 6.0.",
    "31": "I am gonna echo a few of the reviewers before me. This movie is somewhat in between a comedy and an action movie, yet never fully goes into any of the 2 genres despite not holding on the blood. There is a few \"chuckles\" moment but there was never really big hillarious moments. There is a few cool action scenes but they are not that numerous considering the 1h50 runtime.That said the movie does have us guessing a bit in parts of the plot and never get too predictable, and John Cena charisma truly manage to keep us invested. Alison Brie is both gorgeous and charismatic as well as the sidekick. Juan Pablo Raba also has some pretty cool moments as the over the top dictator.Basically this is a movie i enjoyed watching but i don't see myself rewatching until a pretty long time. It did the job it was suppose to do wich is entertain me for roughly 2 hours.",
    "32": "I don't want to say I don't like it, but I have to say that I can't help but to feel how underused John Cena is ever sense his debut action movie the Marine.I guest I have to respect his attempts to be a serious actor, but seriously?This movie could have been the next Commando. Cena was screaming \"I'm Arnold Schwarzenegger as John Matrix!\" Once again, did not hate his performance but the potential of this movie overall could have been so much more but it truly does not feel like they were focus on that. It's all more of a parady of an action movie than anything else.Bonus points for little Alison Bree being all sexy in this flick. Also thought the guy (who i don't know) playing the dictator was great with what he does.I need to say it once again. Did not hate this movie but Cena is just too darn big not to give more 80s nostalgia when it comes to action movies.",
    "33": "Supposedly an action comedy, but it was both lacking in comedy and in action.The bad; I didnt laugh once, I smirked a few times (at the start) that was about it. Comedy is personal, maybe other folks might find it hilarious, but it left me cold.What's good though is that it doesnt aim to be a farce. It does inject enough reality into the story to make it believable (ish).What's lacking as well though is the action part. There is little to none action and when there is some it is kinda childish. Not riveting or excting in any way.This movie seems targetted at a teenage / family audience. So you wont get annoyed by it or offended, the worst that could happen (and did happen to me) is that you might get pretty bored by the bland story and the lack of humour.",
    "34": "Not bad but not much to write home about either. Felt somewhat original but still a bit forgettable. I wasn't a big fan of the POV camera shots at the beginning. Just from the voice narrating you knew it was John Cena. His character didn't quite embody the persona of a grown-up adult but that was intentional.Ohhh I should say I absolutely loved that they portrayed him as a stand up-guy with morals. Hate it when a guy can't just be a decent person and has to resort to cheating or something. You could see it coming, they literally built up that cheesy romcom tension leading to that one predictable moment.John Cena was good here, one of his better roles in my opinion, more natural acting. He has that \"dumb steroid\" walk, which suits certain roles but feels a bit out of place in a suit and tie, accentuates the \"dumb\" part lol. Also nice to see Christian Slater, I only knew him from \"Mr. Robot.\"It was funny at times. And I really loved the hand combat scenes. There is a lot of violence, the action adds an extra star to the rating for me. Doesn't lean too heavily into any specific genre. It's laidback, fun and funny, mildly adventurous action movie. It could have been more intense and complex for drama, or more absurd for comedy, or pushed the action for a spy thriller, or even hammered home the political side; but it stays fairly balanced.Doesn't take itself seriously. My initial thought leaving the theater was, \"this would make a great pastime movie.\" It's worth checking out if you aren't expecting to be awed. Respectfully I don't think anybody walks into a John Cena movie expecting to be blown away. I wasn't and the movie felt better than I expected so I enjoyed it. There are certainly better films out there, but there are also worse ones.",
    "35": "No pun intended - the movie has us guessing (mostly right I would assume for most viewers), where it will go next and who is doing what ... to whom. The beginning is quite interesting with the POV shots ... for those who are not fans of Cena - they might be the best shots I reckon, because they don't have to see him.Kidding aside (and you can still hear his voice, so not sure if that is a positive thing or not in the end), the movie is about the dynamic between him and Alison Brie ... who really has a hard time ... not just resisting temptations - many of them, but with her character and how far she should go to show the struggle she is in. This is not Shakespeare but it does try to give us a message.The comedy sometimes does not have the same vibe ... there is also a lot of violence ... so can we care about the political message at all? And does silly humor fit into this? Not always I'd say, but you be the judge ... uneven, yet I reckon fun, if you suspend your disbelief! Makes no sense (Cenas bad back being one of the things that is ... well kind of redundant) ... which can be a shame I reckon.",
    "36": "This movie is one step shy of being an action movie, one step shy of being a comedy, 2 steps past being an actually interesting political drama with a step or two behind the dash of a journalism thriller.Some interesting political commentary weaves through the story to mask the, at times, underwhelming action sequences and make up for the slapsticky humor that might seem a bit immature or flat.It was fun, and that's all you can ask for out of something like this. John Cena has some good comedic chops and Alison Brie can go from stone cold to likable and charismatic in a snap.Fun time at the movies if you ask me.",
    "37": "Freelance is a new action comedy directed by Pierre Morel, director of Peppermint and Taken.Former special forces agent Mason Pettits (John Cena) has left the military to start a family. As a result, he ended up with a boring desk job. Because he misses the action, he starts as a freelance security guard. For example, he has to protect journalist Claire Wellington (Alison Brie) when she goes to interview the infamous dictator Venegas (Juan Pablo Raba).During this interview, a coup takes place, forcing the three to unexpectedly flee and survive together in the jungle.Pierre Morel has not been able to produce a similar action film since Taken. At Taken he was fortunate to be able to work with stories written by action experts such as Luc Besson. With Freelance he unfortunately has to work with a script written by Jacob Lentz, for whom this is only his first film story. He has also written more for talk programs such as Jimmy Kimmel's.The comedy level remains more at the level of comedy from such talk shows. This keeps the comedy at a low level and a bit on the predictable or repetitive side. Unfortunately, there is little to laugh about in this film.Most of the action scenes are also more familiar and reminiscent of other action films such as The Lost City from last year. The film tries to come across as a better jungle action film like First Blood or Predator, but continues to lack this action quality.Due to the lesser action and comedy qualities, John Cena unfortunately gets few opportunities to make something special of this role. Unfortunately, the same applies to the rest of the cast members. Alison Brie and Juan Pablo Raba have been known more for TV series lately in their acting careers. With this film they try to break through again with acting in films, but unfortunately they do not succeed so successfully with films of this quality.",
    "38": "I like John and we all know he can play, but his skills weren't brought up at all. It was just bad. It looked like it was his first movie before he became famous and knew what to do, this is how bad it was!!Then the acting of other. From horrible to bad. Nobody in this movie acted well.Atrocious directing in every way.The script was from a B- movie and it is one of the problem! For every dialog, I was saying to myself, \"I wish he/she said this/that instead...\" The movie wasn't funny. I couldn't understand if I was watching a drama or action or comedy. There was drama, sad cliche one... then there were some attempts at humor,but no actual humor made for some reason. I haven't smiled once. There was some B- action, badly filmed and directed.The movie was just boringScript 2/10\nActing 3/10\nAction 5/10\nDirecting 3/10\nComedy: 1/10\nVisuals/set 4/10No wonder people are walking out and falling asleep. Boring movie.",
    "39": "Freelance is a decent action comedy held up by strong character performances particularly from Juan Pablo Raba. The film takes obvious inspiration from The Lost City, replacing artifacts and authors for hit jobs and journalists. The chemistry between the cast is there and the dialog feels natural. Some scenes feel shoehorned in which detracts from the overall story. However overall the twists feel mostly original and provide a compelling plot.Raba absolutely nails his role as a Castro-ish ruthless dictator who feigns ignorance. His deliveries are perfectly timed and at times he carries the entire weight of the story.John Cena and Alison Brie were great in their roles with palpable chemistry as well however their roles were somewhat hamstrung by clumsy writing.Overall this is a fun and exciting movie for adults. It's not a perfect production but it's a worthy film if not entirely held up by strong acting.",
    "40": "John Cena struggles in the comedic aspects of his role as a buffoonish bodyguard, coming across as silly and unintelligent rather than funny. However, his character abruptly shifts into wisecracking fight mode when action sequences emerge, creating a lack of continuity.Alison Brie brings little authenticity or nuance to what should be an intrepid journalist character. Her bold persona feels more like a facade, lacking the complexity that would make her motivations more compelling.The film touches on the overdone theme of bad marriages leading to bitterness and divorce. While reflecting some realities, its portrayal leans into stereotypical notions about self-centered western culture. It offers no meaningful perspectives on relationships.The supporting cast delivers far stronger performances, adding a groundedness that the story desperately lacks. Even the villains showcase more subtlety than the two leads.The plot is straightforward with an absence of clever twists or unexpected turns. It does attempt some commentary on the insidiousness of dictatorships, but in uninspired fashion.Overall, Freelance assembles an impressive cast but fails to make good use of their talents. The promising premise gives way to shallow characters and a lack of directorial creativity. Fans of the genre may forgive its shortcomings, but for most viewers the film lives down to its generic title.",
    "41": "I am a huge WWE fan. I am a huge John Cena fan. I feel I need to say that so you know where I come from. I am a fan and have loved Cena the wrestler as well as Cena the actor. Cena is trying as actor to be more than one dimensional because of his physique. I think he should have been the next big action star but he wants to have an open mind and do films of every genre possible. I respect that. And he has done a good job in some films like Vacation Friends. But man this movie Freelance is a miss.Freelance is an absolutely boring film where nothing seems to be happening. The movie itself is 1 hour and 45 minutes. The first hour is basically just nothing happening. I actually fell asleep on this and tried to finish watching.I don't know what this movie is suppose to be. It's not really an action film because the action really, there is none up until the final 15 minutes. So, if you're looking for action, none here. You want adventure? Not much here either? That's the issue with the film. What is it?So, yeah, Freelance is a pretty dull movie that drags on forever before anything interesting really happens, the main characters are bland. Cena is really robotic as a serious actor, which is why I wish he would be an action star and let his physicality do the talking. Here, he's just way too robotic.Anyway, Freelance is a pretty boring, bland, film not worth watching unless you want to see Cena's acting progression.",
    "42": "Following a failed mission in the South American nation of Paldonia to assassinate dictator Juan Venegas (Juan Pablo Raba) that left him injured, former U. S. Special Forces operator Mason Pettits (John Cena) is now working unhappily as a lawyer as he struggles to connect with his wife Jenny (Alice Eve) and being a good father to his daughter Casey (Molly McCann). After meeting up with former comrade Sebastian Earle (Christian Slater) who is now running military contracting company CDI, Mason is offered the job of accompanying and protecting disgraced journalist Claire Wellington (Alison Brie) who is seeking to elevate herself out of tabloid journalism with an exclusive with President Venegas. Mason takes on the job despite his history with Paldonia accepts only to find himself, Claire and President Venegas in the middle of a coup with the three traversing Paldonia and trying to evade the insurgents.Freelance is the latest production from action director Pierre Morel who audiences will best know from his work on Taken that he's been trying to recapture with mixed results in his subsequent projects. Written by Jimmy Kimmel writer Jacob Lentz in his feature writing debut, Freelance has many of the staples of this type of action comedy setup as seen in notable examples such as Midnight Run or The Rundown. Unfortunately despite the promise of light-hearted escapist action fare, Freelance feels like a generic product that's solely concerned with occupying space in the most bare minimum fashion possible.It's honestly hard to point out exactly what doesn't work because on paper you'd think this setup would churn out something at least moderately diverting as the premise even if it's not at the level of Midnight Run can be serviceable such as 1990's Flashback with Dennis Hopper and Kiefer Sutherland, however much of the characterization feels very flat with not much defining our two leads of Mason and Claire who feel so bereft of personality that the usually reliable John Cena and Alison Brie feel like they're struggling to make these characters come alive. The opening that shows Cena's dissatisfaction with his life is positioned to make us sympathize with him, but it honestly makes him feel kind of callous and selfish in how he views his family as a lead weight who don't give him a vaguely defined sense of \"purpose\". Likewise Claire Wellington is supposed to be this disgraced journalist working her way up from covering celebrity house parties but aside from being a generically ambitious reporter there's nothing all that interesting to the character. The only character who feels like he really comes alive is Juan Pablo Raba's President Jaun Venegas who has a mildly amusing gag that he always knows who is trying to kill him and why, but the script doesn't really know how to bring that joke much further and The 1979 film The In-Laws I felt did this kind of thing in a more outrageous fashion because with Freelance it's sort of trying to play for both pathos as well as comedy and it doesn't coalesce in a strong enough way leaving the film dull and forgettable as a result. Christian Slater is also wasted in a borderline cameo that only serves to remind how much better he played this character type in his recurring role on Archer.Freelance didn't aspire to be much other than disposable late in the year action fodder, but even by those standards there's a plethora of films that have done this set up better and funnier than this one so I'd be hard pressed to recommend this even to the most forgiving of action fans.",
    "43": "Where do I begin? I suppose the movie starts out okay. We're introduced to John Cena's character, Mason Pettits, a special forces/lawyer who's unhappy at home and his job and is married to his wife, Alice Eve (Jenny Pettits), who doesn't love or appreciate him at all. His old war buddy (Christian Slater), who owns a private security firm, tracks him down and offers him a job to protect a journalist who is played by Allison Brie. Allison is tasked with interviewing President Venegas, but on the way to his estate they are attacked by a military outfit that is attempting a coup. This is where the story takes off, but this is also where I started to check out.The director's directing of his actors is abysmal. The script is dreadful. The \"comedy\" feels forced and not funny. And the music score is overly loud and out of place. The \"action\" mainly consists of them running away and the bad guys having storm trooper aim. Allison Brie's character is there to just be an annoyance and further the dumb. The cinematography is good, but unfortunately having a movie that looks good is not something that makes watching a movie enjoyable if everything else is mediocre. The acting barely passes as acting, but I guess it does pass. I don't recommend seeing this in the theatre. It's something much more digestible as something you consume on a streaming platform. It passes the time, but you'll likely forget about it a few hours after seeing it.",
    "44": "I have to admit.. I half expected this to completely suck.But it manages to get something somewhat right.. a charming \"villainous\" Presidente of a Colombia(?) Country and its volatile situation. As the script develops, it paints an understandable and believable picture, as if IT was the main character of the movie.. so it isn't a total loss.I still found it boring.With a skippable start, awkward interactions, strange line delivery, atrocious pacing and scenes that last just long enough to feel weird. Not to mention the bad CGI, dull action and intrigue. Also, calling this a comedy is a lie straight out! But the most disappointing part has to be the cast (aside from the mentioned President), that could have been comprised of any \"Hollywood star\", honestly. Those in place don't add anything to it. And Alison Brie continues to get roles that show how replaceable she seems to be.. which is sad.Would I recommend this?Not if you have to pay for it.. It lacks imagination, creativity and memorability in almost every department.",
    "45": "Lets be clear; this a relatively low budget action movie so do not expect spectacular actions scenes. There is lot of violence and action but is mostly comedy.The incredible situation are the dialogs; unbelievable realistic; playing with the standard common places in this kind of movies and twisting them to unexpected outcomes. And the very hard critic to corporations exploiting third world countries for they resources.Another surprise is that all the characters have a well defined roles, There no \"dumb\" characters and perhaps the most naive is the John Cena character.The acting of everyone is really good; including Cena (incredible humble here) and Juan Pablo Raba being the most interesting (and surpurising in a very good way).Alison Brierie is very good particularly in the sensual moments.Yes, it is a comedy but a very serious one.Sadly the action colud have been better; but this is a REAL GOOD MOVIE that deserves audience and it will not disappoint.",
    "46": "I'll be honest. I don't think that \"Freelance\" is a good movie. In fact, I know it's not. But I want to ask you a question, first, before I continue on with this review. Based on the poster, the star power, the director, and the trailer, what kind of movie do you think that \"Freelance\" is? I mean, it's made by the director of \"Taken!\" Surely this must be a hard hitting, seriously, gritty action movie... right? Wrong! In fact, \"Freelance\" is anything but.Let's just get this part of the review out of the way - if you're going to see \"Freelance\" and in any way, shape, or form think you're going to get an action film, erase that thought from your memory as fast as possible; because \"Freelance\" is not an action film. Yes, there's some action in it, but it makes up maybe five minutes, if that, of the entire running time. And how is the action when it hits? Not very good. And that pains me to say with Pierre Morel behind the camera, because we have evidence that he knows how to direct good action. Now don't get me wrong: \"Freelance\" does have spurts of action brilliance - by spurts, I mean that there is maybe ten seconds of innovation at play here. Other than that, it is crystal clear that everyone in front of and behind the camera could have cared less about the action, as the film doesn't even give its audience the pleasure of a violent pay off with the main antagonist.So the action sucks; what type of movie are you getting, then? Well, \"Freelance\" wants you to think it's a comedy. The problem is that it isn't funny. Scratch that; my dad was laughing, but he's about 63 years old, so take that as you will. I'm in my 20s, and I laughed - nay - I chuckled, perhaps once or twice. Besides that? I was fighting back sleep. Maybe a shot or two (or three) would've enhanced my enjoyment, but I was unfortunately sober while watching this (I am not while writing this review, however). Regardless, \"Freelance\" tries to portray itself as a light hearted comedy while not actually telling any funny jokes. Sure, Cena and Brie have some banter, but they're not actually saying anything funny to each other. Similarly, Cena and Brie and Juan Pablo Raba share some silly moments, but none of them are particularly laugh out loud comedic.There is one scene with Cena and Brie that is surprisingly sexual, which was shocking for a movie of this nature. Admittedly, I did enjoy said scene for what it was, but I couldn't shake the feeling of how out of place and unnecessary it felt, especially when it didn't lead anywhere interesting. However, Brie is extremely attractive, and if you are one of many people who are attracted to her, you may find at least one scene to enjoy here.All of my complaining aside, I didn't hate this movie. But I didn't really like it either. It went by quickly for what it was - and what it was, was a light, breezy, direct to DVD movie that is, for some reason, being released in theatres. I do have to say, though, that I'll probably never watch this again, and nor do I want to. Do you plan on seeing this at the cinema? If so, my advice is to prepare yourself - drink heavily before seeing this movie. You will definitely enjoy yourself more than I did.",
    "47": "After the failure of a mission and the loss of his military brothers, a man returns to a life he never wanted, being a lawyer. His misery spreads to his mental health and his family life. Things look bleak until a friend from his past offers him a job. The job is simple enough: protecting a disgraced journalist who has the opportunity to interview an infamous dictator who is also responsible for ruining the man's mission and killing his comrades. What is supposed to be a simple protection assignment turns into a chaotic political revolution, with a single man's moral compass swinging between revenge or doing the right thing.An action comedy with a political twist, this John Cena flick could be a lot better. For the most part, John Cena makes easy-to-watch and entertaining movies, but this one is long and has a few scenes that drag on. The film also has quite a few terrible green screens and CGI scenes that interrupt the visual flow of the movie. There are some fun action sequences and a couple of good one-liners, and the film does take a different take on the dictator role, humanizing him instead of the cliche tyrant and oppressor. Overall, this movie can be skipped, or if you are a John Cena fan, it is worth a background stream while scrolling on your phone.",
    "48": "Start to finish this was predictable and cliched. Not to say there aren't some smirk-worthy moments, maybe even the odd chuckle - but it really felt like a cliche. Cena showed more range than I'd seen before - albeit in a part that was 60%+ 'on brand' for him. Alison Brie did well in a part that had limited opportunity to shine. The dictator role was played well, but there were exaggerated aspects to the character that made for cringing moments.If there was meant to be some underlying messages about America's history in geo-politics, or their own history of controlled opposition etc, it was far too subtle and muddy.Heavy green screen usage completely detracted from what little enjoyment I had in watching - either go shoot on location or do a better job in the editing/CGI. The horse scenes in particular were one of my few laugh out loud moments (unintentionally funny, I'm sure) It genuinely felt like that whole part of the movie, and the delivery on screen, was a 'I give up, just run with what we have' moment from the producers. Likewise a lot of the jungle scenes.This would have rated lower but for Cena being better than expected, Brie being solid, and the potential for people to understand how governments really work.",
    "49": "Mason Pettits (John Cena) hated to have a normal boring life as a lawyer and quits law school to join the army, for the adventure seeking life he finds purpose in. After a mission goes south Paldonia, he is forced to be a lawyer, leading a boring life which in turn is taking a toll on his marriage. As he struggles to make things right, he is called back by CDI, run by his friend to go on as security detail to a disgraced journalist who is on her way to Paldonia to interview the dictator Mason loathes. How does he manage to protect her and the man he hates from an internal coup forms rest of the story.Freelance directed by the man who gave District 13 and Taken, suffers from lazy writing right from the word go and it's just painful. The film never gets to decide what it wants to be, an action comedy laced with rom-com stuff or a generic action film. It never settles to being one as the jokes written are so flat, it doesn't work as a comedy and the action scenes are so dull that it doesn't do any justice to the Director's filmography or the main lead's. John Cena has charisma and a great comic timing but you cannot expect him to save the film by offering nothing lines throughout.",
    "50": "Typical action flick where you dont expect much in terms of character depth, or story depth.It's a lighthearted take on a heavy topic, which is not bad angle to take, but it was just unnecessary.I mean, is any movie starring John Cena neccessary?The dialogue is considerably bad and repetitive though, and when you have nothing coming out of the characters mouth that's interesting, it's hard to latch onto anything else, especially when it's also put together lazily and mockingly.At least the movie makes fun of itself throughout, the CGI is a dead giveaway honestly, and if the viewers cant\npickup on that, that's on them.Go in with reasonable expectations, and you will be okay.",
    "51": "Well, there's nothing to actually recommend this film.. (ahem, except for Alison Brie, of course). The plot is meh, the characters are all uninteresting, and the set-pieces are as generic as they come. For an action-comedy, there's very little comedy to speak of. In fact, I don't remember a single occasion where anything in the film made me laugh in the slightest. Alison Brie, my love, I think it's time to fire your agent. Why have you been part of some of the most forgettable films since The Rental? Cena looks bored to the core, and the writing doesn't even give him an opportunity to showcase his comedic chops. He gets to wear his costume from The Marine once again, however.I couldn't give two hoots about where the plot was headed, or the twists that just kept coming like a 9-course dinner menu. At least, I thought Pierre Morel would stage the action bits a lot better. It's green screens galore; that's all I can say. I think the only scene that made me sit up was when Alison Brie's character was trying to seduce John Cena's character. The payoff to that is, well.. disappointing as well. Oh, and we get a Christian Slater cameo, for anyone who cares.",
    "52": "This is billed as an action comedy. I can honestly say I never laugghed and that you cannot tell it is a comedy unless you are told so. Seriously. So that is out the window already.Character development is minimal, and performace by John Cena is one dimensional. He is not good for a comedy unless he is the straight man to the funny person.Cena is mean for serious action movies. The plot is one we ahve seen a hundred times. Protect girls from evil killers while running in a jungle. Add to that the dictator that is trapped with them .The dictator is betrayed by cousing or some family member and is trying to take over the country.Realy really I did not care if the present dictator or the new one made it or not. The present dicator is specially annoying and adds to the pain of watching thsi one dimensional movie.Alison Brie si a very good actor, and pretty, but does not have much to work with.The movie is a bore. Was trying to leave it as background noise halfway as I worked but it was jsut oo awful to keep dining on.I ended it about halfway.",
    "53": "Philip Morel has directed some cool films before, however this one is very very amateurish, it's like watching college student' written script turned to film. Hiwever, Morel's signature explosive action scenes were all over the film but without a good story, it was nothing but a waste of money to make this and wasting valuable time to watch this.The whole script didn't make any sense nor it had any flow relatable from one scene to the next. It was exceptionally bad that I really believed the writer used AI or ChatGPT's AI to write the script. The conversations basically copied existing films from the past, like Romancing the Stone, James Bond, Lethal Weapon, and so on. Stitching the conversations together to create the story flows pretty much a disaster vecause they were forced to be relatable whie they were not.The casting was also bad. Alison Brie is a talented actor and well liked, but in this role she had, she was a city cat pet in 5th Ave pretending to be a jungle tiger, she was so out place and the script didn't give her anything but paycheck. I felt some of my brain cells died watching and listening to her scripted scenes.Funny thing is, John Cena is already known as the actor who will do anything for attention, and this film fit his attention seeking behavior. Unfortunately, he has no memorable scene.So, skip it. Don't waste your time or money to watch this film.",
    "54": "American special forces soldier Mason Pettits (John Cena) is forced to retire after a helicopter crash causes permanent injury to his back. He is stuck in his suburban life with wife Jenny (Alice Eve) and young daughter. His Army buddy Sebastian Earle (Christian Slater) comes to him with a private security job. Disgraced journalist Claire Wellington (Alison Brie) is going to Paldonia to interview dictator Juan Venegas (Juan Pablo Raba) and he's her bodyguard. A military coup breaks out and Mason has to get Claire to safety.It's a bad trio of characters. John Cena is good but the others are problematic. Alison Brie is too arrogant without the reversal. I don't understand why she wouldn't ask him about his past operations. Those could be good stories and he never says that it's classified. When the coup happens, the arrogance in Claire should make her follow Venegas and the story. Then there is the dictator himself. The story is trying to make a bad dictator into a good dictator despite all the killings. It's all very awkward for a comedy. It doesn't come off as funny. It would be a lot easier to keep it a twosome instead of a threesome.",
    "55": "IN A NUTSHELL:\nAn ex-Special Forces operative takes a job to provide security for a journalist as she interviews a dictator, but when a military coup breaks out in the middle of the interview, they are forced to escape into the jungle to survive.This movie is directed by Pierre Morel and written by Jacob Lentz.Based on the terribly low score of 7% by critics on Rotten Tomatoes, I can say I definitely got a kick out of this movie more than other film critics. During its opening week, it sat at an embarrassing 0%. Yikes! Audiences liked it more too, giving it a 77% grade.THINGS I LIKED:\nJohn Cena is such a beast. I get a kick out of his movie performances. How about you?The story features a guy with Special Forces training in the Army. Those guys are total studmuffins.I've always liked Alison Brie and was happy to see her again. She looks beautiful in every scene.It's great to see Christian Slater again. He's looking good.All of the cast members of this movie about the Banana Republic did a great job and included Marton Csokas, Juan Pablo Raba, and adorable Molly McCann.The soundtrack is fun, energetic, and even humorous at times.Snappy and funny dialogue\nLots of visual and spoken humor.I don't know why, but I always love it when characters in a movie reference other movies. In this one, it's a slam on how terrible the movie Delta Force Ha ha It also quotes a line from The Godfather.I love twists and turns. There are quite a few of them in the story, so the viewer is never quite sure who is telling the truth.Lots of action and fight sequences.I thought it was funny that President Venegas' suit stayed perfectly white throughout the entire jungle ordeal.I love that the movie doesn't take itself too seriously, while at the same, sharing some insightful messages.THINGS I DIDN'T LIKE:\nIt's as if the movie can't decide if it's a comedy, action, or a drama. It's a bit of all three, really, but the tone shifts so much that it's hard to know what the filmmakers were going for.Well, there didn't have to be as much profanity, blood, and nudity...TIPS FOR PARENTS:\nLots of profanity, including many F-bombs in English and Spanish\nViolence with various weapons & hand-to-hand combat\nA woman throws up after drinking too much alcohol\nTalk of having an affair\nSome Spanish is spoken sometimes with and without subtitles.A little girl flips the bird.We see people get shot and killed\nSome blood\nExplosions and destruction\nWe see the top half of 3 naked people coming out from showers. A woman covers her chest with her hands (but she doesn't cover everything).Check out my YouTube channel called Movie Review Mom!",
    "56": "\"Freelance\" is an action-comedy that takes viewers on a wild ride through a jungle coup with a washed-up journalist, a reluctant bodyguard, and a ruthless dictator. While the film falters in its reliance on cheesy CGI and predictable action sequences, it manages to redeem itself with its surprisingly effective humor and a charismatic cast.John Cena shines as Mason Pettis, the former special forces operative who finds himself working as a bodyguard for a desperate journalist, played by Alison Brie. The chemistry between Cena and Brie is undeniable, and their banter is a highlight of the film. Their comedic timing is spot-on, and their improvised exchanges are genuinely funny.The supporting cast also contributes to the film's comedic appeal. Eva Longoria as the ruthless dictator is a deliciously over-the-top villain, and Ken Jeong provides some much-needed comic relief as a bumbling arms dealer.Unfortunately, the film's action sequences are less impressive. The CGI is often distractingly bad, and the fight choreography is uninspired. The action scenes feel like a throwback to a bygone era of action films, and they lack the polish and excitement of modern action cinema.Despite its flaws, \"Freelance\" is an entertaining action-comedy that is worth checking out for its humor and charismatic cast. The film's trashy CGI and predictable action sequences may not be for everyone, but fans of lighthearted action-comedies will find plenty to enjoy.",
    "57": "Directed by Pierre Morel. A runtime of one hour and forty-eight minutes. With an R rating.\"Mason\" played by John Cena used to be special forces with his good friend \"Sebastian\" played by Christian Slater. After a mission trying to assassinate a dictator, \"President Venegas\" played by Juan Pablo Raba went south losing a lot of men. \"Mason\" decided to call a quits.Now a lawyer with a messed up back and hates his new life. His marriage to his wife \"Jenny\" played by Alice Eve is on the rocks. The only highlight is his daughter \"Casey\" played by Molly McCann.Things seem to turn when his old buddy \"Sebastian\" who now has a private security company asks \"Mason\" to do a Job for him. It's easy money, and all he has to do is protect this journalist \"Claire Wellington\" played by Alison Brie. But there is a catch. She's doing a story on \"President Venegas\". The same man he was sent to kill years ago and who was responsible for losing most of his team.Trying to muster some happiness he takes the job. But it's far from what he thinks. He'll get mixed up in some nonsense with a \"Colonel Jan Koehorst\" played by Marton Csokas. Now this easy job will turn into a hard one. He'll have to stay alive and keep everyone around him alive which opens up its box of worms. In this action comedy.\"Freelance\" was another copy-and-paste action comedy from John Cena sounds way when I say that but I like John Cena in film. When done right he is usually hilarious and brings the proper amount of action needed.I liked the cast. The majority of the cast are well known and have been in several films I like. The plot and script were simple but it got a little too complicated toward the end. It wasn't that complex. They were just doing a bit much toward the end.It had its funny moments, its action moments, and its cheesy moments. I've seen way worse in general but out of the John Cena catalog, this was just ok. It would have been better as a good streaming film. That being said It was still entertaining. I give it a strong three mor fires 🔥🔥🔥.#CosmoandtheMovieWithin\n#CosmoMovieBlog\n#CosmoLanier\n#Freelance.",
    "58": "I wasn't expecting much,just like the recent Jackie Chan,John Cena film but damn both surpassed all and we're freaking goodFor the first time in any movie,the president of a foreign country is actually smart and doesn't bootlick for western powers begging them to come save him or his country,this is really realistic if such events unfolded in real life and besides some mistakes such as rockets hitting grass and there's no charred grass or any fires,it was surprisingly and honestly good and I am sure the bad reviewers here giving negative reviews of this movie are salty that a western backed foreign invasion failed in this movieJohn Cena carried the movie and it's commendable that he stayed true to his wife,all 12 year old sigmas pledged allegiance to him upon seeing the filmThe president of Paldonia is smart and well spoken and was doing all for the sake of his country though there's nothing wrong with staying In power so long you don't abuse such powerThis was way better than ghosted 2023 and really good film anyone can enjoy,it really does make up it's shortcomings with comedy.",
    "59": "Freelance, with its increasingly brutal plot twists, plunges the audience into a thrilling life-and-death escape. John Sihan's performance truly echoes Arnold Schwarzenegger's shadow from back in the day. When Alison Brie's interview mission is abruptly interrupted by an unexpected coup, she displays a calm demeanor in the face of chaos and turbulence. What they face is not just chaos and fear but the brutal and merciless reality of the world, with the injustices of those in power and the selfishness of human nature. As Mason and Claire constantly teeter on the edge of life and death, they find themselves with nowhere to run. In this journey of escape, the audience witnesses the ruthless nature of betrayal and the importance of friendship, support, and trust when facing the challenges of survival. As the plot unfolds, the movie reveals the instinctive reactions of human nature in extreme circumstances. This stark portrayal prompts reflection on the various injustices and inhumanities in society, all intertwined with the dark selfishness of commercial interests.",
    "60": "Why is it that the South Africans are portrayed as bohemians who are all wearing snoods or scarves.Where are the khaki shorts and savannah clothing?Also- no way Saffers miss so many shots. We used to shooting running bucks and criminals jumoing over your wall.The movie is a bit clunky and doesnt flow properly. Storyline not super original - but was hoping for a good ol Action Comedy... But it's... Okay at best... Good enough when there is nothing else and you a bit bored.Not to harp on the bad fake South Africans- but wish the one sentence in Afrikaans was executed properly at least...",
    "61": "This movie at the moment is underrated. If you love John Cena you MUST watch this film he did a great job he gets better every film. If you love Alison Brie and OMG I love her so much.... I would bet you would probably enjoy the time in the theater watching this movie. If you love Alice Eve and I do but she isn't in it as much as I would like to see but it's still worth the theater viewing she did awesome.It's quite funny I was surprised and I was expecting to be disappointed no joke, mainly because it's been a tough year for all movies and I already lost hope to be honest. I enjoyed Barbie, Oppenheimer, the latest Mission Impossible film and Five Nights at Freddy's but I expected a lot more this year. I enjoyed Killers of the Flower Moon as well but I was expecting more but maybe that's on me.The comedy is good.. The action is good.. The actors are good.. The editing is almost there but it does have a few short moments you'll notice are off. I have ADD and OCD 😂As for the R rating, not all that much severe happens, it has some blood and action violence with weapons and slight language and very slight sexuality. This film could have got a PG-13 rating fairly easily. If you have teenage boys they'll love this film because of Alison Brie's performance alone. She was funny and gave good effort in the action scenes, the sexy scenes are very minimal like 60 seconds but tasteful.I watched this film at a Marcus Theaters Movie Tavern eating chicken strips and perfectly crisp fries and excellent popcorn. It was a nice time.",
    "62": "When John Cena got into Peacemaker role, it was another step for him to put aside his WWE character and get a large step towards being an epic action movie superstar. He got into all the right films for his level and size, but nothing - at this kind of work and genre, promises good scripts or movies.This time he wastes his time and talent with low level action movie and demonstrates, once again, that he still needs to work on his appearance and movie choices. He is an ex-military man, that got injured during one of his missions and this time, in a very comfortable way, he agrees to leave his current and boring life, to breath some old and familiar dust and danger.The script is so predictable and lazy, that only teenagers would be able to see the movie and enjoy it, at the same time. Cena is pretty good at this one, but the movie itself is pretty bad - at the same time. Alison Brie is OK but nothing can erase so many dumb lines she and Cena have to read during their job as the leading characters.The chemistry is pretty off and the movie itself is not interesting enough - so we find another actor that could have been interesting, despite the fact he crawled out of his hole, to get some fresh air. Christian slater hasn't participated one good movie for over the last twenty years, so his role could have been written and performed better, but he doesn't need something so practical as this movie, to shine.Seems that another film with Cena in it, as the lead character, is once again flushes down the toilet. Cena have been casted to this kind of movies because of his comic abilities, but now it seems that even those tools can't help his to find a good movie to be a part of...",
    "63": "Prepare yourself for a rollercoaster of mindless entertainment in \"A Good Dumb Fun Movie.\" This action-packed comedy is a guilty pleasure that doesn't take itself seriously, and that's exactly what makes it oddly enjoyable.The plot is as straightforward as it gets, offering a convenient excuse for a series of over-the-top action sequences and laugh-out-loud moments. Don't expect any profound storytelling or intricate character development; this movie is all about delivering the goods when it comes to mindless fun.The cast, led by a charismatic ensemble, fully embraces the absurdity of the script. They seem to be having a blast, and their infectious energy carries over to the audience. From the clumsy hero to the over-the-top villain, every character is a caricature, adding to the overall charm of the film.While the humor may not be everyone's cup of tea, there are undeniably some genuinely funny moments scattered throughout. The jokes are often slapstick and rely on well-timed physical comedy, ensuring that you won't need to engage your brain too much to get a good laugh.",
    "64": "There's stuff to dislike about this movie but its clear it doesn't take itself too seriously and viewers should do the same. Its basically a 90's action movie but they modernized it a bit and it has a twist that makes it a bit more than what you expect, though you need to watch more than half for it to play out like that.The humor is cheesy and the action predictable. But what I liked about it, is that it all seems practical effects. Many movies these days put half of the action into the computers these days, making it look fake or overcomplicated. This is just back to the old days, with a green screen here and there, but nothing overdone.A big positive for me was also the actors. John Cena is his regular old self but the rest of the cast is pretty well done. I especially liked the president, and Alice wasn't the usual damsel in distress.So I can recommend watching it, but as said, you shouldn't take it too seriously. Its a nice twist to have a bit of fake news in there but on the whole its just a neat action movie. And sometimes thats just what you need."
}