{
    "0": "Say what you want about the man but Mel Gibson is sorely missed, that was one of many mistakes this movie made. Flat, boring, pretty, but not fun. The original stands as a childhood favorite that I've watched with my kid many times but nugget of whatever, will be forgotten in a week. Yet another in a long list of agenda filled Netflix blunders. When will they learn? (Side note about Netflix as a production company: finally canceling my subscription after ANOTHER price hike, removing Christmas movies around the holidays, while other services put them behind pay walls is just a greedy, disgusting practice imo, streaming is out of control and people are finding alternatives)",
    "1": "For me, this sequel was a decent continuation of the original. It was based on the same concept as the original with some minor additions.The story was simple and light hearted just like the original, the screenplay was decent, the direction was decent, the animation was unique like the original and the voice actors did a good job. The thrill elements were embedded nicely in the story which makes this normal story little bit enjoyable.But to be honest, I think this sequel was unnecessary as it was underwhelming if we compare it to the original. Overall, this movie was a decent entertainer.",
    "2": "Chicken Run was always second tier Aardman; Dawn of the Nugget is probably the weakest thing I've seen from them. As my title suggests; there's no charm to anything new the film introduces, whether that is characters, voice actors, character design or story. The fact my 6 year old loves the first film and was visibly bored through most of this speaks volumes too.The new voice actors are different to the point they essentially change the personalities of some characters and a few of the vocal performances are objectively poor and lifeless. It's unfortunate that it's two of the main characters that are impacted by this.The animation is unremarkable and the theme of a prison camp/play on The Great Escape is watered down and replaced with very little. The film does get better but is annoyingly slow to get going.",
    "3": "One of the best films in animation has a sequel like this?It felt like watching random children's programme. It also reall highlighted the signs of the time where everthign created now is on safe level without too much or basically an humour due to the delicate ones.I also couldn't adapt to the new voices either, its like changing buzz or woods voice in To Story, it just does not work.Overall, I would say pretend this film never happened and just keep re-watching the first one over and over again until this one is completely out of your mind.It's a 2 star film for me. Please don't make another.",
    "4": "It was a fresh storyline with ample reference to the first, which is super nostalgic.I really enjoyed it! I love that it kept the original style and wasn't super modernised or impacted by modern day graphics.It definitely met my expectations and it was a fun, light movie that's great for kids and adults! Love that the original characters were in it with a few be ones.I did notice some of the voice actors had changed. Would have potentially liked them to be a little closer to the original, but a minor detail. Love the colour and vibrance of the set designs too!Would recommend this one, enjoy!",
    "5": "Ok meh is a little harsh, its filming is a master art of craftsmanship in stop motion and model making, love this style of animation and the work that goes into it. That said the story, well it just didn't need to be made , it was dull, and lacking any real adventure unlike the first one. It's ok for the kiddies, but this time round there is nothing in it for the adults. The voice acting was fine, but it just didnt add anything , sorry guys some times sequels just don't need to be made and this was very pale next to the original. It spent way to long in the \"chicken processing plant\", and chickens running around doing different things, there was no character growth arc like the original, as that had already been done, so again what was the point of it all?",
    "6": "Firstly let me say, Wallace and Gromit is my childhood! I have always loved Aardman and I remember being genuinely moved and at points terrified by the original Chicken Run. It was dark, well written, funny, had genuine chemistry between the characters, and it also had genuine threat. Most importantly, it had a soul. I am very sad to say that this sequel does not have a soul. The plot is contrived and rushed, the voice acting too often feels phoned in and they too often lazily use Babs as a forced comic relief. I don't think I laughed out loud once. There are very few redeeming qualities about it other than the usual incredible animation but even that is lacking in visual puns and Aardman's typical nuance and wit. I really wanted to like this. Truly. But it is just empty and devoid of feeling and love.",
    "7": "Where to start? The jarring changes to the voice acting cast? The flat delivery of the new cast? The lack of charisma between the lot of them? The jokes that didn't land? The script and dialogue that could have been written by a child?I don't know, the only positive explanation I can conjure is that it was made for a completely new audience consisting of children, anyone above the age of ten will get nothing out of sitting through this.If you loved the first film, do yourself a favour and give this one a miss. I could barely sit through it, I just wasn't engaged at all. It's a poundland version of the original. Lazy.",
    "8": "What made Ardmans Chicken Run so successful is that while it is arguably a children's movie there is plenty of clever adult humour in it to appeal to many adults. However this second one is totally lacking in anything other than a child's movie, and probably a child no older than about 10 years.I was a big fan of the original and had been looking forward to this as a Christmas highlight, but after over 30mins of poorly written drivel with virtually no humour what so ever, I could take it no more and turned it off. This really does not bode well for the Ardman/Netflix collaboration for a new series of Wallace and Gromit stuff. I just fear that the Netflix writers/producers just don't get the British humour that made both Wallace and Gromit, and Chicken Run so successful in the first place.",
    "9": "I'm not convinced the same people had the same amount of control as this didn't have the quality of any previous movie from pirates to Shaun to W&G, the looks were the same but it was extremely basic, very un creative and a cash grab once again with a desperate attempt for few subscribers from Netflix, I'm sure if they'd have had an idea they'd not have needed 23 years.There was no cuteness, no heart and desperately lacked humour, it was just tedious, slow, predictable and repetitive, it was as basic of an idea as you could get and it was executed poorly, none of the adults like it and 5 kids out of 7 went to sleep. Shame.",
    "10": "Aardman but after 20 plus years waiting for a sequel . This production was far from worth the weight . For starters it's the was the most predictable script out every . Then due to the discriminative people behind this they decided to do a mass recast claiming the original actors which made this film what it was too old . Which is Ageist . The biggest problem was you replaced the best characters with the worst voice . Levi for Gibson come on what are you smoking over there . That's like owning Disney and swapping it for a turd covered in glitter . Levi voice distracted me the entire film . Gingers voice not the same . Same with the rats and Fowler. Imagine taking away what made this film great.",
    "11": "Hello, everyone. Today I'm gonna review an awaited movie for the decades. It's a really long time since Chicken Run came out (man, I was a kiddo when I saw that movie). And now, we got the second movie, Dawn of the Nugget.The movie tells a story about chickens living on an island, free from the cruel farm life. The main heroes, Ginger and Rocky, have got a baby called Molly. As she grows, she starts to be fascinated by the outside world. And one time, she manages to do something, well, expectable...\nWhen I saw the trailer, I was fascinated about that movie. It showed us interesting elements, and also one movie spicy twist. The story was cool, and TBH I kinda like the movie tries to show the cruel reality of how meat is made. It was shivering down my spine, and well, it's not the first time I was thinking about becoming a vegetarian.I think we can notice how animation improved. Aardman is well-known for its stop-motion and clay animation techniques, so we can see a considerable improved, if I compare it with the 1st movie and Wallace and Gromit: The Curse of the Were-Rabbit.As I mentioned before, I was surprised by the movie twist - and that was the villain. In this case, it's cool the creators just used the same one, and no new villain appeared. It added its vivacity to the movie. I cannot imagine how it would look with another villain.TBH, I couldn't wait for this movie to come out. I remember false commercials were all over on the internet. But now we can see the true one.I was satisfied with this movie. At the end of it, I think there were some weird moments when I was asking: Why do they do like nothing happens? But it's normal in the movies.I give it 8/10.",
    "12": "The film was amusing enough (lots of slapstick humour) and I enjoyed the fun details in the animations, e.g. A hot air balloon disguised as a cloud, and the factory \"eye register\" including a night-shift worker with very bloodshot eyes..That being said, the storyline felt unoriginal and became flat halfway through; it was too obvious what was going to happen. Chat GPT could have written it - and given many industries' overreliance on AI, it wouldn't surprise me if that were the case.I also have to agree with some other reviewers that the personality of main characters was watered down, especially Rocky. The original Rocky's bragging bravado was a big driving force and source of parody in the first film. The sequel's endless slapstick humour and flat characters didn't do enough for me.",
    "13": "Is this a masterpiece, no. But the first one wasn't either. It's meant to be a fun watch and that's what it is. It feels like classic Aardman for a new generation with similar slapstick and animation mixed with a compilation of new jokes and an excellent improvement on the classic stop motion animation.A few jokes do fall flat but it's still got the same witty humor and fun animation. Going with a new cast is a bold move but considering the original was 23 years ago I'd say it isn't insane for them to get a new cast considering most of the main cast hasn't done much work since the mid 2010's.All in all a fun movie that has the old Aardman charm that blends nicely with new generation.",
    "14": "Seriously, who was this for? Was ANYONE really asking for a part 2 to the original? Was this even necessary?! No, no it wasn't. Frankly, this movie was pure dribble and rubbish! Seriously, stick to the first one; it was alot better. This movie was very unimaginative and pathetic, overall. Just a cash grab production and nothing more. Sure it was interesting to see what the characters were up to after all this time, but that was about it. It was rather boring and pitiful to watch. Frankly, it's lacking some serious charm to keep the audience interested. I really see to point of the film or why it was even made. Do you self a favor and watch something that's actually WORTH watching.",
    "15": "Chicken Run 2 disappoints on multiple fronts. The recycled plot lacks the originality that made the first film a classic. Characters feel superficial, failing to capture the charm of the original cast. The animation, once groundbreaking in stop-motion, adopts a less visually appealing style. Humor falls flat, lacking the cleverness of the first movie. Most notably, the sequel misses the chance to address contemporary themes or offer a fresh perspective. In the end, Chicken Run 2 struggles to recapture the magic that endeared audiences to the original, leaving fans longing for the brilliance that defined the first film.",
    "16": "The original was so good. What happened? This story is so predictable that in the first 5-10 minutes you know you've seen the story so many times beforw and know how it will begin and how it will end. But you think maybe the jokes and the characters and the situations will make up for it. They don't. It just doesn't have the charm of the original. So many things happen for no reason except to set up the punchline of a joke that just isn't very clever.The original was unique, clever, funny, exciting, and touching. This one just isn't. I don't recommend it. See the original a second time instead.",
    "17": "So this movie was all about breaking in the chicken farm to save other chickens from Ms tweedy. The villain was trying to kill all the chickens and turn them into nuggets for money. So Ginger makes a plans to get in the chicken farm to save her child then gets trapped inside a hole and then Rocky fires up the popcorn and then in exploded on to the sky. And then they when back to the farm to save frizzy and the rest of the chickens. The finale battle against Ms tweedy was epic. The chickens were driving a car the freedom and expoled the farm. So the Chickens when back to their home with a lot of chickens friends.",
    "18": "Man This Movie Is Way Better Than Other Movies, I Mean, This Has Best Animation,\nBest Story,\nBest Characters,\nTo Bad The Other Character Is Not In This Movie, I Love How They Made A Recap Of The First Movie, I Seen The First One, I Love The Villains, But Mrs. Tweedy Returned As A New Person And I Was So Happy That See Returned, I Thought It Was Another Villain, At The End Where They Did The Same Thing Just Like In The First Movie, I Recommend This Movie If You Love The First Movie, It's So LOL And Funny, I want To See Another Sequel To This Movie, To See What's Next, The End Was A Cliffhanger.",
    "19": "I really love the voice acting and everything especially having the first Scouser chicken I think you have a lovely accent as well because you don't get to hear many people from the Northwest especially from Liverpool on the TV show especially on Netflix. But I think the layout and the background was amazing but I felt like the storyline could've been much better feel like it Mr Matthew flashbacks or maybe that's just saving up for next series because I hope we get more of a backstory with Gill years and Rockies early years I think I'll be more excited about that I think we need more of that going deeper into the emotions.",
    "20": "What the hell is this.I absolutely loved the original Chicken Run, and what made it so great was it's dark subject matter, fast pace, distinctive and gritty setting (rural Yorkshire chicken farm?? Loved it), quick wit and incredible voice acting.This is terrible in comparison. I knew I was done after about 10 minutes. Main gripes:What the hell has happened to the voice acting??? Ginger is now posh and sounds like she's on heavy sedatives (I PINED for Julia Sawalha, what a travesty). Rocky is a moron. Babs' stupidity used to be lovable but now just makes her punchable. There are weird pauses in between the line deliveries which make the actors sound like they're all in different rooms facing the wall, guessing when the previous person last spoke. It's bizarre.The writing is shambolic - the strong characters from the previous film have been watered down into twee, bland archetypes garbling out recycled jokes that are lacking any sense of originality. It's so boring.They've yassified Mrs Tweedy??? MRS TWEEDY IS A DIVA ANYWAY, she doesn't need EYELINER AND GOGO BOOTS??! What made her so scary in the original was how little she really spoke and appeared on screen, but here she's stomping all over the place, THE ICON LOSES HER MAGIC!!! Another queen lost.Feels very much like an Americanised 'film for kids' and kids ONLY. All the original British humour has gone. Visually great to look at but thats where the positives end, the rest is just baseless and empty. All for show.What is this Incredibles setting?? It's so modernised and bizarre? WHY ARE LITERAL AGENTS PATROLLING A HIGH TECH CHICKEN FARM, WHAT DO THEY THINK WILL HAPPEN?? Who wants to break into a chicken farm (apart from these weird animals)?? The location is so ridiculous and unrelatable it's actually kind of amazing how boring they make the plotline surrounding it.WHY DOES THE GUY WHO OWNS THE RESTAURANT GIVE MRS TWEEDY A TASTER OF SOME WEIRD SAUCE DIRECTLY FROM HIS POCKETMy favourite character was a snail who appeared about three times in the whole film trying to get away from Fowler's endless speech (weren't we all)I'm a hater by nature and this film let me thrive. Never again.",
    "21": "It's been a good number of years since the original, but I'm pleasantly surprised by this sequel. It fits well and doesn't feel like it was created just for money. Hardman have impressed me once again with the flawless stop motion and story telling with the characters. After the events on the farm, ginger and rocky are living in peace with the other chickens on a island. That is until a new threat emerges that could destroy everything they have built. And with daughter Molly missing they gang will once more get back into plan mode to destroy the new threat and the shadow of someone very familiar. With some great new voice talents dawn of the nugget is a charming sequal thats bright and vibrant. And not as gritty and dark as the first, though it was more realistic.",
    "22": "It's a disappointing, paint-by-numbers sequel that is full of 'the message'.Rocky was fun and smart in the first film. He seems to have had a lobotomy where he can't do anything right and gets hurt a lot.He and Ginger have a strong and brave daughter who runs away from home. Her father is useless and so is Fowler. Fortunately the female chickens are smart and competent.You've seen this film already.It's very disappointing to see a brilliant company like Aardman fall into the trope of all the male characters being evil or stupid. I hate to think of what they'll do to Wallace and Gromit.",
    "23": "\"Chicken Run\" is one of my favorite stop-motion movies as I really like the characters, the animation, and the narrative. With this sequel after many years, it was entertaining and underrated. The connection between the characters is one of my favorites in the movie.Admittedly, as a huge fan of the original film, I did find myself missing the Earthy textures and rather doomy palette of Tweedy's farm. However, the retina-scorching colours of both the new focal facility and the island on which the chickens call home do a wonderful job of providing a stylistic counterpoint to the nihilism of the story being told.I give this 9/10.",
    "24": "I liked very much the first/original, so I had some expectations regarding this sequel. It is brillantly animated, you can clearly see the progress they made in these 20 years in this field, but this is pretty much the only improvement that I could notice in respect to the original. The plot is quite boring, there are no real interesting twists and the few ones are extremely forced. The voice acting is ok, but not better than that. It is indeed very difficult to create the perfect magical mix that trasforms inanimated puppets in lovable characters playing an interesting story and in this case it did not worked fully, at least for me.",
    "25": "The first Chicken Run film is one I watched repeatedly when I was a kid, so naturally, I was excited to hear about a sequel. This one definitely has a more happy tone than the original because they're living independently on the nature reserve/island/sanctuary, but their way of life is threatened by the appearance of Fun Land Farms nearby. Now I gotta say, although it's not as grim as Tweedy's prison camp farm in the first movie, Fun Land Farms' use of mind control collars to keep their chickens happy and flavorful in this vibrantly colored playground until they march up the stairs to their deep-fried death is incredibly eerie. All in all, the film still holds a lot of the same charm as the first did and I can see many kids enjoying it. I wouldn't say that it's better than the original--very rarely that sequels are-- because there's so much difference in tone and aesthetic.In fact, with enough callbacks and flashback sequences to the first film, Dawn of the Nugget works pretty well on its own. I especially enjoyed the introduction of new characters Molly (Rocky and Ginger's curious daughter) and Frizzle (quirky friend of Molly's from a different farm) as they sort of helped breathe new life into the Chicken Run franchise. Like we know everyone loves to see their favorite characters from the first movie doing their thing, but it's nice to throw some different bits in there, too. After all, they've had over 20 years to ruminate on a new story, haha.In summation, Dawn of the Nugget is a pleasant movie for the whole family and I'm sure die-hard fans of Aardman animation and newcomers alike will enjoy it.",
    "26": "I saw some quite negative reviews, but had promised my kids (7 and 3) that we would watch it together after having shown them the original film a couple of weeks ago. They loved it, and really, so did I. Sure, some voice actors have changed (23 years have passed, so that's ok with me!), but the quality of the clay animations and the fun factor were brilliant and true to the original Wallace and Gromit films of my childhood. I would have given this movie a 7, but the kids prolonged our Netflix showing with the making of before going to bed, and it really shows you the unique skill and love that goes into these stop movie animations. So a 9 from me for the unbelievable effort to detail! Well done!As I tucked my 3 year old son into bed he said « daddy, when I close my eyes, I see chickens » and went to sleep with a smile. So I guess that's a 10 from him.We will be seeing this one again, as a family and with much joy.",
    "27": "I loved all the older stuff by this team as it was fundamentally clever, but this is tedious, dumbed down, achingly predictable, and facile. Perfect for a mass market raised on American swill.The animation is very slick, so much so that I initially thought they'd opted for CGI that simulates claymation, but apparently not. In any case, slick visuals has never made a show more entertaining, just look at anything with Transformers in it!I'm not a fan of many of the voices in this one either. I know it probably sounds like I'm grumbling about change in general, but it's not that. The voices just seem to be lacking character. Or is it just the script? Can't tell, but it's mediocre to bad.",
    "28": "Put me off my lunch I don't like my food having names one scene a chicken got turned into nuggets as I was eating nuggets though mine didn't make me say love you mummy. It reminds me of when I watched Fernando while having a wagyu stake though I finished the whole thing this stopped me eating and rethink my diet i became a meat eater after watching veggie tales and seeing the carrots and how they were but now what do I do can't eat bread since sausage party because that bagle gave me confusing thoughts I'll have to dervert to eating insects on a separate note been told to watch a bugs life so looking forward to that whole minching down on a caterpillar or two. Movie was really good though made me belly laugh a few times 8 stars.",
    "29": "Honestly removing Mel Gibson and Julia Swahala from the voices just ruins the film from the start.Throw in the spoilt brat molly and the film just doesn't get going.. Mr Tweedy has been replaced by some Dark Clay look a like, the magic of the first film was slowly dwindled away within the first few scenes.The storyline isn't too bad, but they breal in the factory, break out, then break back in again but then break out again in force, its just a confusing plot. The best character is Fowler.Overall. It just feels like a film that didnt need to be made other then because someone had an issue with mel gibson so had to replace his voice in a new film.",
    "30": "That chicken escape may not be as great as the first time, but still pretty wild. Chicken Run: Dawn of the Nugget is a very decent sequel. I'll admit that the story does rehash the first film and doesn't really do a lot new for the sequel. But it does have charm with exciting escape and chase scenes, good comedy, some enjoyable characters, and animation that's still amazing even after the first. I think I will make this recommendation. Do you want to watch a Chicken Run sequel, even as someone that highly enjoyed the first film? Maybe you will enjoy it. If you haven't asked for a sequel to it, then maybe watch it at least once just to compare to the first. I may consider this as among the weakest movie from Aardman, but I guess this sequel is pretty enjoyable.",
    "31": "The film is in no way near as original as the first movie. Tough act to follow. I have been a really big fan of the original. However the movie is really entertaining for both kids and grown-ups. It has that great Aardman humor that is really refreshing in modern animation films. It also got a really steady tempo and is not boring at any point. Not too long either. My only problem is the lack of personality in the Human characters. This is where you can feel that the original Aardman guys is not part of the productions. Mrs Tweedy is great as always. More charm and creativity than most of the new Disney, Pixar and Leika films out there.",
    "32": "For me this sequal lived up to my expectations, it was such an easy watch, it had funny little details such as one of the chickens using a hot water bottle to scuba dive & it felt so nostalgic. I loved the fact that it had references to the first movie and the plot having similarities was in keeping with the characters and what they would do. It also makes sense for Molly to want to explore outside of their safe haven so felt very natural to me.The team are honestly so talented for making the movie so seamless and I appreciate how much work it took compared to normal animation it's definitely something to admire/appreciate when reviewing this movie\nI recommend also watching the making of chicken run 2 (or something similar to that title), so interesting!",
    "33": "Following their escape at the end of 'Chicken Run' to an isolated island, Ginger and Rocky have a daughter, Molly, who grows up seeking adventure and finds it in the mainland at the mysterious Fun Land Farms which poses a great danger to all chickens, despite initially appearing like a holiday camp for them.Very silly, great fun nonsense jam packed with all sorts of imaginative ideas and enjoyable characters. The actors, mostly not from the original, do a good job and the last half hour as they try to save Molly and the chickens from a deep fried death is clever and actually quite exciting. As good as, if not slightly better than the original.",
    "34": "In contrast to 2000's Chicken Run, This Successor is a refreshing installment, with some members returning to reprise their roles such as Lynn Ferguson as Mac, Imelda Staunton as Bunty, Jane Horrocks as Babs and Of Course Miranda Richardson as The Malicious Mrs Melisha Tweedy, some actors/actress have come to replace the main counterparts, Thwandie Newton, David Bradley, Zachary Levi, Daniel Mays, Romesh Ranganathan and so forth, Bella Ramsey is set playing the newest member of the flock MollyChicken Run: The Dawn of The Nuggest was fun, exhilirating, one for the whole family to watch, great design of Tweedys new farm, synopsis was essentially revelant and overall a good family made film, something the fans have been waiting over 20 years to see!",
    "35": "Warning - I didn't watch the whole film. In fact I only watched about 15 minutes before having to turn it off because it was so dire. So my review is based on that aloneI'm not sure of the backstory about how this came to be made but after growing up with the delights of Wallace and Grommet, Creatire Comforts, Shaun the Sheep and the first Chicken Run film all with innovative annimation, story lines and quirky British humour this was terrible.Something has gone drastically wrong in the Aardman camp. Some very young children may find it visually entertaining but most adults are going to be deeply disappointed by this blooper.",
    "36": "All these reviews expect so much. They expect the same actors ,which doesn't really happen anymore. They expect the story line to be the same when it left off with them escaping so they had to continue it . As for the chickens living as \"humans\" , what you want them to do? Just walk around and peck the ground. Haha another good thing was the animation was pretty much the same as before ,just a tad more detailed .My family enjoyed the movie and it had a nice story line! I'm glad they made a part 2 to the movie because we just recently watched the first Chicken Run. I didn't even know they were coming out with part 2,because i never seen any previews for the movie . I'm glad i caught the add on Netflix.Don't judge the movie by these other so called \"critics\",watch it for yourself! It's judged too harshly . So pop some popcorn and tune in.",
    "37": "I'm going to be honest since I saw the first image of the movie I screamed with excitement, well Chicken Run is one of my favorite movies of all time and seeing the trailer of the movie made me excited but when the movie finally came out well... .The movie is not bad, but it is not so good either.The pros:\n-impeccable animation\n-good music\n-I like the story\n-ginger, rocky, nick, fettecher, molly, babs, mack are nicecons:\n-molly and frizzle are irritating at times\n-There are convenient moments, because imagine you are in a big problem and out of nowhere the solution appears\n-The final battle could have been better in my opinion\n-Fowler doesn't have much participation because he was talking about a snail\n-a new villain, because it would be more interesting and not boring Miss Tweedy\n-indestructible characters because the protagonists do not die\n-It's not as dark as the first one, the darkest thing is just a random chicken turned into nuggets, but in the first one Miss Tweedy killed a chicken in cold blood and it hurt everyone.",
    "38": "After seeing the first installment of Chicken Run in 2002 (I was 2 yrs old), I was so stunned for what I've witnessed... a masterpiece! Brought myself a question of what if there's a sequel for Chicken Run, sadly there's isn't but, Wallace & Gromit Classics can make me entertained more while still being little upset and hoping for one day, Aardman Studios can make a sequel. Well here we are after over 20 years, the sequel is streaming now and I must say... I love it. I say, watching from both films in one night can make it entertaining little more! Hugh props to the crew & studio for make it happened! But wait...! There's a little easter egg at the last minute from Chicken Run 2 from where the whole colony of chickens come to rescuing other chickens being caged where looking at the top right corner of the bushes, you may see someone who is wearing a villainous outfit... someone's dishwasher gloves!!! W&G, onto the next chapter...",
    "39": "The CGI has absolutely destroyed the legacy of what was a great film. Julia sawalha Should never have been omitted from this film either. The writing is OK but Aardman have sold themselves out on this film. Terrible. It's been so long, and everyone has wanted a follow up film but this massively falls short as it has lost the spirit of the ethics it originally stood for. Bring back the gnarly thumbs on animation and don't try and fob an off with this TV (at best) standard animation. We wanted the tweedy's setup and got the wrong setup. The colours and bright sharpness took everything away from the heart of aardman and what we have all grown up with. This film was basically an extension of one of your Timmy episodes, and even they are better and more wholesome animation.",
    "40": "As an older generation I really really wanted and hoped to like this sequel. But as we al know sequels are hard to get right and few are better then the original.The story for the sequel is fun, but it has een done before. Especially the parent child plot. Where a child wants to go to the place there parent once was. This is done by multiple companies including multiple times by Disney. And we all know or don't want to know anymore how that went. What they could have done to change that is to give child a sibling or a friend on the island.I understand that Rocky is the only rooster next to Fauwler, but still it's 2023 why could he not have chick's? I got the impression that in chicken run he and Bunty were flirting. And then there comes the next question; what happend to the other chicks we see in the end of chicken run? Are we just to assume that they are all born after this movie?Love it that Babs and Bunty are done by the OG actors! But to know that Rocky and Ginger where both replaced....just because for example that Rocky became a father is saddening. I understand you want to reach a new generation, but in my opinion you do that with new characters. And I loved those few new characters.And I'm still left with the question: what happend to mister tweedy? It would have been fun to see a flashback from Mrs Tweedy. I for one want to know what happend after she got smashed by a big door. Instead of me making assumptions.Ofcourse the film has jokes and aardman did what it does best. But it is a oké movie, could I watch it for a second time: I could. Would I say it's the movie of the year? No. But it doesn't have to be.",
    "41": "Story is typical, we've seen it somewhere else before and the dialogue is typical, we've seen it somewhere else before.Voices are great.Facial expressions in the characters are good.Beautiful moving picture.Clever or fun ideas about turning human gadgets into tools for them to use. Like that cloud out of \"wool\"?, with the fans.The funniest thing about this movie is the stupid happy chickens with the creepy voices. One hilarious scene of them is when they are playing mini golf in the playground cage, one chicken is swinging for the ball, three other chickens beside stair intensely at the golf ball thinking probably \"Oh my god it's going to move soon\", the chicken hits everybody in the face with the golf club and they fall flat.Watch it with your family or significant other, it's a silly movie and it'll bring laugh.Probably not a masterpiece, but it's a good movie that doesn't repeat itself or leave you hanging for something to happened.",
    "42": "This film had a strong set up and continued nicely from the first film, but dipped down a bit towards the middle. (No nugget pun intended). It became a typical plan, then escape scenario for the whole middle section with not much else to it, which was still enjoyable, but not as emotionally impactful as the first.I did however, like the ending and how it is different to the first film, which was about saving themselves from the pens, compared to how, by the end of this film, they are saving other chickens across the country. It was a nice progression.It is a shame that the full cast of the last one couldn't return.I Still really enjoyed the film and it is always impressive to see the hard work of stop motion in its final form. It still has that nostalgic feel to it.",
    "43": "This was either written by some 20 y.o. Phone-tapping interns or AI. Zero charm, fake forced cuteness, zero originality, not a single new interesting character, every scene is boring to tears, too much meaningless rambling, a lot of it too British to understand... I can't imagine how can it get any worse.We stopped watching after about 30 minutes. There was absolutely nothing to hold attention. It's generic, boring nothing written by worthless hacks capitalizing on masterpiece written by truly talented people.I had such high hopes. Unfortunately the generations who used to make great movies got squeezed out of the industry by new crop of talentless hacks with zero imagination, life experience who can't write anything worthy to entertain even a 5 y.o.",
    "44": "We wouldn't like kids to view it in case they related to the dark message.Was it made by anti-animal-cruelty activists? That would be o.k. Of course, but cruelty was the message we got so we couldn't say we enjoyed it..Didn't anyone else see it this way?O. K. If the title had hinted that it is \"the thinking person's movie\" and had a warning that it might make children sad, we would have appreciated it for what it is and scored it a nine, Unfortunately, immediately before Nugget, we watched \"Christmas with the Kranks\" which had left us both sad and uplifted at the same time. Parallels can be made between the two. Maybe we should have watched Kranks before Nugget.",
    "45": "That chicken escape may not be as great as the first time, but still pretty wild. Chicken Run: Dawn of the Nugget is a very decent sequel. I'll admit that the story does rehash the first film and doesn't really do a lot new for the sequel. But it does have charm with exciting escape and chase scenes, good comedy, some enjoyable characters, and animation that's still amazing even after the first. I think I will make this recommendation. Do you want to watch a Chicken Run sequel, even as someone that highly enjoyed the first film? Maybe you will enjoy it. If you haven't asked for a sequel to it, then maybe watch it at least once just to compare to the first. I may consider this as among the weakest movie from Aardman, but I guess this sequel is pretty enjoyable.",
    "46": "The film is in no way near as original as the first movie. Tough act to follow. I have been a really big fan of the original. However the movie is really entertaining for both kids and grown-ups. It has that great Aardman humor that is really refreshing in modern animation films. It also got a really steady tempo and is not boring at any point. Not too long either. My only problem is the lack of personality in the Human characters. This is where you can feel that the original Aardman guys is not part of the productions. Mrs Tweedy is great as always. More charm and creativity than most of the new Disney, Pixar and Leika films out there.",
    "47": "For me this sequal lived up to my expectations, it was such an easy watch, it had funny little details such as one of the chickens using a hot water bottle to scuba dive & it felt so nostalgic. I loved the fact that it had references to the first movie and the plot having similarities was in keeping with the characters and what they would do. It also makes sense for Molly to want to explore outside of their safe haven so felt very natural to me.The team are honestly so talented for making the movie so seamless and I appreciate how much work it took compared to normal animation it's definitely something to admire/appreciate when reviewing this movie\nI recommend also watching the making of chicken run 2 (or something similar to that title), so interesting!",
    "48": "Following their escape at the end of 'Chicken Run' to an isolated island, Ginger and Rocky have a daughter, Molly, who grows up seeking adventure and finds it in the mainland at the mysterious Fun Land Farms which poses a great danger to all chickens, despite initially appearing like a holiday camp for them.Very silly, great fun nonsense jam packed with all sorts of imaginative ideas and enjoyable characters. The actors, mostly not from the original, do a good job and the last half hour as they try to save Molly and the chickens from a deep fried death is clever and actually quite exciting. As good as, if not slightly better than the original.",
    "49": "In contrast to 2000's Chicken Run, This Successor is a refreshing installment, with some members returning to reprise their roles such as Lynn Ferguson as Mac, Imelda Staunton as Bunty, Jane Horrocks as Babs and Of Course Miranda Richardson as The Malicious Mrs Melisha Tweedy, some actors/actress have come to replace the main counterparts, Thwandie Newton, David Bradley, Zachary Levi, Daniel Mays, Romesh Ranganathan and so forth, Bella Ramsey is set playing the newest member of the flock MollyChicken Run: The Dawn of The Nuggest was fun, exhilirating, one for the whole family to watch, great design of Tweedys new farm, synopsis was essentially revelant and overall a good family made film, something the fans have been waiting over 20 years to see!",
    "50": "Warning - I didn't watch the whole film. In fact I only watched about 15 minutes before having to turn it off because it was so dire. So my review is based on that aloneI'm not sure of the backstory about how this came to be made but after growing up with the delights of Wallace and Grommet, Creatire Comforts, Shaun the Sheep and the first Chicken Run film all with innovative annimation, story lines and quirky British humour this was terrible.Something has gone drastically wrong in the Aardman camp. Some very young children may find it visually entertaining but most adults are going to be deeply disappointed by this blooper.",
    "51": "All these reviews expect so much. They expect the same actors ,which doesn't really happen anymore. They expect the story line to be the same when it left off with them escaping so they had to continue it . As for the chickens living as \"humans\" , what you want them to do? Just walk around and peck the ground. Haha another good thing was the animation was pretty much the same as before ,just a tad more detailed .My family enjoyed the movie and it had a nice story line! I'm glad they made a part 2 to the movie because we just recently watched the first Chicken Run. I didn't even know they were coming out with part 2,because i never seen any previews for the movie . I'm glad i caught the add on Netflix.Don't judge the movie by these other so called \"critics\",watch it for yourself! It's judged too harshly . So pop some popcorn and tune in.",
    "52": "I'm going to be honest since I saw the first image of the movie I screamed with excitement, well Chicken Run is one of my favorite movies of all time and seeing the trailer of the movie made me excited but when the movie finally came out well... .The movie is not bad, but it is not so good either.The pros:\n-impeccable animation\n-good music\n-I like the story\n-ginger, rocky, nick, fettecher, molly, babs, mack are nicecons:\n-molly and frizzle are irritating at times\n-There are convenient moments, because imagine you are in a big problem and out of nowhere the solution appears\n-The final battle could have been better in my opinion\n-Fowler doesn't have much participation because he was talking about a snail\n-a new villain, because it would be more interesting and not boring Miss Tweedy\n-indestructible characters because the protagonists do not die\n-It's not as dark as the first one, the darkest thing is just a random chicken turned into nuggets, but in the first one Miss Tweedy killed a chicken in cold blood and it hurt everyone.",
    "53": "After seeing the first installment of Chicken Run in 2002 (I was 2 yrs old), I was so stunned for what I've witnessed... a masterpiece! Brought myself a question of what if there's a sequel for Chicken Run, sadly there's isn't but, Wallace & Gromit Classics can make me entertained more while still being little upset and hoping for one day, Aardman Studios can make a sequel. Well here we are after over 20 years, the sequel is streaming now and I must say... I love it. I say, watching from both films in one night can make it entertaining little more! Hugh props to the crew & studio for make it happened! But wait...! There's a little easter egg at the last minute from Chicken Run 2 from where the whole colony of chickens come to rescuing other chickens being caged where looking at the top right corner of the bushes, you may see someone who is wearing a villainous outfit... someone's dishwasher gloves!!! W&G, onto the next chapter...",
    "54": "The CGI has absolutely destroyed the legacy of what was a great film. Julia sawalha Should never have been omitted from this film either. The writing is OK but Aardman have sold themselves out on this film. Terrible. It's been so long, and everyone has wanted a follow up film but this massively falls short as it has lost the spirit of the ethics it originally stood for. Bring back the gnarly thumbs on animation and don't try and fob an off with this TV (at best) standard animation. We wanted the tweedy's setup and got the wrong setup. The colours and bright sharpness took everything away from the heart of aardman and what we have all grown up with. This film was basically an extension of one of your Timmy episodes, and even they are better and more wholesome animation.",
    "55": "As an older generation I really really wanted and hoped to like this sequel. But as we al know sequels are hard to get right and few are better then the original.The story for the sequel is fun, but it has een done before. Especially the parent child plot. Where a child wants to go to the place there parent once was. This is done by multiple companies including multiple times by Disney. And we all know or don't want to know anymore how that went. What they could have done to change that is to give child a sibling or a friend on the island.I understand that Rocky is the only rooster next to Fauwler, but still it's 2023 why could he not have chick's? I got the impression that in chicken run he and Bunty were flirting. And then there comes the next question; what happend to the other chicks we see in the end of chicken run? Are we just to assume that they are all born after this movie?Love it that Babs and Bunty are done by the OG actors! But to know that Rocky and Ginger where both replaced....just because for example that Rocky became a father is saddening. I understand you want to reach a new generation, but in my opinion you do that with new characters. And I loved those few new characters.And I'm still left with the question: what happend to mister tweedy? It would have been fun to see a flashback from Mrs Tweedy. I for one want to know what happend after she got smashed by a big door. Instead of me making assumptions.Ofcourse the film has jokes and aardman did what it does best. But it is a oké movie, could I watch it for a second time: I could. Would I say it's the movie of the year? No. But it doesn't have to be.",
    "56": "Story is typical, we've seen it somewhere else before and the dialogue is typical, we've seen it somewhere else before.Voices are great.Facial expressions in the characters are good.Beautiful moving picture.Clever or fun ideas about turning human gadgets into tools for them to use. Like that cloud out of \"wool\"?, with the fans.The funniest thing about this movie is the stupid happy chickens with the creepy voices. One hilarious scene of them is when they are playing mini golf in the playground cage, one chicken is swinging for the ball, three other chickens beside stair intensely at the golf ball thinking probably \"Oh my god it's going to move soon\", the chicken hits everybody in the face with the golf club and they fall flat.Watch it with your family or significant other, it's a silly movie and it'll bring laugh.Probably not a masterpiece, but it's a good movie that doesn't repeat itself or leave you hanging for something to happened.",
    "57": "This film had a strong set up and continued nicely from the first film, but dipped down a bit towards the middle. (No nugget pun intended). It became a typical plan, then escape scenario for the whole middle section with not much else to it, which was still enjoyable, but not as emotionally impactful as the first.I did however, like the ending and how it is different to the first film, which was about saving themselves from the pens, compared to how, by the end of this film, they are saving other chickens across the country. It was a nice progression.It is a shame that the full cast of the last one couldn't return.I Still really enjoyed the film and it is always impressive to see the hard work of stop motion in its final form. It still has that nostalgic feel to it.",
    "58": "This was either written by some 20 y.o. Phone-tapping interns or AI. Zero charm, fake forced cuteness, zero originality, not a single new interesting character, every scene is boring to tears, too much meaningless rambling, a lot of it too British to understand... I can't imagine how can it get any worse.We stopped watching after about 30 minutes. There was absolutely nothing to hold attention. It's generic, boring nothing written by worthless hacks capitalizing on masterpiece written by truly talented people.I had such high hopes. Unfortunately the generations who used to make great movies got squeezed out of the industry by new crop of talentless hacks with zero imagination, life experience who can't write anything worthy to entertain even a 5 y.o.",
    "59": "We wouldn't like kids to view it in case they related to the dark message.Was it made by anti-animal-cruelty activists? That would be o.k. Of course, but cruelty was the message we got so we couldn't say we enjoyed it..Didn't anyone else see it this way?O. K. If the title had hinted that it is \"the thinking person's movie\" and had a warning that it might make children sad, we would have appreciated it for what it is and scored it a nine, Unfortunately, immediately before Nugget, we watched \"Christmas with the Kranks\" which had left us both sad and uplifted at the same time. Parallels can be made between the two. Maybe we should have watched Kranks before Nugget.",
    "60": "Aardman Animations, personally, is a hit or miss for me as in the past, they have created some great works like Wallace & Gromit, Shaun the Sheep and so forth. But at the same time, they have made some pretty mediocre or pretty bad works too. \"Chicken Run\" is one of my favorite stop-motion movies as I really like the characters, the animation, and the narrative. With this sequel coming out after many years, it was entertaining but it was a bit underwhelming.Throughout, the stop-motion animation, character models, and colors are amazing as Aardman continues to provide great clay animation. Aardman always provides some great animation and the models, colors, sound designs, and the movements are all excellent. We get to see the same characters from the previous movie and it was fun to see them communicate, move around and observe their actions throughout. The voice performances from the cast members were solid as they provided some good voice works, although a few voice performances weren't great. The soundtrack is pretty good and there are some decent humor moments that I chuckled at.With the narrative continuing from the previous movie, the narrative explores some new concepts and territories within the setting and characters and there are some aspects that were interesting but some not so much. Certain new concepts that were explored I felt weren't strong enough and at times, it really feels like a rehash of the first movie. On the characters, there are new characters that are introduced but unfortunately, none of the new characters weren't really interesting since they felt a bit dull and kind of annoying at times. Because this is a new cast, I personally felt while the original characters are still fun, the chemistry and energy of what made them fun from the first movie felt a bit lacking. The soundtrack is okay and there are some solid dialogue moments while being a bit clunky.Despite my gripes, I still was interested to see where the movie goes and for what it is, it's a decent sequel. Overall, it is entertaining and it's nice to see the characters again, but I wish it could have been better.",
    "61": "I was keen to see this movie, as I loved the original Chicken Run.It's a long time since the first movie, so naturally the voice actors have changed. This was OK, except I thought Thandiwe Newton sounded a bit too \" posh\" to play Ginger. I got used to it (love Thandiwe!), but I did miss Julia Sawalha and I think the original had a better cast.The main problem for me was the way the chickens are now portrayed. In the first movie, they were hens living at a poultry farm, having to lay a certain number of eggs each day, or risk getting topped by the farmer's wife. So they were basically chickens living like chickens. What made it amusing, of course, was the hens' human qualities, and the fact that whole thing ran like the satirisation of a prisoner-of-war escape movie.However in the sequel, all pretence at \"chicken life\" has gone; the chickens live exactly like humans, and are in effect just humans who look like chickens. Egg laying is a rare event; it's all farming and building and lounging in deck chairs sipping drinks. The spivvy rats with their dodgy goods are now lovable. And to make matters worse, Rocky and Ginger have a ghastly brat of a kid called Molly.As the plot of this movie is also pretty weak, I found it hard to get involved. God forgive me, I was dying for Molly to get turned into a chicken nugget.Didn't work for me. I find it hard to care about chickens who have turned into humans.",
    "62": "This sequel to 'Chicken Run' arrives after 23 years, but don't worry, being animated the returning cast haven't aged a bit! Although the story picks up where the original left off, this is an entirely new adventure and you don't really have to see the first film to follow the story, although it is highly recommended. The opening to 'Chicken Run: Dawn of the Nugget' recaps the events of the first film in a nutshell.The chickens are living happily on an island away from humans, and Ginger and Rocky starts a family. Their daughter is Molly. No sooner has she become a teenager than she becomes curious about the world and what lies on the other side of the lake. When trucks arrive and start clearing the forest, the chickens devise a plan to shelter themselves from human vision, but Molly wants to explore...and so she does.She befriends a chicken named Frizzle, and together the head to Fun-Land Farms where they believe chickens to live happy lives, according to an advert they saw. Off course the farms are not what it seems, and they soon get into trouble.It's up to Ginger, Rocky and some of their friends to save them. Last time they broke out of a chicken farm; this time they're breaking in. A familiar antagonist from the first film returns, as well, but I won't spoil it for you.I enjoyed the stop-motion animation, the characters, their adventures, and the humour. This is a delightful film young and old can enjoy. The film also illustrates how the younger generation are not always appreciative of what their parents went through to ensure their survival, and I don't think youngsters watching this will fully understand. These are lessons a mature audience will relate to.As much as I enjoyed 'Chicken Run: Dawn of the Nugget', I enjoyed 'Chicken Run' more, because it was simpler and funnier.",
    "63": "There are some prequels or sequels that no one asked for, but end up being happy that they happened anyway.This sadly isn't one one of them.I was already upset by the fact that many of the core voice actors were being replaced. Mel Gibson I could understand for obvious reasons, but the excuse for Julie Sawalha's exclusion was not acceptable. I do believe the real reason was because Sawalha is no longer famous, while Thandi (or Thandiwe) Newton, her replacement, is a big name in the industry. This is a growing trend in modern animation where famous actors are favoured to voice cartoon characters rather than actual voice actors.At one point Ginger fearfully says \"that voice!\" before the reveal of the return of Mrs Tweedy. It would have been extremely awkward if Miranda Richardson was no longer voicing the villain.The story itself is a little too similar to the first Chicken Run and the animation looks too shiny and CGIed, despite most of it being clay-animation. The stakes were not really as high, and the characters were not as fleshed out as they were in the first film.My favourite character is still Fowler, as he was still hilarious. And unlike the new voices for the other main characters, David Bradley does a great job here.The humour in the first film was intelligent and witty. But despite most of the film still being proudly British (even including a chicken character with a Scouse accent)\n, the magic and the passion found in the first film has dampened down quite a lot here.Kids will no doubt enjoy it. But after 23 years, I wasn't all that impressed.",
    "64": "The stop motion is always on point. Impressive, when you think about how much time goes into it.If you work really hard, you can probably scrape together some respect for the production, but that might be the only feeling you can evoke. The voice acting isn't great, and not just because the original actors are missing. There's a strange disconnect between the animation and the acting, it feels insincere and forced.The story is nothing new, and it should have been. It should have broke new ground just as the original did. It really feels like they put no effort into creating an original plot and just clung to the coat tales of the first film. Seems like a bad choice.I want to write something positive about it but I don't really know what that could be. I guess Bella Ramsey was good casting. I'm only giving it 5 stars because I appreciate the time it takes to make stop motion.",
    "65": "I don't know what to say, I've been looking forward to this for ages and after watching it, Wow!The voice acting is awful, they've changed some of the original actors and they're not even close, it's jarring, whoever voices Ginger is awful, talk about phoning in a performance and Rocky sounds like a completely different character.The animation looks like made for TV stuff, really cheap and devoid of the originals charm, the story is okay and will no doubt keep kids occupied but for adults, there's nothing here where as the first one had loads of adult humour.This is far from the worst thing I've seen but Wow is it a massive step down from the original, really disappointing. Still good to see Mrs Tweedy return though so that's at least one plus.",
    "66": "Some time after the escape from Tweedy's Farm, Ginger (Thandiwe Newton) is now living with her husband Rocky (Zachary Levi) along with the others who escaped on their secluded island hideaway. As Ginger and Rocky welcome their daughter Molly (Bella Ramsey) into their family, Molly grows up brave, adventurous, and curious often to the worry of Ginger as Molly shows interest in the other side of the water where Ginger and company escaped from and tries to dissuade Molly's interest without success. When Molly runs away from the island she meets up with another young runaway chicken named Frizzle (Josie Segwick-Davies) with the two soon coming across a delivery truck to Fun-Land Farms that Molly and Frizzle believe is a Chicken's paradise but is in fact something far more sinister. As Ginger, Rocky and several others follow Molly in order to rescue her from Fun-Land Farms, they soon cross paths with an old enemy.Chicken Run: Dawn of the Nugget is the latest animated feature from Aarman Productions and the sequel to the studio's top grossing film, Chicken Run from 2000, which has the distinction of being the highest grossing stop-motion feature of all time earning over $200 million worldwide which has yet to be topped in the years since. Beginning development in 2018 with Netflix acquiring the distribution rights in 2020 with Aardman and the streamer having developed a relationship with the Christmas special Robin Robin as well as a forthcoming Wallace and Gromit feature. Now after 5 years of development and production, I'm happy to report that Chicken Run: Dawn of the Nugget has all the right ingredient for not just a strong Aardman production, but a great feature in its own right.Needless to say Aardman's features are always rich in details and life and that's no less the case here with the opening scenes on Chicken Island creatively realized with how they've established this village with all manner of structures and mechanisms that carry with them a warm and tangible quality in how lovingly every facet of this world is crafted. The character models are nicely distinct with the main cast given distinct visual identities to compliment the voice acting and even if the movie were put on mute you'd be able to tell their personalities apart with no issue. While the producer's treatment of Ginger's former voice actress Julia Sawalha is certainly a shame, Thanidwe Newton does well stepping in for the character and brings the same level of determined energy to the character with this follow-up doing a good job of setting up Ginger being at odds with her daughter Molly who is ably played by Bella Ramsey. Imelda Staunton, Lynn Ferguson, and Jane Horrocks are all welcome returns as Bunty, Mac, and Babs respectively with Horrocks in particular scoring more than a few laughs from her charming ditziness, though I will admit their return here does feel like an indictment against Aardman's decision to recast Sawalha.In terms of story, Dawn of the Nugget includes a nice analysis of Ginger's character in how she's protecting Molly from the real world and her attempts to leave the past behind end up driving a wedge between her and Molly that serves as the inciting incident for what happens. While to a degree there is a \"here we go again\" element to the story especially with the line where Ginger says \"last time we broke out of a chicken farm, this time we're breaking in\" it never feels like a rehash especially since Aarman have more resources on hand this time around and get creative with the Fun-Land Farms setting. If the original Chicken Run was very much modeled after World War II POW films like Stalag 17 and The Great Escape, Dawn of the Nugget takes itself to a more over the top retro sci-fi place. Fun-Land Farms is gloriously designed as it's very much a mixture of a Bond villain's lair and a 1970s dystopian sci-fi film (with the \"selection scene\" almost reminiscent of Carousel from Logan's Run) and the contrast of the overly warm and friendly insides of the farm with the colder and exaggeratedly brutalist exteriors make for a really fun environment. I do wish the marketing hadn't spoiled the return of a prominent character (if you've seen the trailer you know what I'm talking about), but there's definitely some good work regardless and we get a very amusing pair of villains that we love to hate.I really enjoyed Dawn of the Nugget. While I was initially skeptical in a Chicken Run sequel 25 years after the fact, I'm pleased to say that it's probably as good if not better than its predecessor in both a technical level and a story and character level. Definitely recommended.",
    "67": "\"Chicken Run: Dawn of the Nugget\" is the sequel to the 2000 Aardman Animations film \"Chicken Run\". Featuring the voices of Thandiwe Newton, Zachary Levi, Bella Ramsey, and Miranda Richardson, it is an amusing, albeit unnecessary follow-up to the original film that still manages to be entertaining.Sometime after the events of the first film, the freed chickens of Mr. And Mrs. Tweedy's Farm have all settled into their new lives on an island far away from humans. Ginger (voiced by Thandiwe Newton) and Rocky (voiced by Zachary Levi) have since become a family after their daughter Molly (voiced by Bella Ramsey) hatches from an egg. As she grows older, Molly becomes more curious about life outside the island, and one night decides to ignore her parents' warnings and sneak out across to the mainland. The next day, Ginger and Rocky learn of Molly's disappearance and set out with a group of other chickens to look for her. Meanwhile, Molly has been captured and taken to Fun-Land Farms, a technologically advanced chicken farm operated by Mrs. Tweedy (voiced by Miranda Richardson) and her new husband Dr. Fry (voiced by Nick Mohammad). Upon learning of this, Ginger, Rocky, and the rest of their team quickly conspire a plan to break into the heavily guarded farm and rescue Molly before she is turned into chicken nuggets.One notable animation style that I think ages well is claymation, which when done right can give the product in question a timeless presentation. The British studio Aardman Animations has been using this particular technique since their founding over 50 years ago, producing many short films, advertisements, and opening titles for TV shows. In 2000, Aardman created their first feature length film \"Chicken Run\", a story about a group of chickens who plot an escape from their farm before their tyrannical owner can turn each of them into pies. Even more than 20 years later, \"Chicken Run\" still holds the record for the highest grossing stop-motion animated film of all time, and remains a favourite among viewers of all ages. In 2023, Aardman released a sequel titled \"Chicken Run: Dawn of the Nugget\", which retains most of the charm of the original, despite having little reason to exist in the first place.For those who haven't seen the original, things were wrapped up pretty nicely at the end so it seems like a strange decision to want to continue things from there. With that in mind, this sequel does a decent enough job of establishing a follow-up story to justify another film. We see that the chickens are now living in a carefree utopian society, and Ginger and Rocky are now parents to the inquisitive Molly, who has no idea about life outside of their current peaceful existence. It is here we learn that Ginger suffers from PTSD related to the events of the previous film, making her reluctant to talk to her young daughter about what lies beyond their idyllic island home. As a result, Molly's curiosity grows even stronger, frequently relying on information about the outside world from the chickens' rat associates Nick and Fetcher. I liked that the film told things mostly from Molly's perspective, reflecting that younger generations often have no idea how much easier they have it than their parents in some regards, and her interest in finding out for herself helps set the plot in motion.As mentioned earlier, Aardman films are renowned for their claymation art style, and this film is one of their best looking yet. Nearly every frame of this movie is so bright and colourful that it's hard to look away at times. Best of all, the set-design was crafted by hand in a studio as opposed to CGI added in post-production, which of course makes the film look even better. I also found myself observing all of the everyday items that were being used as props, like a spoon as a shovel (which was also done in the original film) or an egg holder as a drinking cup. Like all of Aardman's productions, the film has a distinctly British feel. The humour is dry and witty, and the quirky personalities of the chickens allows for the odd chuckle at the expense of the situations they land themselves in. It pleases me that Aardman have always stayed true to their British roots, never allowing any blatant Americanisation of their work to compromise their vision.Although the voice acting was very good all round, I still can't help but feel sad that some of the main characters from the original film had their actors recast. Thandiwe Newton has replaced Julia Sawalha as Ginger, and while I did like the level of emotion Newton brought to the role during her parental scenes with Molly, it would have been nice if Sawalha had returned to the part instead. Allegedly, Sawahla was replaced due to her sounding \"too old\" for the character, which is why it seems weird that the filmmakers cast Newton over her, who is only four years younger and sounds slightly different. To add to the confusion, there are flashback scenes to the first film that have dialogue from Sawalha's Ginger that cut back to modern day with Newton's Ginger, making the vocal differences particularly noticeable.Similarly, Zachary Levi takes over from Mel Gibson as Rocky, who also does a reasonable job but doesn't reach the level of charisma as his predecessor. Gibson has always had a unique style of confidence that shone through in his depiction of Rocky, which Levi unfortunately is unable to replicate. Of course, it makes sense for Gibson to have been replaced considering his controversial past, but that just means Rocky will never feel the same way as he once was. Other actors have been replaced as well, like David Bradley voicing Fowler instead of Benjamin Whitrow, who passed away in 2017, as well as Timothy Spall as Nick and Phil Daniels as Fetcher, who are now voiced by Romesh Ranganathan and Daniel Mays, respectively.Fortunately, Jane Horrocks, Imelda Staunton, Lynn Ferguson, and Miranda Richardson all managed to return to reprise their respective roles as Babs, Bunty, Mac, and Mrs. Tweedy. If there were one other cast member I'm most glad was able to come back, it would be Miranda Richardson, as it was her intimidating performance as Mrs. Tweedy in the first film that made her such a memorable villain in the first place. This time, her hatred of chickens feels more personal as a result of the events that took place previously. She's much smarter and more conniving than before, fully aware that the chickens are not as dumb as she initially thought, which is notably reflected in the scenes where she fights back against Ginger. It's worth noting that Mrs. Tweedy has a different husband in this film, which means that she and Mr. Tweedy either got divorced or he died off-screen somehow (Mr. Tweedy's voice actor Tony Haygarth died in 2017 so the latter reason is plausible).However, it's not all bad news regarding the cast as I did enjoy Bella Ramsey's performance as Molly, the adventurous daughter of Ginger and Rocky. It was quite cute to see Molly taking an interest in the world around her and Ramsey helps bring a likeable curiosity to this character and why she wants to step outside her comfort zone. At first, I was concerned that Molly would be another perfect \"Mary Sue\" type protagonist, but she actually struggles throughout her journey quite often, learning that things aren't always going to go her way and that she needs to work hard to overcome any adversity she faces. Some of the film's best scenes are with Molly and her mother, the latter of whom understands what it is like to long for a different life beyond where she is now.For a belated sequel that didn't really need to exist, \"Chicken Run: Dawn of the Nugget\" is a fun ride that fans of the original can appreciate for its impressive claymation effects and signature sense of humour. Though it could have been better in places, there's no denying that the film's appeal is more than enough to reach both children and adults alike. It's crazy to think that people like myself who were kids when the original came out are now old enough to have kids of their own, so any Millennial-aged parents showing this film to their children are sure to have an enjoyable time watching this one together as a family. And for that reason alone, I would say the film has accomplished its goal.I rate it 7.5/10.",
    "68": "23 years after Aardman's big leap to the big screen, Chicken Run returns in a sequel that takes the chicken story to another level. The production of this film is much more meticulous and larger than the previous one. The characters now face something much bigger that the production took a long time to build. It begins when it seems like everything was over at the end of the previous film. Rocky and Ginger are now parents, but it is clear that Ginger is still affected by the events of the previous film to the point of not letting young Mollie explore the outside world. While the film respects the characters' personalities, young Mollie is a mix of her parents' personalities. She has the attitude of Rocky and the spirit of Ginger. Bella Ramsey gives Mollie an air almost similar to that of Ellie in The Last of Us. What sets off the events of the story may feel like Mollie's fault, but this is one of those stories where the parents' actions are also part of the triggering factor. Ginger's desire to protect Mollie is noble, but hiding the truth is sometimes not the right way to protect young ones. The atmosphere of the film is more technological and there are moments that are reminiscent of Mission Impossible. There is more orientation towards humor or it does not have that social allegory that the previous film had, but the concept of the chickens wanting to confront the food chain remains intact because they feel that being food for humans is an act of oppression against it. From beginning to end, there is the idea that the chickens become a resistance or rebel group, giving a nod to that social allegory that the original film has. Dawn Of The Nugget is an acceptable sequel that expands this story, even though it seems that the conclusion of the first film was definitive. It is clear that sometimes there is something more after \"Happily ever after\" and that they are not always the definitive conclusion. My final rating for this movie is a 9/10.",
    "69": "Looks like the creators didn't learn anything from the failure of Early Man (2018). A successful family animation needs to engage folks of any and all ages - the first Chicken Run did to a good extent. This one didn't. Ditto Early Man.Audiences want to see relatable settings, characters with soul, plots that are realistically challenging (not pointlessly ridiculous). So we end up with a colourful bland bright happy island commune ... overdone, unrelatable and boring. Then we get a silly super high tech robots and gadgets filled chicken farm/factory - huh? And football matches in prehistoric Early Man? Huh?From the short documentary on 'the making of' its immediately clear the creators and team spent a massive 99% effort on the puppeting, the sets, the lighting, the movements, the look of things - which is fine, except, where's the effort on the story, the characters, the soul of the whole thing??The director even laughed at how fun it was to give Ms Tweedy a glam look - but hello mister - did you ask yourself what the viewers want out of a once iconic scary evil character like her? A glam up look? Really?It does seem all the people involved in this - many very competent in their area of specialty - was more focused on putting out their best on producing their area of specialty than making an animated movie that truly relates to the audience.For instance so much technical deal and effort was made of Tweedy walking down glass steps - if the story and plotting was better it wouldn't have mattered if she was walking down milk carton cutouts with average lighting and a less smooth gait.Do please spend more thought and effort on plotting and characters and audience impact, and less on the visual razzle dazzle.",
    "70": "I wanted to love this as much as the original! I was really excited to queue it up... within minutes it was clear it wasn't remotely close.The main change is the voice acting and pace.The acting is flat and comes across slow paced and like reading a script. It makes the characters hard to buy into. The main characters voices have been changed and it's jarring.New characters add little to the story and I didn't warm to any of them.I found it was now very much for young kids only and lacked the organic humour of the first film.It's clear the production quality has gone from movie to made for tv on a low budget.One to miss.",
    "71": "I give a lot of flak to Disney fangirls who claim to have \"waited their whole lives\" for a sequel to one of their childhood faves that only just was announced (with no other sign that the story required completion). But with this follow-up to Aardman Animation's Chicken Run, y'all almost got me.Chicken Run was the first movie I ever saw in a theater and, for whatever reason, I couldn't stop rewatching it once it came out on VHS (and when the Swedish dub was over, I'd happily move on to the English version, which was on the same tape). I can definitely recall wanting more and, sadist that I was, even wishing for the return of Mrs. Tweedy -- one of the most ruthless of all animated villains -- so that she may exact revenge.Well, now there's Dawn of the Nugget, and while I'd stopped pining for a sequel years ago -- having learned, as most adults do, that sequels aren't automatically a positive and, in fact, often a negative -- the sequel in question did seem to get a lot right.In terms of animation, Dawn of the Nugget certainly doesn't betray the original film (everyone looks exactly as I remember them; I was never as put off as when I saw the Wallace & Gromit film when I was younger, disappointed that they gave Wallace that weird overbite), but it's too brightly lit and bouncy to ever achieve the original film's atmosphere. What's worse, there's little depth to the characters and the story.It just sort of goes through the motions of a Finding Nemo-type get-back-home plot (with a few tropes that recall Disney direct-to-video sequels), meaning it also fails to stand out from the kiddie-film competition the way the first movie did with its Great Escape homage. (Note that the new film is about breaking INTO Tweedy's place of business -- now it's a nugget factory that seems curiously high-tech for a franchise I always thought was set in 1950s rural England.) The darkness and urgency of the original can only be seen in the various in-your-face flashbacks and Member Berry clips.I'm also a bit mixed on the vocal performances. It's great to hear Miranda Richardson, Imelda Staunton, Lynn Ferguson, and Jane Horrocks again, and Thandiwe Newton and David Bradley constitute decent replacements, but boy do I not understand replacing Mel Gibson with Zachary Levy of all people.For what it's worth, in a climate where the term \"Netflix original\" seems to have gone back to having about the same right to it as \"direct-to-video\", I'd say Dawn of the Nugget is the perfect film to put on there.",
    "72": "So much of what makes Aardman great is the clever and hilarious humour and creative storytelling, none of which felt represented here. I so badly wanted to enjoy this movie after loving the first one as a child (and as an adult), but this sequel lacked almost everything I loved about the first.What made the first movie so memorable is the dark subject matter and the lightness of the humour, working together. A chicken farm allegory for a prisoner of war camp, made child-friendly?? It was such a reach, and unique idea, made amazing by the silliness of the visuals and the comedy to balance the severe subject matter. By the end of the film, you SO badly wanted them to succeed. This lacked all of that. It was basically the same \"prison escape\" premise, but watered down beyond any recognition. I couldnt have cared less about the characters by the end.The comedy was also lacking. I chuckled once, that was it. Nothing overly clever, and the characters lacked all their unique funny qualities from the first movie. Rocky was particularly annoying.It sounds dumb, but the human-chicken interactions also were super weird. The whole humour of the first movie was how the husband was the only one seeing their human-like behaviour, which was a whole source of comedy in itself, but this time the chickens were already humanised? Treated as intelligent from the get-go, it made for a weird dynamic. It was like all the fundamentals from the first movie weren't respected or carried forward. So many opportunities for comedy, nuance or story, lost.It felt like a cheap TV-made special made exclusively for younger children. The only positive things I can really say is that the quality of the animation is impeccable, as usual, and the child characters were pretty delightful. Otherwise, a pretty big disappointment..",
    "73": "'Chicken Run: Dawn Of The Nugget (2023)' is the long-awaited belated sequel to 'Chicken Run (2000)', Aardman's earliest feature-length film. The picture isn't a patch on its predecessor, but before I can give my thoughts on it, I first need to address the elephant in the room. Mr. Elephant, please leave so I can get this review done. Okay, now that he's out of here, I'll touch on perhaps the only controversial aspect about the picture. The filmmakers (or at least their new Netflix overlords) made the baffling (and, frankly, mean) decision to recast the protagonist, Ginger, simply because original voice actor Julia Sawalha apparently sounds \"too old\" now. The even more baffling thing is that they not only opted to keep the rest of the cast largely in tact even though most of them sound considerably older than they did in the first flick (which is, I want to be clear, absolutely fine), but also to cast someone a mere four years younger. Now, I love Thandiwe Newton as much as the next guy, but the reason for her inclusion is simply unacceptable (which isn't her fault, of course). Furthermore, it's constantly distracting that the main character no longer sounds anything like she did before when most of the people around her sound, well, almost exactly like they did before. It's not as if Newton delivers a bad performance and I don't think it would have been a good idea for her to try to mimic the tonality of the original voice work, but her vocals don't scratch that same itch and actually go some way (along with the writing) in making the protagonist's characterisation tangibly feel somewhat different. What makes all of this worse is the fact that they didn't even contact her to let her know they wouldn't be offering her the role and she had to find out the same way everyone else did. Plus, it seems as though she would have been up for returning if they did ask her to. It's just a really poor decision on the part of the filmmakers and it does leave a sour taste in your mouth, which is bad for everyone involved (Newton definitely doesn't deserved to get bogged down in all this drama). There are some other parts that have been recast but these are mostly welcome. It's a shame that Timothy Spall and Phil Daniels didn't return as Nick and Fletcher, but Romesh Ranganathan is almost a dead ringer for Spall and it's always good to see - or hear - Daniel Mays. David Bradley is brought in to replace Benjamin Whitrow who passed away in 2017, and he confidently maintains the spirit of the role while putting in an entertaining effort of his own. Mel Gibson is given the boot (good) in favour of Zachary Levi (bad), but I don't think anyone blames them for not putting that guy in a children's movie.The film itself isn't bad. In fact, it's perfectly fine. However, perfectly fine isn't good enough when it comes to Aardman, who are typically effortlessly charming even on their bad days. The movie feels very sanitised and safe when compared to the first, which has an underlying grit to it primarily because of its POW camp setting (in terms of both narrative and aesthetic). This is much more colourful and bouncy and traditionally 'kiddy', despite featuring the same underlying stakes (chicken being killed for human consumption). It often feels like a bit of a sci-fi flick, in a way, with designs reminiscent of the more ridiculous '007' movies (or, perhaps more accurately, parodies of them). It's all fine in theory, but it undeniably makes for a less compelling vibe. It sands the edges off the concept and style, so much so that the piece kind of loses its identity and blends with the current slate of generic animated efforts (which is all the more disappointing when you consider how iconic the original still is). Having said all that, the animation on display here is arguably Aardman's most ambitious. They pull off everything they set out to achieve in this respect, too; the thing looks so good you could swear it was created in a computer. There's something so special about the tactility that comes with claymation, and the literal hand-crafted nature of the flick does shine through most of the time (despite things feeling somewhat artificial on occasion). The best sequences are easily the set-pieces, which - while never as memorable as the first flick's masterful pie-machine segment - are often free-flowing, energetic and enjoyable. There are also a handful of rock-solid sight gags and puns, jokes which remind you just how uniquely funny this studio can be. The things in-between the best bits aren't particularly bad, but they aren't particularly good, either. The story itself is very simple, playing with expected themes surrounding the new family situation of its lead, and it follows the classic sequel formula of taking the most memorable characters and sending them on a road trip of sorts while also introducing a couple of newbies who will hopefully become as well-liked as the series stalwarts. It also makes the classic mistake of reducing its side players to their most basic versions, playing up elements which seemed to have connect with the fans without really taking the time to understand why they worked so well in the first place. For instance, Babs has been reduced to being dim-witted rather than naive and her misunderstandings are overplayed to the point of they kind of start to cheapen her character. Elements such as this start to stack up, giving the overall experience a bit of a second-rate feel.Ultimately, this is an unnecessary and mostly unexciting sequel that has its moments but isn't something I can see myself returning to in the future. In all honesty, it's probably my least favourite effort from Aardman. That doesn't mean there isn't some value here, and it's worth a watch if you're a fan of the original. You may find something more to like, or you may be disappointed. It's passively entertaining, but utterly forgettable. While there are certainly worse films out there (a lot of those are Netflix originals, too), this is just an unremarkable effort that doesn't live up to the standard set by its predecessor.",
    "74": "I find Chicken Run: Dawn Of The Nugget is very good, Because the animation is splendid. Unlike its predecessor is taking place in the 1950's, it's also very dark, edgy and it's a spoof of The Great Escape (1963). But this sequel is taking place in the 1960's, it's also a spoof of espionage media genre like James Bond, Austin Powers, Charlie's Angels, Joe 90, Totally Spies, Mission Impossible, Johnny English, Kim Possible, Spy Kids and Codename: Kids Next Door. The main protagonists are Ginger, who is Molly's British mother. Rocky Rhodes, who is Molly's American father. Molly The Chick, who is the daughter of Ginger and Rocky, and a friend of Frizzle. Frizzle The Scouse Chick, who is a friend of Molly. Mac is the Scottish genius of the group. Bunty is the cynical, but very tough muscle of the group. Babs is the cheerful and happy-go-lucky hen of the group. Fowler is the old rooster, who taught about his Royal Air Force days. The comedic and helpful rodents are Nick and Fetcher. But the main antagonist is returned from its predecessor is none other than Mrs. Melisha Tweedy, Because She is married to the eccentric, but very intelligent scientist called Dr. Mark Fry instead of the bumbling oaf of the farmer Willard Tweedy. Also Melisha Tweedy is gone from Miss Agatha Trunchbull from Matilda (1996) to Frau Farbissina and Dr. Evil from Austin Powers Trilogy (1997-2002) in this. Instead of the Chicken Pies business like in the first movie, But She is doing the Chicken Nugget business by using the mind-controlling collars that made the chickens more docile and happy rather than fear and upset. Unlike Tweedy's Farm is very dark, edgy and behaves like a prisoner of war camps in World War 2, Fun Land Farms is seemingly cheerful, bright and colourful, but it does have a sinister edge. I'm giving this a 9/10.",
    "75": "Much like Disney's once-prestigious animation company, it's difficult to overstate how huge Aardman Studios was in the 2000s, and how disappointing it is to see both studios now in the rut of belated sequels punctuated by undercooked original films. I still think Aardman is faring better than Pixar today-- -- -- they're less pretentious, less concerned with appealing to movie critics, their animation is more interesting. But Dawn of the Nugget is not a step in the right direction. It contains a few good visual gags (the 'employee eye-pad' is a funny reminder of the kind of loony wit Aardman excels at) but the overall story and barrage of jokes contain more misses than hits and mostly dissolve into a noisy chaotic blur, punctuated by inane emotional moments. Just give us something bonkers like the first half of Pirates, you Brits!Obviously the recasting seems to be the most common criticism. They didn't bring back Mel Gibson (cowards) but perhaps it's just as well, since the Rocky character is reduced to the stereotypical 'bumbling idiot dad' trope popularized by Disney. Zachary Levi is better for that sort of thing. Despite Julia Sawalha being told she was too old to return as Ginger, they kept the Mrs. Tweedy actress who is ten years older. Questionable. (However, it is worth noting that the return of Mrs. Tweedy is the only reason to see this film, and her gruesome fate shows that Aardman at least hasn't lost it's penchant for over-the-top cartoon violence)Overall I'm hoping Aardman can pull itself back into relevance, but while being stuck with Netflix it's not likely. They have a new Wallace and Gromit coming out soon with Nick Park returning, but how many people will care by that point? And what will they do afterwards?",
    "76": "This animated escape thriller is more than a children's movie. Watching films like this as an adult, it always gives me a kick when the writers work in humor that you know goes over the kids heads but is still fun. Don't get me wrong, the film was true to its PG rating, but was playful and creative.As the sequel, Chicken Run 2 took the story to new heights in a way that reflects modern changes to our agriculture system. The film cleverly used a heavily secured industrial agriculture facility as the setting for an escape/heist movie. There were several clever themes throughout that included traumu-related overprotectiveness (as one can imagine being an anthropormorphized chicken who escaped the abattoir!), the public concern for \"happy animals\" in animal agriculture, and the tension of the benefits and perils of broadening one's horizons.The film cleverly worked the heavy security around the complex (both humans and automated) to advance the heist element of the story. And the characters came together with divergent personalities that played off each other to make a fun and humorous composite.",
    "77": "Dawn of the Nugget is a return to form for Aardman, at least on the animation department. Though there are a few CGI touches, most of the movie is in their classical stop motion, which is rather pleasant to see especially given a certain company decided to forsake traditional animation styles.Storywise, however, it suffers. It is essentially the plot of the DTV Little Mermaid sequel, with a few twists. At least the dub I watched had most of the original cast return, so that degree of reverence saves the film.Also, there are numerous background jokes peppered in, which make this film rewatcheable.Overall, not as good as the original and with less of a political commentary, but not bad either.",
    "78": "It's neither shockingly awful, not particularly good and that's the biggest issue. It's just meh.So you get the typical cliche we see in a lot of films... Someone wants to know the truth, others hide the truth, which makes the someone even more determined... In this case, a young chicken wants to know what happens off the island that she loves on.If her parents say her down and told her the truth, the film wouldn't happen.. so they ban her and don't tell her anything which makes her determined to leave the island.The voices are... Odd.. A lot of the original film voices return but they recast Ginger. They said it's because the original actor is too old but the new voice actress is just 4 years younger than her, so that makes no sense. Bella Ramsay is fine as the typical Uppity Teenager stereotype character, neither awful nor fantastic.On the whole, comparing it with the first, it falls flat with odd voice casting and a clichéd and predictable story. Kids will enjoy it, I'm sure of that, and fans of the original will like it for nostalgic reasons, as a film judged by it's own attributes, it's all just simply... Meh... 5/10\nI don't regret watching, but I'll never watch it again.",
    "79": "It has been a while since the stop motion studio Aardman has made a new movie, and what we get is a sequel to their movie Chicken Run (2000); I liked and enjoyed the first film, and think it is one of Aardman's best other than Wallace and Gromit and Shaun the Sheep, though those are good too. Though the first film is better, I still liked the sequel Chicken Run: Dawn of the Nugget (2023); some of the voice actors are different, but they still do a respectable job, and some of the original voice actors returned to voice the same characters. Also, this sequel is not that bad of a continuation to the first, with it taking place where it left off, and continuing the story for it to lead to a new threat that makes sense when connecting to the events in the last movie.Ginger, now voiced by Thandiwe Newton, likes that she, Rocky, and the rest of the chickens found an island for themselves free from a chicken farm; the voice acting for her is good, and I like how she is trying to protect her daughter Molly from anything involving a chicken farm like last time. Rocky, now voiced by Zachary Levi, is there for Ginger and his daughter Molly and goes out to save his daughter from the new advanced chicken farm; the voice acting is also good, and he was funny to watch. Ginger and Rocky's daughter Molly, voiced by Bella Ramsey, wants to know what is outside the island they live on, and she gets kidnapped and put into the new advanced chicken farm; you understand why she would want to go outside the island, and why she should not, along with her being smart on many occasions or just act like both of her parents in many situations.If you have seen the trailer, you will know the villain is the same one from the first movie, and now she has a highly advanced chicken farm where she will turn the chickens into chicken nuggets; she is still threatening like before and she remembers everything the chickens have done to her in the first movie, by having an occasional flashback. The stop motion animation is fantastic watching with the look of the characters and backgrounds, and the details they add; the chicken farm looks big and has a lot of security and defenses, which makes the main chickens want to produce a plan to break in, and the methods to get the chickens is funny but also a little bit disturbing. Also, the movie is funny, mostly involving the characters or physical humor from the animation and how it is used to move everything around for jokes, and the dialogue that is given.Chicken Run: Dawn of the Nugget (2023) is a good sequel to the first Chicken Run (2000), but the first film is better, even though I did enjoy this sequel; the movie is funny, it has great animation, good new and old voice cast, and it still has a threatening villain. If you liked the first Chicken Run (2000), I would check out the sequel Chicken Run: Dawn of the Nugget (2023); skip this you are not a fan of the first, but if you do like the first movie, I recommend giving this a watch.",
    "80": "Knowing nothing about the film, I had no expectations about it and ended up delighted!The target audience is clearly kids, but as a kids movie it's beautifully made. Adults (like me) will enjoy the nods to classic 60s action movies, a path that Pixar's The Incredibles also trod.The story follows the classic three-act structure with few surprises but is well-written within this structure. The lead protagonist gets a meaningful character growth arc, with Bella Ramsey again giving a fantastic performance.All the violence associated with farming chickens is carefully avoided, making it suitable for very young audiences.Coincidence is heavily used to get our heroic chickens out of trouble, which could easily frustrate older viewers, but once I accepted this as a kids movie I very much enjoyed the ride.",
    "81": "This narrative unfolds as a familiar tale delving into the struggles of parents grappling with the antics of a seemingly foolish child, setting the stage for a catastrophic event. The ensuing plot then takes a turn as the characters unite to overcome the challenges, ultimately culminating in a harmonious resolution. Strikingly absent from the storyline is any semblance of punishment or remorse for the characters' seemingly ill-advised decisions. Much like countless other films, this one adheres to a conventional narrative arc, with the sole differentiating factor being the peculiar involvement of a chicken.The question that naturally arises pertains to the creative choices made by writers and directors who repeatedly opt for such archetypal story structures. Is it a reflection of a broader trend in the industry, or a deliberate choice to cater to audience expectations? The use of a recurring formula raises inquiries about the industry's inclination toward tried-and-true narratives, possibly driven by a perceived commercial success associated with familiarity. While the inclusion of a chicken injects an element of distinctiveness, it prompts a broader reflection on the need for creative innovation and a departure from the confines of predictable storytelling in cinema.",
    "82": "Hey everyone yesterday I saw Chicken Run Dawn of The Nugget on NetFlix. For the most part I really enjoyed it The basic premise of the sequel is that Ginger, Rocky, and the other chickens are peaceful free lives on an island in the middle of nowhere and Ginger and Rocky are now parents to an adventurous little chick called Molly. Ginger and Rocky have decided to keep their past lives a secret from Molly and not let her explore the outside world. But Molly chafes at this and eventually runs away to go an adventure and ends up getting captured by Fun Lands Chicken Farm which styles itself as a Pleasure Island for chickens. Funlands Chicken Farm is run by Gingers old nemisis Mrs Tweety. It's up to Ginger Rocky ad the other chickens to rescue Molly from being turned into a chicken nugget. Let me just say that I really love Chicken Run Dawn of The Nugget and have been a big fan of the original having seen it in theaters on June 30th 2000 when I was 13 years old I'm 36 now. Even though I love Chicken Run Dawn of The Nugget that doesn't mean the sequel isn't without it's flaws Ginger and Rocky have new voice actors. Half the time they sound like the originals and half the time they don't. I just gotta say I really miss Mel Gibson Zachary Levi whom most everyone knows as SHAZAMN by now does a decent job sometime at impersonating Mel Gibson's voice but other times he doesn't. He's basically to Mel Gibson's Rocky The Flying Rooster what Dan Castellenata was to Robin Williams Genie semi decent imitation in terms of voice but not as funny. Another problem with Rocky is that they make his character a TOTAL IDIOT. In the original Chicken Run Rocky was a happy go lucky carefree JERKASS But he wasn't STUPID. Part of the conflict in the first movie was that Rocky came from The Circus he launched himself out of a cannon to escape from The Circus and accidentally landed in Gingers Chicken Farm Ginger and the other chicken took him in and hid him from Mr and Mrs Tweety and The Circus people hoping he'd teach them how to fly not knowing that roosters and chickens cannot fly. In the sequel Rocky is a TOTAL MORON his only contribution to the movies plot is when they get stuck in a corn silo and Rocky figures out how to make popcorn to get out of the silo. Earlier in the movie Rocky taught Molly their daughter how to make popcorn in order to de-escalate an argument between Molly and Ginger. The things that work for th sequel is the central conflict between Molly and Ginger. Ginger wants Molly to stay on their island to avoid danger but Molly has a case of really bad wanderlust and runs away and gets caught by Mrs Tweety's minions and taken to Fun Lands Chicken Farm a high security detention center for chickens disguised as a chicken's playground where chickens are given mind control collars worn around their necks to keep them docile and than turned into chicken nuggets. They brought back Miranda Richardson who voiced Mrs Tweety in the original, and she's the primary reason why Dawn of The Nugget is almost as good as the original. Mrs Tweety has really grown as a villian instead of simply keeping chickens on a chicken farm behind wire cages she keeps them in maximum security compound you'd see for criminals She fits them with mind control collars keeping them happy so they don't run away while she processes them into chicken nuggets this time around instead of chicken pies I REALLY LOVE DAWN IF THE NUGGET AND AM HAPPY THEY FINALLY RELEASED A SEQUEL TO THE ORIGINAL. I was a but skeptical hen they announced the sequel but I really love this movie.",
    "83": "Where do I begin... always have very much enjoyed anything produced by Peter Lord or Nick Park... The first movie is a testament to that... it took risks in a genre fairly seldom take any in... and was wonderfully sculpted with so much love it, simply brimmed at the edges with it...The fact the main things I enjoyed about the 'dawn of the nugget' are all attached to the film leaching on to former plot lines (miss tweedy eg) ...My main disgruntlement bar the childish direction was the Voice acting ... it was changed for the worse ... feels soulless ... plastic.. Mel Gibson and Julia Sawalha are sorely missed .. nothing said by the stand ins feels sincere or real for any consitent point of the movie ... thought Bella Ramsey was a stand out however really giving her all to the role and you could hear it in every one of her takes...Unfortunately the person they allowed to over see decided to lean into a more shaun the sheep style narrative ... it feels very silly in a slap in the face way ... rather than the original .. which left me feeling the same way I do after a good Robin Williams film .. warm on the inside..Overall a decent movie to watch with the kids but does not shine a light to the original ... Watch aardmans darkside ... recommend.",
    "84": "Chicken Run was a massive part of my childhood. I wasn't even born when it was released, now I'm 22 years old so obviously this film was a long time coming. Initially, I really didn't think Chicken Run needed a sequel. I thought the idea and the previews for The Dawn of the Nugget were just plain silly.But I still decided to watch it for nostalgic reasons and I ended up really liking it! It expands the world of the first Chicken Run film and it's good as a sequel for it COULD be. Adults will probably like a lot of the jokes as well and the comedic timing was fantastic, in my opinion. The only negatives for me are that a few of the re-castings of the characters don't sound much like the original voice actors, Frizzle's voice is a bit over-the-top silly and Dr Fry is a bit irritating and too much like Mr Tweedy. It's also rather puzzling to me that a lot of the technology shown in this movie seems to be very modern even though the franchise is supposedly set during the 40's or 50's?I was overall just very entertained by this film and was surprised by how much I liked it. I must say it isn't quite Oscar material but it doesn't need to be. It's harmless family fun and a great laugh.7/10.",
    "85": "I wish I could say I was disappointed, but that would've required any expectation to begin with.The film is devoid of any charm, any feasible identity, any 'life' even. Every attempt it makes at humour or emotion is completely undercut by the corporate machine churning it out, utterly indifferent to the pitiful quality produced as a result. The film is a glorified pay day for Aardman from Netflix's piggy bank.Beyond all else, it's a cheap copy of the original. Sure, visually the animation is technically competent, but there's no individual or creative spark behind it. Gone the harsh environment and WW2 concentration camp inspired design that complemented the original's simple yet effective escape storyline. Instead replaced by a generic sci fi chicken farm setting, undercutting the 'real' and gritty feeling the original film hammered in.Somehow this film ends up taking Early Man's crown of Aardman's worst production to date. Whilst some of their more recent endeavours like 'Robin Robin' perfectly captured and evolved the Aardman animation style, 'Chicken Run 2' instead reverts to poorly plagiarising the original film's identity whilst simultaneously stripping all meaning away.'Chicken Run 2' is an embarrassment of a film, acting only to fill the pockets of Aardman executives at the cost of humiliating the entire studio. Run far from this chicken of a film.",
    "86": "Knowing nothing about the film, I had no expectations about it and ended up delighted!The target audience is clearly kids, but as a kids movie it's beautifully made. Adults (like me) will enjoy the nods to classic 60s action movies, a path that Pixar's The Incredibles also trod.The story follows the classic three-act structure with few surprises but is well-written within this structure. The lead protagonist gets a meaningful character growth arc, with Bella Ramsey again giving a fantastic performance.All the violence associated with farming chickens is carefully avoided, making it suitable for very young audiences.Coincidence is heavily used to get our heroic chickens out of trouble, which could easily frustrate older viewers, but once I accepted this as a kids movie I very much enjoyed the ride.",
    "87": "This narrative unfolds as a familiar tale delving into the struggles of parents grappling with the antics of a seemingly foolish child, setting the stage for a catastrophic event. The ensuing plot then takes a turn as the characters unite to overcome the challenges, ultimately culminating in a harmonious resolution. Strikingly absent from the storyline is any semblance of punishment or remorse for the characters' seemingly ill-advised decisions. Much like countless other films, this one adheres to a conventional narrative arc, with the sole differentiating factor being the peculiar involvement of a chicken.The question that naturally arises pertains to the creative choices made by writers and directors who repeatedly opt for such archetypal story structures. Is it a reflection of a broader trend in the industry, or a deliberate choice to cater to audience expectations? The use of a recurring formula raises inquiries about the industry's inclination toward tried-and-true narratives, possibly driven by a perceived commercial success associated with familiarity. While the inclusion of a chicken injects an element of distinctiveness, it prompts a broader reflection on the need for creative innovation and a departure from the confines of predictable storytelling in cinema.",
    "88": "Hey everyone yesterday I saw Chicken Run Dawn of The Nugget on NetFlix. For the most part I really enjoyed it The basic premise of the sequel is that Ginger, Rocky, and the other chickens are peaceful free lives on an island in the middle of nowhere and Ginger and Rocky are now parents to an adventurous little chick called Molly. Ginger and Rocky have decided to keep their past lives a secret from Molly and not let her explore the outside world. But Molly chafes at this and eventually runs away to go an adventure and ends up getting captured by Fun Lands Chicken Farm which styles itself as a Pleasure Island for chickens. Funlands Chicken Farm is run by Gingers old nemisis Mrs Tweety. It's up to Ginger Rocky ad the other chickens to rescue Molly from being turned into a chicken nugget. Let me just say that I really love Chicken Run Dawn of The Nugget and have been a big fan of the original having seen it in theaters on June 30th 2000 when I was 13 years old I'm 36 now. Even though I love Chicken Run Dawn of The Nugget that doesn't mean the sequel isn't without it's flaws Ginger and Rocky have new voice actors. Half the time they sound like the originals and half the time they don't. I just gotta say I really miss Mel Gibson Zachary Levi whom most everyone knows as SHAZAMN by now does a decent job sometime at impersonating Mel Gibson's voice but other times he doesn't. He's basically to Mel Gibson's Rocky The Flying Rooster what Dan Castellenata was to Robin Williams Genie semi decent imitation in terms of voice but not as funny. Another problem with Rocky is that they make his character a TOTAL IDIOT. In the original Chicken Run Rocky was a happy go lucky carefree JERKASS But he wasn't STUPID. Part of the conflict in the first movie was that Rocky came from The Circus he launched himself out of a cannon to escape from The Circus and accidentally landed in Gingers Chicken Farm Ginger and the other chicken took him in and hid him from Mr and Mrs Tweety and The Circus people hoping he'd teach them how to fly not knowing that roosters and chickens cannot fly. In the sequel Rocky is a TOTAL MORON his only contribution to the movies plot is when they get stuck in a corn silo and Rocky figures out how to make popcorn to get out of the silo. Earlier in the movie Rocky taught Molly their daughter how to make popcorn in order to de-escalate an argument between Molly and Ginger. The things that work for th sequel is the central conflict between Molly and Ginger. Ginger wants Molly to stay on their island to avoid danger but Molly has a case of really bad wanderlust and runs away and gets caught by Mrs Tweety's minions and taken to Fun Lands Chicken Farm a high security detention center for chickens disguised as a chicken's playground where chickens are given mind control collars worn around their necks to keep them docile and than turned into chicken nuggets. They brought back Miranda Richardson who voiced Mrs Tweety in the original, and she's the primary reason why Dawn of The Nugget is almost as good as the original. Mrs Tweety has really grown as a villian instead of simply keeping chickens on a chicken farm behind wire cages she keeps them in maximum security compound you'd see for criminals She fits them with mind control collars keeping them happy so they don't run away while she processes them into chicken nuggets this time around instead of chicken pies I REALLY LOVE DAWN IF THE NUGGET AND AM HAPPY THEY FINALLY RELEASED A SEQUEL TO THE ORIGINAL. I was a but skeptical hen they announced the sequel but I really love this movie.",
    "89": "Where do I begin... always have very much enjoyed anything produced by Peter Lord or Nick Park... The first movie is a testament to that... it took risks in a genre fairly seldom take any in... and was wonderfully sculpted with so much love it, simply brimmed at the edges with it...The fact the main things I enjoyed about the 'dawn of the nugget' are all attached to the film leaching on to former plot lines (miss tweedy eg) ...My main disgruntlement bar the childish direction was the Voice acting ... it was changed for the worse ... feels soulless ... plastic.. Mel Gibson and Julia Sawalha are sorely missed .. nothing said by the stand ins feels sincere or real for any consitent point of the movie ... thought Bella Ramsey was a stand out however really giving her all to the role and you could hear it in every one of her takes...Unfortunately the person they allowed to over see decided to lean into a more shaun the sheep style narrative ... it feels very silly in a slap in the face way ... rather than the original .. which left me feeling the same way I do after a good Robin Williams film .. warm on the inside..Overall a decent movie to watch with the kids but does not shine a light to the original ... Watch aardmans darkside ... recommend.",
    "90": "Chicken Run was a massive part of my childhood. I wasn't even born when it was released, now I'm 22 years old so obviously this film was a long time coming. Initially, I really didn't think Chicken Run needed a sequel. I thought the idea and the previews for The Dawn of the Nugget were just plain silly.But I still decided to watch it for nostalgic reasons and I ended up really liking it! It expands the world of the first Chicken Run film and it's good as a sequel for it COULD be. Adults will probably like a lot of the jokes as well and the comedic timing was fantastic, in my opinion. The only negatives for me are that a few of the re-castings of the characters don't sound much like the original voice actors, Frizzle's voice is a bit over-the-top silly and Dr Fry is a bit irritating and too much like Mr Tweedy. It's also rather puzzling to me that a lot of the technology shown in this movie seems to be very modern even though the franchise is supposedly set during the 40's or 50's?I was overall just very entertained by this film and was surprised by how much I liked it. I must say it isn't quite Oscar material but it doesn't need to be. It's harmless family fun and a great laugh.7/10.",
    "91": "I wish I could say I was disappointed, but that would've required any expectation to begin with.The film is devoid of any charm, any feasible identity, any 'life' even. Every attempt it makes at humour or emotion is completely undercut by the corporate machine churning it out, utterly indifferent to the pitiful quality produced as a result. The film is a glorified pay day for Aardman from Netflix's piggy bank.Beyond all else, it's a cheap copy of the original. Sure, visually the animation is technically competent, but there's no individual or creative spark behind it. Gone the harsh environment and WW2 concentration camp inspired design that complemented the original's simple yet effective escape storyline. Instead replaced by a generic sci fi chicken farm setting, undercutting the 'real' and gritty feeling the original film hammered in.Somehow this film ends up taking Early Man's crown of Aardman's worst production to date. Whilst some of their more recent endeavours like 'Robin Robin' perfectly captured and evolved the Aardman animation style, 'Chicken Run 2' instead reverts to poorly plagiarising the original film's identity whilst simultaneously stripping all meaning away.'Chicken Run 2' is an embarrassment of a film, acting only to fill the pockets of Aardman executives at the cost of humiliating the entire studio. Run far from this chicken of a film."
}