{
    "0": "It's a biopic set in New York City between 1943 and the late 1980s. Its primary focus is the relationship and marriage between Leonard Bernstein (Bradley Cooper) and Felicia Montealegre (Carey Mulligan). We learn pretty early that Bernstein's sexual appetites extend to both women and men. An early male relationship is with David Oppenheim (Matt Bomer). Felicia knows Bernstein's orientation from the beginning but asks that he be discrete. We also meet Bernstein's sister, Shirley (Sarah Silverman), and, especially, he and Felicia's oldest daughter, Jamie (Maya Hawke).The second orientation of \"Maestro\" is Bernstein's difficulty harnessing his expansive skills in composition, conducting, and popular education about music. His extroversion sometimes hinders his ability to focus. The film portrays this issue less effectively.\"Maestro\" is an intense and skillfully photographed movie. The cinematography reflects the era being portrayed. Thus, for example, the film is black and white until the 1960s. I cannot comment on the portrayals of Bernstein's conducting or the quality of his compositions, except to note that Bernstein's conducting is very intense. An enormous number of people populate the film, making it difficult to keep track from time to time. That said, Carey Mulligan gives a superb performance that deserves Academy consideration, though some parts of her life are missing, such as her political activism.Cooper's Bernstein is not deep outside the relationship with Felicia that slowly deteriorates. The film omits to mention that Bernstein also had affairs with women during the marriage. The movie portrays Felicia's final illness with breast cancer very effectively and emotionally..",
    "1": "POSITIVES:1) The two central performances are both absolutely sensational. Both Cooper and Mulligan have some really jaw dropping scenes and they were what kept me engaged throughout\n2) The direction and cinematography are both superb. There are lots of long takes and clever camerawork and this helped to make certain scenes feel much more impactful, such as the big conducting scene near the end that goes on for several minutes with only a couple of cuts\n3) Using Bernstein's own pieces as the score for the film was very clever and I loved how over dramatic the score felt a lot of the timeNEGATIVES:1) I really didn't like the first hour or so of this film while it was in black and white. It just felt so pretentious, fake and full of itself. Also, the characters all talk insanely fast for some reason during the black and white scenes. Things did improve once things went to colour though\n2) As the title of this review states, I felt like the film was more of a technical achievement than something I actually enjoyed watching. I didn't really care about any of the characters, in fact I found Bernstein very unlikeable, and I wasn't really invested in the plot\n3) As is the case with a lot of biopics, I think this film is guilty of trying to cram an entire person's life into only 2 hours, which makes a lot of things feel very rushed.",
    "2": "In a nutshell, this is a very artistic and well-made feature. There are great performances all around and the colours/cinematography/sets/music are all great. The main couple especially stands out. HOWEVER, this film seems to be uninterested in telling the story of a prolific composer/conductor's career, but instead tells the story of a couple and their hardships. It's an interesting choice that will no doubt alienate audience members expecting to learn more about Bernstein as a musician. While I can't say this subversion entirely pays off, it's a sweet story with some tear-jerky moments. Brad plays very convincingly. Personally though I'm left a little unsatisfied and would've wanted to see more of his career and professional life.",
    "3": "We don't know much about Leonard Bernstein. We didn't learn why he wanted to be a composer or how he got in the business. His relationship wasn't very clear either. He's bisexual, but that doesn't go anywhere. His wife isn't explained much either other than being a stage actress. We don't know much about his children. The timelines aren't clear when the movie takes place. It seems to start in the 50s other than the opening scene of him as an old man. I do like Bradley Cooper's performance, but not much comes from the character. We don't know what made him famous since he was already famous before his memorable score in On the Waterfront.",
    "4": "I cannot even begin to describe how deeply this movie affected me; I have seen it three times in theaters already and am considering a fourth viewing. The elegance of the cinematography and the haunting power of Bernstein's compositions are without question, but what really took my breath away was the raw honesty and realism with which the central marriage between Lenny and Felicia is portrayed. Carey Mulligan gives one of the most immersive and empathetic performances of the century, and Bradley Cooper matches her beat-for-beat with an uneven combination of mature compassion and an almost childlike misunderstanding of her needs. This is no hagiography or even a biography really; it is a poetic exploration of what it truly means to love another human being in sickness and in health, 'til death do you part. Be prepared to cry and perhaps reexamine the relationships in your own life.",
    "5": "Cooper's work here should be enough to garner Oscar nominations for acting and directing. Carey Mulligan should waltz away with Best Actress. The film is absorbing, seldom lags, but the focus is an intimate love story, not the once-in-a-generation brilliance of Bernstein's music and career. The main objection here is that Bernstein's very public affairs with men, despite his marriage to a woman, are part,of his larger-than-life story, but here they are largely straight-washed. Hinted at, not fully explored as part of his story. If you blink, you'd miss it entirely. Most curious is the fact that Matt Bomer's performance was apparently left on the cutting room floor. Despite his billing as one of three co-stars, Bomer has only about three minutes of screen time in the entire film. WHAT? Much was made of his signing for the movie and his participation was featured in the early publicity. What happened? Was Cooper afraid of tarnishing his straight man reputation?",
    "6": "Don't judge the film based on the nose. Judge is based on the film. Critique the makeup all you want, but not the film. This is a beautiful film - great story, marvellous acting, beautiful music and a great aesthetic production design. This all put together, makes this one of the best films of 2023, capturing the life of the late great Leonard Bernstein. An amazing gem that people will overlook, because they aren't jewish and care so much about a prosthetic nose. Bernstein's s children approved of the nose, so deal with it. It's a shame, all everyone wants to talk about is an exaggerated nose, but that's where we are. Appreciate what's in front of you. An amazing film by BRADLEY COOPER!!!",
    "7": "It seems to me that there are always biopic movies released around the time that Awards Season is approaching, all made as \"Oscar Bait\", this film released near the end of the year is a good example, it liked the sound of it, and it was getting rave reviews, produced by Martin Scorsese and Steven Spielberg, directed by Bradley Cooper (A Star Is Born). Basically, it opens with the words of Leonard Bernstein: \"A work of art does not answer questions, it provokes them; and its essential meaning is in the tension between the contradictory answers.\" Leonard \"Lenny\" Bernstein (Bradley Cooper) plays a modern classical piano composition while he is at his home being filmed and interviewed, at almost seventy years old. After he finishes playing, he talks about the significant impact his wife Felicia made on him for many years. In 1943, twenty-five-year-old Bernstein is living in New York City as the assistant conductor of the New York Philharmonic. When Bruno Walter falls ill, he makes his sudden debut conducting the orchestra. Bernstein is exceptional as a substitute and receives a rapturous reception from the audience. During this time, Bernstein is having an on-and-off romantic and sexual relationship with clarinet player David Oppenheim (Matt Bomer), but he hides his homosexuality from others. One night at a party, he meets aspiring actress Felicia Montealegre (Carey Mulligan), and he develops feelings for her. They start dating, and sleeping together, and go on to marry and have three children together: Jamie (Maya Hawke), Alexander (Sam Nivola), and Nina (Alexa Swinton). Felicia joins Leonard during a rehearsal for his latest musical, On the Town. By the mid-1950s, Leonard and Felicia have a highly affluent life and make public appearances, and Leonard has composed many successful operas and Broadway musicals, including Candide and West Side Story. They begin to host lavish parties. Felicia has concerns about Leonard's homosexual tendencies, but she is insistent she is in control as his wife. However, over the next few years, Leonard continues to have casual flings with men and is addicted to alcohol and drugs, all of which take a deep toll on his marriage to Felicia. Things are worsened when Jamie hears the rumours of her father's affairs, he tries to deny what she has heard, but his daughter's suspicions are only raised more. Finally, during Thanksgiving, Leonard returns home late from a night of drinking, he and Felicia have an explosive argument where she insists is full of hate, and that if he continues, and will \"die a lonely old queen\". Nonetheless, the couple remains married, through Leonard's composition of Mass in 1971. In 1973, Bernstein conducts a legendary performance of Mahler's Resurrection Symphony at Ely Cathedral, England. During the rapturous reception, Felicia reconciles with Leonard, insistent that \"there's no hate in his heart.\" A few years later, Felicia is diagnosed with lung cancer. Despite going through surgeries and an aggressive chemotherapy regimen, her condition gets worse. Felicia dies in Leonard's arms in 1978. Overcome with grief, Leonard and the children abandon their lavish home shortly afterward. In 1987, Bernstein has moved into teaching the art of conducting, but he also continues to party, and having affairs with his much younger, male students. Returning to the present day and the interview, Bernstein admits that he misses Felicia terribly, and memories of their time together flash before him. It ends with the real Leonard Bernstein conducting a successful performance. Also starring Sarah Silverman as Shirley Bernstein, Lenny's sister, Michael Urie as Jerome Robbins, Brian Klugman as Aaron Copland, Gideon Glick as Tommy Cothran, Miriam Shor as Cynthia O'Neal, Josh Hamilton as John Gruen, Zachary Booth as Mendy Wager, and June Gable as Old Lady. Mulligan gives a tremendous performance as the wife who goes through all the emotions, and Cooper is equally splendid as the famous talented maestro of the title who had his demons, but also a joyous enthusiasm for music. Most real-life based films just go through the \"greatest hits\" material and only skim over the personal things, this one only mentions the musicals and orchestrations Bernstein is famous for and concentrates almost entirely on the relationship element. The use of black-and-white for the 1940s and colour in the later years is an interesting choice, the highlights are the rehearsal scene and the exuberant cathedral performance, the connection between Cooper and Mulligan is heartfelt, it is genuinely heart-breaking near the end when tragedy strikes, and Bernstein's music (his works are heard throughout) is wonderful, and a worthwhile biographical drama. Very good!",
    "8": "Just attended a private screening of this beautiful film.I'm absolutely blown away by the amount of depth of the characters in this marvelous film. Every line of the dialogue, pauses, each movement has a unique feel and reflection on the current situation. Bradly's work as a writer, director, and actor is truly phenomenal. I'm still trying to understand how one person can create such a one-of-a-kind film where every department is devoted to the GREATEST level of success. After speaking with the cast, I'm touched by Bradly's openness, kindness, and objective to heal people with his art. I felt every bit of it! I'm thrilled to be one of the first ones to see this one-of-a-kind work of art. This film truly making you feel all the true emotion.BRAVO MAESTRO!!!",
    "9": "Well, just trying to be funny. This is just another vanity project that been funded by big tobacco.If you love classical music you will be disappointed, because this movie is not about music, conducting, orchestras or about musicians. It's about a smoking, a boring and a rather bland man and his wife.This could have been a great well to get some knowledge about how conducting or a great classical orchestras work, but no, you will not get that in this movie. I'm a bit surprised because Cooper is a really good actor with great charisma, so that makes this train wreck even more surprising. But I guess, the good story just went up in smoke.that how it goes.",
    "10": "Bradley Cooper was snubbed for best director for A Star Is Born, he wont be this time,\nThe way he portrays Bernstein and goes into his life, conducting and hiding himself being gay whilst being married to Felicia, the acting was top notch,\nIt shows almost perfectly the fighting between Felicia and Leonard because of his affairs with much younger men, despite him showing his love for her very much. Bradley Cooper and Carey Mulligan both deserve Oscars for this, and its about time Cooper won anyway, the acting in this is amazing and the way the films been made, even better, it seems different to other biopics, it almost doesnt seem like one. Even though Bradley Cooper caused lots of controversy due to the fake nose. It should be overlooked and this is definetly a frontrunner at the Academy Awards this year,\nHighly Recommended.",
    "11": "I happen to think that Bradley Cooper is one of our finest actors living today. All of his Best Actor nominations are well deserved. I really enjoyed his performances in American Sniper and A Star Is Born. However, Maestro, a very long, dull, and drawn out biography of Leonard Bernstein, really smells of really bad Oscar bait nothing more.The performances by Cooper and. Carey Mulligan are fine but I never thought Leonard Bernstiein was that fascinating a composer to begin with. In fact I find his musical work highly overrated as I feel there are far better composers.So of course I didn't find Maestro to be that interesting to being with. His life story from which covers from the 1940s to his death from lung cancer in the early 1990s, covers such events as Bernstein leading the New York Philharmonic to musicals such as West Side Story.While those who grew up with his music will find that fascinating, others, like me, were completely bored out of my mind, not to ,mention Benstein flat out cheating on his wife to hide his bisexuality rings of complete pretentiousness.All in all, it was a good effort by Bradley Cooper and there is nothing wrong with his direction. I just found his subject matter here to be completely uninteresting.This film is due to come out on Netflix in December. It may have a better success there than it did with my audience many of whom fell asleep while watching it.",
    "12": "Stanley Kubrick once said about actors who are obsessed with making it 'real' but he countered: is it interesting? The performances in Maestro have everything technically perfect, the accents, the beats, the spaces in between, but they don't come off as real people we know or care about which in itself interesting. We SHOULD since the actors poured their hearts out, but the audience I saw it with, clearly didn't. I'd guess the problem was also in the script. But look for nominations just the same: makeup - some of the best aging makeup to date, score, nominations for some of the leads (if enough people see it.). Bradley Cooper continues to grow as a director and his visual style is getting better with each movie.",
    "13": "Maybe my expectations were way too high going in, but i have to say I was disappointed going out. By the 3/4 mark I was ready for it to be over. I wanted to love the motive, but struggled to like it. All the pieces were there: great acting, awesome cinematography, and of course the music, but there was no flow. To begin with the movie is no biography, but a study of a marriage. Bradley Copper did a very good job, but there was just something missing and it seemed overly long to me. If you are watching a movie and as it progresses you find yourself asking yourself if you like the movie, maybe the movie is not doing what it should. Some may love it, but I was disappointed.",
    "14": "Some lovely noir lighting, of course a big spend, but this doesn't do any justice to the great LB.Admittedly this would be hard to achieve for anyone; but Cooper doesn't really achieve the depth, the nuance, the voice, the facial expressiveness (OK maybe that is The Nose) or gravitas.It's an angle to explore, the homosexuality and relationship with Felicia; but to major on the personal conflicts rather than the huge musical life creates such a reductive skew of Bernstein's towering musical achievement and reach.Couldn't catch much of the rushed/thrown away dialogue either. Overall, pretty disappointed.",
    "15": "This is essentially a movie about two very pompous people being pompous. Not particularly likeable, not particularly interesting.I'll confess, I have no idea who LB was, but neither have I learnt anything accept he was pompous and loved fags, pardon the pun.I found both characters irritating from the moment they appeared on screen.It was a strange choice of movie for Bradley Cooper to direct, but saying that, he's obviously a fan of his, hence his brilliant piano playing. (Only interesting part of the whole movie)Would have been better making a film on Leonard Cohen's and Marianne IhlenNo doubt they'll expect an Oscar nomination which it will probably get because it's boring and shot in black n white (sporadically it must be said)",
    "16": "Cooper and Mulligan deserve every accolade for their portrayal of the complexities of being bound together in a marriage of minds, and ultimately love.It is more than a film about one man, it is about the world of a genius and those that are caught up in the whirlwind. Do not expect a breeze through a back catalogue of greatest hits , although even more music would have been a crowd pleaser.Only criticism is Cooper at times is so involved in playing the character of Bernstein that he forgot to Direct, the cast carries on like an Orchestra that has no Conductor but knows how to play the piece. Bravo and bravo to the musicians and crew.",
    "17": "An empty bag of mostly water. I have watched in near disbelief as Mr Bradley Cooper is starred in film after film. As an actor he is zero, I see nothing, feel nothing, learn nothing from his body of work. That he has Speilberg's endorsement is, to me, the kiss of death. Mediocrity is the A-Listers new genre. A white man actor, Cooper is so generic that his plastic nose, his acting parts, his very presence adds nothing at all. Why the movie going public is even interested in a film about Berstein is a puzzle. List your favorite music right now. Is Berstein on your list? Making films about below average composers by using a well below average actor makes sense somewhere. Cooper is an empty bag. I try to watch him, but there is nothing there to see. And as for Leonard Berstein, honestly, who cares?",
    "18": "It was very one dimensional. The camera angles were strange and distracting, the dialogue was slow and laborious. 1-3% of the movie was about his music. We didn't learn much amount him that I couldn't summarize in less than 30 seconds and that's never a good thing.They just kept beating us over the head with the same thing over and over. It never went anywhere or progressed in any way. For me personally it was pure torture from start to finish.Sadly, I paid to see this in the theaters, pre-12/20. Didn't know it was going to be a Netflix release. Oh well, I'll never get that time or money back.",
    "19": "Been a longtime fan of Bernstein. I remember we had a textbook about famous Americans in 1967 that had a short biography of Leonard Bernstein, and it started something like this \"Lenny was always running.\" In the first few minutes of the movie, an early image of Cooper's Lenny was of him running into Carnegie Hall once he was told he was going conduct the New York Philharmonic in concert.The casting was spot on. On Inside the Actors Studio over 10 years ago, when asked what job Cooper would like if he wasn't an actor, he replied \"Conductor.\" Lenny was one of those conductors who conducted with his whole body & every emotion so know that Cooper was in no way exaggerating when he was conducting. The makeup for Cooper's Bernstein was fantastic. I've loved watching Carey Mulligan grow up as an actress, from the wonderful Sally Sparrow in Doctor Who's Blink to the sad character in Mudbound. Both leads were extraordinary & ultimately heartbreaking.Using Bernstein's music (mostly) as the score was an excellent choice as it showed that, even though he wasn't a particularly prolific composer, he was an extremely diverse composer.The core of the movie was the often tricky relationship between the Bernsteins. While Felicia always said she understood who Lenny was, they were sometimes in a tough situation. The script makes it clear that while they loved each other, they were both quite arrogant. At the end though, Lenny's famous workaholism was less important than being with Felicia. I lost it when Lenny cried into his pillow.This movie is worth your time to see in a theater.",
    "20": "This movie is almost entirely a romance. The trailers may seem to suggest this movie is a look at Leonard Bernstein's life in its totality but it's hyper focused on the relationship that is at its center. Sometimes that takes away from the movie as it tries to give the audience those amazing awe inspiring seems with Bradley cooper showing off his conductor skills. In many ways it succeeds with those scenes but the meat of the movie is all in the relationship and the complexities of it that are shown amazingly through the super Acting from the two leads. Carrie carries a lot of the emotional weight through her acting alone as many scenes only suggest what is actually happening instead of actually saying. That builds a lot of tension that is sometimes deflated with the generic scenes required of a biopic. Overall it was entertaining, moving, and emotional. See it just for the leads alone.",
    "21": "Great, great movie!! Carey Mulligan is amazing!! As is Bradley Cooper!! Had the pleasure of seeing it tonight at a theater in town. Awesome. So glad we went and saw it!! The acting is superb!! I mean amazing!! Honestly wasn't really sure I'd like it but wound up loving it!! Amazing story of Leonard Bernstein. Was reading about the access they had to the family and how closely the film resembles their childhood was awesome to hear. Pretty crazy life he lead, they lead. Parts in black and white which are so well done. You will not regret seeing this. The performances alone of Cooper and Mulligan is worth every minute!! Must see!! 🤘🏻🤘🏻🤘🏻🤘🏻",
    "22": "Yes, one CAN dispute that \"...dramatically wielding a baton, flinging one's head and hair about in time to music, does add a rather welcomed, visual highlight to a concert of otherwise stultifying musicians\", if one's reasons for attending a concert are the appreciation of the music and performances, and not such unimportant ephemera as the musicians' wardrobe choices, hairstyles, bodily movements and facial expressions and tics while they play or sing or conduct, etc.There were several notable maestri -- e.g., Dimitri Mitropoulos, Charles Munch, and Bernstein himself - who were so genuinely caught up in the music that they couldn't contain their physical reactions to it. But all too many of the current crop of shallow, callow young conductors fall back on excessive podium choreography to compensate for their lack of depth as musicians.",
    "23": "Beware, this is a movie about Bernstein's marriage, NOT about his music. It should have better been titled as \"The Marriage of Leonard & Felicia\" and not \"Maestro\".I expected a music biopic, but what I got was a masterfully directed and terrifically acted portrait of a marriage with a bisexual husband and all the difficulties (secret affairs with gay men) that came along with it, when back in the days of the fifties and sixties, being gay wasnt something one could openly talk about in public.The good: LONG scenes with NO editing cuts. What BLISS to be able to watch these 2 great actors perform uninhibited by cuts, with many minutes long lasting scenes filmed from 1 static angle. I truly applaud the director (Bradley Cooper) and the photographer and editor for this gorgeous and balanced way of filming this portrait. I was really impressed!Any bad? I had my trepidations about Bradley Cooper's impersonation of Bernstein that was borderline according to many. Did he pull it off? I think he did a really good job, although it took me some time to get used to all the mannerisims (the peculiar voice in particular). I can understand though that others might get a bit uneasy / irritated by some of the makeup (too much?) and other mannerisims.Carey Mulligan (as the wife of Bernstein) deserves special mention. Her role was more subdued and subtle, but AS powerful and touching. She truly shined!Conclusion: I am not a fan of watching stories about artist's private lives, but as far as this personal account of Leonard Bernstein's marriage is concerned, they created a really mesmirising, warmhearted portrait, that left me behind in my seat with goosebumps and in reverence...Thank you for reading my 2100 th review on Imdb!",
    "24": "It's an old (and unanswerable) question: to what extent is it possible - or desirable - to separate the art from the artist? Is it possible to appreciate the art simply as art, and not to delve into the (sometimes tawdry) details of the artist? Or are the art and the artist so inextricably entwined that you cannot understand the one without knowing the other?I very much lean towards separation. I fell in love with Bernstein's music the first time I saw West Side Story mumble years ago at an impressionable age; which is why I was disappointed that there was so little West Side Story in this film. Surely a biopic of a composer should feature that composer's music pretty heavily?Of course, we all know that beneath every great artist is a human being - usually with a collection of human flaws. But does this matter? Well, it matters here. What we mostly get is a film about Leonard the man, and his complicated marriage to Felicia Montealegre. Much of this was new to me. I knew that Bernstein was bisexual, but didn't care. I find that I also don't care about most of the other details of his life which were revealed to me - although if the film was truly about the man, not his music, his record as a human rights activist should probably have been at least touched on. But never mind that: I came for the music, and didn't get enough.Not that this film is without merit. Bradley Cooper's performance is first class - there's one sequence in which he truly shows us the passion of a great conductor - and Carey Mulligan is as riveting as ever. Cinematography and sound are both excellent.Overall, this is a good film, but ultimately a disappointing one.",
    "25": "It's worth noting that at this past weekend's screening of \"Maestro\" for members of the Motion Picture Academy, the filmmakers received a standing ovation when they came onstage for the Q&A afterward. This from a crowd of around 800 folks who actually know what it takes to make a film, are willing to make the trek across town, and are not an easy group to impress to that degree. A standing ovation from that crowd is a rare event.As others have noted, this is primarily a study of the relationship between two artists, one a well-regarded Broadway actress (played brilliantly by Carey Mulligan) and the other a once-in-a-generation musical genius. While others bemoan this approach to what some characterize as a biopic (it isn't really), I feel it was a smart way to let the audience in on Bernstein the man. Bernstein the musician is pretty easy to learn about - just check Wikipedia, YouTube and the gazillion recordings available.Many major filmmakers, including Martin Scorsese & Steven Spielberg, have tried tackling a \"biopic\" of Bernstein, and struggled on the best approach; Spielberg essentially handed the project to the fresh-off from \"A Star is Born\" Bradley Cooper when Steven learned of Cooper's passion from childhood for conducting and his fascination with Bernstein. It didn't hurt that Cooper, even without the brilliant prosthetics (approved by the Bernstein children), looks remarkably like Bernstein, and was able to get his voice, accent and speech patterns down so perfectly that if I closed my eyes at that screening I would have sworn I was hearing the Lenny Bernstein I grew up watching on TV. Cooper, growing by leaps and bounds as a filmmaker with this one, serves his actors brilliantly, and leaves the viewer with a palpable sense of what maestro Bernstein was like as a human, flaws and all.",
    "26": "I went to Maestro expecting a film that would chronicle the life of one of America's, if not the world's, great composer/conductors. I've seen Leonard Bernstein many, many times, starting at age 8 when my grandfather took me to Bernstein's music for kids on Saturday mornings at Lincoln Center. I had no idea who he was at the time, only that people called him Lenny. My grandpa took me to meet him and he was spellbinding. I remember him looking right threw me with his expressive eyes.He loved kids and loved to teach them about music. Turns out grandpa and Lenny went to Harvard together, hence I got a personal introduction. Bernstein is the guy that got me hooked on classical music and music in general, but I didn't learn anything about his musical career, his childhood, his years at Harvard, his work in Europe, who inspired him, etc.The making of West Side Story is really interesting (if you know the story) but nothing about it in this film and I mean \"nothing.; We get a tiny glimpse of Candide, but nothing about its composition or insight into the Maestro's process. We get zero insight into his Missa Brevis, perhaps on the highlights of his career.Bradley Cooper blew me away. I've seen Lenny up close many times and I've talked to him a few times. Cooper nailed it, and the scene at St John of the Divine is probably one of the greatest musical scenes ever captured on film. Cooper's conducting is simply amazing. He worked very very hard to capture the speech, mannerisms, and the Bernstein attitude and texture toward music. I cannot speak highly enough of Cooper's performance, but we get so little insight into the musician, and that was so disappointing.Carey Mulligan? Her performance is nothing less than spectacular, in fact all the acting is extraordinary, but it's not a story. The Bernstein children really have nothing to do in this film, and I have no idea why Lenny's sister was included as she has very little to say or do. Overall, a very perplexing film ... not sure what he was going for. In fact, I kept waiting for it to start. The emphasis was all on style, and believe me, it's beautiful to look at.",
    "27": "Obviously made for the Academy to truly honor Bradley Cooper remarkable transformation into the hoity toity world of Leonard Bernstein. Yes, we know he is going to be great in this role. But sometimes when you surround yourself with Oscar level material and talent, it could seem like it's just fishing for the Little Gold dude.This is what it felt like. Though, simultaneously...he's just good.Actor turned directors don't always work. Especially virtuosos that started clownish and end up in the serious zone. Cooper is that guy. Following in the footsteps of Clint Eastwood rather than, say Charles Laughton. It felt like a natural transition for Cooper who seemed to fine tune his energies towards more serious endeavors outside of things like \"The Hangover\" flicks.\"Silver Linings Playbook\" was the start.And who are his mentors in directing if it weren't the top tier directors.... David O' Russell, Paul Thomas Anderson, Spielberg, Scorsese or Clint Eastwood himself.What this film struggles with, is the interest level. A lot will go over modern audiences head. Simply because we only know him as the guy who did the music to \"West Side Story\" And even THAT is stretching it. Cooper doesn't focus his energy on that rather this \"love\" story of a woman who fell for a gay guy. This would've been interesting 30 years ago. Now, not as intriguing.Carey Mulligan is the best thing in this movie. At times, she is very much a Katherine Hepburn North Atlantic phony. But when some of the veil of her pain rises to the surface, she drops the pleasantries and tells it like it is.There is a moment during a Thanksgiving party where we see some of the best acting I've seen between two people. Dialogue is somewhat on the nose, but boy do they both play it to the hilt. It's phenomenal, the ability to get to a screaming match with the words actually meaning something. That is an accomplishment.Things get slow when the self-indulgent conducting moment creeps in. Yes, we know Brad studied a long time to get Bernstein's mannerisms. Do we really have to see all of it?Other things that bothered me... it still feels like a very cold movie. Aside from Mulligan, his entire family seems to have been plugged in as trope characters to get you more understanding of the guy. They don't add much. Perhaps that was attempting to be subtle. It felt like subterfuge.This was Oscar bait in absolute.",
    "28": "The rule for any biographical movie is \"Would this be interesting if you didn't know who this person was?\" And that pretty much is the \"Problem\" with this movie. Bernstein fans will dote on every word; those who have no idea who Leonard Bernstein was will be bored stiff. For those who don't know (and there are many, so don't scoff), Bernstein is considered the first great American conductor of classical music. But that was only one of his talents. He was also a gifted composer who wrote both \"serious\" music (like symphonies, concertos, etc.) and the scores of such diverse Broadway musicals as ON THE TOWN, WEST SIDE STORY, and CANDIDE. All the film's musical scoring is taken from his compositions, which is a bit jarring when used out-of-context. The film concentrates on Bernstein's relationship with his wife who was a Jewish stage actress from South America. They did have a lot in common in that they had similar cultural backgrounds and were both artists. But it's hard for a heterosexual woman to have a relationship with a man who not only is basically narcissistic, but also has an eye for the fellas. And that's \"sort of\" what the movie is about. His gay relationships are very discreet and mostly only hinted at in the movie. You get the idea without going into much detail. Were these just sexual relationships? Or were there emotional and intellectual aspects, too? The movie never tells us who these shadowy lovers are or what they saw in each other. There surely were more interesting things about Leonard Bernstein than his being bisexual. I hope so, because although I am in awe of Bernstein's achievements, I didn't think the movie was very interesting, despite being beautifully acted by the two leads, Bradley Cooper (who also directed) and Carey Mulligan as his wife. The movie is at its best (for me, at least) when the style has elements of fantasy, like when the characters dance and seem like participants in one of Bernstein's stage productions, but too much of it is rather like a plodding TV show. That's the second biggest \"problem\" with the movie. There isn't really a consistent point-of-view. Some of the movie is in black-and-white and then turns to color, but for no particular purpose. It's not like opening the screen door and stepping into Oz; it just means that time has passed. The whole story is shot in the screen ratio of pre-Cinemascope. Although it changes from black-and-white to color, the screen never widens. I came out of the movie not knowing any more about Bernstein than I did when I went in. If you're a fan, that won't matter. But if you're not, well...",
    "29": "I had hoped to enjoy 'Maestro'. It is a film for adult audiences, featuring actors I appreciate (Bradley Cooper and Carey Mulligan) and directed by that same Bradley Cooper. It deals with a true American Icon (composer / conductor Leonard Bernstein) and deals with the 'man' inside that icon. In this time of Holiday Blockbusters it promised to appeal to an audience like me. And, in fact, it did. The theatre was two-thirds full; a first-time-since-the-Pandemic at this small art house.The film, however, is something of a mess. It is confused about the type of picture it wants to be. In its first thirty minutes it takes on a flight-of-fancy aura; it is as though Bernstein and his soon to be wife are in a musical-comedy with the background stage settings changing as if by magic. The film's first half is in black and white; I imagine a testament to The Forties and early Fifties (the time period covered by those scenes) but, in fact, lots of color-films were made at that time.Leonard Bernstein was bisexual. And that bisexuality is, in fact, revealed, but revealed in a coy, teasing, easy-to-misunderstand way. And then there is the background music, all of which was composed by Bernstein, but not all of which fits the scene it backgrounds. The selection from his 'West Side Story' is the most emblematic of this. But not the only example.For me, the story belongs to Bernstein's wife Felicia (played by Mulligan). She is the wife of a bisexual man; a fact that is problematic enough. But he is a man who is always center-stage, and for whom she gave up a promising career to raise their children, support her husband, and who suffers in silence until she can suffer silently no longer. But even here (and though Mulligan has long been a favorite of mine), there is a smile on her character that (a) rings insincere and (b) is repeated so often that I wanted to scream, No more. But, sadly, there is more; the most cinematic, most hard-to-believe smile coming, in a hard-to believe scene, in London's Westminster Cathedral.Finally there is the finale. I will give nothing away when I say that the film ends one scene too late, it is one scene too long. A scene in which Bernstein instructs a young orchestra conductor would be as appropriate an ending as one could hope for.But then .....",
    "30": "Bradley Cooper's \"Maestro\" is a visual feast, a glittering tapestry woven from Leonard Bernstein's iconic life. Every frame hums with the electrifying energy of his music, performed with breathtaking precision. Yet, amidst the operatic grandeur, a haunting note lingers: the film fails to truly capture the maestro's soul, the incandescent flame that fueled his every note.The live performances are undeniable magic. They aren't mere background noise; they're the beating heart of the film, pulsing with Bernstein's raw genius and the characters' emotional turmoil. Cooper understands this, and his directorial baton conducts the camera with masterful precision, pulling us into the intoxicating vortex of sound and light.But then, the music fades, and the narrative stumbles. The love story, though beautifully told, feels like a diverting aria, eclipsing the symphony of Bernstein's artistic journey. We glimpse the sparks of creativity, the whispers of inspiration, but the film never delves into the furnace where his music was forged. We're left wanting to know: what ignited this musical inferno? What drove Bernstein to push the boundaries of sound, to paint the world with his sonic brushstrokes?Instead, \"Maestro\" drowns in the sea of its own spectacle. The dazzling sets, the whirlwind romance, the electrifying performances - they all become distractions, glittering baubles that momentarily blind us to the true treasure: the unyielding devotion that resided within Bernstein, the man who dared to make music his mistress, his obsession, his very lifeblood.The film pays homage to Bernstein's legacy, yes, but it leaves us with a hollow echo, a yearning for a deeper exploration of the maestro's soul. We see the man, the lover, the artist, but we never truly hear the music that made him sing. \"Maestro\" is a stunning performance, a technical marvel, but it's a love letter penned in the wrong key, one that ultimately misses the beat of Bernstein's true passion.",
    "31": "Carrie Mulligan is outstanding. Cooper the actor is almost as good. Cooper the director is often breathtaking.I knew in advance that this was a study of the Bernstein's romance, and not of his creative process as an artist. It is hard to show that creative process in a film. Many times, to portray the trials of creation effectively, a director must expect his audience to have some familiarity with the process. Most of us are not painters, nor dancers, nor composer/conductors. Most of us don't understand how a composer can wrestle with choosing the next note... a 4th or a flat 4th? Such quandaries aren't fascinating to most and are largely unexplored. Films that partially succeed often have crazy protagonists: \"Lust for Life\"'s Van Gogh, or \"Pollock\".Cooper's direction makes frequent use of the \"long take\", a single shot that can take minutes and has no cuts or edits. These shots give us a sense of \"place\", we are there: a long take (and long shot from a distance) of the couple talking with arbors of grapevines framing the scene, the couple on either side of a room arguing while the Thanksgiving Day parade floats past the window, and a wonderful six minute long take of Cooper conducting Mahler 2. Kudos to Matthew Libatique's photography.... and a brief statement to those who complain about the prosthetic: grow up.On the whole, the movie came up a bit short for me. My takeaways: Mulligan rules, and I can't wait to see what Cooper does next.",
    "32": "The life and loves of Leonard Bernstein are the subjects of Bradley Cooper's movie biography, \"Maestro,\" Netflix's latest lux production for the big and small screen and this year's Oscar tease.Presented in competition at the Venice International Film Festival, lush and romantic, in that classic style typical of the Hollywood biopic, it sweeps in with grand gestures and the stirring strings of Bernstein's beloved \"Adagietto\" from Mahler's 5th Symphony, the composer's love letter to his wife. But, unfortunately, like the typical biopic, it romanticizes a complicated, messy life that's better suited to austere documentary than swelling violins and sumptuous vistas.Perhaps crude to note, but the Bernstein story is worthy of movie treatment only because homosexuality compelled him to lead a double life, which today may seem quaint, in that sense of a love that dares not to speak its name. Older movies about gay composers, Cole Porter and Lorenz Hart, are laughably inaccurate accounts of what are otherwise fascinating, tragic men. In \"Night and Day\" (1946), Porter, as portrayed by Cary Grant, himself closeted, isn't a gay man but a lousy husband, and physically wrong for the role. Far worse in \"Words and Music\" (1948), Mickey Rooney's portrait of Hart's tortured life is reduced to a general malaise over being short. Sexually conflicted, philandering Bernstein, as Cooper presents him, makes for good copy in 2023.The movie opens with a quotation of Bernstein's: \"A work of art does not answer questions, it provokes them; and its essential meaning is in the tension within the contradictory answers,\" which seems less an explanation than an admission of regret for what's to follow.Admittedly, a heterosexual conductor with a remarkable career but a commonplace life does not a movie make, not to mention a movie about a conductor, albeit a great one. Anyway, conducting is really a mystery to most, as its purpose seems unnecessary to the result; however, one can't dispute that dramatically wielding a baton, flinging one's head and hair about in time to music, does add a rather welcomed, visual highlight to a concert of otherwise stultifying musicians.Bernstein was this and so much more: adept at both classical and popular music, winner of Emmys, Tonys, Grammys, and an Oscar nomination, honored and celebrated, from Broadway to the New York Philharmonic, to concerts in Israel, Vienna, London, Berlin, Tanglewood--\"On the Town,\" \"Westside Story,\" \"A Quiet Place,\" \"Candide,\" \"Mass,\" \"Kaddish.\" A musician, a performer, a teacher, he tried to demystify symphonies and the work of conducting, specifically in his CBS broadcasts for children, but mostly for anyone to whom a baton seemed like a magic wand. And he collaborated with some of the best creative minds of the 20th Century. But all of that is material for another film and another filmmaker.Prodigious like his subject, Cooper does triple-duty here as writer, director, and actor, playing the Maestro himself, whom he uncannily resembles, despite latex enhancements to his own features. Cooper's love and admiration for Bernstein are obvious and should come as no surprise: he dives into the role, but never really inhabits it. Without creative distance and restraint, his performance is a testimonial, not an exploration of a life, and especially one in relation to music.A visual storyteller, with an eye for composition, Cooper places and moves his camera with purpose, frames shots for dramatic effect, and edits with rhythmic precision. And as he showcased in his first film, ambitious yet flawed, \"A Star Is Born,\" he also has an ear for music cues and underscoring shots to elicit the right emotion at the right moment. Like his mentor Steven Spielberg, he is a classicist at heart, and, unhappily, like Spielberg, not an innovator, but a follower (an observation, not a criticism). Classic Hollywood filmmaking has stood the test of time and isn't going away anytime soon. Yet, a filmmaker who follows form is never an artist, only a craftsman. Altering his appearance, for instance, to play Bernstein is indicative of craft, what actors from Lon Chaney to Orson Welles have done to find character, working from the outside in. This choice, while outmoded today, is still an accepted practice among actors, more so in biopics. But for Cooper it only adds to the list of reasons why this film doesn't work.Its focus, and its reason for being, is Bernstein's 33-year, somewhat \"open\" relationship with Costa-Rican actress Felicia Montealegre, which began in 1946 when the two met--felicitously--at a party in the home of pianist Claudio Arrau, her teacher. The competent Carey Mulligan plays Montealegre, but she's a bit too peaches-and-cream in a role that's better suited to a Latin. To her credit, she ably acts the part of an astute woman, talented in her own right, entangled in a romance with a gay man, yet she and Cooper don't fit as a pair. This kind of relationship does happen, of course, but hardly ever succeeds. The difficulty here is conveying the attraction, the job of the principal actors, certainly, but also of the director/writer. The obvious conclusion one may draw is that banal standby, \"love is blind.\" True enough, but why marry him? Therein lies the dilemma, the basis of Bernstein's self-indulgent, double life, which necessitated his needing a beard. Montealegre fit the bill. She was also a pretty ornament and a uterus for a man whose life was ruled by his whims. With similar whimsy, Cooper takes the audience along on this romantic escapade, expecting them to understand it and emotionally connect with it, but neither he nor Mulligan is credulous wholly to muster a convincing performance. Period set pieces and attractive costumes don't compensate for a weak script.The image in the movie's poster perhaps says it best: an elegantly coiffed and attired woman, faceless and alone, the word \"Maestro\" hovering lordly above her.What is to be learned? What questions provoked? What essential meaning? What tension within contradictory answers? Don't bother, it's not worth the effort, except to gather that Bernstein was indeed master of his career, but not of his life. If anything, he's an abject lesson for those who care to examine life because examining life is what makes it worth living. But that's more credit than the movie deserves.",
    "33": "This is one of the weakest movies I have seen in quite a while. It exhibits the worst faults of a biopic, with none of the compensatory pleasures. It contributes nothing to our understanding of the challenges faced by successful, celebrated people, instead trotting out clichés that go back at least as far as the 1940s. Career-obsessed husband, long-suffering wife, wealth,jealousy. We can safely feel superior, in this day and age in societies likely to screen this movie, that Bernstein's bisexuality can be addressed. In fact, it's pretty much the only thing that's addressed in Maestro. The trajectory of Carey Mulligan's Felicia Montealegre (Mrs Bernstein) is one of acceptance to rejection to acquiescence which, however reactionary that may be politically, at least gives this otherwise spineless piece of work a little spine, and enables me to give the movie one star for Ms Mulligan's performance.. I should really award another for make-up maven Kazu Hiro's remarkable work in transforming Mr Cooper face, but the realism in that department didn't spill over into the performance as a whole. Here, as in A Star Is Born, Mr Cooper is attracted to characters with gravitas, but he isn't able to convey that quality at all. We watched the remarkable Michael Fassbender in a movie the other night: he is someone who is what Orson Welles called 'a king actor'. Bradley Cooper, notwithstanding his many gifts, isn't that.Nor do his talents seem to extend to writing. He's credited as co-author on this project, so therefore half-responsible for the toe-curling sections of thudding name-drops, the embarrasing lines uttered by almost everyone, and the lack of investigation of Bernstein as a political animal. Tom Wolfe's infamous essay about the Bernsteins hosting a party for the Blank Panthers is noticeable by its absence. Indeed, the environment is spectacularly white. There's a Latino housekeeper who has little to say, an African-American student who Lenny takes a shine to. Of course, the world in which he moved was indeed overwhelmingly white: the point is, he was sensitive to it, aware of it. Omitting this side of him to focus on the domestic is a valid artistic choice, I concede that; but to realise that artistic choice in the behind-every-great-man-is-a-woman trope does no service to anyone involved, including the audience.Cooper the director makes puzzling and irritating decisions as far as camera positions are concerned. The most puzzling is fliming the climactic confrontation between the Bernsteins in an unchanging two-shot, as if it were a scene in a play. The result is uninvolving, cold. And there are lots of meaningless shots of the countryside, and the huge estate that, naturally, the Bernsteins owned. If you've got it, flaunt it, right? That's the American Way.Trite, dismal, pretentious. Don't waste your money.",
    "34": "The trailer and my love for classical music had me super hyped for this film, but it was the biggest disappointment in the cinema of recent years for me.When I go and see a biopic I do not expect an imitation or copy of the main person, but at least an interpretation that does their life's work justice.This movie doesn't really tell a story, it seems like a messy collage of shots and incoherent scenes. The absence of a proper screenwriter is really felt in every minute, also in the silly lines the characters sometimes utter. I attribute it largely to the poor script that the characters seemed undeveloped and shallow and I felt untouched by or distant from the events happening around them (despite some great acting by Mulligan).The movie also completely misses the topic that its title \"Maestro\" suggests. Bernstein was indeed a master, one of the biggest musical geniuses to have lived, but you are not going to get any sense for that in the film. What he did for music, for young people, in his teaching, conducting and composing is what will be spoken about for decades to come. But the makers of this movie decided that the most interesting thing about him is the rather unspectacular fact that he was bisexual and Jewish and stuffed all possible clichees into every minute of the movie to total boredom.Cooper does not feel like the lead here, although I had great hopes. Bernstein always said he loves two things and he is not sure, which one he loves more: music and people. That is why he loved bringing music to the people. Cooper had such unemotional eyes, there was something clinical about them, he couldn't convey the warm charisma and nuance of Bernstein. Yet, the whole movie (Cooper has come up with the project, written and directed it, for himself it seems) feels like he is bragging for an Oscar. It was non-stop showboating, when it should have been a subtly calibrated performance, drawing the audience in and showing what might be going on inside such a genius mind.I think it is an insult to denigrate the most outstanding or memorable achievements of someone, just because his sexuality and therefore lifestyle differed from the societal standards of his time. For Bernstein, music was life. He said: \"Life without music is unthinkable. Music without life is academic. That is why my contact with music is a total embrace.\" I think he would turn in his grave for how sloppy and poorly they captured what music and being Bernstein really meant.Lastly, a movie like this should easily have the best soundtrack of the year. Think of a movie like \"Amadeus\", the soundtrack remains one of the most popular classical music recordings of all time. In \"Maestro\", even the soundtrack seems cheap and gives the false impression that what Bernstein did wasn't really that great or beautiful (luckily, we are blessed with tons of breathtaking videos and recordings by him). E.g. All singing in the soundtrack was of poor quality and made the pieces sound so ugly, I wondered if they ran out of singers or if they just had a tasteless musical advisor.I saw \"Maestro\" in a cinema, only 6 people were in it (on the Friday night of release week), one of them left after maybe two thirds of the movie and a woman next to me and myself were often taking a deep breath or sighing (in an annoyed way) when they stuffed every possible clichee and their forced \"message\" into different scenes.The filmmakers/ studio seem to have spent all the money on famous leads (great names to draw the audiences) as well as marketing/ exciting looking trailers, but not much was spent on anything else that constitutes a good film, like script-writing, cinematography, cutting etc. (not the first netflix production to exhibit this problem). In some places the movie honestly looks quickly thrown together and unfinished. Some scenes or shots seemed to be in the film only because they would look great in a trailer, but did absolutely nothing to convey a message or tell the story.",
    "35": "Greetings again from the darkness. A creative genius must deal with the constant demands, both internal and external, of new and better projects. That last one was great, now what's next? The art is never enough, and it's never done. As if that pressure to create is not enough, there is also the personal side. A connection is presumed by fans and customers and critics. We like your art, so we feel like we know you. How does one even find their true self, much less hold on to it, while being adored and showered with accolades? Well, many don't, and the aftermath is usually not pretty.Bradley Cooper has received nine previous Oscar nominations in various categories: Actor, Supporting Actor, Producer, and Writer (many from A STAR IS BORN, 2018). He has yet to win, but with this latest (co-written with Josh Singer, an Oscar winner for SPOTLIGHT), Cooper is likely to nab multiple nominations yet again. \"Oscar bait\" was how a movie like this would have once been described, simply because it's well made and appeals to a wide audience. While the description seems a bit unfair, this film is in fact, well made and appeals to a wide audience. On top of that, the two lead performances are both noteworthy. Cooper stars as Leonard Bernstein, and Carey Mulligan co-stars Felicia Montealegre, the actress Bernstein married.Leonard Bernstein was a generational talent as a world-renowned conductor, He was also a bi-sexual philanderer who felt he never received due credit for his compositions. Felicia was a long-loyal and long-sacrificing spouse who raised their kids and supported her enigmatic husband, who frequently used his musical genius as an escape clause. The film spans the 1940's, when Bernstein made his accidental (no rehearsal) debut as Assistant Conductor filling in for the New York Philharmonic at Carnegie Hall, to the 1980's when Bernstein is giving an interview at his Fairfield, Connecticut estate and discussing how he misses Felicia.This is clearly a labor of love for Cooper as director-star-writer-producer, and yet it's Mulligan who has the most complex role ... one she excels in. Certainly, Cooper shines in a tender moment scene with daughter Jamie (Maya Hawke) where he lies about the rumors she's heard, and he relishes the highlight of reenacting the London Symphony Orchestra at Ely Cathedral in 1976 for Mahler's second symphony. The latter is a scene itself worthy of a theater picket price for the picture and sound. Despite the flamboyant nature of Lenny, it's Mulligan who is the heart of this story, and she excels in every scene ... especially the Thanksgiving Day argument as Snoopy floats by their Central Park apartment window.A third co-star here would be cigarettes, which seem to fill the screen with smoke regardless of the time period or location. Seriously, the supporting cast includes Matt Bomer and Sarah Silverman, and Bernstein's compositions are heard throughout the film, including \"West Side Story\" in the most ominous moment. A particularly creative scene occurs as Bernstein becomes part of the \"On the Town\" sequence on stage, and we also see Lenny and Felicia interviewed on television by Edward R Murrow.This is Cooper's second outing with almost complete control of the project, and it's a technical masterpiece from a movie-making perspective. If it falls a bit short on the emotional connectivity scale, that's likely due to the true story of Lenny and Felicia. The cinematography from Matthew Libatique is gorgeous (both black & white and color), and the costumes from two-time Oscar winner Mark Bridges and prosthetics/makeup by two-time Oscar winner Kazu Hiro add to the smooth transitions from era to era. Rather than a traditional biopic, this is more a relationship story - one between an egotistical, absurdly talented man-child, and the loyal, selfless woman who allowed him to shine, even as she stood frustrated in shadow.",
    "36": "Having just had the pleasure of seeing this film on the IMAX screen in London I can confirm that an intimate drama in standard aspect ratio heavy with closeups of people simply talking can prove perfectly acceptable in this format.The resemblance to Leonard Bernstein of the makeup applied to Bradley Cooper is extraordinary, but the convincing way he ages is more extraordinary still; while the vigour of Cooper's performance is matched by the energy of his direction - which includes fanciful use of black & white and colour which enhances the mood of the film by capturing the look of magazine photography of the period - and the gusto with which Bernstein throws himself in equal measure into both his sex life and his art (both he and wife Carey Mulligan consume cigarettes at a rate of knots throughout the film - even when the poor woman is being (SLIGHT SPOILER COMING:) treated for cancer; right up to the final closeup of Bernstein drawing on yet another cigarette.Lovers of Bernstein's music may demur at how little of his work actually makes it into the film - although his performances of Mahler, Shostakovich and so on are briefly heard on the soundtrack - for the emphasis is principally on his domestic affairs and for Bernstein the theatrical pleasure of conducting plainly far surpassed the lonely drudgery of composition.",
    "37": "Think of a biopic of a famous person as like a complex cake - you can carefully dissect one slice of it to examine the contents, or you can bravely try to examine the whole lot to see what it's made of.This biopic of American composer and conductor Leonard Bernstein is like looking at only the surface of the cake through a slice of Swiss cheese - a lot of loosely connected vignettes with no depth. If you don't know much about the man, you would leave the theatre with no great insights about him.The film jumps around in time and gives you snippets of the man's life and work. There are scenes about his bisexuality and penchant for men, his role as a conductor and composer, his drug addictions and his relationship with his daughter, but none of these are examined in any depth at all. His bipolar relationship with his wife and her later death from cancer are given the most screen time, but still feels unfulfilled and lacking in substance.Bradley Cooper directs in a rather disjointed style. The first half is shot in black and white, then we change to colour for no good reason except maybe historical chronology - it doesn't work. Neither does the curiously tight aspect ratio, which again inexplicably opens up to full screen near the end. Some scenes are beautifully shot but too often Cooper relies on the slow zoom in and the very long takes, which don't always seem to match the scene. The film also could have ended perfectly with the penultimate scene, but inexplicably ruins the moment with one extra shot that completely fails to land.Carey Mulligan is excellent as Bernstein's wife but Cooper as Bernstein doesn't quite work for me. He tends to overact, gives you little insight into the man himself, and the nasal voice starts to grate after a while - maybe it was inevitable with the prosthetic nose he was required to wear.Even the grand concert scene in the cathedral, conducting his beloved Mahler, didn't quite generate the depth of feeling it could have - contrast this with the Tchaikovsky concert scene in the French-Russian film Le Concert, which takes emotion (actors and viewers) to a much higher level.All in all this is not a bad movie, and to be fair it does engage the viewer a little more in the second half. But it tackles too many themes with a disturbing superficiality, giving very little substance to almost any. It could have been a lot better. No doubt however it will get lots of Oscar nominations, but then the Academy lost the plot years ago and succumbs to hype more than merit.",
    "38": "Carey Mulligan is the only reason to see this movie. Her performance is outstanding\nAll the awards!Bradley Cooper wildly overacts as Leonard Bernstein. Matt Bomer is wasted in a tiny throw-away role.I cannot say much good for the movie itself. It starts out in black & white, then turns to color. Why? The first two thirds of the movie were so dull; I nearly dozed off. There is endless philosophizing, and people talking over each other. It added nothing to the story. Then there are long shots that look like they are a mile away of people talking. It makes the actors look Lilliputian.Bradley Cooper'ss direction of the movie is choppy in many scenes, but lovely in others, such as his direction of Carey Mulligan. The camera loves her as she goes from young woman to middle aged woman to dying from cancer.The final third was the best in terms of the story flow.However, I cannot recommend the movie unless you are a diehard Bernstein fan.",
    "39": "My Review - Maestro\nMy Rating. 7.5/10First the brickbats then the bouquets about an impressive movie which is the bittersweet love story about the relationship of famous conductor composer Leonard Bernstein and his elegant Costa Rican Chilean wife actress Felicia Montealegre.This is the second movie I've seen in a few weeks with a 1:33 narrow screen ratio that doesn't go full screen 1.85 till the last scenes of the film plus it's in monochrome until till the last scenes when it changes to colour. In my opinion it's a gimmicky pretentious and hopefully not a lasting trend . For me it adds nothing to the movie experience on the contrary it lessens it for me.The Director of Saltburn Emerald Fennell recently said she chose the narrow screen ratio to allow a peeping in effect ? So I wonder what Bradley Cooper's excuse was ?Well yes , Maestro is at times an uncomfortable peep hole but the 1.33 narrow screen ratio is not required to portray the intimate lives of 2 famous celebrities who no doubt loved each other . The bitterness of the love story is the fact that Leonard Bernstein was a gay man who fell in love with a beautiful woman who bought stability and respectability and children to his life at a time when that was commonplace thankfully no longer.Yes Felicia was aware of his sexuality but loved him dearly until as as in one of the most poignant scenes in Maestro when Lenny is off his face on cocaine and becoming as she describes sloppy about his male affairs she tells him that he will end up being a lonely old queen.My other technical problem was a difficulty at times to pick up on the complex dialogue which is perhaps my hearing but at times it was like being in a room with a lot of people and not being able to the person speaking to me.Bradley Cooper gives a brilliant performance as I expected and no doubt will probably receive at least 2 Oscar nominations however he sounded as if he had a heavy cold which may or may not have been due to his controversial prosthetic nose .The performance I enjoyed most in this movie was from the superb Carrie Mulligan who gives to my mind a potential Best\nActress Oscar winning performance as Felicia Montealegre .From the moment the camera pans on her nervously walking to a show biz celebrity party where she meets Lenny for the first time to the incredibly sad last half hour of Maestro I couldn't take my eyes off her expressive face Carey Mulligan gives a performance of grace and sophistication.This time 12 months ago Tár another movie about a classical conductor starring Cate Blanchett was received with critical praise and Oscar buzz . It was nominated for 6 Oscars winning none so I'm a little cautious about the Oscar potential for Maestro.I mention Tár also because the fictional conductor Lydia Tár for me had a few of the same strong character defects that Maestro Bernstein had namely a gigantic ego which perhaps is unavoidable with great genius plus an almost childlike sense of entitlement , what Lenny wanted Lenny got whether in love or artistic adulation.I remember well watching a documentary made in 1985 about the making of his recording of West Side Story when Bernstein rudely and cruelly verbally attacked Jose Carreras one of the famous 3 Tenors for his pronunciation of one of his songs at that time I thought you're not a nice person in fact you're a rude pig.When an actor Co writes , Directs and stars in their own movie as Bradley Cooper has in Maestro it must undoubtedly be a labour of love or as some may say an ego trip but not in this case I think he has achieved exactly what he set out to do .Maestro originally had 2 other directors lined up first Martin Scorsese then Steven Spielberg but both decided to be Producers of the movie instead .What better endorsement of confidence could Bradley Cooper have received when in 2018 after seeing an early cut of A Star Is Born which was also directed by Bradley Cooper caused Steven Spielberg to walk over to Cooper after the \"Shallow\" scene and say to him, \"you're directing Maestro.\"\nThe co writer of Maestro is the Oscar and BAFTA winning screenplay writer Josh Singer who won for his brilliant writing on Spotlight and also wrote First Man and The Post so Bradley Cooper has chosen a trusted and proven collaborator .The music in Maestro is sublime of course as it's all the wonderful music of Leonard Bernstein . It won't be nominated for an Oscar as it's not original to the movie but it's all been newly recorded\nIn a wonderful scene filmed at Ely Cathedral where Bernstein conducted the London Symphony Orchestra in 1976 Bradley Cooper said, that was that scene he was so worried about because we did it live\nI had to conduct them. And I spent six years learning how to conduct six minutes and 21 seconds of music.It will be so interesting to see how many Oscar nominations Maestro receives next year I would love Carey Mulligan win or at least be nominated but I don't think Maestro is the best movie of 2023 or that Bradley Cooper's performance is necessarily the best but he certainly is impressive.",
    "40": "There's so much to admire here: the wonderful performances, the captivating cinematography, the creative subverting of the standard biopic trope. And yet I came away somewhat disappointed.Part of this is due to the nontraditional approach to a biopic. We don't see much of Bernstein's renowned highlights (\"West Side Story\" is barely mentioned), and for the biography of a famous musician there's surprisingly little music. All right, I'll go with that.Call me a traditionalist, but I wanted more of a defined story arc. We see key moments in their lives but I never truly got a sense of what drove Bernstein (or his wife) other than their undeniable love for one another. Also, in many of the scenes I had a hard time following dialogue: lines were spoken on top of one another, rapidly. Yes, I know that's how people talk in real life, but this is a movie that we're supposed to understand.I will watch this again (with subtitles) to see what I missed, and perhaps I will appreciate it more. Let me state that I mostly liked this (hence my rating) -- but whether it was due to heightened expectations or not, I wanted more.",
    "41": "An old adage holds that meeting an idol isn't always a good idea, if you don't want to be disillusioned.That's the takeaway from \"Maestro,\" a penetrating portrait of monumental musical artist Leonard Bernstein, starring, directed and co-written by Bradley Cooper.Considering how much sublime beauty and exuberant joy he brought to the world as a conductor, composer and concert pianist, \"Lenny's\" life offstage was a glorious mess. Darkness and unrequited hunger in his psyche counterbalanced the soaring highs he shared with adoring audiences.Spanning three decades beginning in 1946, Cooper's ambitious epic follows the artist's meteoric rise and reign in concert halls around the world. His accomplishments extended to theatrical stages (\"West Side Story\") and screens large and small, including his Young People's Concert series in the new medium of television.But more central to Cooper's grand design, it chronicles Bernstein's 25-year marriage to Felicia Montealegre (Carey Mulligan).Cooper gives Mulligan top billing in the credits. Deservedly so. Hers is the more layered performance as she advances from radiant brilliance as a stage actress through the willing sacrifice of her own career in service to her husband's, into final painful decline.Complicating their relationship was Bernstein's bisexuality. When, as a young assistant conductor, he received the phone call that would change his life - to step in for an ailing guest conductor and, without rehearsal, conduct the New York Philharmonic in Carnegie Hall that afternoon - he was in bed with Jerome Robbins, destined for his own Broadway fame as a dancer and choreographer.Although he submerged his sexuality in ensuing decades, becoming instead a doting father to his three children, Lenny would eventually become less discreet in his pursuit and seduction of younger men.He was a charismatic figure of boundless enthusiasm and insatiable appetites. For all the exacting precision he expected from his musicians, on the podium he seemed ravished by the music, his face in ever increasing ecstasy, utterly spent by the final note.Cooper learned to conduct with the same ferocity he brings to every detail of his portrayal - the frenetic Manhattan accent punctuated by the ever-present cigarette in his fingers or hanging from his lips. (\"Maestro\" should come with a surgeon general's warning of secondary smoke risks just from watching it.)\nAround the central performances, with stars like Sarah Silverman in the supporting cast, Cooper captures bygone eras with distinctive visual touches. He'll shoot dialogue shots from the distance, making the settings in Manhattan, Tanglewood or the Bernstein home in upstate New York as important as the words. The cinematography, following \"Oppenheimer's lead in black and white and color, is as lavish and bold as the musical score.The Bernsteins' Park Avenue duplex overlooking Central Park also became a hub of activity, awash in upscale liberal cocktail parties brilliantly immortalized by Tom Wolfe in \"Radical Chic and Mau-mauing the Flak Catchers.\" Here as on the podium, Bernstein was always \"on,\" always performing, the center of attention, sucking all the air out of the room.Considering that he essentially launched his career as the pretty boy in \"The Hangover's\" hapless quartet, Bradley Cooper continues to demonstrate himself as a consummate artist on both sides of the camera. \"Maestro\" nicely follows his remake of \"A Star Is Born,\" which also probed the tortured soul of music making.Creative genius, it seems, isn't always a gift for the handful of humans who possess it. In Bernstein's case it felt like an unachievable responsibility, a curse as much as a blessing.As a member of the audience that grew up watching Bernstein's Young People's Concerts in the '50s, he remains a mythic figure, more demigod than human to me. Steven Spielberg and Martin Scorsese are about my age. Similar feelings my have prompted them to sign on as producers of Cooper's film.Lydia Tár also grew up watching the Young People's Concerts, which shaped her ambition to become a conductor herself. Lydia, of course, wasn't real, but the brilliant creation of Cate Blanchett and writer-director Todd Fields in last year's similarly themed \"Tár.\" Ironically, it's Lydia rather than Lenny who is ultimately the more compelling screen character. His very human failings don't fit nearly as neatly into three-act structure as her fictional flaws did.True, Leonard Bernstein's artistic genius achieved immortality in his lifetime.But sucking all the air out of the room gets annoying after a while.",
    "42": "I don't know if maybe \"Bohemian Rhapsody\" (2018) or \"Rocketman\" (2019) have made me a bit immune to the rather hedonistic lifestyles of the musical rich and famous, but I found this beautifully photographed depiction of the life of the enigmatic Leonard Bernstein to be remarkably tame. The monochrome presentation is glorious to look at, but the narrative is weak, I found. Carey Mullian, his long-suffering wife Felicia Montealegre is easily the most meritorious of praise here. She portrays the increasingly frustrated, betrayed yet still loving woman with a strength and subtlety that is really engaging - especially towards the end of the film. Cooper, on the other hand - well, was he meant to be mimicking Barry Manilow or Tony Bennett? We learn very little about what made the man tick, about what made his sexuality such a big deal for him? The other characters come and go with little context to illustrate their roles in his life, his role in their's and with the possible exception of their eldest daughter Shirley (Sarah Silverman) there is no conversation to be had about just how this marriage of convenience was established or managed. It's also largely devoid of his most famous musical works. Aside from the tiniest interlude from \"West Side Story\" - which I know he didn't much care for - we could be forgiven for assuming that this was a biopic of a composer with high-brow classical aspirations but with little popular appeal. That said, there is a splendid rendition of Mahler's 2nd from the acoustically gorgeous Ely cathedral to savour, but otherwise this is all a rather underwhelming melodrama that really didn't tell me much that I didn't already know about this charismatic, selfish and flawed individual the fluctuating state of whose marriage was, frankly, of very little interest to me. More marital woes than maestro, sorry.",
    "43": "Many people know Leonard Bernstein by his recordings of classical music, and by his compositions for Broadway and movies. This film shows the private side of his life - his relationship with his wife Felicia, herself a busy actress. It also includes his relationship with his children (mostly his daughter), and the various men that float thru his life - which his wife accepts, as long as he is discreet.Backing the story are excerpts from Bernstein's career. The soundtrack includes music he composed, including West Side Story, and combined with bits of classical music. There is a scene of a rehearsal of the dancing sailors from On The Town, while the classical highlight is Bradley Cooper conducting (allegedly live) the finale of Mahler's Symphony #2 \"Resurrection\".Since the time period spans ore than a quarter century, there is a problem of having too many characters who are basically cameos, which I had trouble following.Shooting the earlier scenes in black-and-white is an interesting attempt at \"documentary\", given that it was the time period before color film The makeup for Bernstein is impressive, changing as he ages. Also interestingly, Carey Mulligan as Felicia Montealegre is given top billing, even though she has less screen time than Bradley Cooper, but Cooper already has credits for Director, Writer, and Producer as well.So this film will appeal to lovers of certain genres of music, while it will not resonate among those who don't know Bernstein.",
    "44": "This film is a shoe in Academy Award nominee, potentially winner in at least 7 categories. In the UK it is already out in cinema. Who knows for how long. Then it will be Netflix but, honestly, it is much more enjoyable on a big screen rather than on an IPad or Airplane screen. Funnily enough, for a movie titled \"Maestro\", the film devotes equal parts to Bernstein the man, the Conductor, the Composer, Elite New York and the Wife. In a way it seems a continuation on the themes of \"A star is born\". That was Lady Gaga's movie, this one is Carey Mulligan's. There is a dissonance in the making of this film I am not sure I am able to explain. The black and white parts are near perfect, the transformation of both Bradley Cooper and Carey Mulligan is a feast of make up, costumes and mighty acting, the scenes, the editing, the music, so much music... It' s an emotional and amazing journey in and out of Carnagie Hall, Midtown Manhattan and - go figure - Ely Cathedral, Cambridgeshire. But there is that dissonance, a harsh sound like the phone ringing at the beginning of the movie, and it confines this triumph of research, prosthetic, locations, sound and cinematography to near perfection.",
    "45": "Maestro is the ideal directorial follow-up to A Star is Born and a biopic that shows what it's like in the shadow of an all consuming fame just as much as it shows the iconic career of its subject. If all biopics were as bold and inventive as this film's early black and white sequences then the genre would never be considered boring again.Aided by Kazu Hiro's faultless make-up, Bradley Cooper gives one of the best performances of his career. It feels like his entire being is in this performance, best exemplified during the one time it shows his conducting in all its glory. It's performed like a euphoric out of body experience in which Cooper gets completely lost in the moment.There's a reason that Carey Mulligan is billed first because this is her film just as much as Cooper's, if not more. She exudes elegance flawlessly and the early scenes in which the relationship begins to form between her and Bradley Cooper has a real spark to it. The most devastating moments of the film come from emptiness that's so clearly felt when she isn't there.Bradley Cooper's direction feels designed as a direct response to any criticisms of his previous efforts not being showy enough. This is truly bombastic stuff, switching between colour and black and white with very precise framing and more lyrical flights of fancy. He also ends the film on the perfect shot and really knows when to incorporate Bernstein's own work into the soundtrack.",
    "46": "It's a decent oscar-type biographical movie about Leonard Bernstein and his wife Felicia Montealegre with gorgeous production and camerawork, direction and strong performances from the cast members. Bradley Cooper's previous work \"A Star Is Born\" proves Cooper has talents with directing and this movie takes different direction and approach from his previous work, and there are some pretty good directing on the style, atmosphere and tone Cooper provides. Many of the sound designs, the musical/soundtrack moments and the compositions were well executed as it helps to add the energy and setting of the time era and the works of Bernstein. All of the performances are really good as Cooper and Carey Mulligan have good chemistry and dialogue between one another. Including good costumes and presentation uses of black & white.On the narrative, while Cooper and Josh Singer do try to provide some interesting concepts and themes, I found the narrative to be too standard and basic to the extent I wasn't fully emotionally with the characters and writing. The writing is the typical Hollywood biographical setting with predictable structures and set pieces which did make the movie a little boring at times. Leonard Bernstein is an interesting figure and I kind of wish the movie explored more about his character in other aspects. Certain dialogue moments felt a little rough and there were certain styles and movements that felt like it wanted to be Tár but it ended up being cheesy and kind of show off.Undeniably, Bradley Cooper has a vision and this movie does prove it. There are some really good directing and strong performances and chemistry between the actors. But I just didn't connect with the characters and story. Overall, it is ambitious and there are some really strong moments but it feels more like a typical Oscar-Bait movie.",
    "47": "Once upon a time there was a nice Jewish boy named Leonard Bernstein who lived in the artists apartments in Carnegie Hall. One day a conductor couldn't show up at Carnegie Hall, so Leonard took his place, and everyone called him a genius. He married beautiful Carey Mulligan and had beautiful children and made important music and TV shows and money. And because he was bisexual, he cheated on his wife with anyone he wanted. Once his wife got angry with him and left, but she came back. Then his wife got cancer and died, and Leonard was sad, but now he could sleep with anyone. And if he hasn't died, he's still doing that today.Well, he did die in 1990 at the age of 72, and Bradley Cooper wore a big fake nose to play him in this movie. That got a lot of people very angry, but I thought it made him look like Bernstein. Mostly, though, I wonder why Bernstein for this diagetic musical? Why not someone who did more interesting music, like Aaron Copeland? As I am so often, these days, I am confronted with the question of who this movie was made for.Not that it's not a fine piece of film making, with great performances, but it's not really much of a story, is it? As for Bernstein's music, he was a middling talent as a composer, and never appreciated the good work he did there; as a conductor, he was mainly notable for being one of the first Americans to be the conductor of a major orchestra or three. His most important role was probably that of educator, not only for his Young People's Concerts, training other conductors, and keeping the upper edge of cultural consensus going in this country for longer than it might have otherwise. Is that enough to justify a motion picture, even one that Spielberg and Scorsese expressed interest in directing?",
    "48": "No pun intended - Bradley Cooper! I would not have thought he'd be in this place when I watched him in Alias. The tv show that is - I loved him in that show, just in case that came across in a bad way. And I loved him in the movies he did after his run was done with that show. But he has shown himself able to be behind the camera as well as in front of it.Now this ... I am not sure what to call it: is it a biopic? I reckon that is the closest one can call it. But it is not really focusing on a lot of things Bernstein. It does rather focus on his relationship (Mulligan playing his significant other - well one of them so to speak - the main one).I think it would have made sense to have done some homework before watching the movie. On the other hand it does work without much prior knowledge (I am the best example for that). Of course you may know at least some of his work - or have heard it! Literally that is of course.I had not idea about his private life - and Bradley really gets into that. He becomes him - and that is not just the make up. You may still see Bradley underneath it all - but he also does the voice thing. While I have no idea what the real one sounded like ... I am quite certain Bradley comes at least close enough.When it comes to his private life, I reckon some may have issues with it. But Oscar buzz is there ... for both main actors ... and this is a movie that lends itself to be nominated multiple times ... whether you find it deserving or not is a different matter ... still technically and otherwise top quality ...",
    "49": "Came in knowing nothing about the guy, and even after 2 hours I can't say that changed. A common critique of biopics is how their structure usually facilitates merely the broad lines, the Wikipedia summary. Well, let me tell you, Bernstein's Wikipedia page is infinitely more interesting than anything this shows on screen. I mean, the guy had an FBI file due to his left-wing activism, and even Sherlock couldn't deduce that out of this film. Granted, Cooper seems more drawn to interiority, to psyche, but his insistence on bulldozering through the story leaves emotional connections severed. So much nuance is lost that when Bernstein has a fight with his wife, the performances mighty as can be, the motivations behind their disagreement were absent to me. Cooper doesn't seem able to decide how the hell he wants to approach this man. Is it about a troubled mind, an artist wrestling with the inevitably of his end? Is it about a marital struggle fueled by sexuality and ego? Is it about Bernstein's connection to the realm of music? It's all of this and ends up none of this, each element so criminally undercooked it's ultimately unfocused.Maybe the biggest offense, though, is how little we see him actually conduct. It takes 90 minutes for the film to properly show us the conductor doing what that name entails, and it's powerful, not only musically but also through the energy and dedication displayed by Cooper. Obviously, 2 hours of this is not what I'm asking for - but it does hint at the underlying problem of Cooper not understanding where the strengths in this tale lie. Incredible how last year's Tár boasts a completely fictional character that feels more real and defined than the recreation of an actual person here.At the end of the day, it looks neat and features some marvelous performances that will probably sneak their way into the awards season, but, ultimately, there doesn't appear to be a point, which dooms both your engagement and remembrance: I watched this mere hours ago and forgot about it multiple times already.",
    "50": "As much as I love Biopics I do think they are one of the harder genres to pull off in a successful way. I've seen more than a fair few that feel like the cliff notes of an interesting story rather than an actual examination of real people and fascinating events. For every Oppenheimer there's a Napoleon and I was so excited to see how Bradley Cooper would portray a biography like this after his strong debut as a director. While Maestro doesn't come close to being in the cliff notes category, I do wish that Cooper had told this story in a bit more of a unique way.I fully bought into and loved Cooper's performance as Leonard Bernstein. I thought his makeup transformation was extremely well done (I think the controversy behind it is ridiculous), I thought he nailed the accent as well as all the conducting scenes, all of which I thought were the best scenes in the movie. And I say that as someone who doesn't know anything about that kind of music. Carey Mulligan is every bit his equal too. There's a physical process that character goes through that can't be fully conveyed with makeup and she portrayed it so wonderfully that it actually start to affect me as a viewer. The best thing I can say about these two actors chemistry is that their interactions never felt scripted. They felt like genuine conversations between too people with a lot of history and that comes down in large part to the dialogue.It's so unbelievably well written and performed. It feels like it's ripped directly out of a film from the 50's or 60's where a large majority of this takes place and it manages to be extremely witty and quick paced without ever seeming overwritten. I can't fault Cooper's performance or his work behind the camera in this movie. It's a gorgeous looking movie with a great use of aspect ratio and other than a few overly flashy long takes and scene transitions I thought his direction was really well restrained that let the performances and music speak for themselves. I'm not overly familiar with all of Leonard Bernstein's music but I thought it was integrated into the film in a really fitting way. I was totally impressed by this movie from a performance and technical perspective but honestly not that enthralled with the way it told its story.I found this to be an extremely well acted and very well shot version of a familiar story told in a frustratingly straightforward way. The opening scene seems to imply that the story will play out with a flashback narrative but after the opening events play out entirely linearly with a lot more familiar plot beats than I would've liked. As soon as the central romance begins it's obvious there's only a matter of time before it runs into turbulence and it does in the most predictable way possible. I wouldn't exactly call the film fast paced but I did think it was a bit too montage heavy for its own good with a lot of time jumps that felt very abrupt. A lot of the key turmoils in this relationship were too brushed over and as a result I didn't always find the drama to be as compelling as it could've been. Because the lack of build up in these areas a large part of the third act dragged for me and after a certain event happens very abruptly the film plods along for another 15 minutes before ending in a way that I felt could've been stronger.I really enjoyed all the performances and technical aspects of Maestro but I just wasn't as invested in it as I wanted to be. It's an extremely well presented version of a story we've seen done before with a lot moments that would've had more impact if the script spent more time on set up than it did on pay off. I did like this movie but I was expecting to enjoy it a lot more given Cooper's clear passion for Bernstein's life. I enjoyed my time with it but unfortunately I don't know that I'd ever watch it again. Still I think Bradley Cooper has a good filmmaking eye and I'll definitely be interested to see what ever project he helms next.",
    "51": "If you are looking for a movie about how Leonard Bernstein created his masterworks, or chose the subjects for his Young People's Concerts or what went into composing his broadway and movie scores - this is NOT the movie for you. This is Bradley Cooper's homage to Citizen Kane. With the strange aerial shots, the black and white cinematography, the overlapping dialogue - exactly the kind of pretentious movie making that the old members of the Academy will eat up.Yes, the two stars, Cooper and Mulligan chew the scenery and will definitely get Oscar Nominations, but the movie was not made for music aficionados.The movie was made for those with a prurient interest in Bernstein's sex life. Too bad it wasn't advertised that way. With a title like Maestro - one might conclude that the viewer might get some insight into the mind of this gifted and inspired artist - completely not the case.This is certainly Oscar candy - it's just sad that you are better off watching a documentary on the movie's title character than this Award seeking click bait.",
    "52": "Seeing Maestro was one of those it helped having a full blown fan of the subject (I love West Side Story and On the Waterfront and that's my extent) - my mother, who religiously watched the children concerts on TV for years and saw him as \"heroic\" - and while she loved Cooper's lush and emotionally bittersweet saga even more than I did, talking with her about how some of the visual choices were thoughtful and precise made me like it more.For example, a number of the extended shots showing Lenny and Felicia together in conversation, from afar and close (and eventually in one of the most memorable scenes an explosive argument), and how they are like choices a composer or conductor would choose for - here is where something has to be extended and where this instrument plays softly and then this takes off with a boom and clash. There is distance at times, but never carelessly presented.I think there are a few scenes in the middle I found a little dull (which ones? I'd have to go back to watch it again to pinpoint them but they were a couple of the familial hangout scenes as I recall), but what I did like and really appreciate about the film was that it is firmly a biopic that has its feet planted in character over incident. It doesn't mean there aren't important moments for Lenny and Felicia in the film represented, but it is about the magnetic power of LEONARD BERNSTEIN above almost all else.The almost, of course, being his relationship with Felicia and the bisexuality and other partners (for its and maybe any time), and as sharp and against all odds empathetic Cooper makes Lenny its Mulligan who makes the movie for me, a subtle and joyful and eventually devastating performance and character. In other words, this doesn't make the mistakes of like Napoloen, for example.And while I do think having one or two scenes showing more of Lenny's creative process at work could have been enlightening, it may be clear (at least this was my mom's point I'm adopting because it makes some sense) that as Bernstein tells the one interviewer he is/was as a creative person solitary doing it all himself, so showing that on film might not be as involving (though with collaborators? Shrug).But the real emotional meat, and the greater point of Maestro, is what is felt and accepted and given back of the relationships, about the glorious and beautiful, the thrill of success and the disillusionment of being the \"other\" in someone's heart; and the ugly nature of how someone sees themselves with someone else (especially if they're brilliant *and* a narcissist), or how one doesn't reveal something about themselves (again, the bisexuality).There is daring in the filmmaking - again, once or twice early on to the effect of... that is a choice and a half, like when it becomes a fantasy dance number on stage with part of the cast of On the Town, and I wish that framing had come back at some point - and for the couple of moments it lost me it doesn't mean what works is overshadowed. Like Priscilla also this season, this is a true life famous person saga where it's not about what happened but how they felt about it, and Cooper as actor and director latches on to feeling like a pro... And when Bernstein is conducting the orchestra, specially Mahler? What a rush.",
    "53": "Just back from seeing Maestro on its opening weekend at our local theaters. Bradley Cooper and Carey Mulligan seem to be shoo-ins for Best Actor nominations, along with a few other categories like set design, costuming, and cinematography. I admired the craftsmanship on display here quite a bit -- meticulous recreation of the styles, settings, speech patterns from the 1940's through the 70's. And obviously Cooper dug very deep into channeling Leonard Bernstein, not just hairdo and makeup. (And at times his resemblance to the real Bernstein is pretty stunning.) I knew a lot less about his wife and love Felicia Montealegre, but I'm assuming the same is true for Carey Mulligan's portrayal of her. They are both arresting, finely nuanced performances.It's all impressive and worth seeing more than once. One thing I wanted more of was, oddly enough, the music. We mostly get only tiny snippets of Bernstein's own compositions, plus a bit of Beethoven and others, as if Cooper (who's also the director) thought we the audience wouldn't have the patience for more. Wrong, IMO. There is one -- just one -- centerpiece scene allowed to play out full measure, which is Bernstein conducting the last several minutes of the titanic Mahler Second Symphony in a huge cathedral. It's the highlight of the film, and although the purpose seems to be to show B's over-the-top directing style, the music itself is what's overwhelming. Bernstein seemed to be made for Mahler (than whom there is no more emotional composer) and his work bringing all of Mahler's symphonic work back into the mainstream is for me his biggest career accomplishment.The rest of the movie is like a series of short vignettes, as if we are putting blocks together to gradually assemble a rounded picture of Lenny and Felicia. I wanted them to let some scenes just play out longer. When this thing is on Netflix I'll watch it again to help decipher all the rapid-fire, overlapping dialog. And, I'm not sure that even if you go back and look at films from the 1940's you would see this much cigarette smoking! It's a feature. He was clearly a chain smoker, but was she as well? Perhaps so, given their causes of death.All this said, it's a major film and worth going to see. There are loads of movie biographies of famous people that are totally off track. This one isn't.",
    "54": "Giving this an 8/10 ratingBradley Cooper, writes, directs, stars in this epic tale of conductor-composer Leonard Bernstein and his actress - wife and muse of sorts, Felicia Montealegre Cohn Bernstein, plated by Carey Mulligan. Except Oscars nominations for both of them and this film.Cooper is totally immersed and you really can't see his face with the brilliant make up as Bernstein, old and young, he explodes into this role, like never before, and has too, if he had put a foot wrong, the film would fall so far down the rabbit hole, and that goes for Mulligan, she really, really is so good.Like, 'Napoleon', this is a love story at it's heart, but with the explosive brilliance that is Bernstein's music, the sound is superb, and the the photography, is more than right, it is a film of two halves, and it is sharp, soft, loud and has plenty of moments of did this really happen?! There is plenty of excess here, and I really did not know about a lot that happens in this film. The only reason it does not get a 9 rating is that does drag in the later half, I think some parts of this tale, might not of been necessary, but probably are right for the film, I leave that for you to decide. This is Musical chairs and romance.",
    "55": "Maestro marks a tremendous leap forward for Bradley Cooper as an artist. Absolutely magnificent work from him both in front of and behind the camera! The film really digs into the soul of Leonard Bernstein in a way that's sometimes breathtaking to witness. Cooper transforms into Bernstein with a stunning, naturalistic performance that challenges Cillian Murphy for the Oscar! But despite such a great performance from Cooper, it is Carey Mulligan who runs away with the film by the end - she is truly outstanding. The film truly shows how much Cooper loves filmmaking; it is a visual symphony of a film with so many grand visual flourishes that really impressed me. Cooper truly has great directorial instincts! I loved the distinct look and feel of the movie, the framing and blocking of every shot, it's a gorgeous film to look at. There are some truly astonishing scenes with stunning cinematography and grand sound design, especially while Leonard Bernstein is conducting. The cathedral scene where Bernstein conducts Mahler's 2nd symphony is a highlight of the film, where for some six minutes the camera visually locks on Cooper who is clearly conducting the hell out of this gigantic piece of music. You could think of it as the classical music equivalent of one of those holy crap scenes from the Mission: Impossible franchise where Tom Cruise performs the jaw-dropping stunt. This moment was INSANE to witness in the film; a marriage of both brilliant filmmaking and a committed performance. If Cooper wins the Oscar... this scene will be why.Unfortunately, the screenplay mainly struggles to tie these memorable scenes together into something more cohesive. It also seemed to ignore a lot of Bernstein's work and had less of a focus on the music than I would have liked, instead focusing on the messy love story between Leonard and Felicia, which for the most part still worked (much like the 2015 Steve Jobs film), I was just left wanting more. However the acting and directing more than make up for it! Plus, the soundtrack which features many Bernstein compositions and pieces he conducted paired with the film wonderfully and truly showed off what a master he was. There is absolute brilliance here, along with some moments that were a little flat. Beautifully reminiscent of classic Hollywood, Maestro is a surprising approach to such a legendary figure as Leonard Bernstein, while working as a showcase for a magnificent Bradley Cooper as both an actor and a director.",
    "56": "I'm not sure I would have watched this movie if I hadn't gone to a premiere screening. The marketing and how the media is focusing so much on the prosthetics makes it seem like it's going to be a bore. But that wasn't at all the case and I was absolutely blown away by Bradley Coopers writing and directing in this film.There are some truly stunning shots that feel like they should be framed and hung in a museum. There are many long takes with no cuts that make this film feel calming to watch while keeping us engaged with the level of intimacy and vulnerability of the characters. He masterfully portrayed how humans have many layers and parts of them, both light and shadows. The more brilliant the artist the more complicated they probably are.I laughed and I cried and I left this movie with a lot to ponder. Well worth a viewing. Bring tissues.",
    "57": "Maestro navigates a sophisticated narrative terrain with commendable finesse, offering audiences a glimpse into a compelling storyline. The film's strength lies in its captivating performances, with actors delivering nuanced portrayals that anchor the viewer in the unfolding drama.Visually, Maestro stands out, as the cinematography is marked by striking compositions that enhance the overall aesthetic appeal. The musical score, a key element of the film, resonates powerfully, contributing to the emotional depth of pivotal scenes.However, the movie grapples with pacing issues, as certain sequences feel rushed, impacting the overall coherence of the storytelling. Character development, while promising, appears underexplored, leaving some personas feeling two-dimensional and leaving audiences wanting more depth.Despite these critiques, Maestro remains a commendable cinematic effort. Its potential is evident, with moments of brilliance that elevate the viewing experience. While not achieving the status of a cinematic masterpiece, the film earns a respectable 7/10 rating for its notable strengths and the promise it holds within its narrative and artistic elements.",
    "58": "After all these years Bradley Cooper is still the worst actor Hollywood has, this was the worst performance I've seen in any Biopic. Even the media play cannot cover his lack of talent. He keeps getting worse with each new movie..Worst Biopic of all time my expectations were already low and it still managed to make me disappointed Bradley Cooper needs to retire he was never meant to be an actor.Pooper was practically begging for an Oscar through the full length of the movie his performance feels so forced and uncessary. A pain to watch. And to think he stole the role from Jake Gyllenhaal just for Cooper to give us one of the worst performances in cinema history is flabbergasting.As someone who usually enjoy Biopic this one fell short compared to all the promotion it got, I can easily say it is the worst of all time. Even the prosthetic NOSE couldn't be convincing and cover Cooper's lack of Talent.",
    "59": "Film directed and acted brilliantly by Bradley Cooper, in addition to being produced by giants Martin Scorcese and Steven Spielberg.I ask that, when you watch, be patient in the initial (introductory) 30 minutes.Once the film gets going, it becomes a well of genius, sensitivity and musicality.I'm already predicting that Bradley Cooper will win the Oscar and Golden Globe for best actor - handily, there's no competition this year. If not, it will be unfair.Carey Mulligan, at 38, has reached her peak. Beautiful performance and, certainly, she is also one of the favorites for the Oscar and the Golden Globe.Spectacular photography and soundtrack, as well as characterizations so real that they scare.Anyway, the movie will win many awards in the 2024 season."
}