{
    "0": "The Table, the international crminal brotherhood which has condemned John Wick empowers The Marquis to deal with him (and the Manager of the New York Continentale Hotel). But maybe, just maybe, there is a way out.As expected, the IMDB is full of people saluting this as \"Best John Wick yet,\" \"A masterpiece,\" \"Best action movie ever,\" etc. My view differs. But I must start by giving credit where it is due. Production design, cinematography, action choreography and direction are all first rate, and they deserved a much better film that this is. And this film deserved a much better script than this.The story is fine, quite good even, but it is buried under industrial quantities of action which defies belief. Everbody's resistance to trauma and the complete absence of police are just the big two, but let's not forget the endless succession of pairs of heavies coming out of nowhere and only stopping when Wick has no gun.And even the scriot deserved a better actor than Keanu Reeves. To be fair, the character in the first film has been reduced to a mere cardboard cutout here, but Reeves (who I genuinely like as a performer) doesn't even play cardboard well here.This is beautifully crafted drivel. 7 for craft, 3 for Reeves' central performance, averages to 5.",
    "1": "The first three John Wick films came in fairly quick succession, with only five years between the first and third chapters, each film trying to top the one before in terms of wild set pieces. For me, it all became a bit too much, the action rapidly becoming too frenetic and over-the-top. By Parabellum (part three), I had had enough.I hoped that the four years between Parabellum and this fourth entry in the franchise had given me a big enough breather that I might be able to find new appreciation for the excessive mayhem. If anything, I found Chapter 4 even more tiresome: the fight scenes, as technically excellent as they are, simply don't know when to quit, and they're even more ridiculous than ever. Wick has been established as a semi-mythical being (Baba Yaga), seemingly impervious to pain and injury, meaning that the character is never in any real peril, which generates zero jeopardy or excitement. If anything, the relentless action scenes result in boredom, being mind-numbingly repetitive and far-fetched (the whopping 2 hours 49 minutes runtime doesn't help).Director Chad Stahelski pushes plausibility way beyond breaking point with a protracted melee amidst the traffic around the Arc De Triomphe that somehow fails to attract the attention of the Paris gendarmerie; an even more dumb scene (in a film packed with dumb scenes) sees nightclub revellers continuing to dance while people are being shot and axed to death all around them. The final act - a duel between John and blind warrior Caine (Donnie Yen) - takes place outside the Basilica of Sacré-Coeur de Montmartre at dawn, with not a single tourist or passerby to alert the authorities of what is occurring.I've been known to enjoy comic-book action films that aren't exactly grounded in reality, but John Wick 4 seems to take place in an alternate universe where none of our rules apply. Since very little of what we see in this film can be believed, I definitely don't swallow the idea that John Wick is actually dead at the end (although I sincerely hope he is).Those claiming that this is the best action film ever made have clearly never seen The Raid 2 (or any early John Woo film, or The Night Comes For Us, or Ong-Bak, or Born To Fight, or Eastern Condors or In The Line of Duty IV or.... well, you get the idea).",
    "2": "What is all the raving about with this movie? I felt it lacked a decent storyline and was 2 hours and 35 mins of fighting while the remaining 10 or so minutes was acting.The usual far too long fighting scenes where he does his usual MMA moves by getting the enemies head between his legs while he reloads his gun and shoots him the head.For me it was at least an hour too long and could have been much shorter. The storyline was very weak and after such a long gap between this and John Wick 3 I am surprised it was written better.I also have no idea why this review has to be a minimum go 600 characters?Yes we.",
    "3": "In this fourth installment of 8711's successful franchise, Keanu Reeves wearily drags himself from setpiece to setpiece, saying little, surviving the most ridiculous setups and finally achieves nothing.The acting and writing of JOHN WICK: CHAPTER 4 are indeed the worst aspects of this film, and the exaggerated runtime of almost three hours doesn't help.Try to remember John Wick's motivation to do all the things he does. What exactly is he actually doing, escpecially in this one? In addition to a lack of motivation, Chapter 4 is a remarkable retcon in the sense that John Wick could have ended the hunt for his person way earlier, thus making at least the last two installments redundant.There's plenty of action here, sure, but it has been getting more and more unrealistic, and so you'll be in a situation where your suspension of disbelief says bye-bye, especially when you contrast the growing ridiculousness of the action with John Wick's decreasing vigour.The plot has some toddler level plot holes and contrivances which are really distracting, yes, even in an action no-brainer like this. Keanu Reeves has maybe ten lines of dialogue in the whole movie. The Marquis is a nonsense character, just like Donnie Yen's Caine character. They just appear, but especially in Caine's case you're supposed to be emotional about it because he's basically John Wick's brother from another mother. We just never knew about him. Oh well.This is the definition of a dumb movie for dumb people, and if you just want to enjoy some nice shots and over-the-top action (some of which is really nice) AND love Keanu Reeves, this is your jam. If you need a bare minimum of consistency and structure, you might feel cheated.",
    "4": "In my opinion this is by far the worst movie of the franchise. It's just way too over the top. Everybody seems to have magical jackets now to stop the bullets.Audience loved the dogs on the third one so that just lazily copied one here also but didn't bother to have any real cool scenes with it.I'm happy they made John Wick 1 but since then every movie getting worse and worse. This one was already so bad that I regret spending any money to see it.People shooting and dying in center of Paris but police doesn't seem to care.John Wick getting shot, falling from great heights etc without any issues.",
    "5": "Very much over rated. Repetitive, tiring and inauthentic fight choreography for 3 hrs straight. Unnatural and generic one liner filled script. No deep drama whatsoever. Just bland, perpetual killings till one is numb. Awful and fake seeming blood effects. Bland, cliched action hero.All these characterize John Wick 4. These movies keep getting shallower with every sequel. The little soul the first two had is dead and buried here. I don't get the hype. John Wick has become like those generic, action B movies with cliched scripts and characters. Not to forget the unlikable and uncharismatic addition, black guy with a dog. He was as dull as it gets.Beautiful cinematography though. Loved some of the scenes except the CGI ones. A point for that I guess.",
    "6": "...all at the same time. This hybrid comic book-video game has a stupid plot, worse than average acting, and fight scenes that are so poorly done you don't mind going to the bathroom. Don't get me wrong. I loved John Wick 1. Thought #2 was OK. Then came #3., It showed they were out of imagination and should have stopped with #2. Now with #4 they show that they are not artists or creatives but merely clowns looking for as buck.It's not completely without value, which is why it got a 2 instead of a 1. The photography is beautiful and they have a dog as a hero. The rest is worthless. Save the money and the time.",
    "7": "Who needs a 2hr and 40 min action movie? No one. Yes the action was good, but repeats so many times that it becomes so boring. How can hundreds of assassins not kill one man? Answer, not possible, only in this movie and series. How many times could the dog man have killed Wick? Many. So no other assassin could? Why would the table head get Caine to kill Wick when he knows he won't. You can challenge the head to a duel as a rule, but they only assigned a head for the first time ever in this movie? WTF? And then the head can select a replacement? And he selects a blind man. All Wick had to do was to stand on the side or drop down and he wouldn't get shot. I think everyone knew Wick didn't shoot in the last round, except for the stupid head bad guy. This is not an action movie, it's a fantasy.",
    "8": "From the very beginning to the end, nothing but endless kills, fighting, close combats, bloods squirts or splashes, KR after four chapters, he looked older, slower and tiresome. The screenplay was so pretentious and pointless, the dialog looked forced and boring, katana swords vs. Bullets, and almost every bullet could be fenced off by the katana sword blades. The scenarios and the plots just kept stacked up without any reason or clue, just kill, kill, kill...nothing but kills. All the fighting sequences just like Shaw Brothers' 1970s poor and laughable Hong Kong martial art movies, heavily choreographically staged, looked so forced and fake. Every kill was not killed with one bullets but many, yet the handguns seemed equipped with endless bullets, bang, bang, bang, even the fallen guys already dead, but still needed to be shot several times more to increase the violent sound effect. I don't know what's the purpose of making these 4th Chapter, and I think the 1st Chapter only needed a following 2nd Chapter to end it, but what the heck, brainless young viewers need bloody fights, more dead bodies, ridiculous screenplay with clueless storyline, no real plots or real story really needed, just created something like violent video games.When John Wick fought for his life in the Japanese hotel against so many clueless foes and the Zatoishi-like blind swordsman played by Donny Yen with a Botox injected face, we all decided to quit at the same time.Hey, it's time to wrap it up, guys, no sense to continue to Chapter 5!",
    "9": "By now you know what to expect from a John Wick movie. I thought the franchise was losing a little momentum in chapter 3 so I was worried this could be disappointing. It's not. It's even more on steroids than any Wick before! Even close to 3 hours it doesn't feel to long which is very special for a action movie. This franchise has set new standards. If anybody says a movie is good like John Wick, it better f'n be! The set pieces as everyone mentioned before are really insane this time. The Tokyo sceney with illuminated cherry blossoms was beautiful. The only super illogical thing that bothered me was that nobody flinched at the nightclub, eventually they did but after a whole 10 minute beatdown through the whole club, but then again it's a shady nightclub for high table people. If you liked the first three movies, get your ass to the cinema. Yeah.",
    "10": "Ok, so I got back from seeing this entry yesterday night. I'm writing this review in the early hours after midnight as the film went on for a good whopping 2 hours & 39 minutes!! But we'll get to that in a bit...! Anyway, I was looking forward to this film since John Wick 3's release back in 2019 & this film has had a bit of a troubled history of getting pushed back until it finally got its March 2023 release. I must admit I was a bit skeptical, but, was looking forward to this as the John Wick films are ace, but this film was a bitter disappointment...!The film sees John Wick, who from the events of the last film, has a price on his head which is increasing more than ever. The lethal unstoppable force of nature assassin now must fight against the High Table Global as he seeks out & fights the most deadly assassins players of the underworld from Paris to New York to Berlin to Japan. Will John Wick finally meet his match!?Whoa...! Where do I start!? I found the film for starters to be too long!! At a whopping 2 hours & 39 minutes this film is way, way, way too long! The pacing... whoa! Don't get me started! I was willing to be tolerant & forgive the pacing, but when it got to the final leg it took the absolute puss & started to test my nerves! The story is so weak I had to look this film up in order to get what the plot was, again, another sign that the film was going to be bad, the first was the runtime, which I knew was going to be bad from the word go!The film took a while to get going which was a pain, but it got there I guess! The fights were good, as with the John Wick films typically are, not to mention funny & brutal! But all things considered, it got repetitive fast & annoying especially near the end as I just mentioned! The story scenes were alright as with the villains & bad guys though again, it got repetitive & irritating.The realism was stretch beyond its limits here in this film. John Wick fell from a great height on a metal pipe which looked to have (& lets be honest here) would've snapped his back like a tooth pick! John got hit by a car 5 times yet never suffers any bad injuries or dies! Yet a few bullet wounds finally kill him at the end (another downer of this film which I'll touch up on in a second!), the fight scenes in the night club where only a few people stood there shocked while about 95% just kept on dancing! Face palm! There were several other scenes which made you just think \"dafuq!?\"The lead up to the end was annoying! Just when you thought John Wick was going to go to the Stand Off with the blind villain, there was more fight scenes! Don't get me wrong, these fights where good, but annoying & held the film up for a good 20 minutes before the finale which to say the least, was anti climatic! The scene on the 122 steps was irritating & made you just scoffs in frustration when John got kicked down those steps which for a couple of seconds in its self, dragged & felt & looked comical! It's like getting so far in a mission in Grand Theft Auto V then dying & reverting back to the latest checkpoint where you have to start all, over, again!! The same feelings of that (from experience) where felt for me in this film from that scene!Then of course, after John Wick killing 180 odd people (or more, I lost count obviously) he finally dies! What!? Like James Bond in that god awful Bond Film of 2021 No Time To Die!? Can't be!? What a poor show! Anyhow, to give you guys some perspective on how long this is in comparison to the rest of the films in the franchise! Without credits as they don't count!John Wick (2015) - 1 hour 30 minutes\nJohn Wick 2 (2017) - 1 hour 50 minutes\nJohn Wick 3 (2019) - 1 hours 57 minutes\nJohn Wick 4 (2023) - 2 hours 39 minutesNotice how the films got long & long with each entry...!Overall, this ranks as they absolute worst of the franchise! I was willing to forgive the poor pacing & overly bloated runtime, but it got on my nerves too much to bare & when I saw that John Wick died!? Nope, that was it for me! The editing was poor with this film whoever edited this needs class in editing as this was bad beyond belief! The pacing also was poor combined with the bad editing! The fights were good, but too drawn out, long & annoyingly repetitive! The ending was both bad & anti climatic! How this film has 95% on RT is beyond me! But then what do I expect...! This ranks as the worst John Wick film in the franchise! With word of a female spin-off coming out (which will be bad), I've lost hope in this franchise! Let's hope John Wick 5 (if ever) redeems this kak entry!4/10 & that's generous considering!",
    "11": "No idea how the ratings are as high as they are. If you thought the first one was enjoyable but the 3rd one was bull, read on.Just as the body count in the 3rd was ridiculous, this is even more absurd. Seems after coming up with the bullet proof suit the writers etc thought it a good idea to make sure everyone has one. These giant men sent to kill Wick all wearing suits, raising the jacket to protect their heads was a sight I found so funny. He's the best hitman on the world, how do we kill him? I know, we'll send a blind man!! Pathetic. And he can dodge bullets and he knows where everyone is. You could say it looked choreographed.Now, about the DJ! They may have well cut the scenes directly from the Warriors. Better film, done better and that isn't a great film. For those of you who have never heard of the Warriors, go watch it. For those of you that have, skip this nonsense.",
    "12": "Ever since the original John Wick, the franchise has set a standard of what action in Hollywood should be. Thanks to Chad Stahelski and Keanu Reeve's knowledge of the technical aspects of shooting action, they've been able to deliver expertly choreographed, shot, and edited action films that are now the go to as examples of great action filmmaking. And so, the expectations for the fourth film were fairly high, especially as it became more apparent this was not only the culmination of everything before it, but a whopping 169 minutes long. Rest assured, however, that it delivers in spades. Everything we have come to know and love is here, but with an infusion of creativity like we haven't seen from the franchise yet.John Wick is in a bad way as we open up. He's a man on a mission to get out from under the High Table with seemingly no end in sight. As he blazes a trail of bullets and corpses, those who have helped him or crossed his path find their own lives disrupted. With all hope lost, he soon finds the opportunity he's looking for when he discovers that he can put his life on the line for a chance to finally get out. The film brings with it a whole host of new characters, including Donnie Yen's Caine, Shamier Anderson's Tracker, Hiroyuki Senada's Shimazu, Rina Sawayama's (in a fantastic big screen debut) Akira, Scott Adkins' Killa, and of course Bill Skarsgard as new villain Marquis. It's a full cast, but everyone gets a chance to shine and could easily have their own films. Donnie Yen in particular demonstrates, once again, that he is a legend in this industry with several great fights of his own. But, of course, this is Keanu's film all the way and he gets to bring everything with him in the biggest film yet.Covering four continents, we get fights on a massive set of stairs, fights in the middle of traffic, at one of the coolest looking hotels ever shown on screen, and so on. The fighting, of course, is exceptional, and it brings nunchakus, dogs, throwing stars, swords, guns, and so much more. It's everything a John Wick fan could want and, because these films are so technically proficient, you never feel like you're missing any of the action. Possibly the most creative choice is my favorite scene, one that combines a visually fantastic weapon with a shot choice that is unusual for action films of this nature, but the combination of these two pushes the scene into maybe one of action film's greatest scenes.Admittedly, the story does leave a bit to be desired, but the minor complaints about these kinds of things pale in comparison to what we get. Hollywood has a new film to hold itself to and I have a feeling that (at least for me) action filmmaking will be judged by the standard this movie sets. It's such a blast, I already want to see it again.",
    "13": "John Wick: Chapter 4 picks up where Chapter 3: Parabellum left off. As has been the tradition in the sequels to this beloved martial arts action franchise the action starts from the very inception of the film's opening, and lasts until the curtain falls. JW4 is no exception to that rule. What it does do is improve on the prior installment, and solidify Keanu Reeves as the greatest martial arts action star of all time. If you don't accept that notion, then you must accept the fact that it solidifies Reeves and Director, Chad Stahelski, as the greatest martial arts action pairing of modern times.The film opens in New York City, the home of the notorious Continental Hotel, and takes us to Osaka Japan, Paris France, and Berlin Germany. Each of those cities plays a major role in Reeves' quest to seek revenge against the High Table for the acts outlined in the prior films, and to seek his unconditional freedom from service to their order.As the story unfolds we learn a bit more about Wick's past and upbringing than we did in the prior films, but not enough to get bogged down in. He uses his connections to his past, and the help of some old friends to find a path to level the playing field with the High Table's Emissary, The Marquis, played masterfully by Bill Skarsgård. Skarsgård makes the character memorable, and unique, with just a hint of Santino from the second installment.Keanu Reeves as John Wick in John Wick 4. Photo Credit: Murray Close\nHiroyuki Sanada and Reeves are reunited, having starred in 47 Ronin together. Sanada, as is always the case, is a strong presence in the film and makes the most of every scene he is in. He is a great addition to the film. The Osaka Continental fight scenes are groundbreaking, and among the best and most exciting in the entire series. This is some of the best fight and action choreography you will see; only topped by other scenes in this same movie.Scott Adkins plays an unusually larger than life villain adeptly. The action and violence around the Berlin scenes involving his character, and his relationship to Reeves' past is fun to watch. Adkins is great to watch, whether starring in his own projects, or supporting, as he is here.Shamier Anderson and Clancy Brown are new to the series and add great value. Anderson as a cunning assassin conflicted between admiration and greed. Clancy Brown is a strong presence and welcome replacement in the role of Adjudicator. I found Asia Kate Dillon's version of the same character to be the weakest part of the prior film, and, perhaps, of the whole series.Mark Zaror, another great martial artist also has a prominent role as The Marquis' right hand man.Ian McShane and Laurence Fishburne return and offer more than just familiarity to the cast. Their roles are significant and meaningful.Donnie Yen brings not only his skills as one of the finest martial arts movie stars in the world, but lends his presence as a charismatic and riveting figure. He plays the role of Caine with complexity and humanity that is a terrific mirror to Reeves' Wick; his friend and adversary by circumstance. This was a fantastic choice to take the Wick series to a new level.Keanu Reeves continues to be engaging, empathetic, and dynamic in the role of John Wick. While the series has strayed a bit from the deeply reluctant anti-hero of the first film; we continue to cheer for the good guy caught up in a bad, bad world. One of the great strengths of the film is that Reeves and Stahelski are not afraid the let characters other than Wick shine. In fact, all of the stars of this one have their deeply profound and memorable moments in and out of the company of the main character. This really works.As for the fight and action choreography. The stunt team at 87eleven continue to elevate the game. The film has three major, larger than life action sequences, that each, individually, outdo anything you will see in any other non John Wick movie. As mentioned previously, the Osaka and Berlin scenes were high energy, high body count affairs. They were complete with gun fights, sword mastery, gun play, and one of the best nunchuck displays you will ever see outside of a Bruce Lee movie. As for the scenes in Paris, at the Arc De Tripomphe, and on the Church steps, they are unlikely to be forgotten and, unlikely, to be topped for years to come, if ever. They are unique and exciting and violent feasts for the eyes.While I have heard some say that John Wick: Chapter 4 is the best installment in the series I have to disagree, Nothing can top the original, in my opinion; however, Chapter 4 is a worthy installment for sure.Will there be a Chapter 5 to the JohnWick saga? Remember, I said this was a Spoiler free review....John Wick: Chapter 4 earns a 5 out of 5 star rating. It is worth seeing, and probably seeing again. I predict a significant box office gross for this one, and it is well deserved.",
    "14": "HORRIBLE movie. I love John Wick. I mean I wouldn't pay to see one, but I love the series none the less. Even liked the third one even though the ending blew baby chunks. All the 10s and 9s scores are so damn fake it's hilarious. IMDB is a joke. Someone needs to start a real movie database and weed out the fake high scores, it's as ridiculous as John Wick 4. He walks away from every major injury or collision or building fall. Then he passes away from flesh wounds. What nonsense. The whole plot is nonsense. The fights scene are so boring. I got up to make a sandwich twice. Just the typical 100 judo throws and same shots to head. Numerous coup de grace's. I feel sorry for anyone who paid for this nonsense.",
    "15": "Sitting through the nearly 3 hours of this opus, I can't say that I didn't get my money's worth. But the ride was so bombastic, dark and mumbly that at a certain point it was like being stuck on a roller coaster ride that I've gone through 10 times and gradually sunk deeper and deeper into my chair.What is this movie about? Long were the days of the original John Wick, where it felt nicely paced. A short film extended into a feature but still retained an independent film vibe. Those days are gone. When the original Wick came out, they kept it simple...man seeks revenge on some punks who killed his dog given to him from dead wife. That plot alone is laughably simple. Yet it worked. Perhaps it was the zeitgeist at the time. But this series falls into the VERY same trap they all do. Bigger everything. And that wasn't the case. The Table is a mysterious group that had slick lingo with caricatures of other movies that made you feel something familiar. The call center with its tattoo'd Betties seemed so out of a Jean Pierre Jeunet film like \"City Of Lost Children\" It was unique in the sense that it embraced its steam punk comic book feel. Then it imploded into ridiculous feats of inhuman strength. And a total lack of logic. Police apparently don't exist in John Wick Paris. Ugh.Also, the stunts are great but after (I would calculate) an hour of the same aerobatics, leg locks, tosses and gun shot to head, I grew tired. Made me want to scream to move on. Yes, it has a visceral release to a general audience (I heard a few in my theater clap with approval. But also consider there was one mentally challenged one in a wheel-chair, the other was an elderly lady who was talking through the movie). The original Wick made you really feel the pain of its villains. And made it satisfying. Here, when he goes room to room sweeping with a fire launching shotgun, I wanted to REALLY cheer. It felt flat. Well done, but something was missing. That's what this entire movie felt like. Something missing. Keanu is obviously an expert gun handler now and does hand to hand combat well, but man was it getting old fast.Bill Skarsgard, as the villain, seems to be tapping into Rami Malek from \"No Time To Die\" He's a meglamaniac whose ties to this under ground assassin league is anchored to funding it. Did they ever explain why this society even exists? Probably not. I was bored. Also, Ian MacShane's Manager role is exhaustively pedestrian.. I mean, tiresome tropes come out of his mouth as if it were the first time hearing it.Everyone is desperate to be cool in this flick. Finally, the Donnie Yen character. Okay, a LOT cannot be forgiven. He is dragged into wanting to kill Wick because of threats to his family. Yet, he kills everyone BUT Wick and yet gets to survive. Here's the problem. It telegraphed it when he would incapacitate the guys in the kitchen of the Osaka branch. Instead of violently kill them. That's how you can tell he wasn't going to be a bad dude.Oof. They add an extra assassin who totes along a dog. That dog was getting on my nerves. And I love dogs. This dog seemed to be trained to sick men's privates. For some reason. After the 5th go at this gag, it was dead in the water.This is a subpar entry into the series. Though they kill off Wick in this flick (yeah right) he see some future installment with say...the daughter of the Osaka branch who seemed to have projected a future conflict with Wick in the future.This series will never end as long as simple minded audiences exists. All Sound And Fury Adds Up To Nothing.",
    "16": "This movie was just silly nonsense and reminded me of a bad video game. People were holding their suits up like they were batman to shield themselves from bullets a few feet away and the fight scenes seemed awkward and slow like they were practising them before the actual shoot. To be honest I only gave this.one star as I like. Keanu Reeves and enjoyed the other John Wick movies especially the first one.This is not a good movie and when John Wick was pushed off a ledge about 40 feet up and bounced off a concrete ledge before face planting a concrete floor and just got back up while all the time dancers around him paid no attention to what happened I knew it was time to turn it off.I have no idea where the good reviews come from but do yourself a favour and go watch something else.... anything else.",
    "17": "The first John Wick was the best, after that they all went down hill. There's no point to these movies.John Wick 4 is three hours of mind-numbing repetition. Keanu reading the script: \"Punch, roll, headshot, repeat. Dude, I think I got it.\"\nI'm not even sure what John Wick was trying to accomplish. These movies could have gone on for 100 years and nothing would have changed.And evidently everyone is now bullet proof and has infinite ammo. John took out 250 guys with his 9mm pistol. He's also invincible. He can fall several stories and not even break a bone, get run over a dozen times, and roll down a million stairs.I would have enjoyed this movie more if at the end he took off flying because he was really Neo in a simulator and all of this took place in the Matrix, which would explain Laurence Fishburn.",
    "18": "Indiana jones, terminator, predator, Jurassic park, the matrix, Jason bourne, etc. All amazing franchises but all share a common trait of having a bad or forgettable movie or 2 at some point. This is why john wick is the best action action movie franchise of all time; The movies just keep getting better and better. In john wick 4, when the action starts in Osaka Japan, it never let's up despite it's almost 3 hour running time. What I really enjoyed the most about JW4 is the cast of characters. Great villains and allies really keep this movie interesting as john trots the globe for 3 hours. The sound engineering, editing, direction, cinematography are excellent as always. The color schemes throughout this franchise (more john wick 2, 3 and especially 4) are such a treat for the eyeballs. Best action franchise EVER. And the shotgun fight in Paris with the \"dragons breath\" is the best action sequence I've probably ever seen in my life.",
    "19": "May or may not count as a spoiler but John Wick pilled up more of a body count than Jason Vorhees sure different genre yet both great killing machines! Chad Staleski created such a great action extravaganza quad of films and one of my favorite trivia's he was the stunt doable for Keanu Reeves in the The Matrix back in the day; fast forward to 2014 they work together on one of the greatest action films of our generation. John Wick 4 is ultimate experience that is a must see I can't praise enough for how much fun it is.I might get vibes for my thoughts I tried not to spoil it's obvious the combination of kill count has added up the rest left to the viewers, the action and writing is incredible for Chapter 4 that everyone involved deserves praise! I'd like to say too I own all the John Wick films and every Matrix, I'll get this in 4K when available.",
    "20": "So the second and 3rd john wick movies were blazing electric movies that took john wick to unbelievable levels. This 4th wick movie was water down and embaressingly woke with a corney addition to the wick roster of assasins. Kane somewhat saved the movie at times but the movie felt vague and amibiguous with endless fighting and wayy over the top action the\nthat took wick to a level of absurdity and crossed over to ridiculous and clever or as cool as part 3. Thr crafty skills wernt on display in the same they were in the last 3 movie outside of one glorious overhead camera shot of wick blistering through a apartment building. This scene alone bumped this film up into the above average relm.",
    "21": "Just how much cash can you get out of a cash cow? As the John Wick producers know that's plenty of dough but with each iteration the movies become ever more flabby and contrived. The Hollywood formula has been employed; copy a previous success adding ever more crash bang and wollop and of course stretching the whole thing out to a dreary 3 hour run time. But of course Hollywood misses the point, yet again. What made the original Wick movie interesting was the character's struggle to make a new life only to be dragged back into the criminal underworld. Granted it's an interesting and novel criminal underworld but now it's the world of John Wick which is the focus, not Wick himself. Then there's the blatant plagerism of Walter Hill's, The Warriors which demonstrates just how little new the franchise has to offer. Time to call it a day.",
    "22": "I don't get why this movie has a high score, it doesn't deserve it. It's horrible, it doesn't make any sense, just killing people, but how can it be possible that those people after being shot many times, were able to fight as nothing happened to them? And the plot? Trying to kill John Wick in any way possible, period.The worst thing is that they used some scenes from the movie The Warriors (1979), they didn't try to change anything, a black woman with nice big lips, talking on the radio, guiding the gangs with the purpose to chase and kill The Warriors. Same with John Wick, but of course with a modern technology. Shame on you! Didn't you have any better idea? You just copied an old movie that was much better than this one, and that soundtrack was great!What a disappointment! It remembers somehow Kill Bill, but that movie was very good, this one is almost unacceptable!I enjoyed the other movies about John Wick, they were very well done, and had a good plot. This time it seems like they didn't know what to write.Not even the ending was good, is he really dead? We can't be sure, and probably there will be a John Wick 5, because something is missing. Anyway the fight against the thugs, before the last duel, was really bad... just a videogame.",
    "23": "We all walk into John Wick 4 with expectations of what we will see, standards we refuse to lower and excitement already creeping in. From the first second it engages you, no hesitation, no quarter. And it's only the beginning. I read somewhere that a reviewer had said that there wasn't a wasted moment in this film and I watched it questioning the validity. They weren't wrong. Each conversation has a purpose, each scene makes a point. From the gunfight samurai scene in Tokyo to the phosphorus gunfight shot from above in Paris, the action doesn't diminish. Normally a sequel is \"lesser\" but John Wick 4 simply builds onto the quadrilogy. It makes sense, it continues the story and the characters get all the more interesting.I can tell you right now, if the phosphorus gunfight scene doesn't impress you (which it will), the Paris traffic carnage scene is brilliant. I can't say I have ever seen someone do full continuous 360 drifting in a muscle car either :DI know Keanu said that Chad Stahelski and himself were taking a long break from the John Wick series but should we have seen the end, it ended on a note I feel we could live with. If they can find another story that will build onto the John Wick series then so be it but if not, I truly left the movie happy and felt it was done.Don't leave until after the credits are done. Trust me, it's not finished.",
    "24": "Listen, this movie was far from as good as the others and had very little realism to it compared to the others. Numerous times John falls from like 4 stories up and gets up and walks it off. He also gets hit by cars numerous times and simply just walks it off. He also falls down 222 steps and gets up and walks it off. Where is the realism here?Also, the acting was incredibly bad. Like really really bad. Laurence Fishborne going over the top and Keanu not saying much, but when he does he makes himself sound like he's having a stroke.Adding the black assassin dude simply as the diversity hire was a weird choice. Like seriously, he was the only black dude. The dude was a complete wild card that you had no idea whose side he was on. He was trying to kill John, but also trying to save him? Also, he had a dog to help him. Didn't Halle Berry have the exact same gimmick in the last movie that did the same trick of going for the nuts?And where was John's motivation for all of this? Why was he in Japan? Why did he kill the High Table person? Why wasn't this Marques person introduced sooner? Why was a blind assassin 20x better than any of the other assassins? And lastly, why did John go through allllll of that crap just to die at the end? To protect Winston? The dude who shot him off roof?Overall, there was only a couple of good parts to the movie. Nothing that the other 3 movies hadn't done before.",
    "25": "Unpopular Opinion - John Wick 4 is a below average movie.I loved all 3 John wick movies, but this one is more likely a conclusion of John wick series, So the fight scenes are boring and repetitive. Previous movies had different types of action and stunt choreographies. This one has long same fights , might be in different locations.As far Keanu goes, his close up shots or his face doesnt appear in the movie atleast for a half time. John wick past movies had few dialogues but it had an impact, 4 has same few dialogues but it was very plain and flat.Ending is Spoiler - John Wick Dies (or not) shown in a way that if there is a possibility of a sequel , there can be.May stunts shots and its accuracy is totally gone, we can clearly see that where the gun is aimed and it just went like a paper plane. Even with the so-called Coat Armour, some pistol shots were directly aimed at Head / Leg which was again repelled with the armor which is in the shoulder.The sad thing is this is the same with Balayya movies, but when it directed and taken in Hollywood people go crazy!An average movie 6/10.",
    "26": "JOHN WICK: CHAPTER 4 (2023) ***1/2 Keanu Reeves, Laurence Fishburne, Ian McShane, Lance Reddick, Clancy Brown, Bill Skarsgard, Donnie Yen, Aimee Kwan, Hiroyuki Sanada, Shamier Anderson, Rina Sawayama. Reeves' indestructible titular assassin returns in full form in the latest (and arguably best) of the fast-hitting, brutally violent action franchise with the marker on his head increased by new foe Skarsgard (oily good at being the villain) and the countdown to his demise imminent worldwide. The set pieces are displayed with cunning skill and scary accuracy with pressure point precision and unnerving balletic grace. A *chef's kiss* for the wherewithal overall and a genre fan's wet dream fulfilled. It kills! (Dir: Chad Stahelski)",
    "27": "This is laughably bad. My second hand embarrassment threw up its hands and died of shame.I adore Keanu but my god he failed at even the most basic fight choreography; although the fault is shared equally with the script writers, the editing team, and the director who all decided we needed almost 3 hours of whatever this was.If anyone believes that a half bent over John Wick could kill 100s of super trained assassins all by himself, then have I got a bridge to sell you in Laos.Look, KR is like a 100 yrs old and should have long retired from doing any film that requires hand-to-hand combat.Note to Keanu's agent: get this man into a zombie/apocalypse movie, ffs.",
    "28": "John Wick series have always been over-the-top action / thriller joyrides more focused on dazzling you with visceral, expertly choreographed action sequences than trying to tell the most coherent stories about stylish assassins. Director Chad Stahelski's John Wick: Chapter 4 is no exception. And it abundantly delivers on the franchise's hallmarks - snazzy guns, lovable dogs, and one very haggard man in black. John Wick: Chapter 4 isn't a movie you casually sit down to watch apropos of nothing. It's a commitment, both in terms of how long it is and in how invested you really have to be in the idea of John Wick for the film to be engaging. To its credit, John Wick: Chapter 4 does an admirable job of leaving open possibilities for a future filled with stories of some of the movie's new supporting characters. It comes as a pleasant surprise given how much time this story spends trying to remind you that Wick is the baddest man in town. It's a movie that's meant to be watched loud and big. Remember ! John Wick has fought hard for it.",
    "29": "Does Bill Skarsgård know how to wear a suit or does that man know how to wear a suit? I'm giving the costume designer for John Wick 4 a nice fat \"10\". But the rest of the movie?Everything bad that can be said about this movie has been said already, by other reviewers. Still, I can't resist adding a few gripes of my own. Forgive me for repeating what other's have already written, but I feel like it's the only way I can get rid of this very bad taste in my mouth.Keanu I love you with a passion, but you're too old and creaky to come off as someone who is impervious to cars slamming into you at 45mph. The scene where you fall 75+ feet onto a car and walk away like nothing happened? Hahahahaha. Stop it, you're killing me.And you, with your gray beard, rolling down 222 stone steps ----- ALL the way down the steps, and then AGAIN part way, even though there are multiple breaks in the stairs where (kudos to stunt work!) anyone else would have eventually come to a halt in their rolling? ---- pure comedy.The fight scenes where the guys WAIT for you to make your move, over and over and OVER again. Beyond painful to watch. The audience can practically see the cartoon balloon over your head reading, \"Okay. Now this is where I insert my left leg in between this dude's legs and I heave myself over, so we twist and, as he falls, he very helpfully throws himself to the side and then he waits for me to shoot him in the head.\"The fight scene choreographers should all die of shame. Is this the best they could do? Time after time the bad guy pulls back and you can almost hear him saying to himself, \"Wait for it. This is where Keanu comes at me, jumps on my chest and then shoots and stabs me. Ready set go!\"Donnie Yen, Hiroyuki Sanada, Shamier Anderson, Lance Riddick, Ian McShane, Larry Fishburne = Great performances. Keanu? Some of the worst of the worst of your acting effort, sad to say. Really BAD.One last thing: Ian McShane's upper teeth really bothered me. As in mesmerized by their fakeness and fit type bother me. Can't unsee that.Of course Baba Yaga isn't dead. Pfft. But I sure hope this franchise is. Enough is enough.",
    "30": "John Wick 1 was the best imo. The story was somewhat coherent and drew attention. There was plenty of action that was exciting without being over-the-top ridiculous.Next up in John Wick 2, the story was still somewhat coherent and though some scenes started to become a bit nonsensical(tons of assassins and no police etc), it was still a solid movie and easy to follow.In John Wick 3 everything took a nosedive into utter nonsense. Part 4 expanded on this with nothing but lots of ridiculous wild nonstop fights. Typical Hollywood cash grabs devolved into absolute boring and ridiculous rubbish.",
    "31": "Quite possibly the best action movie of the decade. It's only 2023. This one is currently number one. Terminator 2 is the best action movie of all time. The raid 2 is the best action sequel of all time. This movie is the best 4th movie in a series of all time. Props to lethal weapon 4 as well. Keanu is a bad ass ok. He moves a little slow in the beginning but by the time the second half comes along he moves like a martial arts madman. That being said.. the nunchucks he incorporates into his character in that first half is brilliant. The set pieces in this are absolutely fantastic. The music is perfectly incorporated as well. There were a few nods to some classic flicks too. Movie buffs will catch them.",
    "32": "It delivers everything one would want in a John Wick film. A very high body count, and very impressively staged fight scenes, and seeing the punishment he takes, you have to think \"boy that must really hurt.\" And as usual John Wick leaves nothing to chance, as he makes sure the attacker is dead. So it is a high octane movie, with some of the usual characters, and this time John is fighting to leave the Table for good. So the stakes are very high. There is some lull between the attacks, but not a lot of time is wasted even though it is a long film. As entertainment, it fills the bill. And it doesn't pull punches.",
    "33": "This movie was just silly nonsense and reminded me of a bad video game. People were holding their suits up like they were batman to shield themselves from bullets a few feet away and the fight scenes seemed awkward and slow like they were practising them before the actual shoot. To be honest I only gave this.one star as I like. Keanu Reeves and enjoyed the other John Wick movies especially the first one.This is not a good movie and when John Wick was pushed off a ledge about 40 feet up and bounced off a concrete ledge before face planting a concrete floor and just got back up while all the time dancers around him paid no attention to what happened I knew it was time to turn it off.I have no idea where the good reviews come from but do yourself a favour and go watch something else.... anything else.",
    "34": "The first John Wick was the best, after that they all went down hill. There's no point to these movies.John Wick 4 is three hours of mind-numbing repetition. Keanu reading the script: \"Punch, roll, headshot, repeat. Dude, I think I got it.\"\nI'm not even sure what John Wick was trying to accomplish. These movies could have gone on for 100 years and nothing would have changed.And evidently everyone is now bullet proof and has infinite ammo. John took out 250 guys with his 9mm pistol. He's also invincible. He can fall several stories and not even break a bone, get run over a dozen times, and roll down a million stairs.I would have enjoyed this movie more if at the end he took off flying because he was really Neo in a simulator and all of this took place in the Matrix, which would explain Laurence Fishburn.",
    "35": "Indiana jones, terminator, predator, Jurassic park, the matrix, Jason bourne, etc. All amazing franchises but all share a common trait of having a bad or forgettable movie or 2 at some point. This is why john wick is the best action action movie franchise of all time; The movies just keep getting better and better. In john wick 4, when the action starts in Osaka Japan, it never let's up despite it's almost 3 hour running time. What I really enjoyed the most about JW4 is the cast of characters. Great villains and allies really keep this movie interesting as john trots the globe for 3 hours. The sound engineering, editing, direction, cinematography are excellent as always. The color schemes throughout this franchise (more john wick 2, 3 and especially 4) are such a treat for the eyeballs. Best action franchise EVER. And the shotgun fight in Paris with the \"dragons breath\" is the best action sequence I've probably ever seen in my life.",
    "36": "May or may not count as a spoiler but John Wick pilled up more of a body count than Jason Vorhees sure different genre yet both great killing machines! Chad Staleski created such a great action extravaganza quad of films and one of my favorite trivia's he was the stunt doable for Keanu Reeves in the The Matrix back in the day; fast forward to 2014 they work together on one of the greatest action films of our generation. John Wick 4 is ultimate experience that is a must see I can't praise enough for how much fun it is.I might get vibes for my thoughts I tried not to spoil it's obvious the combination of kill count has added up the rest left to the viewers, the action and writing is incredible for Chapter 4 that everyone involved deserves praise! I'd like to say too I own all the John Wick films and every Matrix, I'll get this in 4K when available.",
    "37": "So the second and 3rd john wick movies were blazing electric movies that took john wick to unbelievable levels. This 4th wick movie was water down and embaressingly woke with a corney addition to the wick roster of assasins. Kane somewhat saved the movie at times but the movie felt vague and amibiguous with endless fighting and wayy over the top action the\nthat took wick to a level of absurdity and crossed over to ridiculous and clever or as cool as part 3. Thr crafty skills wernt on display in the same they were in the last 3 movie outside of one glorious overhead camera shot of wick blistering through a apartment building. This scene alone bumped this film up into the above average relm.",
    "38": "Just how much cash can you get out of a cash cow? As the John Wick producers know that's plenty of dough but with each iteration the movies become ever more flabby and contrived. The Hollywood formula has been employed; copy a previous success adding ever more crash bang and wollop and of course stretching the whole thing out to a dreary 3 hour run time. But of course Hollywood misses the point, yet again. What made the original Wick movie interesting was the character's struggle to make a new life only to be dragged back into the criminal underworld. Granted it's an interesting and novel criminal underworld but now it's the world of John Wick which is the focus, not Wick himself. Then there's the blatant plagerism of Walter Hill's, The Warriors which demonstrates just how little new the franchise has to offer. Time to call it a day.",
    "39": "I don't get why this movie has a high score, it doesn't deserve it. It's horrible, it doesn't make any sense, just killing people, but how can it be possible that those people after being shot many times, were able to fight as nothing happened to them? And the plot? Trying to kill John Wick in any way possible, period.The worst thing is that they used some scenes from the movie The Warriors (1979), they didn't try to change anything, a black woman with nice big lips, talking on the radio, guiding the gangs with the purpose to chase and kill The Warriors. Same with John Wick, but of course with a modern technology. Shame on you! Didn't you have any better idea? You just copied an old movie that was much better than this one, and that soundtrack was great!What a disappointment! It remembers somehow Kill Bill, but that movie was very good, this one is almost unacceptable!I enjoyed the other movies about John Wick, they were very well done, and had a good plot. This time it seems like they didn't know what to write.Not even the ending was good, is he really dead? We can't be sure, and probably there will be a John Wick 5, because something is missing. Anyway the fight against the thugs, before the last duel, was really bad... just a videogame.",
    "40": "We all walk into John Wick 4 with expectations of what we will see, standards we refuse to lower and excitement already creeping in. From the first second it engages you, no hesitation, no quarter. And it's only the beginning. I read somewhere that a reviewer had said that there wasn't a wasted moment in this film and I watched it questioning the validity. They weren't wrong. Each conversation has a purpose, each scene makes a point. From the gunfight samurai scene in Tokyo to the phosphorus gunfight shot from above in Paris, the action doesn't diminish. Normally a sequel is \"lesser\" but John Wick 4 simply builds onto the quadrilogy. It makes sense, it continues the story and the characters get all the more interesting.I can tell you right now, if the phosphorus gunfight scene doesn't impress you (which it will), the Paris traffic carnage scene is brilliant. I can't say I have ever seen someone do full continuous 360 drifting in a muscle car either :DI know Keanu said that Chad Stahelski and himself were taking a long break from the John Wick series but should we have seen the end, it ended on a note I feel we could live with. If they can find another story that will build onto the John Wick series then so be it but if not, I truly left the movie happy and felt it was done.Don't leave until after the credits are done. Trust me, it's not finished.",
    "41": "Listen, this movie was far from as good as the others and had very little realism to it compared to the others. Numerous times John falls from like 4 stories up and gets up and walks it off. He also gets hit by cars numerous times and simply just walks it off. He also falls down 222 steps and gets up and walks it off. Where is the realism here?Also, the acting was incredibly bad. Like really really bad. Laurence Fishborne going over the top and Keanu not saying much, but when he does he makes himself sound like he's having a stroke.Adding the black assassin dude simply as the diversity hire was a weird choice. Like seriously, he was the only black dude. The dude was a complete wild card that you had no idea whose side he was on. He was trying to kill John, but also trying to save him? Also, he had a dog to help him. Didn't Halle Berry have the exact same gimmick in the last movie that did the same trick of going for the nuts?And where was John's motivation for all of this? Why was he in Japan? Why did he kill the High Table person? Why wasn't this Marques person introduced sooner? Why was a blind assassin 20x better than any of the other assassins? And lastly, why did John go through allllll of that crap just to die at the end? To protect Winston? The dude who shot him off roof?Overall, there was only a couple of good parts to the movie. Nothing that the other 3 movies hadn't done before.",
    "42": "Unpopular Opinion - John Wick 4 is a below average movie.I loved all 3 John wick movies, but this one is more likely a conclusion of John wick series, So the fight scenes are boring and repetitive. Previous movies had different types of action and stunt choreographies. This one has long same fights , might be in different locations.As far Keanu goes, his close up shots or his face doesnt appear in the movie atleast for a half time. John wick past movies had few dialogues but it had an impact, 4 has same few dialogues but it was very plain and flat.Ending is Spoiler - John Wick Dies (or not) shown in a way that if there is a possibility of a sequel , there can be.May stunts shots and its accuracy is totally gone, we can clearly see that where the gun is aimed and it just went like a paper plane. Even with the so-called Coat Armour, some pistol shots were directly aimed at Head / Leg which was again repelled with the armor which is in the shoulder.The sad thing is this is the same with Balayya movies, but when it directed and taken in Hollywood people go crazy!An average movie 6/10.",
    "43": "JOHN WICK: CHAPTER 4 (2023) ***1/2 Keanu Reeves, Laurence Fishburne, Ian McShane, Lance Reddick, Clancy Brown, Bill Skarsgard, Donnie Yen, Aimee Kwan, Hiroyuki Sanada, Shamier Anderson, Rina Sawayama. Reeves' indestructible titular assassin returns in full form in the latest (and arguably best) of the fast-hitting, brutally violent action franchise with the marker on his head increased by new foe Skarsgard (oily good at being the villain) and the countdown to his demise imminent worldwide. The set pieces are displayed with cunning skill and scary accuracy with pressure point precision and unnerving balletic grace. A *chef's kiss* for the wherewithal overall and a genre fan's wet dream fulfilled. It kills! (Dir: Chad Stahelski)",
    "44": "This is laughably bad. My second hand embarrassment threw up its hands and died of shame.I adore Keanu but my god he failed at even the most basic fight choreography; although the fault is shared equally with the script writers, the editing team, and the director who all decided we needed almost 3 hours of whatever this was.If anyone believes that a half bent over John Wick could kill 100s of super trained assassins all by himself, then have I got a bridge to sell you in Laos.Look, KR is like a 100 yrs old and should have long retired from doing any film that requires hand-to-hand combat.Note to Keanu's agent: get this man into a zombie/apocalypse movie, ffs.",
    "45": "John Wick series have always been over-the-top action / thriller joyrides more focused on dazzling you with visceral, expertly choreographed action sequences than trying to tell the most coherent stories about stylish assassins. Director Chad Stahelski's John Wick: Chapter 4 is no exception. And it abundantly delivers on the franchise's hallmarks - snazzy guns, lovable dogs, and one very haggard man in black. John Wick: Chapter 4 isn't a movie you casually sit down to watch apropos of nothing. It's a commitment, both in terms of how long it is and in how invested you really have to be in the idea of John Wick for the film to be engaging. To its credit, John Wick: Chapter 4 does an admirable job of leaving open possibilities for a future filled with stories of some of the movie's new supporting characters. It comes as a pleasant surprise given how much time this story spends trying to remind you that Wick is the baddest man in town. It's a movie that's meant to be watched loud and big. Remember ! John Wick has fought hard for it.",
    "46": "Does Bill Skarsgård know how to wear a suit or does that man know how to wear a suit? I'm giving the costume designer for John Wick 4 a nice fat \"10\". But the rest of the movie?Everything bad that can be said about this movie has been said already, by other reviewers. Still, I can't resist adding a few gripes of my own. Forgive me for repeating what other's have already written, but I feel like it's the only way I can get rid of this very bad taste in my mouth.Keanu I love you with a passion, but you're too old and creaky to come off as someone who is impervious to cars slamming into you at 45mph. The scene where you fall 75+ feet onto a car and walk away like nothing happened? Hahahahaha. Stop it, you're killing me.And you, with your gray beard, rolling down 222 stone steps ----- ALL the way down the steps, and then AGAIN part way, even though there are multiple breaks in the stairs where (kudos to stunt work!) anyone else would have eventually come to a halt in their rolling? ---- pure comedy.The fight scenes where the guys WAIT for you to make your move, over and over and OVER again. Beyond painful to watch. The audience can practically see the cartoon balloon over your head reading, \"Okay. Now this is where I insert my left leg in between this dude's legs and I heave myself over, so we twist and, as he falls, he very helpfully throws himself to the side and then he waits for me to shoot him in the head.\"The fight scene choreographers should all die of shame. Is this the best they could do? Time after time the bad guy pulls back and you can almost hear him saying to himself, \"Wait for it. This is where Keanu comes at me, jumps on my chest and then shoots and stabs me. Ready set go!\"Donnie Yen, Hiroyuki Sanada, Shamier Anderson, Lance Riddick, Ian McShane, Larry Fishburne = Great performances. Keanu? Some of the worst of the worst of your acting effort, sad to say. Really BAD.One last thing: Ian McShane's upper teeth really bothered me. As in mesmerized by their fakeness and fit type bother me. Can't unsee that.Of course Baba Yaga isn't dead. Pfft. But I sure hope this franchise is. Enough is enough.",
    "47": "John Wick 1 was the best imo. The story was somewhat coherent and drew attention. There was plenty of action that was exciting without being over-the-top ridiculous.Next up in John Wick 2, the story was still somewhat coherent and though some scenes started to become a bit nonsensical(tons of assassins and no police etc), it was still a solid movie and easy to follow.In John Wick 3 everything took a nosedive into utter nonsense. Part 4 expanded on this with nothing but lots of ridiculous wild nonstop fights. Typical Hollywood cash grabs devolved into absolute boring and ridiculous rubbish.",
    "48": "Quite possibly the best action movie of the decade. It's only 2023. This one is currently number one. Terminator 2 is the best action movie of all time. The raid 2 is the best action sequel of all time. This movie is the best 4th movie in a series of all time. Props to lethal weapon 4 as well. Keanu is a bad ass ok. He moves a little slow in the beginning but by the time the second half comes along he moves like a martial arts madman. That being said.. the nunchucks he incorporates into his character in that first half is brilliant. The set pieces in this are absolutely fantastic. The music is perfectly incorporated as well. There were a few nods to some classic flicks too. Movie buffs will catch them.",
    "49": "It delivers everything one would want in a John Wick film. A very high body count, and very impressively staged fight scenes, and seeing the punishment he takes, you have to think \"boy that must really hurt.\" And as usual John Wick leaves nothing to chance, as he makes sure the attacker is dead. So it is a high octane movie, with some of the usual characters, and this time John is fighting to leave the Table for good. So the stakes are very high. There is some lull between the attacks, but not a lot of time is wasted even though it is a long film. As entertainment, it fills the bill. And it doesn't pull punches.",
    "50": "Where do I start ? After fighting & killing about 400 blokes he gets run over by buses cars throws himself out of a 3rd story window onto a VW van , gets thrown down 300 concrete steps and yea you guessed it .... Get up and carries on light nothing happened !It's insulting your intellect to even imagine him doing all this ? On top of that there's a blind man fighting 100 + assailants who doesn't get stabbed , shot , or even knocked out 🤣 who writes this nonsense? I love Reeves but this time it's too over the top to be real , embarrassing again and again ! Don't bother paying to see this crap.",
    "51": "Wow just wow. How far this has fallen. The first movie was great. The second was very good. But there was a tail off after that. But this fourth movie, is a complete pile of rubbish. There's no real people in this movie, only assassin's and people dancing. D. Yen plays a blind martial artist, just for a change! There's no real story line, just fight scenes after fight scenes. The suits are like the protective shields from Dune. Each fight scene is boring as there's no real investment in the characters. John Wick says literally about 8 words in the whole movie. One word at a time, normally just a single name. I can't believe this gets such a high rating. Honestly it was painful to watch.",
    "52": "It's extremely difficult to write 600 characters about this so called movie. Just take 10 minutes of one of the action scenes and copy it 20 times so you could bore the watchers to death! What was the purpose of the producers, script writers and the director to spend so much time and money for this thrash? Was there anything plausible in this so called movie? John Wick I was ok within its fiction universe of assassins and mobs etc. And somehow watchable action scenes. However what could we say about this repetitive misery of extreme exaggeration of a character who could not be harmed under any condition? Take Mr. Wick as the next generation Terminator...Maybe.",
    "53": "I really liked the first 3. And really hated this one. I thought the action sequences were stupid like one that reminded me of the scene in Hot Rod where Andy Samberg goes flying down and a hill and doesn't stop for miles. Apparently this is one of John Wick's new superpowers, to be able to survive long falls. The Scout character is extra stupid and unnecessary. I don't understand his motivation. There's too many characters here that are supposed to be important. I just found everything confusing and redundant. There may have been one or two scenes that I liked but I can't even think which they are. Keannu is too slow now to pull these fight scenes off. Donnie reprises his role from Star Wars Rogue One. I just think it's a messy movie.",
    "54": "This was just like watching my nephew play a videogame for 3 hours straight. I normally like action movies, and don't mind the hole plots, the exaggerations ++ as long as you get involved with the characters and it's funny. This had little humor, and it was so over exaggerated the the point I just wanted everyone to die (even John, and he should have died 1,5 hours earlier). I was so mad when he fell down the stairs for the 20th time, I just wanted the movie to end. No fun to watch when the main characters supposedly have superpowers and could have won the WW2 all by them selves. But I guess people don't expect much from movies anymore.",
    "55": "I was super excited to watch the John Wick 4 movie and went with my cousin to the cinemas. Paid a bomb for the tickets and the popcorn...\n15mins into the movie and i was wondering am i really watching chapter 4 !!My cousin and i was laughing throughout the film as it felt like a comedy movie more than an action film... more than a john wick film..... chapter 4 has no story !!It felt like a movie was presented to fill a 4 year gap... and they captialized on the john wick franchise to mint.I could not bear to waste a moment more of my time on this utter crap... however with the amount of money paid to watch this nonsensical theatrics we stayed...dont ever recommend the movie to anyone.... - JUST DON'T.",
    "56": "A dramatic step down in quality from previous entries in the series.The main drawcard being the action sequences and gunplay. Sadly in chapter 4 they lack any stakes and become boring and repetitive almost instantly. Bullets have no effect or simply pass through people, stuntmen routinely stumble while waiting for their queue to attck then die, basics like taking cover take a back seat to flashy unnecessary spin that some one thought \"looked cool\". Many sequences just look like a bad dress rehearsal they decided to keep.Unnecessary characters that add nothing to the already non existent plot. Streets or famous landmarks are completely empty or filled with bystanders that appear to be in a different dimension, oblivious to the insane acts of violence occurring next to them until it suits the plot or they vanish into thin air from one shot to the next. Not a single police car or officer called out the entire movie. In possibly the most unrealistic scene, an entire subway train in Osaka is empty. This is a movie that holds the same level of quality and planning you'd expect from a bunch of 7 year old boys playing bang bang in their back yard. \"My suit is bullet proof\" you hear them yell as you chuckle and sigh, \"ah kids..\" You really really need to switch off your brain to enjoy this 3hr slog, or just laugh at how poorly planned and executed the entire idea is.I can understand people wanted this to be good and rated it highly because these types of movies are indeed in short supply these days and I also want to see more quality adult action movies made. But lets be honest, even with a high budget this is just plain old fashioned below average shlock. \"Wrap it up\" someone said, too bad there's no bow on this one.",
    "57": "Repetitive Action, Lacks Story.The movie has some great action seens but it's too repetitive and lacks reality completely. There's no story and the high table, just wants to keep giving John chances to be a free guy over and over again. Expected more from this movie tbh.ChatGPT\nTitle: \"John Wick 4: Explosive Action with a Repetitive Plot\"Word Count: 709\"John Wick 4\" is the highly anticipated sequel to the action-packed franchise that has captivated audiences with its adrenaline-fueled sequences. While the film delivers on its promise of spectacular action scenes, it falls short in terms of originality and narrative depth. Despite its flaws, \"John Wick 4\" manages to entertain fans of the series, but fails to live up to the high expectations set by its predecessors.Undeniably, the movie showcases some truly impressive action sequences. From intense gunfights to jaw-dropping stunts, the film's choreography and execution are impeccable. The fight scenes are meticulously crafted, and Keanu Reeves once again proves his dedication to his role as the lethal assassin John Wick. The combination of Reeves' physicality and the expertly designed action sequences creates a thrilling cinematic experience that keeps viewers on the edge of their seats.However, the film's biggest flaw lies in its repetitiveness. While the previous installments of the franchise offered a fresh take on the action genre, \"John Wick 4\" feels like a rehash of familiar territory. The plot fails to bring anything new to the table, resulting in a sense of predictability that diminishes the overall impact of the film. The narrative lacks the complexity and depth that fans have come to expect from the series, leaving much to be desired.One of the disappointments of \"John Wick 4\" is the lack of a compelling story. The film relies heavily on the established formula of John Wick facing insurmountable odds and battling countless adversaries. The absence of a coherent and engaging plot prevents the movie from reaching its full potential. While the franchise has never been known for its intricate storytelling, this installment takes it to a new level by prioritizing action over substance.Another aspect that hampers the film's impact is the portrayal of the High Table. In previous movies, the enigmatic organization added an element of intrigue and mystery to the narrative. However, in \"John Wick 4,\" the High Table becomes a monotonous antagonist whose only purpose seems to be providing John Wick with repeated chances for redemption. This narrative choice not only diminishes the stakes but also makes the world feel less grounded and realistic.",
    "58": "By far the worst of the four unless you are a brainless action junkie looking for a fix.It didn't take much writing for this one, everyone wants to kill John and John kills everyone, the end.The first three chapters at least had a break where a storyline appeared and there was some dialogue between the actors that added to the story in between fight scenes. The fourth one seemed to be no more than a poorly written attempt at cashing in on the first three. Profit seemed to be the motivating factor.?On the upside, the action scenes were good, though like drinking, it may have been better served if done in moderation, with a little time left over for a story.",
    "59": "I am truly baffled by the amazing reviews of this film.Over the years, I have greatly enjoyed violet revenge films, so I expected to enjoy this one too.How wrong I was.The movie is gorgeous, the sets are beautifully designed.But... that's about as far as it goes.The movie fails in its single most important task - to make us give a damn about the main character, to worry about him.Instead, we are presented with boring fights - it's the same thing over and over and over again.The fights are so unrealistic they make Crouching Tiger, Hidden Dragon seem like a documentary.The bad guys are worse at shooting than starship troopers.In one sequence, Wick gets hit by not one car but three... and still walks away.In the disco fight scene, people keep dancing even though people are axed and shot all around them.Every problem in the movie is solved by... another massive fight scene.This is literally one of the worst movies I have ever watched. I was bored to tears.2/10.",
    "60": "John Wick uncovers a path to defeating The High Table, and earning his battered body, a much deserved freedom.But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe, and forces that turn old friends into foes......First of all, any film that features Donnie Yen and Scott Adkins is a must for any action film aficionado. But to have them in a John Wick film isn't just a dream come true, it's a work of sheer genius. I've had my expectations high for several films this year, such as Pants Man, Cocaine Bore, and Scream VI, which have all let me down.So I tried to lower my expectations for this, but I couldn't. Because this franchise has just been getter bigger and better with each instalment. And does it meet expectations?Too bloody right it does, it's a masterpiece in set pieces and going above and beyond in pleasing the fans.There are five huge set pieces that are wonderfully staged, and they are brutal and unflinching, and usurp anything from the previous three movies.The first is at Shimazus Continental, and although it goes on for a while, it's breathtaking, reminiscent of the shootout at the end of Parrabellum, but with Yen making good use of an everyday household item, and the icing on the cake for this sequence, Wick using nunchucks. That's all you need to know. Wick using nunchucks.The second features again, Yen, but now we have Scott Adkins thrown in. And for good measure, he's wearing a fat suit. Again, beautifully staged, with Wick suffering badly this time at the hands of Adkins, with a beautiful diegetic piece from Le Castlevania, keeping the tradition of the franchise. If you though a pencil was a good weapon, wait until you see what is used here.Thirdly, and arguably the best, we have a shoot out around the Arc De Triumphe. A ballet of cars and bullets that had me on the edge of my seat. It's so seamless and expertly made, I doubt you'll find a better cinematic action scene this decade. It's that beautiful.Fourthly, we have a wonderful over head long take with Wick taking out bad guys from room to room, using the most unique gun of the series. It's literally a blast.And the most bone crunching and funniest sequence is on the steps leading to the church. It puts The Exorcist to shame.All this clocking in at nearly three hours, and I didn't once find the film bloated or lagging. As for Reeves, he's a movie star. Some of his acting is pretty questionable in the film, but the man has screen presence, and by his performance, he's dedicated to the cause of Wick.What let the side down a little was Skarssgards pantomime portrayal of the villain. He's far too camp to be in the least but threatening, and the 'help' Wick received from the tracker was a little too convenient at times.But minor quibble aside, this is a masterpiece of action, it's balls to the wall from the moment you see the Thunder Road PC logo, right until the fade of the last scene.This is everything you've expected and more. If you are a fan of the action genre, see this, you've deserved it.Look out for a Wilhelm scream, and a stinger.'Chefs Kiss'",
    "61": "Am I the only one who finds this film terrible? I was looking forward to it because I like Keanu Reeves and Scott Adkins, but the fight scenes are atrocious, they are so slow and out of sync, multiple times I noticed actors waiting to be hit, and in the background you can clearly see the actors missing each other, in one scene the Chinese woman was fighting with two bad guys and as one of the went to hit her, he clearly stops to give her time, which is so amateur, it's embarrassing. I remember the other three films, and I must say the first one was the best. It is nice to see some other great actors though, Clancy Brown, Lawrence Fishburne, Ian McShane, Donnie Yen to name a few.Sorry but I found it terrible.",
    "62": "If I've understood correctly, this film doesn't really have any plot at all at least for those who're familiar with the john wick world.This film relies heavily on the actions and nothing else, just action.We all know that John Wick is going to win in the end and hence the movie doesn't really surprise us at all but if there would've been some turns & twists then maybe this film would've gotten a chance to talk about but relying just on the action part is not at all good for any kinda movie, not even for a John Wick movie is the essence that this film brings upon us.Overall, if you don't want to miss out on one from the franchise, then it's your fate.",
    "63": "As Mr Wick nears the end of his journey, we are given a delight of a story well structured across its constant world building. It gives a never-ending stream of new structural and actionable aspects that feel natural as it progresses, from the action, to plot points, and personal development. An intertwining of interests rooted in common found circumstances, history, connection, as well as coincidence and luck. As he came back into this life a free man, he wills to fight to leave just as he came no matter the cost. As the nature of it expands with new and unsurprising aspects, this feature more than delivers and entertains.",
    "64": "Right off the bat, the second scene where he is chasing three guys on a horse in the desert (why? Who are they?) and then kills The Elder who's just sitting there, with very little fanfare in the middle of nowhere, no protection or even servants, I was immediately underwhelmed. This is supposed to be like a big deal, yet it felt meaningless.After that, it's just a bunch of barely credible fight scenes, over and over and over and over... All with convenient bulletproof clothing, and apparently none of these trained killers and thousands of bullets can hit the man's head. The cream of the crop is at the Arc de Triomphe, where he gets hit by four cars no less and just walks it off each time. Or where he jumps 4-5 stories high and slams his body basically head first on a parked car, and just walks that off too. Or when he falls down 222 stairs and walks THAT off.In the end, this is all just a cheap video game, where your character goes from set piece to set piece and has to shoot his way out; but in God mode.This thing is getting great reviews all over. What a low point we've come to.",
    "65": "I absolutely am amazed by this film I wasn't expecting it to be that brilliant whenever the camera zooms out into the city's omg my mouth dropped the fights are like 45 to 35 mins and it's extremely brutal and the reason I'm reviewing on 23rd is cause UK released it early and I watched it at 6pm today it was absolutely amazing and brilliant the new villians was wow crazy marquis tracker Caine and many more the ending was unexpected and very sad there's no slow moments it's extremely intense and gruesome in parts so it's not for the faint of heart this film should be 18 in UK idk how it got 15 but I recommend ppl over 14+ can handle it I hope everyone enjoys this film 10/10 best film of the year if I had to rank it John wick 3 John wick 1 John wick 2 and my number 1 is John wick chapter 4 so that's my review on John wick chapter 4 I hope everyone likes the review.",
    "66": "And we are just luckiest people to be alive at such times. Not just best John wick movie or the one of the best action movie but a Truly Beautiful Movie (yes hundreds of people does die brutally here) but the way every scene especially the fight choregraphy is shot, its nothing short of a masterpiece. From the great actors, to the epic storyline, the comedic scenes (yes there would be many) to the extraordinary breath taking scenes, its all just perfect. The 2nd best movie i ever saw in theatres (after the endgame ofcourse). Nonethless, its a movie worth missing everything for, just go out there watch it in theatres especially in 4DX. Or you might just regret it for the rest of your lives!",
    "67": "I like to watch people getting killed. Give me a movie where people are getting killed for 3 hours and I'll be happy. Then you've come to the right place in Hollywood. Hollywood is for the mob what was once the arena in ancient Rome, but the light version. The rabble, ignorant, feasting on big screens where violence is shown as necessary, tough and sexy. John Wick is like American porn: do you like chocolate? Then we'll drown you in it. The film has a total lack of drama, a total lack of imagination and, even worse, a total lack of humour. After the umpteenth headshot I look bored at my lukewarm popcorn. Kenau Reeves, the Internet's darling of good deeds, plays a depressed killer in a black suit who does nothing but kill people. A feast to watch for the poor in spirit. Hollywood: we've got millions and what do we do? Portraying human ugliness like it is sexy.",
    "68": "'Brilliant' word will be an understatement for this film .This is Chad Stahelski's finest piece of work . John wick 4 is visually stunning and at the same time is engaging .The running length is almost 3 hour but feels like 2 hr . The editing is crisp and on point . The action choreography and Set pieces are phenomenal . John Wick 4 is arguably the best action movie of this decade . The stellar star cast comprised Keanu Reeves , Doni Yen , Ian McShane , Hiroyunki Sanada,Bill Skarsgard ,Scott Adkins ,Laurence Fishburne and Late Lance Reddick etc are apt in their respective role .Kudos to the director and his team for gifting us such an amazing cinematic experience .",
    "69": "After the hundredth henchman fails to shoot John Wick on the head you might be thinking 'aren't these guys supposed to be well trained?'The movie had very little stakes and even less plot. At times you could see stunt men missing their cues and their marks. Usually you can ignore it but violence was all this movie had so I expected better. Watching a stunt man stumble around for five seconds until Keanu was ready for him took me right out of it. For a movie that went to great lengths to advertise how the actions scenes were accomplished I felt cheated.The plot was laughable. Honestly I thought this movie would try to explain parts of the high table, gangs and why an American homeless man has millions of dollars in paintings stored in a train station in Paris.We heard someone snoring in the cinema.",
    "70": "Wtf, 10s from people? This was the worst one yet and Chapter three sucked ass!Over, over the top. People dancing while others are killed around them, cars keep driving on like a damn marry go round even though people are killed like flies. He survives being hit by a car at full speed not once but 5! Times in 5 minutes. Oh, and falls from a building (again) and totals the car but just walks off.And then they try to be funny with the dog biting nuts, him rolling down the stairs like it's an episode of Family guy.And to top it all off, the blind guy shoots better than John f'n Wick.Give me a f'n break.The only reason for not giving it a 1* is cus I like Keanu.",
    "71": "I am absolutely baffled by the 8.4 rating on here of this movie. Watched this in the cinema last night and its the worse movie I've seen in the cinema for a long time. I have never been so bored. No apparent storyline, repetitive, noisy, scene after scene of people fighting each other and shooting people from 2 inches away and wooden acting by Keanu Reeves. I was bored after 30 minutes and couldn't wait for it to finish. The only good thing about the movie was the dog that was in it. 3hrs of my life I will never get back. If anyone is considering going to watch this in the cinema I wouldnt bother wasting your evening.",
    "72": "It's awesome to see how John Wick franchise has progressed, four movies in and it still has that same aesthetic, top to bottom, this film was just amazing. The editing was spot on, the scenery and focal shots are amazing, All of the actors were outstanding, the effects were some of the greatest I have ever seen, and the variety in the fight sequences was refreshing and new.The director and writer really nailed the action and entertainment in this movie. Honestly I was little worried that they couldn't keep up with the franchise going at such a high level, I'm glad it was not the case with this one.",
    "73": "My son and I love the John Wick movies but both agreed this was really bad. There were a few creative aspects to the fight scenes, cinematography and effects, but in terms of the writing the whole movie was just one long incessant fight scene repeated what felt like hundreds of times without any story to break it up or make any of it matter at all to the viewer. In action movies it's obviously about the action and not much is needed to make the story 'matter' but my goodness at least have the basics of an actual story that makes the action compelling in some basic way. There were a number of excellent actors in this movie but sadly the writing made it so that even they couldn't contribute anything to the story. Went in excited but I seriously wanted to walk out about half way through when I realized it was just going to be non-stop fight scenes and nothing else for 3 whole hours. It was truly mind-numbing.",
    "74": "Since I joined IMDb in 2003, my reviews are composed by a summary without spoiler, opinion and the Brazilian title. \"John Wick: Chapter 4\" is one of those movies where it is not possible to write a summary since there is no storyline, only stupid fights and shootings all the time, along almost three hours. There is also a tour in France and Germany, and nice scenarios simulating Japan. One of the most stupid scenes is when people continue to dance, despite the shootings and fights at the same place. John Wick is probably from Krypton, since he is gunshot, hit by at least five cars and jumps off buildings on the street and nothing happens to him. The dog \"Nuts\" is responsible for the best scene in this forgettable movie. Funny also to see is the Metascore and the IMDb ratings for this film. The sheeple believe in them. My vote is three.Title (Brazil): \"John Wick 4: Baba Yaga\"",
    "75": "During this film you get pretty soon the feeling \"seen it all before\". The amateurstic fightscènes (how an opponent is waiting to attack after his collegue gets shot is unintend hilarious), the lack of a good story nor script (I hope Mr. Reeved is paid by the amount of people he kills the same way over & over rather then by the amount of words in the script (40 if I'm not mistaken). The infantile over the top characters & acting. This franchise has it all. Unfortunately we've seen this 3 times before, the 4th time is just too much, even with Mr. Good Guy Reeves. A pure waste of time, Mr. Wick ...",
    "76": "Seriously.This is a videogame. Lot of fight with a boss to defeat each time and the final boss.Nothing new, nothing that we haven't already seen. Some fights are so incredibly lame (opponents seems to goof around just to wait for the hero to get ready rather than attack and kick his ass into orbit) that they just not make sense. Or maybe the director think we the audience are all a bunch of stupid children.The first John Wick made sense. It was about a man who kicked some asses and got kicked for good.This one is more like one of the hundreds dumb superheroes (please.... The suit that deflect the projectiles is so utterly ridicolous that not even the excuses \"it's made out of kevlar\" can stand on its feet) that already are clogging the theatres and the tv on demand.We don't really need another one that turn a good idea, a good character and a potentially good franchise in a pile of fuming, smelly manure. Once again.To me there is only one Jonny Wick. The first one. All the rest are for the childrens who cannot see beyond the pewpew and the eyesore of the special effect and the dumb fighting scenes.Sorry. Not sorry.",
    "77": "I think the first one was the best.. because of the introduction of the character and how ruthless he is.The second one was ok and him running away on parabellum started to get crazy and over the top.. him being hunted by every body started to get too much over top.. even too much unrealistic than it already was but we were still diggning...\nlike him getting revenge for the dog was alrighjt, everybody was rooting for him for sure... but then.. it lost its purpose..and then this movie .. dude, come on, why 3 if it was that easy.. i mean, it wasnt easy but it the possibility of the duel existed in the first place? And how conveniently this marquis was hiding in a corner waiting for his turn to appear... kinda like the eternals during the whole Thanos event.. they said they couldnt interfere.. but wait, their whole purpose was to use Earth to do something I wont say for spoiler purpose.. but you know, made no sense than not helping the avengers... but anyway, this marquis and the duel should have happened in the movie before.. or not at all like i said lol..\ncould have gone with wick saving someone or whatever.. i dont know..imho, he is still alive but I imagine there wont be another one... unless this movie gets $$$$$ worlwide box office and then maybe.",
    "78": "If stunning fight scenes are your thing you'll be in awe, as the battles start quite soon and lead to more, hand to hand, with guns and swords, not much dialogue, no time for words, as the blood is spilt, the casualties do soar. The geography begins in New York City, not too later in Osaka things get gritty, Berlin really bares its teeth, as several more become deceased, and in Paris things get wild, and somewhat tricky.Nothing you haven't seen before but perhaps not on this scale, as The High Table appoint a Marquis to remove John Wick and all he represents, employing traditional tactics and approaches not unbecoming of a film of this nature.",
    "79": "Throwing a gun at somebody hurts them more than shooting them with a bullet, apparently. The action sequences look like dance choreography. And a blind man proves humans don't need eyes for anything, much less shooting or sword play or \"watching\" loved ones. This is an utterly ridiculous piece of garbage. This is not Cinema. This is just shoot, kick, slay and whatever other crap you can come up with. And it lasts a whopping 2 hours and 49 minutes. Whoever finishes watching this must be given a gift, surely.There Are Video Games And There Are Movies, What Is This? For this is just not cinema, Period.",
    "80": "The story was ok but could have been better flushed out. Fight scenes are great but they were way too long and so unrealistic. Not nearly as good as the other 3 movies. If they would have given us a little more background on some of the new characters it would have made more sense and given them more depth. In previous movies John would use his Krav Magra skills to take down or slow down someone then a double tap to the head would usually be sufficient. Those fight scenes were outstanding and believable. Almost all of fights in this movie ridiculous. People were shot and stabbed several times and looked like they weren't hurt. How many times did John get hit by a car and just walked away? How many times do you have to hit someone in the face with nunchucks before they go down. I used to think John was special. The Baba Yaga. But in this version he is made to look almost invincible. Really, did they have to get so far away from reality this time. I left somewhat disappointed. Was I watching a movie or a video game?",
    "81": "Think it's gone too far past how great JW1 was,just over hyped now. How is all this action happening with no police any where?A blind man shooting people but no one can shoot him ?? The main body guard for the main villain should of been killed plenty of times,JW puts bullets in people who you know are dead but leaves this guy in the middle of the road when he's the main threat??How is all the violance happening in the street and night club and no one batters an eye lid ??why did he leave the underground to go to the church that's obviously miles away to then end up in a shootout ? Surly he got of go there easier ? The overlay of the radio DJ at the end was annoying,how did she know where he wa aging to be constantly??",
    "82": "Wick needs to go from spot A to spot B. There are hundreds of enemies trying to kill him. He will fight against them all alone and will kill them with his weapon. Now he is at the spot B and needs to go to spot C. There are hundreds of enemies trying to kill him. He will fight against them all alone and will kill them with his weapon. Now he is at the spot C and needs to go to spot D. There are hundreds of enemies trying to kill him. He will fight against them all alone and will kill them with his weapon. Now he is at the spot D and needs to go to spot E. Yeah that's the same over and over again for three hours. Make yourself a favor a skip this movie. Thank me later.",
    "83": "If you like a bunch of dudes posing and fighting in the most inefficient manner because it looks cool on screen, this is your kind of movie.I'll admit, I'm not a fan of this type of movie. When the high tension music kicks in and people start shooting just close your eyes until it stops, you think John Wick will be dead? The plot is the same as in the other movies: Super badass is so cool everyone wants him dead including the ridiculous organization of metrosexuals and suicide girls that he works for.There were several attempts at humor that didn't land, it was ironically when the movie was deadly serious that I found myself laughing out loud.",
    "84": "Just got home from the theaters and man oh man was this one of the best movies I've seen in a long time. This is legitimately a MASTERPIECE. I've seen a lot of films and I think this is the best action film I've seen. Definitely the best action film saga. I had to wait in the theater for a long time because I was just so blown away by how well made this film was.The lighting has evolved with each movie and it was absolutely stunning. And that goes along with the cinematography. Just absolutely beautiful shots. And of course the choreography was incredibly well orchestrated. AND THE PEOPLE WHO DID THE STUNTS. There seriously needs to be an Oscar for choreography and stunt work.This one is for Lance Reddick. We all love him and will miss him dearly. Bravo.",
    "85": "This movie has the same plot as before: John Wick against the rest of the assassin world with longer running time. What is good with a longer duration is the characters can be well developed, and I really like that Donnie Yen, Shamir Anderson, Hiroyuki Sanada and Scott Adkins have enough time to show their acting. Especially Donnie and Scott. Hiroyuki/Henry Sanada has seriously acted on several movies so he's natural.Another benefit with longer duration is of course more actions! However, I'm a bit dissapointed about this, because it doesn't mean that to make it longer, those henchmen should be too hard too kill as if they were zombies which you need to punch, kick, throw, shot on the knee, leg, abdomen, chest and finally their head to finally died. For those troops with full body armor (in Continental hotel set) this is still logical. But for those thugs in Paris who were not use a bulletproof suits, this become silly. I don't understand why John Wick didnt try to break their neck or shot their heads to quickly eliminate them.Not only those thugs are zombies, John Wick should also a zombie since he fell from 2nd/3rd floor several times, get stabbed, punched kicked, hit by car also several time, fall down and roll over on hundreds of steps and still can get up and seems fine.And I totally loss it when there's a shooting duel, with one of the participant is blind!. I really want the movie to be finished asap.However, as I said, the character development is nice and the gun-fu which are shot from above from room to room is also memorable. I quite enjoyed them. 7/10.",
    "86": "The fight scenes were terrible. Looked absolutely fake. This movie series should stop. Turning into Fast and Furious. The people at times were waiting for Keanu to turn around before throwing the slowest fakest punches ever. The punches Keanu was throwing didn't look remotely real. The nunchucks scenes were crazy bad. This movie is not good.It is so stupid that you have to write so much in order to leave a review. There is no need to write a paragraph in order to review a movie. Especially one as trash as John Wick 4.Crazy people acting like this movie is good. By far the worst of the franchise.",
    "87": "Come on, how many people can Mr Wick kill and still walk around with hardly any wounds. And the number of cars that crashes into him!?! Then climbing hundreds of stairs and falling down and climbing back, that alone would have done him in. Oh, what about the Blind man who can go to all these different locations, know his way around and kill so many? He's BLIND!There is a good twist at the end is why gave a 4. Without that I would have ony given a 2. But the ending after all the gun fights makes no sense. Plus, really did it have to be 2 hours 40 plus minutes long? I think not! Loved the first John Wick. One of the best action movies ever made.",
    "88": "Spoiler alert.It's John Wick. You know what your in for and it looks good, and the action is good in places. But, long story short, there is no point in any of the events in this film happening. It also pretty much renders 2 and 3 null and void.Everything he did, going against the high table, trying to get out, is undone because he just dies. If he'd got killed at the start nothing would have been any different. He manages to get out from under the High table but just dies so why bother? Okay, you can listen to Reeves and the director waffle on about this and that but who cares?\"For him to get his peace, or freedom, in a way... that was the reason to make the movie. It can't just be, 'Let's do another one'. It was really about death, or a way of dying. We were really inspired by the Hagakure.\"Great, cheers Keanu.Another theme seems to be consequences and facing them... okay fine, other characters do keep pointing out that he's getting everyone killed with HIS actions and he is. But y'know, surely he'll redeem himself and achieve something. Nope.You could also argue that he sacrifices himself to save his friend and his daughter but again who cares about that? The daughter is in it for about 20 seconds (and is less of a character then John's car was in the first film) but nevertheless he helped them and that's a positive. Oh wait, the post credits scene it's going to make sure even that small spark of hope gets snuffed out.It's a mean spirited and cynical film, that relies far too much on magic kevlar suits to mask the paucity of new ideas (although the \"dragon breath\" scene is cool) and just leaves a sour taste, even though it didn't have to. There are so many narratively satisfying ways to kill off a main character but this managed to miss every single one of them.The first one is brilliant. Lightning in a bottle. Turning it into a franchise bloated it and then killed it stone dead.",
    "89": "I was fortunate enough to view 'John Wick: Chapter 4' in a double-bill (Chapter 3 prior to 4) avant-premiere screening at the theater with my family. I've always been a great admirer of the practical action sequences portrayed in the 'John Wick' films.Undoubtedly, 'John Wick Chapter 1' remains my favorite, followed closely by Chapter 3. It definitely has something to do with the fact that the type of action and gun-fu felt so new back then. That is also the one main thing this fourth film suffers from in my opinion: innovativeness. Though this issue only really exists throughout the first half of the film.The Paris sequences & pretty much all action sequences featuring Donnie Yen (as 'Caine') serve as a breathe of fresh air in this film. Some new weapons and technology such as the bow & arrow, the nunchucks and some fancy incendiary bullets make certain action scenes a joy to watch. Though the other sequences are certainly cool, I can't help but feel like I've seen it quite a few times already.The cinematography was definitely at it's highest point in this fourth film. The movie was absolutely gorgeous. The colors are vibrant and ultramodern, almost in a science fiction-y way. The way action sequences are shot have always been amazing; from long takes to overhead shots, back to running between cars on the Champs-Elysees and dueling like it's the wild west. It's a lot of bloody fun! I'm slightly saddened by the fact so much action was shot in dark and distractingly lit environments, but overall the practicality of it all was still there.I enjoyed the music more in the prior movies, though I haven't separately listened to the OST yet so I know what to do. Sound design, costumes and world building is another massive win for me. I love this world they've managed to create full of assassins and strange people. It was nice to explore so many different countries and 'continentals'. It really helped with making this film different from the others.Keanu Reeves is always a joy to watch, what else can I say? I'm also very happy they brought in legends like Clancy Brown, Donnie Yen and Hiroyuki Sanada. Their skills and overall badass vibes just fit so fell in this world. Speaking of legends, I'm saddened by the recent passing of Lance Reddick, who portrayed 'Charon' the concierge. I'm glad to have seen him one last time in this role and I pay my respects.Overall I rate this film a 8/10, on par for me with chapter 2. If you come to see John Wick absolutely kicking people's ass while also breaking his own back numerous times (you'd think), this is the right film for you. You don't really get a lot of opportunities to breathe, and I love it.",
    "90": "Finally got the chance to watch this movie and I have to say, everything you'd expect from a John Wick movies, you got it. From the cinematography to the color grading, to the special Fx. So I wasn't moved by that at all. We all know that 3 was bad, but 4 was abysmal. I don't know what the directors were thinking making the main antagonist, Caine, a BLIND man. I mean, how were you going to sell this to fans of John Wick who know him to be am amazing gunslinger? And you telling me, he can't shoot a blind man dead from a few yards away? What load of rubbish is that? That spoilt the whole movie for me.And then you had Mr Nobody, who I really didn't understand what he was doing in the movie with his dog. Then you had all the awful and predictable fight scenes. It was such a pain to watch, you could tell it wasn't real as the fighters would pause, waiting for Keanu to make a move then they responded. I don't know if it was Keanu who was slow or what, it was just wrong. And the Marquis guy's acting was just terrible.The story was very weak IMO, not as rich as the first and second. This is the 4th chapter, I was expecting something rad! But everything here we've seen before in previous John Wick movies, the only crazy moment was the unexpected death of Winston's concierge.My conclusion is a simple question: how hard is it for a whole John Wick to shoot a blind man?",
    "91": "Imagine a video game where you are shooting bad guys. Your hardware is old so everything is kind of slow and out of focus. The opponents are set to Easy and you installed a hack to give you invincibility and autoaim. And they come at you slowly, shouting, out in the open, with weapons that fire three or four bullets before they run out and they can shoot anything anyway. They use no snipers, no explosives, no traps of any kind. They can't even hit you when they're next to you and wielding a knife. And you try to fight them in a decent manner, yet your avatar moves like a 60 year old man and even with the autoaim you still suck. And if you somehow get into the many separate levels where nothing make sense, you get a big cinematic that takes you out of it. And because the cinematic is in 4k or whatever, it feels like slow motion.That, my friends, is the experience of watching JW4. The style that people have applauded in the first movie has turned into a demented caricature, the fight scenes are ridiculously bad, the actions of the characters make no sense at all, the world described makes no sense. Not even the tongue-in-cheek references to The Matrix don't hit, because you know that if you enjoyed that film, you're now over 40 and it makes you feel old. The film is three hours of irrelevance.And if you are among the people who I can't understand that rated this film anything above boring, just watch the end credits scene. It destroys the little joy that you might have kept watching this.Bottom line: So many talented people worked on this film. With them on board, I cannot imagine a worse outcome. It's not even funny, it's just sad.",
    "92": "These John Wick movies can be sort of fun in the sense that they are unintelligent violent nonsense pretending to be movies. There is something entertaining about dumb nonsense sometimes, and the first two of this franchise was decently okay in this regard. The last one and this one however not so much, only dumb.This movie is almost 3 hours long, and oh boy do you feel every minute. Because if you have seen the previous instalments you have seen this one to. This is like a bad video game repeating the same thing, the same course, the same enemies, and for the 4th time. There is also a post credit scene, which is simply dumb, no reason to stil around for it.The acting is also horrid, and if you are going to buy any of this you have to have good acting but no.The only positive I can say about this movie is that it is not as putrified as many other movies lately so for a contemporary action movie this is not as bad as much else.I give this a very, very generous 3/10. If you want to watch this, don't. Go watch the first one, and maybe the second one instead. Those are also highly stupid, but at least decently entertaining, this is not.",
    "93": "I went to the cinema with great expectations. I have to admit that the photography is gorgeous, the locations are wonderful and the action sequences are well coordinated. However I feel that the true identity of this franchise was completely lost with this fourth chapter. The first two movies for me are the best because the stunts look more credible. \"Parabellum\" started to drop in quality, but it was still a solid flick. Here John suddenly became a superhero that can take any hit and can fall from every height and he can just keep going like nothing happened. When Chad Stahelski directed the first movie he was not expecting all this success and when the production company ordered sequels, he did not really know how to develop this saga. Now it is one of the biggest action franchises with a TV show that will be aired in the future and maybe with a 5th entry that was already approved. This got definitely out of hand and Wick basically became the parody of himself, with scenes that have forced comedic moments that do not quite deliver. In my perspective they really do not know what to invent anymore. I really hope that in the future screenwriters and the director will come up with better ideas, because it is a series with potential and it showed it in the previous chapters, but in this case it just felt pointless and purposeless.",
    "94": "Most American action flicks released these days have poor screenplays and overuse computer-generated imagery. The John Wick franchise is one of the few exceptions, along with Mission Impossible. These franchises keep getting better with every entry. Hollywood can make action masterpieces, but Marvel has greater demand, so that's what we get most of. It's a shame.The stunts and choreography are beyond impressive. Every artist involved does their job to perfection. Donnie Yen's performance is unbelievable. Not only does he fight great, but he also has to move like a blind man. Keanu Reeves is also very impressive. Keanu IS John Wick. Although there are a few scenes where his enemies stand by and wait for their turn to attack, it's easy to overlook because everything else is so great.I can't fathom how anyone could choose to watch Ant-Man over John Wick. It's so fast-paced, and the choreography and stunts are mesmerizing and brutal. When the action breaks out, it's unbelievable. It's hard to explain -- you have to see it! Why watch a computer-generated \"superhero\" fly around when you can witness Reeves and Yen engage in a genuine and thrilling fight?",
    "95": "Half of this review will be me gushing about the action. Wow. Just wow. I was in complete awe. There were multiple times I was both tearing up and laughing at how unbelievably amazing the fight scenes are. Now this is nothing new for the John Wick series. But for me, this is far and away the best action of the entire series.I'm an action junkie and am repeatedly disappointed with action movies and their terrible fight scenes, filled with shaky cam, quick cuts and close-up shots (looking at you Snake Eyes and Mortal Kombat). Then I watch a John Wick movie and feel so spoiled, while also being baffled at why other action movies can't learn from this. The fights are so fast-paced yet completely clear and easy to follow.There is every kind of fighting imaginable. So many weapons, styles, chases, vehicles, animals, everything. So much creativity with the kills. Amazing combinations of weaponry and fighting styles (pistol/sword combo is my fave).The music is awesome as usual, maybe even a step up. It enhances every action scene. The cinematography is pristine. So many beautiful shots, so many mesmerizing locations for the action. It is stylistically beautiful.There are a couple of scenes that are shot in such a creative way that I've never seen before. One is an overhead shot one-take that I couldn't believe. It takes the movie to a new level. So many scenes feel like they're a video game brought to life. Numerous times it feels like the VR game Pistol Whip.Donnie Yen is awesome. End of paragraph.About an hour into this nearly 3-hour movie, I felt like I experienced enough action amazingness for an entire movie. I was in a state of ecstasy. Not only was this looking like the best of the series, I started wondering if this would be a landmark action flick. Maybe it's my own fault for setting expectations so high mid-movie, but the second half is more flawed, though still awesome.The subplot with the tracker doesn't seem at all consequential. And his dog attacks were already done, and better, with Halle Berry in Parabellum. A few of the issues I had with Parabellum pop up again, like overdoing it sometimes with the damage he takes. For example, instead of getting hit by one car, he gets hit by three cars. And that's a mild example. Also, it's fairly anticlimactic.Even with those flaws, I had a BLAST with this movie and will definitely see it at least once more in theaters. Seeing it on a premium screen is a must. Loudest speakers, biggest screen. TRUST ME.EDIT: I was itching to go again since opening night. I wasn't able to wait more than 5 days. On second viewing, I still felt the same flaws, but I didn't care. The action is incredible. It has at least four* of my all-time favorite action scenes. I want to watch these scenes a hundred times.It's definitely not perfect, but I still consider it an action landmark (last time I said that was Mad Max: Fury Road). Every other action movie should learn from this. Updating rating from 8 to 9 stars.(5 viewings, opening Thursday UltraScreen 3/23/2023, UltraScreen 3/28/2023, SuperScreen 4/10/2023, re-issue IMAX 5/2/2023, 9/22/2023)",
    "96": "Stuntman turned writer/director Chad Stahelski struck gold with his 2014 surprise hit John Wick. It was somewhat of a comeback for the legendary Keanu Reeves and reinvigorated the action genre. Since then it's become THE action juggernaut franchise. Now we are on number 4 and while usually things get redone with that amount of sequels, this film innovates and thrills to new heights in an absolute epic.One of the most surprising aspects of this particular entry, is the story being written as well as it is. Something that is hard to come by in the genre at times. Not saying the others in the franchise weren't but this is easily the best story diving deeper in the high table aspects as well as John Wick's true emotions . The rich characterization is also at its best with outstanding additions like Skaarsgard, and even more screen time for supporting greats like Fishburne to compliment the magnificent Reeves. RIP Lance Reddick. It's nice to have such substance amongst the endless high octane ballistic visuals.Speaking of ballistic, this movie goes more all out than any I've seen for insanely well crafted choreographed shootout and fight scenes. Just when you thought you've seen it all, Stahelski/Reeves prove their action minds are ever evolving. These guys were born to make action movies together.The extremely vibrant colors and plethora of locations is also a feast for the eyes. The sharp atmospheric imagery creates the ultimate backdrop for not only the action but also just the dialogue. The sound is also top notch and perfectly compliments the intensity. It's just an absolute sensory journey that you don't get in too many action films aside from the Wick genre.Overall the limitless and outrageous action alone is nothing like we've seen before for the genre or just cinema in general . But also this rich unique story may only build Wick's timeless character for more films in the future which at this momentum will be welcomed.",
    "97": "He fights and bites, he fights and bites and fights. Fight, fight fight, bite, bite, bite, it's John Wick, the silliest action movie franchise in history...and it runs 2h49m so there's a lot of extra fighting and biting.Serial killer John Wick is at it again, folks. They should have a graphic in the top right corner of the screen counting how many people he kills in every movie. If watching this doesn't make your brain hurt, you may need to get yours fixed.Everyone talks about the well-choreographed fight scenes, but they have zero link with reality that there can be no tension felt by viewers. Of course, John Wick will walk away from his battles, no matter how stupidly absurd the odds.There can be zero tension in an action movie when there is this much carnage going on. If the hero always comes through, no matter how daunting the odds are against him, why bother watching? Just fast-forward to the end, or stand up and walk out of the theater.",
    "98": "In a world where movie sequels seem to be loathed even before they are released, the 'John Wick' series has remained remarkably consistent and well received. In fact all three of the first films have the same IMDb rating of 7.4/10 and I noticed recently that I gave them all the same rating of 8/10. Incredibly, I think 'John Wick: Chapter 4' is the best the series has to offer. This movie was a wild ride.I was a little disappointed when I first saw the runtime for this one was going to be almost 3 hours. I find that is becoming a tough runtime for a lot of films to justify. This film does it with no trouble. The pacing is so incredibly fast that the 3 hours pass by in no time. I remember looking down at my watch early in the film thinking maybe 20-25 minutes had gone by and almost an hour had already passed.A large reason for this is the action sequences. When an action sequence starts in this film buckle in, because it is going to go for nearly 20-30 minutes and be non-stop craziness the for the duration.The action sequences in this film are perfectly shot as they always are in this series. Lovely, wide camera angles so we can see every thing that happens and know that it isn't all being edited to look this way. These people are actually doing these things.As always with these films you need to go in a rather incredible suspension of belief. Wick is nearing super-human level at this point. It doesn't matter how many cars you hit him with or how high the building he falls off is, he'll be back and fighting again 10 seconds later. It's best to switch your brain off at these points I have found.Finally, I loved the main villain in this movie played excellently by Bill Skarsgård. He was everything a villain should be. Calm and seemingly in control, menacing and easy for the audience to hate and root against.This film was a blast from start to finish. 9/10.",
    "99": "John Wick: Chapter 4 is almost three hours of Keanu Reeves engaged in a gunfight, bookended with meaningless dialog-in-place-of-plot, and a lot of people being thrown down stairs. Of all the \"Wick\" movies, this is clearly the weakest one yet. Was anything added to the overall Wick-universe narrative? No. Did we see a whole lot of inconsequential people die? Yes. Did Keanu Reeves say \"yeah\" a lot? Yes.Look, I was hoping for SO much more than this. A meaningful ending to the series (which it isn't, because apparently this made so much money they are working on a fifth film), but what we got here was something in very much need of more script doctoring and less \"bang-bang.\"With a little more work, this could have been an average movie. Don't talk to me about stunts or cinematography or the choreography of the actors in-play, wow me with a plot that makes sense and moves the story forward--John Wick 4 does not move the story forward. It just says \"let's shoot a bunch of people, okay?\" And that's what it does... for 3 hours.In the end I was of the following opinion once the credits rolled: ...and?...We all deserved better than this. John Wick did, too.",
    "100": "The bad: it lasts too long. A whopping 2 hours and 45 minutes. Some of the fighting scenes stretch out over 5 to 15 minutes of CONTINEOUS fighting. But after having watched over 2 hours of fighting already, I definitely began to long for it to end.The good: the fighting scenes are pretty good though. I was wondering if they could still come up with some new and interesting fighting choreography and they succeeded at that quite well. There are even quite a few comical fighting stunts included. Nice!All in all not a bad sequel. If it werent for the much TOO long duration I would rate this nr 4 sequel better / higher as the nr 3 edition.Nothing beats the original first edition of John Wick though, because THAT first edition was not only contineous action but also cared about the CHARACTERS. Unfortunately all the sequels were more and more focussed on solely the figthing scenes, which kinda bored me in the end.Nr 4 is highly overrated. I suspect because of artificial \"managing\" of the Imdb ratings. This movie is never worthy of 8 stars (ridiculous). 6 stars at best. But because I got bored at the end I will only rate it 5 stars...",
    "101": "So I like the John Wick series as much as the next guy but this is just lazy. There are a couple of things that we need to address here.First the story has gotten very VERY stale. Like to the point of where if you removed the story, it wouldn't have mattered, at all.Second as where in the first movie there was some pretty damn good choreography, in this installment I literally watched MULTIPLE scenes of guys standing around waiting for 1 guy to go down so they could pretend to jump in. And no, this wasn't like a behind the scenes take.And the final insult is the actual fighting itself, there are just times when for no reason the person he's fighting just sits there, they aren't knocked out, they aren't dead, they're just waiting for him to get his gun, load some bullets, go for a coffee, and then shoot them. It actually pains me to watch this garbage be pawned off as a top tier movie.This is when you guys should stop this series, lets be honest you should have stopped it at the last movie, but ok, you had to give it a proper ending. News flash, this isn't it.",
    "102": "Come on guys. Let's admit it.It was bad. Really bad.John should be dead countless times. Assassins who while holding a gun, trying to punch him instead of shooting? 💩 in the first scene, the archers had everyone surrounded, and... Missed?John being hit by a car like ten times, hard, and still walking. His opponents hit once by a car, lightly and stayed down.Also... What was the \" Blade scene\"...\nThe whole \" the legend\" will smith vibe?The... Neo / morpheus thing\nA quick the exorcist scene, and Lawrence of the Arabia scene... A big no for me...\nIt didn't make any sense...\nHell I could be a better opponent than the guys John faced...watched that for 2.30 hour for him just die in a duel? Lol...em... No.",
    "103": "That lasted 169 minutes? I had no idea. The time just flew right by.Chad Stahelski does not pull any punches (or engage the safety) at any time in this gun-fu epic. Combat scenes are not moments so much as they are entire acts. The amount of stunt choreography that everybody had to synchronize to was rather incredible, and they continue to find more ways to entertain us with kills, kill types, use of weapons, locations, teamwork, etc. I caught myself smiling for minutes on end several times while watching it.Of course though, as I said, they really lean into it. I'm sure this has been true of previous films as well, but it is very apparent that John Wick should virtually die in every scene that he is in. Whether it is how he is attacked or how they fail to attack him at the right times, he goes at every foe like the bear in The Revenant with full adrenaline and no signs of slowing down no matter what he is hit by. And again, I think if you look hard enough you will find enemies who have clear shots and choose not to take them because of plot armor, but you can forgive it enough if you're rewarded with a longer take or overall longer action sequence. What I really loved was how many of these scenes took place at night with dazzlingly lit environments all around, and the music in every scene kicks as much *** as what you see on screen. I had pondered over why John Wick doesn't have a video game yet, but if they ever make one I have decided I'd like one of those top-down shooter games (similar to The Hong Kong Massacre, and if not maybe like the GTA:SA MP rampage style).I acknowledge this franchise for what it is now, but I still pine for some of the missing components that I don't know if it'll ever be able to bring back. After watching John Wick, fun as it was, I found myself interested in seeing a prequel when he was the Baba Yaga in his prime, taking missions rather than being hunted. Even still, at least in that movie he was absolutely feared. In Chapter 2, I still found him heavily respected, but it was in that movie that I realized there would probably be a repetitive formula to the narrative and movie/action structure (which still has yet to break). In Chapter 3, there only lived assassins and they would go after him without hesitation, which did is not how I felt the world breathed the first time around. They continue down this path in Chapter 4, while opening the universe more to different characters breeding their own kind of loyalty. They are all insanely fun to watch, and you see the cogwheels of the John Wick universe spinning with the future Continental television show and the Ballerina movie spinoff. Where they remain faulty though is even with the existence of civilians during fight scenes, they act as droning NPC's like nothing is happening around them, or they aren't there whatsoever. It is clear that this is not our world that this movie takes place in, but rather a parallel one.I mentioned the introduction of new characters in this world, and you can't not bring up Donnie Yen when talking about them. He steals each and every scene that he is in, and it's crazy because you wonder how a character like his could thrive in such a world but you absolutely believe it when you watch it. I will absolutely take more of him and Rina Sawayama. She isn't featured as much, but she makes use of every second that she is in front of the camera. There are plenty of others (such as the great Hiroyuki Sanada), but the point remains that Wick is relegated to this greater universe with characters who-good, bad, or for themselves-are ones we can actually root for in any fight. Keanu Reeves is understandably less nimble at his age than the others (and it's either bad acting or he really has taken on this John Wick role in his line delivery to hilarious new heights), but he and Stahelski have found a groove that still makes him the most impenetrable force around, to the point that I go back and watch the action scenes in The Matrix Resurrections and wonder what happened there. I didn't love one particular character in their big fighting moment(s), but they go for versatility and I have to give them that much.March has had an incredible run of theatrical films, and John Wick: Chapter 4 is no different. You will lean forward during the action which there is plenty, and if I'm one to go off of you will not feel the runtime. There is an end credits scene as well if you're able to stay for a moment longer. I would love to go back and see this one again.",
    "104": "Delivers a best high octane action thriller from the franchise .Pros - There was bit let down in JW3 , but they came back with a banger JW4 and delivered one of the best actions of all time . Stunt choreography , Camera work , editing and heart pumping BGMs were totally bonkers . There were many prolonged action sequences through out the movie , each of them never fails to deliver some thrill and adrenaline rush . Besides from action set pieces , JW4 well contributed in the world building and this whole tetralogy done a good job in World building & character establishments , I hope it will be well used in its upcoming spin off series and movies . Cast did great job , especially Keanu Reeves and Donie Yen were great .Cons - Few silly logical mistakes that you can't ignore .Overall , to the action lovers and John wick fans out there don't miss out to watch it on big screen . Must watch . Highly recommended .",
    "105": "An almost perfect sequel & by all means a fitting finale too, John Wick: Chapter 4 continues the tradition of the franchise going bigger, better & bolder with every subsequent instalment, and is action filmmaking at its most balletic, ballistic & breathtaking. Featuring some truly spectacular set pieces & stellar action choreography, all the while raising the stakes as the story progresses, this fourth entry is an expertly crafted & ingeniously executed offering that delivers on all fronts.Directed by Chad Stahelski, the story presents death's very emissary embarking on a Sisyphean mission of suicidal fury after the events of the last film and is more dramatically compelling than before. Stahelski continues to find new, creative & audacious ways to make the action stand out and takes ideas & inspirations from several classics of the past. There is a sense of urgency this time around that makes the unfolding events all the more restless and keeps the interest alive at all times.The reprising cast is impressive as before but the new additions manage to make their mark too, with Donnie Yen stealing the show among the latter. Reeves is captivating throughout and plays his role with panache. Bill Skarsgard delivers as a worthy villain. And the upgrades in set design & cinematography are notable enough to stand out. Also, after all the merciless bloodbath that ensues before, the decision to end the journey with a traditional duel is a masterstroke that only makes the finale better.Overall, John Wick: Chapter 4 earns high scores in every aspect and is one of the most pristine & polished examples of blockbuster filmmaking. Making all the genre elements work in absolute harmony to deliver an action extravaganza of the highest order, this immaculately orchestrated dance of death is one of the most rewarding cinematic experiences of the year that effortlessly lives up to its enormous hype and smartly brings the saga of the man, the myth & the legend to a satisfying conclusion. Do svidaniya, Mr. Wick.",
    "106": "My expectations for John Wick: Chapter 4 was high, these films have become some of my favorite action films of all time, and I can say this without giving it a second thought how it met those expectations. The thugs and easy obstacles are nothing new, except for how they too have ballistic suits like our protagonist. But this Chapter begins with a recovered Baba Yaga who's out for blood. Actors and returning characters along with Keanu Reeves as John Wick is Laurence Fishburne as the Bowery King, Ian McShane as Winston Scott, and Lance Reddick (in one of his final roles) as Charon. New roles which I loved was Donnie Yen as Caine: a blind High Table assassin and an old friend of John Wick.Bill Skarsgård as the Marquis Vincent de Gramont: a powerful member of the High Table whose position is challenged by John Wick. Hiroyuki Sanada as Shimazu Koji: the manager of the Osaka Continental Hotel and an old friend of John Wick. It also stars Shamier Anderson, Rina Sawayama and Scott Adkins.The premise goes like this: John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.Let's dig deeper into the story and what sequences I liked the most, I have a weak spot for samurai movies and the Osaka Continental offers just that. Brilliant choreography for each character, good guys like bad guys. With Hiroyuki Sanada being as brilliant as ever! Also showing off Donnie Yen's retired blind assassin. It's always nice to see a new Continental and this one sure felt special, you notice what friendship John Wick and Shimazu Koji has. The action sequence was great! But my favorite city and action sequences are found in Paris, it has the biggest importance to the story, it brought so many memorable moments. It shows why Keanu Reeves was and is right to lead this franchise. Paris is also the city where Marquis Vincent de Gramont is located and he becomes the highest-ranking member of The High Table during this film. Bill Skarsgård holds one of the strongest performances in the film as the Marquis. Keanu Reeves holds the best though, maybe not the best dramatic performance but certainly overall performance as he does his own stunts alongside everything else, and the stunts are incredible. Donnie Yen was great and possibly even one of the best things of the movie, both his knowledge in martial arts but also his character which I loved. The performance that surprised me was Shamier Anderson as the mysterious bounty hunter, it's a great character that they could do so much with and I can easily say the same for Donnie Yen and Hiroyuki Sanada's characters. One of the final action sequences was all in a one take, except for a quick cut before moving back to the one take. It was shot with a camera above, letting us see everything happening from above and moving with John Wick as he fires inside an abandoned building.Chad Stahelski truly directed an action film that'll be remembered for decades, his direction in both the action and more dramatic scenes are all brilliant. There's so many fight sequences in this film, small like big, all directed and shot brilliantly. The screenplay was done by Shay Hatten and Michael Finch, I don't have any problem with it, it's good and for a Wick film it holds the same quality. The movies aren't about the best writing in Hollywood, it's about what happens on the screen, blood being spilled. Tyler Bates and Joel J. Richard returned to compose the score for the film, after doing so for the previous three films. Like Shay Hatten had done too.I have read various of critics and some people complaining about the length, Chapter 4 has a runtime of 169-minutes. Its long, full of beautiful looking shots that does nothing to the story, only to create atmosphere and suspense where it succeeds. There are scenes that you could easily trim, yes, but I still found the length to be perfect. I want to see the 3 hour 49 minute version just because of how great the film was, but the theatrical version is magnificent. Chapter 4 is all about tying up loose ends, to finally find peace and freedom. It's a long road to that point, Chad uses the film's length for just that, to tell a bigger and deeper story than a simple story. More run time also means for more action sequences!This might be the best film of the four, both action and drama, also most beautiful in regards of the camera work and cinematography. Dan Laustsen truly knows his craft, making each scene absolutely mesmerizing to look at! I loved every second of it, when I saw it at the cinema, a woman (a mother) sat beside the person I was there with and said how brutal it was... She was five minutes in and the first action scene had only just started. Jokes aside, John Wick: Chapter 4 has some of the franchise's best action sequences and Keanu Reeves at his best. Like his role in The Matrix, John \"Baba Yaga\" Wick will be another role he'll be remembered for. This was an incredible film, one of the best I've seen in awhile.",
    "107": "Let's be honest if, by now, you choose to see a \"John Wick\" movie then you know what's coming. Several hours of hyperkinetic, over the top violence with a pounding soundtrack and moody lighting. On this front \"John Wick: Chapter 4\" delivers and then some.There isn't a plot that I can recall but once again our favourite assassin is wrestling with the unseen High Table and the price on his head is increasing faster than post-Covid inflation. So every goon in a suit is out to collect and John has to wade through a tsunami of bodies in order to, well, keep killing people.Clearly there's no logic here as John has no identifiable motive anymore or even an end-goal in mind. Instead he's the main character in a video game and you're watching a Twitch stream of someone talented playing all the way through to the final boss.At one point this characteristic is cemented, in spectacular fashion, when the camera shifts to a top-down view and you get to watch John move from room to room in a bloody spree. It's a fantastic sequence, right down to the spray of blood as henchmen #89 gets shot in the head at close range.So is it a great film? Well yes because \"John Wick: Chapter 4\" plays it straight down the line and sticks religiously to its aesthetic. There are no in-jokes here, in fact there are more grunts than dialog, and the film absolutely believes in itself. On that front it's a right belter.",
    "108": "The bad: it lasts too long. A whopping 2 hours and 45 minutes. Some of the fighting scenes stretch out over 5 to 15 minutes of CONTINEOUS fighting. But after having watched over 2 hours of fighting already, I definitely began to long for it to end.The good: the fighting scenes are pretty good though. I was wondering if they could still come up with some new and interesting fighting choreography and they succeeded at that quite well. There are even quite a few comical fighting stunts included. Nice!All in all not a bad sequel. If it werent for the much TOO long duration I would rate this nr 4 sequel better / higher as the nr 3 edition.Nothing beats the original first edition of John Wick though, because THAT first edition was not only contineous action but also cared about the CHARACTERS. Unfortunately all the sequels were more and more focussed on solely the figthing scenes, which kinda bored me in the end.Nr 4 is highly overrated. I suspect because of artificial \"managing\" of the Imdb ratings. This movie is never worthy of 8 stars (ridiculous). 6 stars at best. But because I got bored at the end I will only rate it 5 stars...",
    "109": "So I like the John Wick series as much as the next guy but this is just lazy. There are a couple of things that we need to address here.First the story has gotten very VERY stale. Like to the point of where if you removed the story, it wouldn't have mattered, at all.Second as where in the first movie there was some pretty damn good choreography, in this installment I literally watched MULTIPLE scenes of guys standing around waiting for 1 guy to go down so they could pretend to jump in. And no, this wasn't like a behind the scenes take.And the final insult is the actual fighting itself, there are just times when for no reason the person he's fighting just sits there, they aren't knocked out, they aren't dead, they're just waiting for him to get his gun, load some bullets, go for a coffee, and then shoot them. It actually pains me to watch this garbage be pawned off as a top tier movie.This is when you guys should stop this series, lets be honest you should have stopped it at the last movie, but ok, you had to give it a proper ending. News flash, this isn't it.",
    "110": "Come on guys. Let's admit it.It was bad. Really bad.John should be dead countless times. Assassins who while holding a gun, trying to punch him instead of shooting? 💩 in the first scene, the archers had everyone surrounded, and... Missed?John being hit by a car like ten times, hard, and still walking. His opponents hit once by a car, lightly and stayed down.Also... What was the \" Blade scene\"...\nThe whole \" the legend\" will smith vibe?The... Neo / morpheus thing\nA quick the exorcist scene, and Lawrence of the Arabia scene... A big no for me...\nIt didn't make any sense...\nHell I could be a better opponent than the guys John faced...watched that for 2.30 hour for him just die in a duel? Lol...em... No.",
    "111": "That lasted 169 minutes? I had no idea. The time just flew right by.Chad Stahelski does not pull any punches (or engage the safety) at any time in this gun-fu epic. Combat scenes are not moments so much as they are entire acts. The amount of stunt choreography that everybody had to synchronize to was rather incredible, and they continue to find more ways to entertain us with kills, kill types, use of weapons, locations, teamwork, etc. I caught myself smiling for minutes on end several times while watching it.Of course though, as I said, they really lean into it. I'm sure this has been true of previous films as well, but it is very apparent that John Wick should virtually die in every scene that he is in. Whether it is how he is attacked or how they fail to attack him at the right times, he goes at every foe like the bear in The Revenant with full adrenaline and no signs of slowing down no matter what he is hit by. And again, I think if you look hard enough you will find enemies who have clear shots and choose not to take them because of plot armor, but you can forgive it enough if you're rewarded with a longer take or overall longer action sequence. What I really loved was how many of these scenes took place at night with dazzlingly lit environments all around, and the music in every scene kicks as much *** as what you see on screen. I had pondered over why John Wick doesn't have a video game yet, but if they ever make one I have decided I'd like one of those top-down shooter games (similar to The Hong Kong Massacre, and if not maybe like the GTA:SA MP rampage style).I acknowledge this franchise for what it is now, but I still pine for some of the missing components that I don't know if it'll ever be able to bring back. After watching John Wick, fun as it was, I found myself interested in seeing a prequel when he was the Baba Yaga in his prime, taking missions rather than being hunted. Even still, at least in that movie he was absolutely feared. In Chapter 2, I still found him heavily respected, but it was in that movie that I realized there would probably be a repetitive formula to the narrative and movie/action structure (which still has yet to break). In Chapter 3, there only lived assassins and they would go after him without hesitation, which did is not how I felt the world breathed the first time around. They continue down this path in Chapter 4, while opening the universe more to different characters breeding their own kind of loyalty. They are all insanely fun to watch, and you see the cogwheels of the John Wick universe spinning with the future Continental television show and the Ballerina movie spinoff. Where they remain faulty though is even with the existence of civilians during fight scenes, they act as droning NPC's like nothing is happening around them, or they aren't there whatsoever. It is clear that this is not our world that this movie takes place in, but rather a parallel one.I mentioned the introduction of new characters in this world, and you can't not bring up Donnie Yen when talking about them. He steals each and every scene that he is in, and it's crazy because you wonder how a character like his could thrive in such a world but you absolutely believe it when you watch it. I will absolutely take more of him and Rina Sawayama. She isn't featured as much, but she makes use of every second that she is in front of the camera. There are plenty of others (such as the great Hiroyuki Sanada), but the point remains that Wick is relegated to this greater universe with characters who-good, bad, or for themselves-are ones we can actually root for in any fight. Keanu Reeves is understandably less nimble at his age than the others (and it's either bad acting or he really has taken on this John Wick role in his line delivery to hilarious new heights), but he and Stahelski have found a groove that still makes him the most impenetrable force around, to the point that I go back and watch the action scenes in The Matrix Resurrections and wonder what happened there. I didn't love one particular character in their big fighting moment(s), but they go for versatility and I have to give them that much.March has had an incredible run of theatrical films, and John Wick: Chapter 4 is no different. You will lean forward during the action which there is plenty, and if I'm one to go off of you will not feel the runtime. There is an end credits scene as well if you're able to stay for a moment longer. I would love to go back and see this one again.",
    "112": "Delivers a best high octane action thriller from the franchise .Pros - There was bit let down in JW3 , but they came back with a banger JW4 and delivered one of the best actions of all time . Stunt choreography , Camera work , editing and heart pumping BGMs were totally bonkers . There were many prolonged action sequences through out the movie , each of them never fails to deliver some thrill and adrenaline rush . Besides from action set pieces , JW4 well contributed in the world building and this whole tetralogy done a good job in World building & character establishments , I hope it will be well used in its upcoming spin off series and movies . Cast did great job , especially Keanu Reeves and Donie Yen were great .Cons - Few silly logical mistakes that you can't ignore .Overall , to the action lovers and John wick fans out there don't miss out to watch it on big screen . Must watch . Highly recommended .",
    "113": "An almost perfect sequel & by all means a fitting finale too, John Wick: Chapter 4 continues the tradition of the franchise going bigger, better & bolder with every subsequent instalment, and is action filmmaking at its most balletic, ballistic & breathtaking. Featuring some truly spectacular set pieces & stellar action choreography, all the while raising the stakes as the story progresses, this fourth entry is an expertly crafted & ingeniously executed offering that delivers on all fronts.Directed by Chad Stahelski, the story presents death's very emissary embarking on a Sisyphean mission of suicidal fury after the events of the last film and is more dramatically compelling than before. Stahelski continues to find new, creative & audacious ways to make the action stand out and takes ideas & inspirations from several classics of the past. There is a sense of urgency this time around that makes the unfolding events all the more restless and keeps the interest alive at all times.The reprising cast is impressive as before but the new additions manage to make their mark too, with Donnie Yen stealing the show among the latter. Reeves is captivating throughout and plays his role with panache. Bill Skarsgard delivers as a worthy villain. And the upgrades in set design & cinematography are notable enough to stand out. Also, after all the merciless bloodbath that ensues before, the decision to end the journey with a traditional duel is a masterstroke that only makes the finale better.Overall, John Wick: Chapter 4 earns high scores in every aspect and is one of the most pristine & polished examples of blockbuster filmmaking. Making all the genre elements work in absolute harmony to deliver an action extravaganza of the highest order, this immaculately orchestrated dance of death is one of the most rewarding cinematic experiences of the year that effortlessly lives up to its enormous hype and smartly brings the saga of the man, the myth & the legend to a satisfying conclusion. Do svidaniya, Mr. Wick.",
    "114": "My expectations for John Wick: Chapter 4 was high, these films have become some of my favorite action films of all time, and I can say this without giving it a second thought how it met those expectations. The thugs and easy obstacles are nothing new, except for how they too have ballistic suits like our protagonist. But this Chapter begins with a recovered Baba Yaga who's out for blood. Actors and returning characters along with Keanu Reeves as John Wick is Laurence Fishburne as the Bowery King, Ian McShane as Winston Scott, and Lance Reddick (in one of his final roles) as Charon. New roles which I loved was Donnie Yen as Caine: a blind High Table assassin and an old friend of John Wick.Bill Skarsgård as the Marquis Vincent de Gramont: a powerful member of the High Table whose position is challenged by John Wick. Hiroyuki Sanada as Shimazu Koji: the manager of the Osaka Continental Hotel and an old friend of John Wick. It also stars Shamier Anderson, Rina Sawayama and Scott Adkins.The premise goes like this: John Wick uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.Let's dig deeper into the story and what sequences I liked the most, I have a weak spot for samurai movies and the Osaka Continental offers just that. Brilliant choreography for each character, good guys like bad guys. With Hiroyuki Sanada being as brilliant as ever! Also showing off Donnie Yen's retired blind assassin. It's always nice to see a new Continental and this one sure felt special, you notice what friendship John Wick and Shimazu Koji has. The action sequence was great! But my favorite city and action sequences are found in Paris, it has the biggest importance to the story, it brought so many memorable moments. It shows why Keanu Reeves was and is right to lead this franchise. Paris is also the city where Marquis Vincent de Gramont is located and he becomes the highest-ranking member of The High Table during this film. Bill Skarsgård holds one of the strongest performances in the film as the Marquis. Keanu Reeves holds the best though, maybe not the best dramatic performance but certainly overall performance as he does his own stunts alongside everything else, and the stunts are incredible. Donnie Yen was great and possibly even one of the best things of the movie, both his knowledge in martial arts but also his character which I loved. The performance that surprised me was Shamier Anderson as the mysterious bounty hunter, it's a great character that they could do so much with and I can easily say the same for Donnie Yen and Hiroyuki Sanada's characters. One of the final action sequences was all in a one take, except for a quick cut before moving back to the one take. It was shot with a camera above, letting us see everything happening from above and moving with John Wick as he fires inside an abandoned building.Chad Stahelski truly directed an action film that'll be remembered for decades, his direction in both the action and more dramatic scenes are all brilliant. There's so many fight sequences in this film, small like big, all directed and shot brilliantly. The screenplay was done by Shay Hatten and Michael Finch, I don't have any problem with it, it's good and for a Wick film it holds the same quality. The movies aren't about the best writing in Hollywood, it's about what happens on the screen, blood being spilled. Tyler Bates and Joel J. Richard returned to compose the score for the film, after doing so for the previous three films. Like Shay Hatten had done too.I have read various of critics and some people complaining about the length, Chapter 4 has a runtime of 169-minutes. Its long, full of beautiful looking shots that does nothing to the story, only to create atmosphere and suspense where it succeeds. There are scenes that you could easily trim, yes, but I still found the length to be perfect. I want to see the 3 hour 49 minute version just because of how great the film was, but the theatrical version is magnificent. Chapter 4 is all about tying up loose ends, to finally find peace and freedom. It's a long road to that point, Chad uses the film's length for just that, to tell a bigger and deeper story than a simple story. More run time also means for more action sequences!This might be the best film of the four, both action and drama, also most beautiful in regards of the camera work and cinematography. Dan Laustsen truly knows his craft, making each scene absolutely mesmerizing to look at! I loved every second of it, when I saw it at the cinema, a woman (a mother) sat beside the person I was there with and said how brutal it was... She was five minutes in and the first action scene had only just started. Jokes aside, John Wick: Chapter 4 has some of the franchise's best action sequences and Keanu Reeves at his best. Like his role in The Matrix, John \"Baba Yaga\" Wick will be another role he'll be remembered for. This was an incredible film, one of the best I've seen in awhile.",
    "115": "Let's be honest if, by now, you choose to see a \"John Wick\" movie then you know what's coming. Several hours of hyperkinetic, over the top violence with a pounding soundtrack and moody lighting. On this front \"John Wick: Chapter 4\" delivers and then some.There isn't a plot that I can recall but once again our favourite assassin is wrestling with the unseen High Table and the price on his head is increasing faster than post-Covid inflation. So every goon in a suit is out to collect and John has to wade through a tsunami of bodies in order to, well, keep killing people.Clearly there's no logic here as John has no identifiable motive anymore or even an end-goal in mind. Instead he's the main character in a video game and you're watching a Twitch stream of someone talented playing all the way through to the final boss.At one point this characteristic is cemented, in spectacular fashion, when the camera shifts to a top-down view and you get to watch John move from room to room in a bloody spree. It's a fantastic sequence, right down to the spray of blood as henchmen #89 gets shot in the head at close range.So is it a great film? Well yes because \"John Wick: Chapter 4\" plays it straight down the line and sticks religiously to its aesthetic. There are no in-jokes here, in fact there are more grunts than dialog, and the film absolutely believes in itself. On that front it's a right belter.",
    "116": "There are many deaths in this filmic free-for-all. And assassins. Donnie Yen plays a blind martial arts expert, a role he knows all too well since he played an identical character in Rogue One: A Star Wars Story. And that really sets up the debate around whether plagiarism is the sincerest form of flattery, or just a dumb, lazy rip off. There are references aplenty from the sci-fi/kung fu genres, including some of Keanu's own efforts. He knows kung fu-and shows us. It's kung fu'd up the wazoo. I imagine the director, a stunt man himself, simply Scotch taped together one fight scene after the next. FOR THREE HOURS! Three writers are credited with crafting 380 words of dialogue for Mr. Reeves. Okay, I read that Stahelski and Reeves stripped out roughly half the dialogue written for his character in the initial script. Accordingly, I would have stripped the writers of their entire salary. The first instalment featuring this legendary hit-man was just that, a smash hit. However, much like the Matrix sequels John Wick: Chapter 4 just gets on my wick.Incidentally, the movie tagline is Baba Yaga. More appropriate would be jibber-jabber. (193 words, where's my check?)",
    "117": "How could anyone jump off the third floor falls on top of a van and on the floor and still come out unharmed? That was the breaking point of my excuses for this movie! When I saw that I just lost interest in all this nonsense! Not even James Bond could get away with that! Ok maybe he would! But still! Just literally unbelievable and intellectually mocking!And now I feel like the writers of JW4 because I am just filling the required characters for this review with empty words and imaginary scenarios and with no purpose except prolonging the screentime of the audience and wasting as much time as possible from their lives!\"Minimum character limit met\"Final credit rolling haha.",
    "118": "I never read the good reviews in anything. Movies, TV, Videogames... Never... I always read the bad reviews only.When i see many reviews that say \"worst movie ever\" the chances are high that the movie is decent and worth a view. Those people never watch actually bad movies or they would know that there is no one worst movie ever... There is thousands of them...When i see many reviews that say \"I'll never get those 2 hours back\" or \"i wasted 2 hours of my life\" i know that the movie is pretty good and I'm gonna like it. To those people... Just sleep less time some days. Even 5 minutes less a day can get you your wasted hours back in no time...But when i see even just one review that complain about that the fourth movie of a franchise is the worst and the whole franchise sucks and yet they have sit through the whole franchise since they are able to criticize it, then the movie is a masterpiece...\nAnd Chapter 4 is a masterpiece...\nEnjoy if you are an action fan, you deserve this👍👍👍Update: When i see reviews with the expression \"Are people blind\"? The movie is probably an 11/10. Blind people have their other senses very enhanced and know better from people with mediocre levels of all of their sense and are completely ignorant about what subjective means...",
    "119": "Sheez Louise these are getting awful. They know the audience wants to see a conclusion; but like Lucy holding the football, they'll keep yanking it away forever. They're trying so hard to keep upping the level, but the fights are just cliche now. The NPCs all swing so slow, hold their hands out for so long, Ian McShanes new teeth are horrendously white, I'm a huge fan of his but it's just unnatural. Almost like Rudy Giuliani. The Bug eyed dude from the remake of IT is awful as a Frenchman? Belgian? Whatever his accent is supposed to be, it's bad. Donnie Yen's blind swordsman is amusing but still cheesy. Nobody? Who is this dude and why is he even in this movie??? Was there some contract requirement that said \"we must have a dude with a dog in this film\"??? Please just finish the series and stop making more. Oh wait they just announced JW 5 in pre-production.Can I jade my 12 dollars back???The only GOOD part was the throwback to Warriors, and even that just seemed bizarre and completely out of place.",
    "120": "Many enemies attack John but they like to attack him one at a time because they're respectful and wait their turn.The story line does not exist, just shooting. It starts off with John shooting some random Arabs and an important black character just gets randomly killed off.The bullets have no impact on John. Falling off a 5-story building has no impact on him either. Just gets up. But the movie is not called \"Superman.\"The dialogue was written by a 12 year old.It tries to be funny by having a dog bite the testicles off one of the bad guys and then pee on that dead bad guy. Seems to have worked because almost the entire theater burst into laughter.If you're one of dumb guys, go ahead and click \"No\" on the \"Was this review helpful?\"",
    "121": "\"John Wick: Chapter 4\" is one of the most captivating, exciting, eye-popping, hyperkinetic, and beautiful action films ever made. Director Chad Stahelski has done the unthinkable; he has outdone himself in this fourth entry by taking a two hour and forty-nine-minute runtime (the longest in the series) and making it feel an hour shorter. This is a combat magnum opus, a relentless sensory experience, gorgeously hyperviolent, and easily the best in the series.Baba Yaga is, once again, fighting to defeat the High Table while also facing a devilish and powerful new adversary (a disquieting and deviously memorable performance by Bill Skarsgärd as Marquis) in death-defying, blood-spurting, neon-blasting, stunts-to-spare, well-groomed, high-fashion style. Yes, the plot is rather simple, straightforward, and lacking in in-depth character background, but that hasn't been the strength of any of the Wick films anyway.The masterful elements at play in \"Chapter 4\" begin with its colorful, even extravagant, and likeable supporting characters including Laurence Fishburne as the crafty Bowery, Clancy Brown as the cryptic Harbinger, Donnie Yen - electrifying as the blind, yet intuitive Caine - and most terrifically, Shamier Anderson as Tracker - a shady spy-like character that gives an indelible performance that ranges from brutal toughness to vulnerable subjugation.Add heart-pounding sound effects and a pulsating musical score, striking nighttime, dark and gritty noir-inspired cinematography, and masterful fighting choreography that frames Wick in different cities with sumptuous vistas across the globe (the locales are outstanding from Sacré Coeur, to Arc de Triomphe, to the Louvre, to the Eiffel Tower in France to the opening scene in Aqaba, Jordan plus Berlin and Tokyo) and you end up with what feels like the most edgy, revolutionary, and most James Bond-esque entry yet.The elaborate and visceral set designs are \"Chapter 4's\" crowning achievement; lavish and rich with detail, they put Wick in elegant and high-tech rooms, ornate buildings, rousing nightclubs, and most memorably, a long flight of stairs and heavily trafficked streets where gut-wrenching, head-popping fighting sequences ensue. It's a WICKedly wild ride from beginning to end that left me breathless, gasping, and exclaiming \"wow!\" in wonderment.",
    "122": "John Wick: Chapter 4 is an action masterpiece, an emotionally investing, unashamedly pretentious and extremely satisfying final chapter that continues to celebrate stunt work as the art form it absolutely is and deliver franchise high spectacle that really does put the majority of other action films to shame.Keanu Reeves is even more agile than ever and continues to really impress in the action despite being 4 films in. Once again though, it's not just the action he excels at with the sense of finality this time around adding a sombre and contemplative nature to his performance that is beautiful.The supporting cast is insanely stacked, a definite new record for this franchise. Ian McShane and Lawrence Fishburne play to their familiar strengths and really dial them up. Then there's the newcomers, starting with Shamier Anderson who has a really interesting angle to his character that's a lot of fun.Rina Sawayama makes a terrific screen debut and has great chemistry with Hiroyuki Sanada who can do no wrong and his reunion with Reeves is a joy to see. Bill Skarsgård is another memorable villain for this franchise as a character who dresses like a gentleman but acts like the complete opposite.Scott Adkins plays against type in hilarious fashion and then there's Donnie Yen. Obviously he's perfect in the action scenes and just so cool but on top that he's one of the best characters because his conflict with John isn't as black and white as previous antagonists, making it all the more interesting.Chad Stahelski's direction is phenomenal, the action scenes are still super clean and impeccably choreographed. There's a nightclub scene that actually improves over the original, a fight in oncoming traffic that's jaw droppingly good and a one take that is one of the best of all time.The film also offers an excellent reminder that Stahelski is an amazing visual stylist as well. With Dan Laustsen's cinematography he creates a beautifully film that makes each location visually unique and the lighting in particular is just stunning throughout.The pacing is so good, gaining momentum early on and never letting up. The music by Tyler Bates and Joel J. Richard is once again incredible, bringing back all the greatest hits without solely relying on them and actually creating the most unique score of the four with plenty of new pieces.",
    "123": "John Wick: Chapter 4 is the latest installment in the popular action franchise starring Keanu Reeves as the titular assassin. Directed by Chad Stahelski, who helmed all the previous films, this sequel continues the story of John Wick's quest for freedom from The High Table, a mysterious organization that rules over the underworld. Along the way, he faces new enemies and allies, as well as old friends and foes.The movie is a feast for action fans, as it showcases some of the most impressive and inventive fight scenes ever put on screen. From gunfights to knife fights, from car chases to horse chases, from Paris to Tokyo, John Wick: Chapter 4 never lets up on the adrenaline and excitement. Keanu Reeves once again proves his dedication and skill as an action star, performing most of his own stunts and delivering his trademark deadpan humor.The movie also deepens its mythology, exploring more aspects of The High Table's history and hierarchy. We learn more about John Wick's past and his connection to other characters in this world. We also meet new faces that add more flavor and diversity to the franchise. Donnie Yen plays Caine, a fellow assassin who shares a bond with John Wick. Bill Skarsgård plays Marquis, a mysterious figure who has ties to The High Table. Hiroyuki Sanada plays Shimazu, a ruthless leader of a Japanese crime syndicate.The movie is not without its flaws, however. At nearly three hours long, it feels bloated and overstuffed at times. Some scenes drag on for too long or feel unnecessary. Some plot points are confusing or underdeveloped. Some characters are underused or wasted. The movie also relies heavily on fan service and references to previous films, which may alienate newcomers or casual viewers.Overall, John Wick: Chapter 4 is a satisfying conclusion (or is it?) to one of the best action franchises of recent years. It delivers more of what fans love about this series: stunning action sequences, cool visuals, charismatic performances, and intriguing lore. It also leaves room for more potential stories in this universe.",
    "124": "Far better than I was expecting. Not that I thought it was going to be a bad movie in the slightest, but I was not expecting to be so bedazzled by it. John Wick has stepped up to the plate and hit that man meal out of the park every single time. Keanu Reeves and filmmaker Chad Stahelski have done everything in their power to keep the action constant.The odd part about that is that this movie did not have the best action sequences out of all the movies, but it did have the most in depth story. That itself is odd considering that John Wick movies are not about story. That is why this whole thing started over the fact that the son of some crime boss killed the dog his late wife gave him. It's a humorous plot that commits to the Franchise's statie of action film plots, but this movie decides to take itself a little more serious than all the others, really focusing on how far Wick has gone down the rabbit hole snice the first film. Surprising but not bad.Then you have the action, done by some of the best in the world. John Wick 4 feels like one of those episodes of the Mandalorian that's not about the Mandalorian at all. Afterall when you have Donnie Yen in the movie you want to make sure he's doing as many cool action sequences as possible, which means that there were a few times in this movie in which John disappears to allow others to shine. Great as far as the action.Also great, Scott Adkins in a fat suit. Now I want them to do a spin off movie with Scott Adkins in that fat suit.I would keep going but I do not want to be as long as the movie was. Do not worry you don't even notice. The film is too hard hitting for that.",
    "125": "As of now, this is the best movie of 2023; that being said, it still has it's issues. I'll start by saying the action sequences (all 9,000 of them) are breathtakingly choreographed. John Wick's trademarked 'GunFu' is on full display in Chapter 4 (for better or worse). This chapter easily has the highest body count out of the series, but you can't rely on bodies and bullets as your main focal point, especially if it's supposedly the last chapter (I highly doubt it is). Wick is weighed down by plot armor so thick it deflects literally everything, including the viewer's belief that Mr. Wick will ever be in any danger. Hit by 10 cars? Tis but a scratch!My main issue with Chapter 4 is that the plot is very thin and it's stretched out over 3 hours. This chapter is very 'Beginning. Middle. End'. The beginning and end are 5 minutes a piece, while the middle is two and a half hours of John effortlessly walking through goons (which is great, until it's not). I love me some Wick slaughtering goons, but when 95% of the movie is gun fire, you begin to forget what the plot even is, what the movie's even about, which is not good. This movie could've easily been cut down to 2 hours if they edited the fight scenes to a reasonable time, so I hope you don't like plot with your action.Another gripe I had is the fact that John Wick had like maybe 10 lines of dialogue? The guy barely spoke a word throughout the entirety of the movie, and when he did speak, 99% of the time it was him going \"Yeah...\" (which is great, until it's not). Maybe use Keanu/Wick as a vehicle for the plot instead of having him be a mute protagonist of an FPS video game? He's the title character for God sake! In Chapters 1 and 2, Wick showed a lot of emotion and vulnerability through dialogue and acting (at least more than this chapter) to express himself, but in this he is pretty much the Doomslayer. Also, is it just me or was Keanu's acting extra bad in this one? The line delivery sometimes was just... oof, even for Keanu standards.My favorite part of the movie is a top-down one-take scene near the end where Wick is blasting through goons with incendiary ammo.Overall, the movie is a good time and if you're a Wick fan, then you won't be disappointed. I'd say this is a step up from Chapter 3, but not as good as 1 and 2.7.2/10.",
    "126": "As thrilling and relentless as any action movie before it, John Wick: Chapter 4 is an adrenaline injection with Oscar worthy stunt work, assured direction and Keanu Reeves as magnetic as ever. The best Chapter yet...John Wick: Chapter 4 feels like a film where Director Chad Stahelski understood that he finally had the freedom and the budget to do, literally, anything he wanted on the screen-and might never again-so by God, he was going to do it.With characters able to dodge bullets left, right and centre, the film is a homage to the classic martial-arts genre with a sprinkling of old Hollywood Westerns where protagonists never seem to run out of ammunition or ways to stay alive.The movie also deepens its mythology, exploring more aspects of The High Table's history and hierarchy. We learn more about John Wick's past and his connection to other characters in this world. We also meet new faces that add more flavor and diversity to the franchise. Donnie Yen plays Caine, a fellow assassin who shares a bond with John Wick. Bill Skarsgård plays Marquis, a mysterious figure who has ties to The High Table. Hiroyuki Sanada plays Shimazu, a ruthless leader of a Japanese crime syndicate.Donnie Yen brings not only his skills as one of the finest martial arts movie stars in the world, but lends his presence as a charismatic and riveting figure. He plays the role of Caine with complexity and humanity that is a terrific mirror to Reeves' Wick; his friend and adversary by circumstance. This was a fantastic choice to take the Wick series to a new level.Overall, John Wick: Chapter 4 is a satisfying conclusion (or is it?) to one of the best action franchises of recent years. It delivers more of what fans love about this series: stunning action sequences, cool visuals, charismatic performances, and intriguing lore. It also leaves room for more potential stories in this universe.",
    "127": "I normally don't write reviews but this movie just pushed the boundaries of absurdity so far that I just can't say nothing!We get it, John Wick never dies, OK!But at least put a tiny bit of reason into the movie!! He jumps out of the window from the third floor, lands on car, THE CAR'S ROOF GETS SMASHED!!!, but he just stands up and continues fighting???And some scenes are so ridiculous that the whole cinema was laughing. Like the scene near the ending where he is literally just rolling himself down the staircase for no reason! You can literally see him push his arms to the ground to roll one more stair flight down!Even if you don't think about what you're watching, the action scenes get boring too quickly! Repetitive style of fighting, same movements from Chapter 1, and then covering themselves from bullets with just a sleeve (???) And then penetrating that sleeve with a knife!I felt like Keanu Reeves was just telling me \"Give me your money and don't think about what I'm showing you, cuz I like the money!\"Seriously! The movie had nothing new to show! Same old story... same old fighting... literally nothing new! We get it, you make good fortune out of this! But at least have SOMETHING NEW when you're taking your audience's bucks.... for example, the three other chapters had at least some good dialogs, but this one.... maybe it's me, but Keanu's performance is just going down in these kind of movies....",
    "128": "JW4 is exceptional!! If you're gunna see anything this wkd, see John Wick Chapter 4.It's a nonstop, adrenaline-fueled rollercoaster ride full of tension, action and suspense. And you don't have to be up to speed with the other JW films, necessarily. The 2nd Act is dedicated to JW enthusiasts, but it's not too difficult to follow.There's also an unrecognizable moviestar in hair & makeup (and a fat suit) that I clocked (I won't spoil it--yet). He is hilarious in the role -- very much like Les Grossman (Tom Cruise) in \"Tropic Thunder.\"The 3rd Act of JW4 is worth the price of admission. This is, by far, the best movie of the year (so far) and the last hour is one of the best finales of any action film in recent memory.Shoutout to the production crew. This film doesn't work without the crew. The stunt coordinators, the sound mixers/designers, safety staff, grips, hair & makeup, choreographers, costumers and the animal trainers. Phenomenal job across the board!!!!!Treat yourself to JW4 this wkd. Stay for the post-credit scene, if you can.RIP Lance Reddick--",
    "129": "I loved the first John Wick movie and while the second one had problems, I like how they expanded the lore of the assassin's guild he was part of. Then in John Wick 3 the lore, story and characters all started to be massively overshadowed by the action. And then we get John Wick 4, the video game.Or should I say John Wick the super hero movie because he might as well be one because he is so unkillable. Anyways, every scene has a perfunctory bit of acting just to set the stage for massively overlong and frankly ridiculous action scenes. John Wick is supposed to be good at fighting but no person is so good that they can take down masses of near-peer skilled enemies. By the end of the movie I was looking at the clock when the action scenes were happening.And don't get me started on the massively stupid trope of the blind assassin that is in this movie. Just stop it already. The guy hunting Wick does things over and over again that are simply impossible. It was just ridiculous that we are supposed to believe he would last more than a few seconds against a skilled, assassin trained opponent.Overall, the movie is a steep disappointment. It was stylishly filmed and is a treat visually, the acting is not bad, and the fights are good to a point but then they go on and on and on so you lose interest.This should be the last John Wick film. And for anyone who is thinking about watching the series for the first time, just stop after the first. That's all you need. The rest is downhill.",
    "130": "John Wick Chapter 4 comes with a bang! John wants to clear his name and be done with the table but the route of getting there this time is much harder a task than we have seen before.There are so many highlights of the movie, the action was all superb ! I already after first watch have a favourite which is hard to pick as there are some AMAZING sequences in the movie. I won't say the location because I want to give nothing away but I will say in Paris with a lot of traffic !This movie delves into the characters way more than before, we get really good time with the side characters, usually a movie like this would give them 10-15 minutes screen time and kill them while this isn't the case, in the time sense. We get motive, we get their struggle and really good interactions with John. My favourite side characters were Nobody, Shimazu, and Caine.John takes some hits, serious fall damage but these are the movies not real life hahaha. It's a spectacle on a grand scale.Very small nitpicks, the fights are all superb but I would like some more intimate fights for eg JW1, when they entered his house it felt more threatening, and that's it hahaha it's personal preference as a nitpick which is pretty darn good.JW4 is definitely the best of the sequels and up there with the first in my opinion! 8.5/10.",
    "131": "\"You'll run out of bullets before they run out of heads.\" Winston (Ian McShane with ascot)For John Wick: Chapter IV, the heads keep rolling, mostly decommissioned by the titular assassin's preternaturally accurate gun, and partly because it seems everyone now wears a bulletproof jacket often used as a shield. Hence the efficiency and necessity of one or two shots to the cranium. And very little blood, which I don't miss at all, given that, like sex, I don't need more than a glance to get it.As with most cinema, even impossibly successful runs like this thriller juggernaut, it's about storytelling even when it's about beautifully-choreographed fight sequences that mix martial arts with high-end weaponry that includes a \"dragon's breath shotgun\"! The story is as old as movies themselves: global corporate hoodlums, The Table, are after assassin John Wick, a wicked former employee. The rep is the smarmy Marguis (Bill Skarsgard), decked out in three-piece suits, the brighter the better, and cravats louder than Winston's (thank you costume designer Paco Delgado).Wait till you see the wild-ass fight on a lengthy set of Parisian stairs or sit across from Killa (Scott Adkins, a martial arts expert), an almost sumo-sized card dealer. His silver teeth take us back to a memorable menace in the James Bond canon.It's all very stylish, no doubt because of returning director Chad Stahelski's penchant for colorful neo-noir and writers Shay Hatten and Michael Finch's ability to take the fantasy into new/old motifs such as a duel that Clint Eastwood would approve. They also supply lines like \"Second chances are the refuge of men who fail\" in a film where memorable dialogue is not what the audience expected.Who would expect set pieces such as combat in the Louvre and around the Arc de Triumph? Or better, who has a budget to afford those glories? Well, the producer of one of the most lucrative crime thriller series in cinema history that takes us to Germany, Japan, and France with ease.I can't predict if Keanu Reeves will return, he with a fortune now probably greater than Croesus' (I hear Reeves is generous with his wealth), because one of the great lines from John's Japanese friend, Shimazu ( Hiroyuki Sanada), in this murderous ballet is \"Have you given any thought to how this ends?\"I have, and I hope it returns if it has more of the absurd style and beautiful ballet peppered with dialogue as sharp as the swords that dispatch very sharp baddies. John Wick: Chapter IV is as good as the best action films we will see all summer, and that bountiful crop has yet to start. Stay tuned.",
    "132": "I'll keep it short and simple. This movie franchise is literally Tugg Speedmans Scorcher with Tuggs trailers in the beginning of tropic thunder perfectly desicribing the plot of these 4 movies. Bad guy kills 100000 assassins and survives. Now he has to kill 100000 more guys to get to the bottom of this whole thing. Then some new villains try to get him and he must kill 100000 more guys. Then in 2023, he's BACK to kill more guys. And let's not fool ourselves, there will be a 5th movie because why not. People keep drooling all over themselves because \"action\". This movie currently sits at a 8.0 on imdb, 0.2 below a classic action flick like Die Hard. That is actually ridiculous.At this point these movies are getting so silly I'm actually embarrassed to go watch another. I brought my girlfriend to the premiere of this movie and felt like a idiot the whole drive back because these movies have rid themselves of ANY meaningful dialogue, the script is actually objectively trash and the acting just isn't there. I was EMBARRASSED on the drive home from cinema. If this was any other movie it would get trashed, but because the first one was a pretty good revenge flick and because Reeves is so lovable this franchise gets a pass. I don't get how people parade this movie like some kind of awesome masterpiece when it's so obvious what a cash grab this is just riding on the back of the first movie. Do better.",
    "133": "John Wick: Chapter 4 joins Mad Max: Fury Road in being the fourth film in an action franchise that is also hands-down the best film in its franchise.The pacing issues present in the last two movies are nowhere to be seen here; remarkable, given the behemoth 169-minute runtime. It absolutely earns that runtime with action sequences that never once feel repetitive and a plot that is always moving.Every single gloriously carnage-filled set piece introduces unique geography, weaponry, and style to the mix so that every scene is more shocking and thrilling than the last. I can't remember the last time I was so consistently entertained for nearly three straight hours.This time around there are also several new characters introduced, and they're all given much more personality and narrative purpose than anything we've seen before in these films. For the first time in four movies, I actually got invested in the story on multiple levels rather than just being thoroughly entertained by the action.But it must also be acknowledged that this movie is absolutely insane, and is not meant to be taken seriously. John Wick is an invincible man, frequently surviving things no man can possibly survive. If implausibility bothers you, this will be your nightmare.The story does try to dive deeper into the theme of \"actions have consequences, and nobody is immune to consequences\" that was touched upon in the previous movies. I commend them for trying, but it's still done in a far too surface-level way to be impactful. The writers really glossed over some pretty heavy plot points whose consequences should have been explored in greater detail, and because of this, I didn't feel anything I think they wanted me to feel when the film ended.But this is a minor complaint for a movie like this. Chapter 4 is the display of a master action filmmaker who continues to dare to go bigger and bolder, and I can't wait to see what kind of spectacle he presents us with next.",
    "134": "\"John Wick: Chapter 4\" is the fourth film in the \"John Wick\" franchise. Once again directed by Chad Stahleski and starring Keanu Reeves in the title role, it stands out as not only the best film in the series but also as one of the very best action films made in recent decades.Shortly after the events of the third film, John Wick (Keanu Reeves) is in the planning stages of taking down the powerful High Table once and for all. After executing the Elder (George Georgiou), a man ranked above the High Table, John travels to Osaka to seek refuge in their local Continental Hotel. While there, John learns from the manager that his old blind friend Caine (Donnie Yen) and a bounty hunter known only as \"Mr. Nobody\" (Shamier Anderson) have each been ordered to assassinate him by a High Table member named Marquis Vincent de Gramont (Bill Skarsgård). As he fights off various other assassins, John eventually meets up with New York's Continental manager Winston Scott (Ian McShane), who may hold the key to disbanding the High Table permanently.Almost a decade since its debut, the \"John Wick\" series has cemented itself as one of the most popular action film franchises to ever grace movie theatres. The films are known for their highly stylised action scenes, memorable supporting characters, and intriguing world building elements that always make audiences come back for more. At the centre of it all is of course Keanu Reeves, who has helped the titular character become one of the most recognisable action heroes of all time. Now four films in, you would expect the series to show signs of losing some steam but \"John Wick: Chapter 4\" proves all doubters wrong with an exhilarating action-packed experience that leaves other similar films in the dust.Now that he's \"excommunicado\", the stakes are at an all time high as we see John facing off against even more dangerous adversaries than before. Anybody who's watched these films since the beginning will know that John's worldwide infamy makes it increasingly difficult for him to find allies willing to assist, especially considering how the bounty on his head keeps rising with every powerful enemy he makes. Because of that, there's more tension this time around than in previous entries, allowing less room for error at the risk of sudden death. Most of the time, John relies solely on his own wit and ingenuity to take out his enemies, whether it's with his simple handgun or with any part of the surrounding environment. John is a resourceful assassin, not blinding shooting at any moving target but instead calculating the right time and technique to take out a particular foe, no matter how minor. It is this trait that separates a character like John Wick from the rest of the typical action heroes, as contemplating his next move is what has made him so interesting to watch over the past four films.Something else I've admired about \"John Wick\" series is the attention-to-detail that goes into virtually every scene. Regardless of where things are taking place, there's so much visual beauty and creativity on display in each shot. This film is certainly no exception as it contains some truly breathtaking cinematography that places the audience right at the forefront of the action. If these scenes don't rejuvenate you, then you probably have no pulse. From the brightly coloured neon lights of Osaka to the raving nightlife of Berlin, every location oozes so much personality that they almost become characters in their own right. It is in these places that some of the best choreographed, best edited, and best filmed fight scenes in recent memory are able to firmly establish this fourth entry as one of the most exciting action films to ever be released in theatres. Yet despite all the frenetic shoot-outs and hand-to-hand combat, they are all handled with such careful precision that it is still easy to follow everything happening without losing focus of who is fighting who. And to top it all off, at no point is shaky cam ever used during the action scenes, which makes these already entertaining segments even better.For someone approaching his 60s, Keanu Reeves shows absolutely no signs of slowing down in the iconic lead role. Every shot that he fires, every punch that he throws, and every sword that he swings proves that Reeves can still hold his own alongside any younger cast members. There were even times where I couldn't help but notice some of the other supporting cast struggling to keep up with Reeves, which helped make him stand out quite considerably. Although the character of John Wick has never really had a huge amount of depth behind him, he definitely has a level of intrigue, something I think Reeves is able to play into perfectly. He is man of few words, whose widespread notoriety and respect from other assassins combined with his compassion for the defenseless makes him an endearing hero for the audience to cheer for. After all, it's easy to care about somebody who has risked everything to avenge the death of his dog.Additionally, I don't think the film would have worked half as well without John's two worthy opponents - Donnie Yen as Caine and Shamier Anderson as Mr. Nobody. Yen's depiction of Caine draws comparisons to that of Marvel's Daredevil, in that he is blind but a highly skilled martial artist relying on his other senses to defeat enemies. Caine's proficiency in combat is so unparalleled that each time I saw him fight I kept forgetting about his blindness since his reflexes are so unusually fast. However, what I liked most was the mutual respect between him and John, being that they were once close friends in the past. On the other hand, Mr. Nobody is completely different as he has no personal connection to John. He is only doing this job for the money but along the way he learns that John is a force to be reckoned with. It is interesting to watch how Mr. Nobody learns more about John as the film progresses, and Anderson successfully brings out all the necessary layers of curiosity surrounding his character.Even after four movies, the \"John Wick\" series is still as impactful as it was when it first started, with each film being better than the last. What began as a relatively straightforward story of a man seeking revenge against those who killed his dog is now a multi-layered, action-packed, and beautifully shot set of films that exists within its own meticulously crafted world. This fourth film has not only helped redefine the series as a whole but also what action movies are capable of in general. Personally, I would love to see another \"John Wick\" film but according to director Chad Stahleski, this will be the last one for a while with the spin-off film \"Ballerina\" and miniseries \"The Continental\" coming soon to fill the void in the meantime. Either way, it looks like this series is here to stay.I rate it a solid 9/10.",
    "135": "I really liked this film. For the first 90 minutes or so. Then, as the body count exceeded what I thought to be roughly 15 thousand souls, I started to feel like I was missing out on life. The feeling grew exponentially, with every batch of 5 thousand casualties.When John Wick began his ascent to the top of Sacré Coeur, where he faced a hundred new villains (probably the planet's last surviving human male specimens), I considered leaving. But it was Mr. Nobody yelling his \"balls\" cormmand (whereupon his dog jumps at a man's crotch, and then urinates over his dead body) that achieved the feat.On my way home, I reminisced about the good old days, when an action-loaded, far-fetched but highly entertaining movie could be squeezed into 87 minutes (e.g. Commando, 1985; btw. 51% of the running time of John Wick: Chapter 4).Anyway, ChatGPT informs me that \"There is no clear evidence to suggest that watching stupid films or any other form of entertainment can significantly lower a person's IQ,\" so it's not all bad. But I lost good lunch money and 3 hours of my life, and there's no refund on these.",
    "136": "Very very bad story, chaotic motives\nOutplayed protagonist by the villainsVery few fresh action elements and the old ones are really robotic and under choreographed.... boring.I really don't understand why is rated above 7.4For me this move was a bit of parody as well, but not in the good way :) Really don't understand why it is needed in this way after the first 3 movieIf you cut the first 30 minutes and the last2 this could be the worst movie in the franchise but still ok.Watching the first action scenes with the so robotic and boring actions... time to retire retire the franchise.",
    "137": "The stunt-work is amazing, let's start with that.Editing is quite nice. So is photography. Acting is not much needed in the movie. At least, acting is not needed as much as stunts. I mean, the action scenes are - how can I put this delicately - impossible or borderline fantasy level unless the whole film is in The Matrix, and also the third film, of course.The character development does not exist, physics does not defy John Wick ever. The opposite cannot be said, though.Even if you turn off your brain and watch, most of it does not make sense, at all.However, if you are into mindless, illogical action scenes, John Wick is the film for you.One more thing, in a gun fight, if you lose to a guy who cannot see, in brightly lit environments, maybe you should give up your career as an assassin. If not, you deserve to get killed in \"action\". One intriguing character was Mr. Nobody, unfortunately, though, the writers bestowed upon him the part of Martha (Batman vs Superman) in this movie.",
    "138": "Ridiculous, ultra violent and nearly 3 hours long 'John Wick: 4' is pure escapism at its finest. No one goes to see a 'John Wick' movie for anything remotely close to realistic fights or gun battles- it's about the body count, hand to hand combat and just how far the director will take things as John absorbs so much abuse yet hardly comes away with a scratch!I usually avoid movies like this however will admit it took my mind off the daily crap of life. This one is much better than the last one- Halle Berry's character was more annoying to me than a female killing machine complement to Keanu Reeves' character.There are scenes in Paris, New York and Berlin - topnotch cinematography that surpasses the other films. And the fight scenes are well scripted- kudos to the work Reaves and the stunt people put in to make them outrageously entertaining!Is this the last film in the series?Maybe... However if this brings in a ton of money rest assured there will be another one.",
    "139": "Phew. I'm exhausted just thinking about this one.I very much enjoyed the previous three films, although admittedly by the third film the fights just didn't have that same impact and overall it was growing tedious, but I tuned in for this one cause my man Keanu deserves it.Sadly, the man gave it his all, but for the wrong movie. The first few films, the fight scenes felt fresh and new, if not quite reaching the levels of mastery displayed in the stupendous film THE RAID (which I feel this franchise owes a great deal of credit to) but by the fourth go around it all feels stale. And not to knock my man Keanu, but he looks tired. The acrobatics just didn't look fluid this time. Don't even get me started on the seemingly endless fight sequence in Japan. Wow - showed flashes of brilliance but when it lasts thirty minutes?? It was almost comical how interminable it felt.I'll give points for the continued showing of imagination fleshing out this world (although we all have to agree, the rules and lore are so confusing at this point that one can barely keep track of what's going on) as well as the wonderfully executed scene at the Arch de Triumph but the rest of this film just felt like a chore. And wow - could we have cut that video game baddie scene with the big fat card player? So lousy. Also - miscasting with the usually on point Skarsgard.Couldn't wait for it to be over, or for Keanu to put me out of my misery.",
    "140": "A movie completely lacking of a storyline yet with a play time of 2h 45m.The main character is shot hundreds of times at close range and yes we know he is wearing a cevlar suit, so do his enemies... and nobody thinks to aim for the head ?? And his enemies are wearing body armor yet are all killed with a single shot\nmr Wick is hit by speeding cars at least 6 times in 20 minutes, and unless i am mistaken cevlar doesn't protect against broken bones yet he gets up and walks away every time... even after falling from a 3rd story window onto a parked car and onto the street he gets up and walks away.And last but not least he falls down 220 stairs and still gets up like nothing happened and climbs those stairs againCome on! At least try to make it a bit credible\nA 5.5 at best.",
    "141": "I love JW 1-3. Awesome fight scenes, excellent cinematography, interesting characters, great stories.This movie is everything I dislike about modern sequels. \"Bigger\" and \"more, more, more\" does not equal better.The kevlar suits deflecting bullets is used WAY too much. Its mind numbing to watch Wick and others deflect bullets over and over. Everyone fights with pistols with the exception of maybe 5 bad guys who use an automatic rifle or shotgun then get disarmed, Wick rolls on the ground and does the same type of grab/kill move over and over. I'm fine with CGI blood, but when it doesn't show on blades/clothing/walls/floors it feels cheap. Some of it literally fades out in the air like exhaling in cold weather.Then there's the plot. John can break the rules, but everyone else seemingly is bound by them. John can also find loophole after loophole within these rules and bend things his way when the plot needs it to move forward. John has \"friends\" but then they're enemies, oh wait now they're friends again.John can also get hit by multiple cars, fall 30 ft to a concrete column, fall another 30 ft to concrete, jump from a 4 story building and land on a car and be fine. Not to mention fight dozens and dozens of bad guys without being tired or hit once. Is this a JW or a Marvel movie?Then the final battle...man, it's REALLY disappointing. Then there's an after credits scene, and after watching it I was like, \"who cares????\".The one and only thing I liked about this movie was a scene toward the end where John is in a building shooting dudes with a shotgun but the camera is in overhead view like Hotline Miami. It only last about 2 minutes though. So a really cool 2 minute scene in an almost 3 hour mess...(JW voice, \"yeah\").There's talks of a JW5 and I really hope its the final chapter and remedies all the nonsense from this movie.",
    "142": "The first John Wick was a masterpiece. They went down from there. Each one less than the last but still providing some Interesting plots and action.Now we have arrived at John Wick 4. Nothing is as good as the previous movies. The martial art action is far more Tae Kwon Do-ish than Ju-jutsu. Spinning kicks to the face? Come on. This is suppose to be somewhat realistic. The \"Gun-Fu\" is now boring and is so over done. The action is a pale imitation of the previous movies.The plot is ridiculous...without going into particulars it's just so silly.And although Reeves says about 15 words in 3 hours, his acting is so bad, it's hard to hear those 15 words.I realize this is all from the comic. But only a 12 year old would like this movie.",
    "143": "John Wick first movie was an authentic masterpiece. Action was pretty well executed, even credible, thanks to Mr Keanu Reeves work and an interesting script and great choreographies. So consequently, I was pretty excited about the 4th statement. Same director, Keanu, and one of my favorite martial arts actors: Mr Donnie Yen (If you don't know who is him I recommend to watch IP man movies), simply amazing.Anyway, what can go wrong with a great talented cast and a great director?... Almost everything.First, the action scenes are extremely long and unreal, even sometimes boring because the repetition of them. You know nobody can't kill John, from the beginning because of his new Marvel's anti bullet suit... Really?Second, the movie itself looks like a videogame or a superheroes movie. It has lost it's soul, any realistic or human scene. A shame. Watch the original again to know what I am talking about. To add, the script is inexistent. The most predictable one from the Saga.Last, it's great to include animals but sometimes it's embarrassing to watch several ultra unreal situations. I really love animals but stop making them superheroes, (watched Sisu too this week).So, overall, is it a bad movie? Not it's not. It's the just the John Weak's of the saga. Best again are the filmography, music and direction. Beautiful but empty.",
    "144": "8.2 current rating, not even close, this is becoming ridiculous. Keanu is old and the fighting scenes are slow motion, very grandpa like.The blind assassin chasing Keanu sees better than someone with 20/20 vision, the 1m distance gun fights and blocks are out of a fairytale.The main audience for this type of movie are the same that pay to watch the Fast and Furious franchise.This franchise needs to hire a younger actor, make the fight scenes a little more realistic and stop copying Power Rangers.Do not waste time watching this movie if you want anything close to realism, watch this if you are bored and want to see kids creating fight scenes with multi million budgets.",
    "145": "The first John Wick was terrific. A real shot in the arm for the action film. Then the second and third films were pretty much repeats, but with each iteration the action becomes more dull, more tedious.This is more of the same; like a video game from the 1990s with each part of the film leading to a bigger 'boss' to defeat. But with none of the fun of a video game because you aren't playing, you're watching. And the outcome is pretty much obvious from the outset.The action scenes that were the highlight of the first film, have become the bits to fast forward as they are so repetitive. The only interest is how the story progresses. And that is a fatal mistake as the story is thin at best.Please just stop now.",
    "146": "More talk of High Tables blah, blah, blah let's get on with the action!There is plenty of that in \"John Wick: Chapter 4\".This was only meant to be a trilogy, but who can argue a 4th chapter when your franchise is a license to print money?Keanu Reeves is back as John Wick of course and even shares what eulogy he'd like on his tombstone when and if that day comes.Also accompanying him is Ian McShane as \"Winston\" The Manger of the Continental Hotel. That sliver in New York.Its concierge is still Lance Reddick as \"Charon\".The wonderful actor and voice actor who died recently at age 60, which makes his appearance even sadder.The villain of this instalment is one of modern cinemas finest, Bill Skarsgard as \"Marquis\".If you loved him as \"Pennywise\" in \"IT\" just wait to see if the balloons all float down here too in Wickland.Hiroyuki Sanada is a fine actor who heads up the Osaka Hotel in Japan as \"Shimazu\" where some of the best action takes place.Plus of course Lawrence Fishburne as the \"Bowery King\" and tailor to Johnathon...especially the 42 regular Kevlar suit.Donnie Yen is back as \"Caine\".Proving even a blind man can tell when he's walking in the Sun or shooting bad guys using door bells.Shamier Anderson is \"The Tracker\" or \"Mr Nobody\" who with the help of his faithful killer dog takes care of business as a gun for hire.Clancy Brown with his marvellous bass/baritone voice is \"The Harbinger\" of mostly bad news.One unbelievable death defying fight scene after another plays out during the longest \"John Wick\" chapter ever at 2hrs 49 minutes...especially considering this movie was designed to be seen on IMAX screens where times should be much shorter.Watch out for: The Arc de Triomphe car chase battle scene and the 200 plus stairs fight.The sound engineering is first class with a great soundtrack.You simply have to throw logic out the door to fully comprehend what's happening on the big screen and just enjoy the ride.It's a thriller and possibly one of the best in this saga that started in 2014.Maybe \"John Wicks\" farewell tour is finally coming to an end.Keanu at 59 is still being excellent to his mates and proving deadly to his enemies, but even Wick can't kill everyone.",
    "147": "Other John Wick's films are acceptable, it needs some effort to be a believable character but still they are good and entertaining action movies, but... here comes the but.... John Wick 4 is totally non-sense, just a few things to expect:\n1. JW suit appears to be a tank armor, if you forget any physics law and has no idea what a gun is, ok, otherwise even Rambo movies are more realistic.2. The Table has all the best assassins in the world and a blind guy is able to kill everyone without being shot. Seriously?3. Every enemy when hit once by a car dies, except for JW which is hit by I don't know, more than 20 cars and keep walking normally... hey, what? \"God-mode on\"\n4. Hundreds of people shoot JW but he is not hit even once! Not in the head, not in the hand which he uses to hold the suit, not anywhere...\n5. When shots are being taken, the bullets make metal noise when hitting the suit... so, is the suit made of metal? If that was true, it would have no malleability, he would walk like Robocop.I found it to be a really bad movie because it became too unrealistic. If you don't mind about reality and just wanna see someone in a suit shooting tons of people, you will probably like it.",
    "148": "I was rooting for the dog to get a treat. It deserved one because it was \"well\" \"trained\".Besides the \"well\" \"trained\" dog. This movie was a bore.This review was made in the month of April the 14th in the year 2023. In century 21st.What was this movie about?: Honestly I can't remember what the last 3 were about. I know I enjoyed them.This one was about people being tortured by the dog.John Wick plays fugitive but with many gun battles.The story and the production overview: It was boring. The only deeming quality was the Asian Daredevil. Wick got whoop throughout the movie.The Kraven the hunter character was one of those mixed unsure characters. He behaves one way then the other.I hated his dog. Kraven the Hunter was a dognutter in this.The dog being unphased after slamming into a vehicle was hash.The pitbull at the end was unnecessary to have in the movie. The movie was more about dogs than having a good movie.Genre: Fightin/shooting/secret society\nSoundtrack: mix it was fine.Duration: 2 long hour of enduring a worthless mutt.UnHighlight: the dog. Very cringe.Highlight: Asian DaredevilWhat can be learned?: well watching serious movie was a good change from the comedic MCU films.Seems like serious movies are on the edge of extinction.Verdict: I was bored and wanted to sleep.",
    "149": "The latest edition of John Wick follows the same disappointing footsteps of Chapter 3. The first two John Wick movies were the best because they were more grounded and realistic. Their plot even though it was simple and straightforward it made way more sense than the latest two movies. Having also better writing, being more focused and having better villains helped them quite a lot. Also the fight scenes were far better than this movieAs we see in Chapter 4 the John Wick franchise follows the same path the Fast and Furious movies took. The first movies were the best for obvious reasons as i mentioned above and the more deep they expanded their universe and characters the more dumb the movies became. In this movie we have Daredevil fighting enemies without breaking a sweat and John seems to have complete invulnerability like he is Superman. There isn't any tension, or a sense of thrill or dread and fear in any of the fight scenes they show. The fight scenes in the first two chapters were way better because John/Keanu reacted faster so age does play an important role and most importantly they were directed better being more grounded and realistic. Being smaller scale helped them shine more, and in this one being having big scale set pieces wasn't the best choice. Moreover the villains in this movie they are straight from a fan-fiction cartoon acting incredible dumb, having the worst lines possible that it becomes not fun to watch at all. And don't make me laugh, i cringed so much with the dog and the guy who chases John especially in his last couple of scenes.I generally don't recommend this movie at all and if you are a truly fan of the action genre that respects both the writing and the choreography and fight scenes of these movies i don't recommend this one at all. At least this movie had great cinematography so that's a positive. But in all other aspects from writing, directing and pacing, it did such a bad job."
}