{
    "0": "Well, I finally broke down and went to see it.  I was hesitant after reading all the pans here.  Egad!   It was a great movie! You can't compare it to the \"original\" any more  than you can compare \"Scrooge\" to the eternal Dickens classic.  It has a life of its own.  Jim Carrey was amazing.   How he can deliver so many feelings and emotions behind 10 pounds of latex is fantastic.  Some of his scenes (obviously impromptu) were so funny I nearly wet myself.  The sets were great and not nearly as over-blown as I had expected.  As for the  \"prequel\" portion, well, it was only so-so. The best part of the whole show is when they sing the \"Ah hoo torres\" song at the end which has ALWAYS been my most favorite Christmas song ever.I recommend the movie highly to kids and adults.   As for the negative comments on imdb.com I gotta say...\"get over it, ya big bunch of grinches!!!!!\"",
    "1": "This movie was never intended to win an Oscar, but for what it is, this movie is an absolute Christmas classic. I was a kid when I saw this in theaters and it still makes me crack up at 28. Jim Carrey is hilarious as the Grinch!",
    "2": "Ok as soon as I heard that this FILM was being done Live. And Jim Carrey was in it and Who was Directed bye.\nI KNEW that this FILM would be a\n\"MASTERPIECE\"\n\"NO ONE IS SMART ENOUGH TO BE THE GRINCH BUT JIM CARREY\"",
    "3": "One of my all time favorite Christmas movies.\nThe grinch is hilarious, the older you get the more relatable it gets. I think Jim Carrey puts a great spin on the lovably quirky grinch. 7 o'clock, dinner with myself, I can't cancel that again!",
    "4": "Ask and Who, there's no place like Whoville around Christmas Day. Yes, every Who down in Whoville likes Christmas a lot, but the Grinch (Jim Carrey), who lived just north of Whoville did not. The Grinch hated Christmas, the whole Christmas season.It could be because his head wasn't screwed on just right or it could be, perhaps, that his shoes were too tight. But I think the most likely reason of all is that maybe have been that his heart was two sizes to small. Cindy Lou Who (Taylor Momsen) goes and sees who raised the Grinch who talk about the Grinch and say he wasn't a bad Who, he was just different. Cindy gets told the day at school just before the Grinch was last seen again.Jim Carrey is a hit as the Grinch and even in the serious times in this movie he is hilarious. Carrey I last saw in the movie \"Yes Man\" with Zooey Deschanel which was a movie about a guy who always says no and goes to a seminar about saying yes which changes his life and gives him more possibilities in life than he thought he knew. Momsen is much older now and it's fun to see where the actors or actresses end when you saw them when they were younger. She actually now is currently on the TV show \"Gossip Girl\" as Jennie Humphrey on Monday nights if you wanted to check her out in her role on the show or just see where she is now. This movie also stars Jeffrey Tambor, Christine Baranski, Bill Irwin, Molly Shannon, Clint Howard, Josh Ryan Evans, and Mindy Sterling. This is a good Christmas movie for the whole family to watch.",
    "5": "I found this a very entertaining small kids movie that actually is geared more for adults with a lot of jokes and humor only they would understand. A few things are inappropriate for the kiddies, but just a few. Othewise, \"The Grinch\" (Jim Carrey) cracks so many jokes you can't keep up with them all, ranging from sexual to cultural to insider-Hollywood to racial.The film is very colorful and looks great on DVD. The little girl in here, \"Cindy Lou Who\" (Taylor Momsen) is really cute and the costumes and hairdos of the little people in here are fun to view. Anthony Hopkins' voice is pleasing, too, so having his narrate this elevates the movie further. His rhymes are fun to hear.I saw this in the theater, though it was \"fair,\" but on DVD, it was far better. I've seen in three times and it got better each time.",
    "6": "In the row of 2000 Blockbusters The Grinch was one of them.This is a live action version starring Jim Carrey.The Grinch that hates Christmas lives up in a mountain above Whoville.A dog the Grinch owns steals the show with his circus acts.Jim Carrey does a great role as the Grinch insane of all the Christmas noise.In one scene the Grinch's head is pounded by a Duracell ape to not listen to the Christmas music.A little girl tries to befriend the Grinch.And, in the end the Grinch steals Christmas, but refuses it as his hearts grows.Silly movie, but a lot of great makeup too.8/10",
    "7": "How The Grinch Stole Christmas was beautifully shot and an excellent twist to Dr. Seuss' story. An OVERALL GREAT CAST and wonderful storyline. Jim Carrey did a phenomenal job as well as the other characters. A++++ Film.",
    "8": "Very nice movie about the true meaning of Christmas and about not judging people by looking or alternatively everyone deserves a second chance. The film is sweet and very funny with an unforeseen and particular plot, with a foregone conclusion but beautiful at the same time.",
    "9": "1st off anyone who gives this a 7 or lower is A GRINCH!! Its funny, The make up and cinematography is phenomenal , it's a different but amazing version of a classic, It felt like we were in whoville, its every thing you want in a Christmas movie. Do you realize how impossible it was to make the grinch live action???????? I didnt think it could be done not without massive CGI and they somehow did it. Mr Ron Howard and crew BRAVO!!!! Job extremely well done.",
    "10": "In 2018 Universal released an animated version of the story however it doesn't have the heart or the laughs that this Jim Carey version does.We all know the classic cartoon version story about \"The Grinch\" but this film shows us why he is this way.Lots of heart and there is a message of bullying here that is beneath the surface here. Perfect for family viewing anytime of the year.",
    "11": "Great and Delightful Film. Funny Enough and Great Message. This was a True Christmas Spirit I would say. The Characters are So Great. This Movie touches my Heart From The Ending. They should make movies like this someday",
    "12": "The film from my point of view shows that the difference becomes something normal after dealing",
    "13": "For me the best Christmas movie ever! Every Christmas since the movie was made as a family we all get together and watch. My son and I can virtually receit every scene of the film. Even after 20 years there's still tiny bits you miss that make to laugh.......... Happy Who balations to you all who watch, enjoy!",
    "14": "The Grinch hates Christmas, then steals it!When this first came out I liked the original version much more, but as time goes on I'm finding myself preferring this version more and more. Perhaps it's because Jim Carey's portrayal is more relatable, or perhaps I'm more impressed with the visuals and production value than I once was, or maybe I just understand the adult jokes more. Whatever the reason, this is a fantastic adaptation.What stands out above all is Jim Carey's performance, followed by the sets and costumes. It is an unforgettable experience that might never be replicated again.While kids may prefer the original, certainly this will be all the adults most preferred version of the Grinch.",
    "15": "How the Grinch Stole Christmas is one of my favorite films. You might think I'm crazy but I still have fun memories seeing this movie with my friends. The characters were superb, Jim Carrey and Anthony Hopkins were excellent and in fact I can do the grinch's voice very well. Anthony is probably the best narrator I have ever seen or heard in a movie. His voice is perfect for it. To me, this movie is an instant classic and way much better than that lousy Cat in the Hat movie. A very highly recommended film to see. See it please, it's a great children's story that I think every single person will enjoy. The best christmas film!!10/10!!",
    "16": "Overproduced spectacle that misses the point of the original story and TV special. If you had to do this film (and you didn't) at least get the point of the story right instead of bastardizing Dr. Seuss' message. Jim Carrey is obnoxious and gave me a headache. Taylor Momsen is the best part as Cindy Lou Who, although I miss the adorable two year old from the original. This Cindy Lou is a typical \"smarter than all the grown-ups\" kid like you only see in movies. Still, overly precocious or not, she's one of the few sweet parts of an otherwise charmless film. Garish sets and dark colors are a turn-off. See the original cartoon instead. It will save you a lot of time and you will come away much happier.",
    "17": "The cantankerous Grinch plots to destroy Christmas for the cheery residents of whoville but is confronted by a bold and generous hearted little girl named Mary Lou.Narrated by the soothing voice of Sir Anthony Hopkins this delightful and beautifully made christmas gem is sure to make Christmas special for many generations to come and what can I say? Jim Carrey is devilishly hilarious as the Grinch. Absolutely nailed it!! Colourfully made with a mixture of CGI and normal filming, this movie comes up beautifully. Food for the eyes. Every child must watch this along with all of the other great Christmas films that make Christmas such an exciting time for children. A must for you xmas collection.",
    "18": "If you went to this movie to see some huge academy award presentation...oh well..but if you wanted to see a funny delightful adaptation of an old classic, you will love it..Jim Carey was incredible as usual. The story line was great, a few parts added like the history of the Grinch made it even better. Ron Howard never misses a beat..But although there were a few ADULT comments and cleavage added, this is supped to be a kids or family show. Try not to lose sight of that ..if you do you really wont enjoy the movie...and as for the comments about Ron Howard, try to direct a major motion picture and see how you do..its not easy as it looks ...",
    "19": "How the Grinch Stole Christmas was a wonderful little Christmas cartoon that anyone could easily enjoy, I never did see the reason for a remake. Not to mention a remake that was made with humans, the cartoon was just perfect enough, what's the purpose of this film? But it also seemed a little odd for Jim Carrey to be the Grinch. I mean he's a great comedic actor, but him as the Grinch? It just didn't make any sense to me. His performance was a little over the top and unintentionally laughable at moments. Not to mention some of the added dialog was a bit childish and not enjoyable. The whole story of the Grinch and Cindy Lou-Who was over done and wasn't needed. They actually just destroyed the story, period.All the who's in Whoville are getting ready for their best Christmas season yet where everything is intended to go perfectly. But Cindy Lou-Who is curious and worried about the Grinch that lives above them and that he's not going to get as good of a Christmas as the other who's. He kicks her out and decides that he doesn't want Christmas this year and that in fact he should just steal Christmas all together to show the who's what his version of Christmas is all about. But soon he realizes that the who's may know that it's a little bit more than what is the materialized version of Christmas.How the Grinch Stole Christmas wasn't needed and was a bit over the top. I really recommend that you stick with the cartoon just for the simple fact that this is a pretty disturbing version, at least in my opinion. The make up and presentation of the whole film was just a bit over done, not to mention that How the Grinch Stole Christmas! was more meant to be as a cartoon rather than a version starring Jim Carry. But at least this version makes you grateful for the Boris Karloff version that is played every Christmas.1/10",
    "20": "This is my favorite Christmas movie of all time. Jim Carrey was epic. Ron Howard is awesome. No child can beat the Grinch!",
    "21": "Spoilers herein.Seuss's charm came from minimalism, a unique sort of theatricality that could be filled in by the reader/listener according to the sophistication of their own imagination.It was a minimalism in the story. Only one simple thread around which you could impute your own world. Trampled on here with all sorts of extra stuff as if our own minds didn't world.It was minimalism in the verse. Some scant remnant of that remains, buried deep in ordinary, vapid dialog.But most of all it was minimalism in the drawings. Those drawings were an anti art nouveau which started clean but ended excessively ornamented. Each line was a joke on itself, a self-referential comment on how the mind likes to take the simplest thing and can't help from elaborating until human limits are reached.His homeopathic style depends on this phenomenon and his simultaneous joke about it. It would require a rather clever and skilled art director to get behind that and realize it for film. What we end up here is `Hook,' except the strutter here is Carrey instead of Williams.The team that did `Casper' might have been able to pull this off. I don't understand why when they spend gobs of money, they don't spend part of it on a designer with vision.",
    "22": "I can understand, why certain people might dislike this film. I agree that the live-action film didn't really needed to be made, and that the film will never outdo the original 1966's TV animation movie. Still, this movie directed by Ron Howard is not as bad, as people make it, out to be. Its way better than other live action Dr. Seuss adaptations like 2003's Cat in the Hat. Produce by Universal Pictures and Imagine Entertainment, based on the 1957 story of the same name by author, Dr. Seuss, the movie tells the story of the reclusive Mr. Grinch (Jim Carrey), who decides to ruin Christmas for the cheery citizens of Whoville by stealing all their gifts and everything holiday related. The only person that can warm his heart is the endearing Cindy Lou Who (Taylor Momsen) whom hopes to show the Grinch, the true meaning of Christmas. Because the film is based on a children's picture book, many additions had to be made to the storyline to bring it up to feature-length, including some information about the backstory of the titular character. Most of that backstory is pretty damn good, despite that the fact that it doesn't fit that well to the original story. Things get very confusing as Cindy Lou can't tell the different between Santa Claus's voice and that of the Grinch!?! How is that possible? I found it funny that the Grinch show his face to her, and she still can't tell them, apart. Is she really that clueless!? Another clueless person is the Narrator (Voiced by Anthony Hopkins). The Narrator speaks as if, he had no knowledge, why the Grinch is mean. It doesn't make sense. Did he not see that the Grinch was mock? Anyways, I still like the backstory. Remind me of the outcast revenge horror movies, just in a tamer kid movie. Sure, it make the citizen of Whoville look like materialism consumer jerks, but the Whos in the novel, didn't have much of a personality. It even gives us, more reason to feel for the Grinch. It made him more sympathetic, than pure unlikeable. The movie expands on the Grinch's character, actually creating legitimate motivation for his actions and a reason why he stole Christmas this year as opposed to any previous year, in comparison to the original story where he simply hated Christmas and randomly decided that after years of putting up with it, he would ruin it. I think this backstory, really gave the movie more emotional depth. Did it weakened the overall moral plot to an extent? Kinda, but it was really needed. Most audience members that saw this movie, had already readt the book in the past. So, most of them, knew coming in, what's going to happen. I think by adding depth, it made the movie a little less predictable and little more watchable. Don't get me wrong, the movie does have a lot of pointless filler scenes that run the time, a little too long. Most of the jokes in the film are pretty clever, and had lot of wit to it. Lots of pop culture references, wisecracks and insults, break the fourth wall humor, slapstick, gross potty humor, and wordplay and puns are some of the jokes, you'll see in this. Lots of adult jokes like sexual, ethic, dirty jokes, are mixed so well with childish humor under a PG rating. It's has everything for everybody, but it really depend on the parents, if they will allow their children to watch this film or not. Not everything is kid's friendly as there are frightens imagery. Most of the jokes for me, personal, hit the funny bone hard. I couldn't stop, laughing at how funny Jim Carrey makes it out to be. A lot of people might criticizing Jim Carrey's performance as obnoxious over the top. I find it, alright. After all, it's Jim Carrey. He's known for over the top, wacky performances before, where critics love him. I don't know what makes this role, any differ than Ace Ventura or Lloyd Christmas. I guess, certain people want the Grinch to be a one-dimensional Scrooge, rather a full-fresh out character. I also found the young actress, Taylor Momsen to be very good at her age. While, she didn't have the chops for a singing voice, she did carry the heart & soul of the film with her performance. Most of the music in the film was pretty amazing to listen to. James Horner' score get you into the mood for the holiday. Faith Hill's song 'Where Are You Christmas?' awaken that Christmas spirit within you. Jim Carrey's 'You're a Mean One, Mr. Grinch' isn't as good, as the original as he tend to overdo it with multiply voices, and volume tones, but it's funny as hell. Even some of early 2000's Boys Bands feature in the soundtrack wasn't as bad, as I thought, they were going to be. I still have mixed feelings about the production. The cinematography need a little more cleaned up. The sets are very beautiful, but you can't see it with all the mist and fog. I know, Ron Howard was really going for the winter type of weather, here, to make it look more surreal, but it's really distracting. Some shots like the CGI wide shot are really made well on the computer, but most of the footage film on the set, looks like it was film in a steam bath with a lot of muted gloomy colors. It doesn't mixed. The film won the Best Make Up award at the Oscars that year, but I didn't really think it was that good. It wasn't ground-breaking. I saw Jim Carrey in similar make up in 1988's Earth Girls are Easy. He look almost the same, but green, instead of red fur. Overall: I love this movie and watch it over and over every Christmas despite its faults. It's a must watch.",
    "23": "For anyone not enamoured by the spirit of Christmas, they will understand the cynic in disguise. Or you can just call him Grinch. Jim Carey gives out quite the performance as a villain/good guy. He kept the latter for his Sonic performance I watched recently. I watched this back to back with the newer Grinch (and saw on imdb there is another Grinch movie with Bela Lugosi? Another one for the have to watch someday list) and it made it obvious that this is not as good as the newer version - at least to me.Having said all that, the movie is still funny and just for Carey it really is more than worthwhile. I guess some watch it every year, so depending how your emotional connection to it is ... otherwise I'd suggest go with the new and entirely animated one.",
    "24": "If you enjoyed the cartoon version, you'll enjoy this more. The setting and makeup really makes this look like a Dr. Seuss film, freaking Jim Carrey as The Grinch is the best thing out of this movie...that's all I have to say.",
    "25": "Ron Howard's big screen version of the beloved Christmas book is one of the few modern Christmas 'classics' (and I use this word loosely) that we have.For me though it's not that great. The visuals are great, the story well adapted, but it didn't do a lot for me.Jim Carrey is given full reign to mug and clown around, with his own brand of humour not always hitting the spot. Christine Baranski is the best of the various supporting players.So, sorry, for me this is not a Christmas classic. Just another fairly average attempt at being one.",
    "26": "Ron Howard directed this? The 1966 cartoon is charming, teaching a simple lesson to children using a simple plot. In this movie, Howard gives us a Whoville filled with greedy, manipulative, self-centered Whos. Jim Carrey is terrible, but I'm sure it's not his fault; I imagine the script called for the nastiest person imaginable, so Carrey channeled Tom Green and the result is movie magic. Much like Danny Devito's Penguin in Batman Returns, Carrey's Grinch is so thoroughly unlikeable that any degree of comedy that might be mined from his character simply evaporates. Where the 1966 cartoon featured a Grinch that we could all identify with, Carrey's Grinch is that angry, soulless old man that we've all seen at one time or another, sitting in a parked car muttering to himself or tripping toddlers at the supermarket with his cane. This Grinch is thoroughly bereft of any degree of humanity, humor, or insight whatsoever, and his redemption at the end of the movie rings false. The whole movie rings false: there is some stupid Christmas lighting competition, a failed attempt at explaining why the Grinch is such a jerk by digging into his childhood, and an indecipherable mystery as to why some of the Whos have that weird lip extension and some of them don't. Contrary to the 1966 cartoon, I would imagine children would find this movie tiresome, irritating, and filled with contradictory messages. Did we really need to see Slutty Smurf, aka Christine Baranski as Martha May Whovier? In addition, Ron Howard filled the cast with his untalented relatives. Throw in the requisite butt jokes, fart jokes, sex jokes, and other obligatory Carreyesque low-brow humor, and you have a movie that is about as far from the 1966 cartoon (or book that inspired it) as George W. Bush is from rational, lucid thought. Thumbs down on this big fat turkey.",
    "27": "When i first saw the teaser trailer for this movie before Mission Impossible my thought was...how could they match the wit of the 1960s cartoon as well as the book it was based on? Well, they did a great job making the grinch who he is while showing an origin story of how he became a grinch. This is why this film dominated the box office for the year 2000 and made Carrey a billionaire. Before you go see the CGI Grinch, watch the 1960s special after you read the book, then see this movie. It's worth watching!!!",
    "28": "I have seen this movie 5 or 6 times and every time I see it the only character that was funny was Jim Carrey as the grinch. Some of theother characters were good in their roles but if Jim Carrey had not been in this film it would have bummed out. Never the less the movie it self had a very interesting storyline but could never compare to the all time Dr. Suess classic. I realize they had to stretch thestory out in the movie considering it was an hour and a half long movie instead of a half an hour cartoon and they did OK. So if you haven't seen this movie yet see it if you like Jim Carrey because he did a fantastic job playing the grinch in this movie.",
    "29": "Some things are just not meant to be live action. Dr Seuss must have been rolling in his grave as his second wife sold the film rights of his Christmas hit to Universal Pictures, who then ran with the idea that live action was the way to re-imagine these beloved children's books. They would begin the Dr Seuss cinematic universe and fill their films with big name comedic stars to draw in audiences. They would stretch 30 page picture books into bloated, overstuffed feature length films. They would replace the simple, economical illustrations of the original with grotesque costumes and lurid colour schemes (Bo Welch, the director of The Cat in the Hat, began his career as a production designer in Tim Burton films such as Beetlejuice and Edward Scissorhands, and copy and pasted the same eye-popping style into his own film). Gone was the playful bounce of the Seuss rhymes; a dark menace replaces the atmosphere hanging over Whosville as Christmas approaches. The town was once a circle of warmth and generosity, until a Christmas ghoul by the name of Ron Howard came along and turned it into the capital of greed and consumerism. The film takes something well meaning and good hearted and turns it into a garish toyland to serve its extended plot. Given the challenge of forcing a hour plus long conflict from a picture book, the script turns the story on its head - it was actually the Grinch who was the original victim, a case of schoolyard bullying, and the Whos who become the villains. Seeing the makeup of these Whos, it's hard not to agree - they've taken quaint cartoon figures and replaced them with life sized humanoids sporting button noses that make them look like some god-forsaken pig-dog mutation out of a secret government lab. Perhaps Howard realised that such monstrosity could not be the heart of the film; no wonder the most innocent of all the Whos, precocious little six year old Cindy Lou, never has to sit in that makeup chair. Her character must over-correct for all the Who buffoonery with a cloying sweetness that by now has become a holiday cliche. If you didn't hate Christmas like the Grinch does during the opening credits, you just might after a little girl keeps popping up to shove tinsel and mince pie in your face. Creepy as the Whos are, they are no match for the real antagonist of the story, the eponymous green Grinch who lives up in the mountains and is revered as a Christmas legend. The script's attempts to humanise him this time around via flashback only serve to make audiences recoil further; his junior form is propped up on the school chair like a creepy puppet, forced sympathy engineered on strings. His adult self isn't the Grinch. It's Jim Carrey in a green fur suit, with a transatlantic-Connery-esque growl thrown in for good measure. Maybe executives were drawn to the manic energy of a Carrey, of a Myers. They thought they could ride on the screen power of these comic icons and then slap on a Seuss label. Carrey is aggressively twisted, and not in a good way. One could barely stand the sight of him with a pot belly and nothing else (clothing for his bottom half is optional, apparently), gyrating and sashaying all over the place. Seeing him fidget and snarl, seeing him shove those hairy pipe cleaners he calls fingers into his nostrils and crunch beer bottles with his fangs, we can see this isn't the mischievous fiend that Seuss envisioned. This is our drunk uncle in a creepy Halloween costume, belching all the way into December. Getting Carrey allows them a little mileage for a few elongated action sequences, if only to further press the point that everything the Grinch touches turns to disaster (the camera assumes the position of some drunk bird that can't stop tilting its head). It's too bad that most of this action mimics the same juvenile trash that belongs in cheap sitcoms. You know, crotch humour, exaggerated slapstick, Grinch getting catapulted right into a woman's cleavage, or pinning mistletoe on his behind. Most of it is pitched at a juvenile level but actually aimed at adults; kids won't recognise the Chariots of Fire theme, or register any of his extended stand-up monologues (to himself), and when Carrey winks and talks right into the camera it's just another gag (\"And this time I'll keep it off.\"). They've never seen the Chuck Jones cartoon anyway, for comparison. I'm actually impressed at how atrocious this adaptation is. It takes a great deal of talent and incompetence to turn a cartoon classic into this gaudy, useless trinket. Is there any upside? Well, at least it isn't as bad as The Cat in the Hat.",
    "30": "The Grinch hates Christmas, then steals it!When this first came out I liked the original version much more, but as time goes on I'm finding myself preferring this version more and more. Perhaps it's because Jim Carey's portrayal is more relatable, or perhaps I'm more impressed with the visuals and production value than I once was, or maybe I just understand the adult jokes more. Whatever the reason, this is a fantastic adaptation.What stands out above all is Jim Carey's performance, followed by the sets and costumes. It is an unforgettable experience that might never be replicated again.While kids may prefer the original, certainly this will be all the adults most preferred version of the Grinch.",
    "31": "How the Grinch Stole Christmas is one of my favorite films. You might think I'm crazy but I still have fun memories seeing this movie with my friends. The characters were superb, Jim Carrey and Anthony Hopkins were excellent and in fact I can do the grinch's voice very well. Anthony is probably the best narrator I have ever seen or heard in a movie. His voice is perfect for it. To me, this movie is an instant classic and way much better than that lousy Cat in the Hat movie. A very highly recommended film to see. See it please, it's a great children's story that I think every single person will enjoy. The best christmas film!!10/10!!",
    "32": "Overproduced spectacle that misses the point of the original story and TV special. If you had to do this film (and you didn't) at least get the point of the story right instead of bastardizing Dr. Seuss' message. Jim Carrey is obnoxious and gave me a headache. Taylor Momsen is the best part as Cindy Lou Who, although I miss the adorable two year old from the original. This Cindy Lou is a typical \"smarter than all the grown-ups\" kid like you only see in movies. Still, overly precocious or not, she's one of the few sweet parts of an otherwise charmless film. Garish sets and dark colors are a turn-off. See the original cartoon instead. It will save you a lot of time and you will come away much happier.",
    "33": "The cantankerous Grinch plots to destroy Christmas for the cheery residents of whoville but is confronted by a bold and generous hearted little girl named Mary Lou.Narrated by the soothing voice of Sir Anthony Hopkins this delightful and beautifully made christmas gem is sure to make Christmas special for many generations to come and what can I say? Jim Carrey is devilishly hilarious as the Grinch. Absolutely nailed it!! Colourfully made with a mixture of CGI and normal filming, this movie comes up beautifully. Food for the eyes. Every child must watch this along with all of the other great Christmas films that make Christmas such an exciting time for children. A must for you xmas collection.",
    "34": "If you went to this movie to see some huge academy award presentation...oh well..but if you wanted to see a funny delightful adaptation of an old classic, you will love it..Jim Carey was incredible as usual. The story line was great, a few parts added like the history of the Grinch made it even better. Ron Howard never misses a beat..But although there were a few ADULT comments and cleavage added, this is supped to be a kids or family show. Try not to lose sight of that ..if you do you really wont enjoy the movie...and as for the comments about Ron Howard, try to direct a major motion picture and see how you do..its not easy as it looks ...",
    "35": "How the Grinch Stole Christmas was a wonderful little Christmas cartoon that anyone could easily enjoy, I never did see the reason for a remake. Not to mention a remake that was made with humans, the cartoon was just perfect enough, what's the purpose of this film? But it also seemed a little odd for Jim Carrey to be the Grinch. I mean he's a great comedic actor, but him as the Grinch? It just didn't make any sense to me. His performance was a little over the top and unintentionally laughable at moments. Not to mention some of the added dialog was a bit childish and not enjoyable. The whole story of the Grinch and Cindy Lou-Who was over done and wasn't needed. They actually just destroyed the story, period.All the who's in Whoville are getting ready for their best Christmas season yet where everything is intended to go perfectly. But Cindy Lou-Who is curious and worried about the Grinch that lives above them and that he's not going to get as good of a Christmas as the other who's. He kicks her out and decides that he doesn't want Christmas this year and that in fact he should just steal Christmas all together to show the who's what his version of Christmas is all about. But soon he realizes that the who's may know that it's a little bit more than what is the materialized version of Christmas.How the Grinch Stole Christmas wasn't needed and was a bit over the top. I really recommend that you stick with the cartoon just for the simple fact that this is a pretty disturbing version, at least in my opinion. The make up and presentation of the whole film was just a bit over done, not to mention that How the Grinch Stole Christmas! was more meant to be as a cartoon rather than a version starring Jim Carry. But at least this version makes you grateful for the Boris Karloff version that is played every Christmas.1/10",
    "36": "This is my favorite Christmas movie of all time. Jim Carrey was epic. Ron Howard is awesome. No child can beat the Grinch!",
    "37": "Spoilers herein.Seuss's charm came from minimalism, a unique sort of theatricality that could be filled in by the reader/listener according to the sophistication of their own imagination.It was a minimalism in the story. Only one simple thread around which you could impute your own world. Trampled on here with all sorts of extra stuff as if our own minds didn't world.It was minimalism in the verse. Some scant remnant of that remains, buried deep in ordinary, vapid dialog.But most of all it was minimalism in the drawings. Those drawings were an anti art nouveau which started clean but ended excessively ornamented. Each line was a joke on itself, a self-referential comment on how the mind likes to take the simplest thing and can't help from elaborating until human limits are reached.His homeopathic style depends on this phenomenon and his simultaneous joke about it. It would require a rather clever and skilled art director to get behind that and realize it for film. What we end up here is `Hook,' except the strutter here is Carrey instead of Williams.The team that did `Casper' might have been able to pull this off. I don't understand why when they spend gobs of money, they don't spend part of it on a designer with vision.",
    "38": "I can understand, why certain people might dislike this film. I agree that the live-action film didn't really needed to be made, and that the film will never outdo the original 1966's TV animation movie. Still, this movie directed by Ron Howard is not as bad, as people make it, out to be. Its way better than other live action Dr. Seuss adaptations like 2003's Cat in the Hat. Produce by Universal Pictures and Imagine Entertainment, based on the 1957 story of the same name by author, Dr. Seuss, the movie tells the story of the reclusive Mr. Grinch (Jim Carrey), who decides to ruin Christmas for the cheery citizens of Whoville by stealing all their gifts and everything holiday related. The only person that can warm his heart is the endearing Cindy Lou Who (Taylor Momsen) whom hopes to show the Grinch, the true meaning of Christmas. Because the film is based on a children's picture book, many additions had to be made to the storyline to bring it up to feature-length, including some information about the backstory of the titular character. Most of that backstory is pretty damn good, despite that the fact that it doesn't fit that well to the original story. Things get very confusing as Cindy Lou can't tell the different between Santa Claus's voice and that of the Grinch!?! How is that possible? I found it funny that the Grinch show his face to her, and she still can't tell them, apart. Is she really that clueless!? Another clueless person is the Narrator (Voiced by Anthony Hopkins). The Narrator speaks as if, he had no knowledge, why the Grinch is mean. It doesn't make sense. Did he not see that the Grinch was mock? Anyways, I still like the backstory. Remind me of the outcast revenge horror movies, just in a tamer kid movie. Sure, it make the citizen of Whoville look like materialism consumer jerks, but the Whos in the novel, didn't have much of a personality. It even gives us, more reason to feel for the Grinch. It made him more sympathetic, than pure unlikeable. The movie expands on the Grinch's character, actually creating legitimate motivation for his actions and a reason why he stole Christmas this year as opposed to any previous year, in comparison to the original story where he simply hated Christmas and randomly decided that after years of putting up with it, he would ruin it. I think this backstory, really gave the movie more emotional depth. Did it weakened the overall moral plot to an extent? Kinda, but it was really needed. Most audience members that saw this movie, had already readt the book in the past. So, most of them, knew coming in, what's going to happen. I think by adding depth, it made the movie a little less predictable and little more watchable. Don't get me wrong, the movie does have a lot of pointless filler scenes that run the time, a little too long. Most of the jokes in the film are pretty clever, and had lot of wit to it. Lots of pop culture references, wisecracks and insults, break the fourth wall humor, slapstick, gross potty humor, and wordplay and puns are some of the jokes, you'll see in this. Lots of adult jokes like sexual, ethic, dirty jokes, are mixed so well with childish humor under a PG rating. It's has everything for everybody, but it really depend on the parents, if they will allow their children to watch this film or not. Not everything is kid's friendly as there are frightens imagery. Most of the jokes for me, personal, hit the funny bone hard. I couldn't stop, laughing at how funny Jim Carrey makes it out to be. A lot of people might criticizing Jim Carrey's performance as obnoxious over the top. I find it, alright. After all, it's Jim Carrey. He's known for over the top, wacky performances before, where critics love him. I don't know what makes this role, any differ than Ace Ventura or Lloyd Christmas. I guess, certain people want the Grinch to be a one-dimensional Scrooge, rather a full-fresh out character. I also found the young actress, Taylor Momsen to be very good at her age. While, she didn't have the chops for a singing voice, she did carry the heart & soul of the film with her performance. Most of the music in the film was pretty amazing to listen to. James Horner' score get you into the mood for the holiday. Faith Hill's song 'Where Are You Christmas?' awaken that Christmas spirit within you. Jim Carrey's 'You're a Mean One, Mr. Grinch' isn't as good, as the original as he tend to overdo it with multiply voices, and volume tones, but it's funny as hell. Even some of early 2000's Boys Bands feature in the soundtrack wasn't as bad, as I thought, they were going to be. I still have mixed feelings about the production. The cinematography need a little more cleaned up. The sets are very beautiful, but you can't see it with all the mist and fog. I know, Ron Howard was really going for the winter type of weather, here, to make it look more surreal, but it's really distracting. Some shots like the CGI wide shot are really made well on the computer, but most of the footage film on the set, looks like it was film in a steam bath with a lot of muted gloomy colors. It doesn't mixed. The film won the Best Make Up award at the Oscars that year, but I didn't really think it was that good. It wasn't ground-breaking. I saw Jim Carrey in similar make up in 1988's Earth Girls are Easy. He look almost the same, but green, instead of red fur. Overall: I love this movie and watch it over and over every Christmas despite its faults. It's a must watch.",
    "39": "For anyone not enamoured by the spirit of Christmas, they will understand the cynic in disguise. Or you can just call him Grinch. Jim Carey gives out quite the performance as a villain/good guy. He kept the latter for his Sonic performance I watched recently. I watched this back to back with the newer Grinch (and saw on imdb there is another Grinch movie with Bela Lugosi? Another one for the have to watch someday list) and it made it obvious that this is not as good as the newer version - at least to me.Having said all that, the movie is still funny and just for Carey it really is more than worthwhile. I guess some watch it every year, so depending how your emotional connection to it is ... otherwise I'd suggest go with the new and entirely animated one.",
    "40": "If you enjoyed the cartoon version, you'll enjoy this more. The setting and makeup really makes this look like a Dr. Seuss film, freaking Jim Carrey as The Grinch is the best thing out of this movie...that's all I have to say.",
    "41": "Ron Howard's big screen version of the beloved Christmas book is one of the few modern Christmas 'classics' (and I use this word loosely) that we have.For me though it's not that great. The visuals are great, the story well adapted, but it didn't do a lot for me.Jim Carrey is given full reign to mug and clown around, with his own brand of humour not always hitting the spot. Christine Baranski is the best of the various supporting players.So, sorry, for me this is not a Christmas classic. Just another fairly average attempt at being one.",
    "42": "Ron Howard directed this? The 1966 cartoon is charming, teaching a simple lesson to children using a simple plot. In this movie, Howard gives us a Whoville filled with greedy, manipulative, self-centered Whos. Jim Carrey is terrible, but I'm sure it's not his fault; I imagine the script called for the nastiest person imaginable, so Carrey channeled Tom Green and the result is movie magic. Much like Danny Devito's Penguin in Batman Returns, Carrey's Grinch is so thoroughly unlikeable that any degree of comedy that might be mined from his character simply evaporates. Where the 1966 cartoon featured a Grinch that we could all identify with, Carrey's Grinch is that angry, soulless old man that we've all seen at one time or another, sitting in a parked car muttering to himself or tripping toddlers at the supermarket with his cane. This Grinch is thoroughly bereft of any degree of humanity, humor, or insight whatsoever, and his redemption at the end of the movie rings false. The whole movie rings false: there is some stupid Christmas lighting competition, a failed attempt at explaining why the Grinch is such a jerk by digging into his childhood, and an indecipherable mystery as to why some of the Whos have that weird lip extension and some of them don't. Contrary to the 1966 cartoon, I would imagine children would find this movie tiresome, irritating, and filled with contradictory messages. Did we really need to see Slutty Smurf, aka Christine Baranski as Martha May Whovier? In addition, Ron Howard filled the cast with his untalented relatives. Throw in the requisite butt jokes, fart jokes, sex jokes, and other obligatory Carreyesque low-brow humor, and you have a movie that is about as far from the 1966 cartoon (or book that inspired it) as George W. Bush is from rational, lucid thought. Thumbs down on this big fat turkey.",
    "43": "When i first saw the teaser trailer for this movie before Mission Impossible my thought was...how could they match the wit of the 1960s cartoon as well as the book it was based on? Well, they did a great job making the grinch who he is while showing an origin story of how he became a grinch. This is why this film dominated the box office for the year 2000 and made Carrey a billionaire. Before you go see the CGI Grinch, watch the 1960s special after you read the book, then see this movie. It's worth watching!!!",
    "44": "I have seen this movie 5 or 6 times and every time I see it the only character that was funny was Jim Carrey as the grinch. Some of theother characters were good in their roles but if Jim Carrey had not been in this film it would have bummed out. Never the less the movie it self had a very interesting storyline but could never compare to the all time Dr. Suess classic. I realize they had to stretch thestory out in the movie considering it was an hour and a half long movie instead of a half an hour cartoon and they did OK. So if you haven't seen this movie yet see it if you like Jim Carrey because he did a fantastic job playing the grinch in this movie.",
    "45": "Some things are just not meant to be live action. Dr Seuss must have been rolling in his grave as his second wife sold the film rights of his Christmas hit to Universal Pictures, who then ran with the idea that live action was the way to re-imagine these beloved children's books. They would begin the Dr Seuss cinematic universe and fill their films with big name comedic stars to draw in audiences. They would stretch 30 page picture books into bloated, overstuffed feature length films. They would replace the simple, economical illustrations of the original with grotesque costumes and lurid colour schemes (Bo Welch, the director of The Cat in the Hat, began his career as a production designer in Tim Burton films such as Beetlejuice and Edward Scissorhands, and copy and pasted the same eye-popping style into his own film). Gone was the playful bounce of the Seuss rhymes; a dark menace replaces the atmosphere hanging over Whosville as Christmas approaches. The town was once a circle of warmth and generosity, until a Christmas ghoul by the name of Ron Howard came along and turned it into the capital of greed and consumerism. The film takes something well meaning and good hearted and turns it into a garish toyland to serve its extended plot. Given the challenge of forcing a hour plus long conflict from a picture book, the script turns the story on its head - it was actually the Grinch who was the original victim, a case of schoolyard bullying, and the Whos who become the villains. Seeing the makeup of these Whos, it's hard not to agree - they've taken quaint cartoon figures and replaced them with life sized humanoids sporting button noses that make them look like some god-forsaken pig-dog mutation out of a secret government lab. Perhaps Howard realised that such monstrosity could not be the heart of the film; no wonder the most innocent of all the Whos, precocious little six year old Cindy Lou, never has to sit in that makeup chair. Her character must over-correct for all the Who buffoonery with a cloying sweetness that by now has become a holiday cliche. If you didn't hate Christmas like the Grinch does during the opening credits, you just might after a little girl keeps popping up to shove tinsel and mince pie in your face. Creepy as the Whos are, they are no match for the real antagonist of the story, the eponymous green Grinch who lives up in the mountains and is revered as a Christmas legend. The script's attempts to humanise him this time around via flashback only serve to make audiences recoil further; his junior form is propped up on the school chair like a creepy puppet, forced sympathy engineered on strings. His adult self isn't the Grinch. It's Jim Carrey in a green fur suit, with a transatlantic-Connery-esque growl thrown in for good measure. Maybe executives were drawn to the manic energy of a Carrey, of a Myers. They thought they could ride on the screen power of these comic icons and then slap on a Seuss label. Carrey is aggressively twisted, and not in a good way. One could barely stand the sight of him with a pot belly and nothing else (clothing for his bottom half is optional, apparently), gyrating and sashaying all over the place. Seeing him fidget and snarl, seeing him shove those hairy pipe cleaners he calls fingers into his nostrils and crunch beer bottles with his fangs, we can see this isn't the mischievous fiend that Seuss envisioned. This is our drunk uncle in a creepy Halloween costume, belching all the way into December. Getting Carrey allows them a little mileage for a few elongated action sequences, if only to further press the point that everything the Grinch touches turns to disaster (the camera assumes the position of some drunk bird that can't stop tilting its head). It's too bad that most of this action mimics the same juvenile trash that belongs in cheap sitcoms. You know, crotch humour, exaggerated slapstick, Grinch getting catapulted right into a woman's cleavage, or pinning mistletoe on his behind. Most of it is pitched at a juvenile level but actually aimed at adults; kids won't recognise the Chariots of Fire theme, or register any of his extended stand-up monologues (to himself), and when Carrey winks and talks right into the camera it's just another gag (\"And this time I'll keep it off.\"). They've never seen the Chuck Jones cartoon anyway, for comparison. I'm actually impressed at how atrocious this adaptation is. It takes a great deal of talent and incompetence to turn a cartoon classic into this gaudy, useless trinket. Is there any upside? Well, at least it isn't as bad as The Cat in the Hat.",
    "46": "That was too ugly to stand. (Jim Carrey) was at some kind of a turning point between being that crazy cartoon channel, and a bit sane comedian / actor. Here, he selected to be the wacky wacko (Carrey). Although he's brilliant, but NOT THIS TIME.The whole deal is so strange; metamorphosing everybody's image transformed the movie's world into big monster for ever mysterious reasons. So, it's not your typical fairytale's soft drawings but, in the same time, not a wild black comedy, or a satirical take on our modern life's towns and people either!As for the humor, let's not talk about the humor. Enough to say that this movie consider seeing a man kissing a dog's butt is something funny that suits a PG comedy!! Who writes this stuff.. Satan?! And if he did, how come that Hollywood agrees to produce it, and sell it as family friendly fun?!!Even as a drama, it's not that right. For example, ask yourself: why the lead got changed at the end? Clearly for nothing but the movie makers' desire! Maybe they expended all the time, the efforts, and the money for building these huge vile set pieces, and forgot about the story, relying on the fact that the audiences would laugh, and be dazzled, more than to think: aka Hollywood everlasting mean trick. But that was out of the question this round, because I didn't laugh, be dazzled, and more than once I found myself thinking furiously \"What is that?, what they were thinking?, is it the Dadaism?, am I having a good time?\" sure \"NO\" FOR THIS LAST ONE!So the problem of this movie is that it suffers from too much of everything bad I suppose: silly lead actor, hideous make-up, repellent lenses, nasty humor, plus unconvincing climax. In one word, this is not the way to make a kids fantasy, it's the new way for making pure ugliness under the name of novelty, uniqueness.. whatever. And even with the wise tone of (Anthony Hopkins), as the narrator, nothing could bring any balance to this kids' story which gone eccentric.This is a fine rival for director (Ron Howard)'s worst movie. Frankly, it looked more like it was directed by the twisted Grinch himself!PS: My review's title is a phrase that was said by one of the movie's characters, and once I heard it, I found nothing better than it to describe the annoying time I was having.",
    "47": "Jim Carrey shines like the Grinch. Unfortunately, it is not enough to save this movie. You would do better watching the cartoon on TV. Best review of Rotten Tomatoes!",
    "48": "How the Grinch Stole Christmas (2000): Dir: Ron Howard / Cast: Jim Carrey, Christine Baranski, Jeffrey Tambor, Molly Shannon, Bill Irwin: We are all curious as to how the Grinch accomplishes his mission on the most giving time of year but from what I can gather, the only thing he truly stole was my admission fee. He is rejected from a small village and lives in the mountains. We are never given any back story as to what his parents were like. Instead we are given a lame pelican explanation that just seems tacked on. The villagers also have snouts, which I never fully understood and probably never will. Plot regards his stealing away Christmas and having a change of heart. While it may mirror the classic holiday animation, it still comes off as artificial. Interesting directing choice for Ron Howard who is known for films such as Apollo 13 and The Paper. While his attempt is praise worthy, the payoff is nowhere near as entertaining as the animated film. Jim Carrey is the ideal choice to play the Grinch but without any background, it just comes off as a really good impression. Christine Baranski, Jeffrey Tambor and Molly Shannon are given the embarrassing tasks of sporting snouts and lame lines of dialogue. The Grinch costume passes but art direction is artificial and about as festive as your average toy store. Perhaps the Grinch should have stole the screenplay. Score: 3 / 10",
    "49": "Yes, Jim Carey is fairly brilliant in what he does and how he does it. However, this is not the \"Jim Carey Show\", it's supposed to be about the Grinch, how he attempted to ruin Christmas and how in the end he finds redemption and all with appropriate humor applied. Not so here. This is, apparently, about Jim Carey, by Jim Carey, and nothing else but Jim Carey. Hence why for the last few years he hasn't been involved with anything noteworthy. People get very tired of someone who's ALWAYS \"on\". Same thing happened to Robin Williams. You may be the star of the picture but you are not the picture itself, or you shouldn't be. You are merely the performer hired to perform the material handed to you. The 1966 TV animated version is much better because of three things: the animation of Chuck Jones based upon Dr. Suess's characters, the adherence to the actual story and of course the profound narration by Boris Karloff. Watch this latest \"grinch\" along with Carey's Andy Kaufamnn \"tripe\" if you dare.",
    "50": "This movie is the best Christmas movie without a doubt. From the first time I watched it I loved it. Ok I love Jim Carrey but this movie is a masterpiece of cinema. From the movies I've watched to adaptations of Dr. Seuss this is the best. The dog Max is the second best character in this movie, I already love dogs and they still put a super cute dog. The songs are also great. And obviously the humor in this film is very good, Jim Carrey's \"exaggeration\" did a lot of good for this film. A movie very funny. Jim Carrey is awesome. The Girl is amazing too and singing is awesome. Film Watched on August 04, 2023.",
    "51": "I'll give it credit for expanding the Grinch's origin as well as some the makeup, costume and set designs but aside from that it's not a good movie. Even as a kid I couldn't get through this movie because it's so glum and mean spirited. Jim Carrey and Taylor Momsen do a good job portraying their characters but even they can't save this movie.If you've read the book or saw the old special then you know what the story's about. There're a few new elements added such as the mayor being the main villain as well as the reason the Grinch became what he is now as well as their being a love interest for the title character in order to stretch out the length. It's not enough for me to recommend this movie though.I hear a lot of people grew up watching this and express their fond memories of it but for me I'm not one of them. I suggest sticking to the book and the old Christmas special.",
    "52": "As usual, any film that Carrey is in becomes more about him than the story. Dr Seuss is rolling in his grave.",
    "53": "Possible Spoilers AheadOh my. this movie is HORRIBLE! First, they add an unneeded love story and history for the grinch. NOT NEEDED! BARELY PLAYED! WHY WASTE THE TIME? And Cindy Lou is made a real heroine by going out and trying to help the Grinch? Maybe it could of worked if they did it differently. The pacing is wretched. the first 50 minutes seemed to say nothing and go nowhere. Perhaps that's the catch of doing a feature-length movie based on a book written in under 500 words.Jim Carrey makes a perfect Grinch when he isn't being Jim Carrey. The other characters were fun. I would of liked to have seen more of the town activities and imagination. The setting was perfect. They brought who-ville to life. But the story additions and pacing were just badly written or poorly executed on the screen.Sad. All the pieces were there. The potential was there. It just wasn't put together right. What a sad day.",
    "54": "Why? Why was this made? Don't get me wrong, I'm not saying it's bad, necessarily, just pointless, which is almost as, well, bad. Amazing how all this money was spent and the final product doesn't even come close to either the 10-page story (or however many pages it was) and the 1/2 hour-long 1966 cartoon.Visually, this live-action Grinch is perhaps the best rendition (the Grinch himself, that is; the live-action Whos look ridiculous), but that's about all this movie has over the other two. Compare the flawless narration of Boris Karloff to the lackluster narration of Sir Anthony Hopkins (who sounds as if he'd rather be doing anything else; I got the strong sense that he was bored to tears doing this) and you can't help but wonder what's the point. Compare Thurl Ravenscroft's rendition of \"You're a Mean One, Mr. Grinch\" to Carrey's spastic rendition and you'll want to sew Jim Carrey's lips shut.Finally, compare the pacing. This story didn't need to be more than a few pages or half an hour long. Yet, somehow, this film is 104 minutes! 80 minutes, I can perhaps understand, but 104? Why, for example, the protracted role of Cindy Lou Who? Not enough justification to make a movie, I'm sorry to say. At one point when she asks Grinch-Santa what Christmas is about and he tells her toys, she answers \"that's what I was afraid of.\"Excuse me while I gag myself with a fork.\"Unnecessary\" is all I can think of to say.",
    "55": "Other than Babe: Pig in the City and Santa Clause Conquers the Martians, I can't think of a more detestable kids pic than this. I hated Jim Carey and I hate Dr. Seuss' widow for authorizing this pile of #@@%!!! AND THEN SAYING \"This is exactly the sort of film my husband would have made\". Yeah, well maybe after he had an aneurysm!! Come on, lady. Just be truthful and instead say \"it's dog drool and the Doc is spinning in his grave like a rotisserie--BUT MAN WILL YA' LOOK AT ALL THE MONEY THEY GAVE ME?!?!?!??\".I base this on the basic fact that the entire message of the book and wonderful TV special is: The GRINCH HATES XMAS and the People of Whoville know the REAL reason and joy of the holiday. Now with this crappy movie it's: The Grinch rightfully hates XMAS because it's been over-commercialized by the selfish people of Whoville. Huh?!?!?! This is the complete OPPOSITE of Seuss' vision and his widow has the nerve to say it was what HE wanted?!?! This was the most overblown and over-hyped movie. With $10000000000000 dollars spent on advertising and marketing (and $6.79 for writing), it's no wonder the movie made money!!! Kids can't help but see Grinch paraphernalia EVERYWHERE and demand to see the movie. BUT, to the parents of Planet Earth we have a solution to movies like this---Tell your kids NO!!!!! Then take them for a walk or go fishing or beat each other senseless with tire irons--it would STILL be better than going to see bloated MEGA-crap like this!UPDATE: I have an Italian friend who likes the film. When we talked about it, I understood why. He had never read the book nor seen the wonderful cartoon versions--and the message in them is the exact opposite of this movie. So, if you haven't seen the cartoon or read the book, this could be a nice film to watch....but if you HAVE and loved them like I did as a child, the film is an insult.",
    "56": "Seeing as Christmas is approaching, and it's tradition for people to write jolly (or not) reviews for films, and Hollywood to make un-jolly films for them to review... hold on, I'm sorry, it's really approaching Halloween. But remember: This is scary!Anyway, I'd better warn you about something: Jim Carrey really looks like himself in this film. Those clips you've seen with him getting buried in makeup? Played backwards; they're putting makeup on him so he looks rubber-faced.Special effects look good in this film, but really, do you expect us to believe that there's a town inside a snowflake? No! Also with bad features:Jim Carrey's in it-enough said! Unneccesary subplots like Cindy Lou Who's biography makes the film go on for 13 hours! We can't believe that a tunnel will take you upward and harm you!More is that they do not change the ending. Come on, (spoiler) for one, it's telling you to give up on your dreams! I mean, Al Gore doesn't push the Christmas stuff that he stole from Whyville over the mountain! Don't tell me that it was in Dr. Suess' story; it still tells you that dreams are silly!Also, there is no point to remaking good films anyway. What do I mean, you ask? Psycho, Planet of the Apes, and now this piece of ****. And to think, we pay money to see CGI-and-nothing-else films like this!Rating: -86566/6PS: Notice that I never said one specific word from the title? PSS: In the rating, look at the last three numbers. That describes it!",
    "57": "Oh, good, Ron Howard and Jim Carrey are getting together for a remake of the Grinch! This is going to be movie magic. I loved the Grinch on TV! What-a-dis-a-point-ment! I usually love Ron Howard directed movies. And Jim Carrey movies are some of my favorites. This movie never gets off the ground. For starters, the town's people just don't translate well from the cartoon form. The mayor is just boorish and boring. Cindy Lou-who, so cute and innocent in the cartoon, has too many silly lines and dull scenes. I never bought the idea where the Grinch is honored by the town. Ron Howard should have realized that many people who take their kids to the movie, also watch the movie with them. I guess the standard set by the beloved cartoon could not be met by the movie. The movie sets are more goofy than charming, and so is Jim Carrey's performance. He had his moments, but weighed down by a bad script and a bad costume, he failed to add to my holiday cheer. You're a bad one, Mr Grinch!",
    "58": "In FOUR words, Dis-a-point-ing....I was really looking forward to it, too.... (esp. due to the Ron Howard factor), I doubt Opie would enjoy it!",
    "59": "Jim Carrey is very funny, but this movie was a complete failure to me. It was just a bizarre, poorly-written kiddie movie, which are among the worst kinds of movies. I'm surprise it did as well as it did. I thought it was pretty bad. There were almost no funny jokes, the Grinch was way too bizarre (the kid version of him was too sadistic also), and when those elements weren't being presented, it was filled with corniness often found in bad kiddie movies. The way the Grinch was written was what ruined the whole movie for me. He was just too bizarre and too sadistic. I'm sure Jim Carrey did what he could with it, but \"How the Grinch Stole Christmas\" is one story that shouldn't have been made into a full-length, non-animated movie. I thought it should've stayed an animated, 1950s TV movie. This was an attempt at \"improving\" a beloved tale that failed miserably. No one should have to watch this bad flick.",
    "60": "This was the second version of the famous story by Dr. Suess, following the 1966 Chuck Jones/Boris Karloff cartoon, a big-budget live action adaptation, produced by Brian Grazer, directed by Ron Howard (Splash, Parenthood, Ransom, A Beautiful Mind). Basically the Whos down in Whoville are preparing for Christmas, everyone is excited to be buying gifts, decorations and food. Seven-year-old Cindy Lou Who (Taylor Momsen) feels however everyone is missing the point about Christmas, going overboard with festive items, rather than personal relationships. While on top of Mount Crumpit lives the hairy, green creature the Grinch (Golden Globe nominated Jim Carrey), he is feared by all the townspeople, he has a heart two sizes too small, and he really hates Christmas. Cindy Lou encounters the Grinch when he comes down the mountain into town to create trouble in the Post Office, she is initially scared, until he reluctantly saves her from being crushed in a packaging machine. She becomes curious about the Grinch, and asks townspeople about his history, she asks many people in town what they know about him. The Grinch had a tragic past, as a baby he was adopted by two spinsters, he showed sadistic tendencies as a child, but was not cruel as he would later become. In school, the eight-year-old Grinch (Josh Ryan Evans) had a crush on classmate Martha May Whovier (Landry Allbright), but his rival Augustus May Who (Ben Bookbinder) teased him about his hairiness. One year, the Grinch makes Martha a gift, he also attempts to shave his face, the next day his classmates laugh at him for his face cuts, he loses his temper, destroys the gift and trashes the classroom, and exiled himself to the top of Mount Crumpit, never to be seen again. Touched by this story, Cindy Lou decides to nominate the Grinch to be the Christmas Whobilation \"Holiday Cheermeister\", to the displeasure of Augustus May Who, now the mayor of Whoville. She climbs to the top of Mount Crumpit and invites the Grinch to the Whobilation, he initially declines, but reconsiders hearing about an award, and that Martha May (Christine Baranski) will be at the celebration. As Cheermeister, the Grinch endures wearing an ugly sweater and judging all the Whos' Christmas food concoctions, but he enjoys being unsportsmanlike and beating children in the competitions. The Mayor reminds the Grinch of his childhood humiliation, giving him an electric shaver as a present, and publicly proposing marriage to Martha May, and offering her a new car on the side. In response, the Grinch berates the Whos about the Christmas festivities, saying it is all about the gifts, most will end up in the garbage which is dumped on Mount Crumpit near his home. He proceeds to ruin the party, burning down the town Christmas tree and causing chaos. Cindy Lou is shamed by the Mayor, but the Whos have a spare tree, which they put up after the Grinch leaves. The Grinch wants Christmas to end once and for all, it is when he sees his dog Max (Kelley, voiced by Frank Welker) with snow on his face, like the beard of Santa Claus, he gets a wonderful, awful idea. He concocts a plan to steal all the Christmas presents, decorations and food from the Whos, he creates a Santa Claus suit and hat, building a powered sleigh, and sticking an antler on Max's head to become a reindeer. The first house the Grinch goes to is Cindy Lou's house, she catches him as he is stealing the Christmas tree, but he lies to her, as Santa, that he is taking it to be fixed at his workshop. The Grinch continues house to house stealing everything Christmassy, packing it into a bag in the back of the sleigh, and gets it back to the top of Mount Crumpit, ready to dump it. The Grinch listens out for the cries of the Whos when they wake up on Christmas morning, the Mayor blames Cindy Lou for what the Grinch has done, but her father Lou Lou Who (Bill Irwin) defends her, saying that Christmas is not all about the gifts, it is about family. Before the Grinch pushes the sleigh of Christmas goods off the edge of the cliff, he hears the happy singing of the Whos, he is puzzled that he has not stopped Christmas from coming. Then he realises, Christmas means more than judt what comes from a store, it means a little bit more, and in this moment, his heart grows three sizes. He sees the sleigh is about to fall from the mountain, he is unable to stop it, but then he sees Cindy Lou on top of the load, this motivates him to save not just the gifts but a life, he finds the strength to lift the sleigh. The Grinch and Cindy Lou ride the sleigh back to town to return the gifts, the Grinch confesses to stealing Christmas and apologises, surrendering himself to the police. Officer Wholihan (Jim Meskimen) lets him go, and Martha May turns down the Mayor's proposal, handing back his diamond ring, as heart belongs to the Grinch. In the end, the Grinch joins Cindy Lou and all the Whos in a singalong, and he has the honour of carving the roast beast for the large feast. Narrated by Sir Anthony Hopkins, also starring Molly Shannon as Betty Lou Who, Clint Howard (Ron's brother) as Whobris, Mindy Sterling as Clarnella, Rachel Winfree as Rose, Rance Howard (Ron's father) as Elderly Timekeeper, Jeremy Howard as Drew Lou Who, T.J. Thyne as Stu Lou Who, Deep Roy as Post Office Clerk, Rain Pryor (Richard's daughter) as Shopper, Verne Troyer as Band Member, Rick Baker as Puppeteer, Bryce Dallas Howard as Surprised Who and Ron Howard as Whoville Townsperson. Carrey is almost unrecognisable under the makeup as the hairy, green pest, he really laps up being mean and causing havoc, Momsen is cute, and Tambor and Baranski do their parts well, and the narration by Hopkins is nice. It sticks to the basic story of the mountain dweller who hates everything festive and plans to steal it, the extension seeing the lead creature's past, why he hates Christmas and other bits and pieces works, it deserved the awards for brilliant makeup for Carrey in his green getup and everything with their noses, the costumes, sets and props are likeably weird, kooky and colourful, and Carrey sings an amusing version of \"You're a Mean One, Mr. Grinch\", it is dark in moments and might be a little much for children, but you will find yourself laughing a lot, and feel the Christmas spirit, a wondeful seasonal fantasy comedy. It won the Oscar for Best Makeup, and it was nominated for Best Art Direction-Set Decoration and Best Costume Design, and it won the BAFTA for Best Make Up/Hair. Jim Carrey was number 47 on The 100 Greatest Movie Stars. Very good!",
    "61": "Ugly, cheesy, noisy, messy, film adaptation of Seuss' classic animated holiday story.Sloppily directed by Ron 'Opie' Howard with a broader-than-broad performance by Jim Carrey in the part of 'The Grinch'. There is absolutely no warmth or charm in this train wreck of a film - and even less comedy. The Grinch eating glass did not make me laugh... it only made my teeth hurt. A modified script depicting 'The Whos of Whoville' as shallow individuals doesn't help. Forget about this one unless you're curious to see how bad a movie can actually be.'Dopey Opie' gets the blame for this pathetic fiasco.",
    "62": "I don't know how people liked it.  It was down right boring.  I thought it would be most enjoyable because Jim Carrey was in it.  I couldn't stand it, it was to slow, I would rather watch the cartoon of How the Grinch Stole Christmas.  Since I didn't like this movie I don't know about seeing The Cat in the Hat.  Hollywood should definately leave the Dr. Seuss stories alone. Let them be the childhood classics we will remember.",
    "63": "...I'm not made of stone!\" Who said it? Was it Mrs. Theodor Geisel upon being questioned why she let her late husband's beloved work, \"How the Grinch Stole Christmas,\" be adapted into this truly abysmal piece of dreck? Or Krusty the Clown as to why he let his name be attached to shoddy products?Ron Howard's 2000 film adaption of Dr. Seuss' holiday classic is an abomination. It takes an illustrated children's book and attempts to stretch its story into a 104 minute feature film. The concept was doomed from inception. Even the brilliant Chuck Jones' 1966 animated version was only able to get its 26 minute run time with the addition of songs and lengthened action scenes. So, imagine all the padding needed to stretch out this children's story into 104 minutes. It's not pretty. Watching a manic Jim Carrey mug for the cameras to drag out numerous scenes gets very tiresome.What sets it apart, though, from the other misguided attempts to adapt Seuss stories to the big screen is that it's a crass piece of Christmas commercialism based on a story that is against crass Christmas commercialism. \"What if Christmas, (the Grinch) thought, doesn't come from a store. What if Christmas, perhaps, means a little bit more.\" That's the message of both the book and its terrific animated adaption. Yet, this movie is nothing more than a cash grab! It was made to sell tickets, sell Grinch toys, sell Grinch merchandise, sell DVDs, and even try to promote that mawkishly terrible Faith Hill song as a new Christmas standard. And it's all so blatant!Both Ron Howard and Jim Carrey have done far better work, and to their credit they've both expressed misgivings about this film. Unfortunately, this awful film stands as a major blemish on both of their careers.In sum: a film bereft of both artistry and a soul despite being based on one of the Christmas season's most beloved works of pop culture. I rarely give single star ratings, but this adaption so missed the mark from its source material's theme and is so poorly made that I find it morally and artistically repugnant. Unwatchable!",
    "64": "I hate this poison, this turkey, this film, whatever you want to call it.Blake French was right: Jim Carrey overacts. You can put special effects in a film all you can and want, the film isn't neccesarily the greatest. The Godfather was a portrait of real life, and was great. This is fiction (and shows), and is bad. And my heart is normal sized. (If you're reading this on Christmas, watch the original-it has quality.)",
    "65": "I rarely review a film that has more than 100 reviewers, but I'm going to make an exception here.I think it's brilliant! Most who really like it give the highest marks to Jim Carrey. But I'm going to give most of the credit to Ron Howard. It occurred to me while watching this that Ron Howard is one director who has contributed an unusually diverse body of work to American cinema. Everything from \"Cocoon\" to \"Willow\" to \"Parenthood\" to \"Backdraft\" to \"Far And Away\" to \"Apollo 13\" to \"A Beautiful Mind\" to \"The Davinci Code\" to \"Frost/Nixon\" to his current tale about \"Moby Dick\". The question with the Grinch film was how to make it relevant to adults, while still keeping the moral of the Suess story..and although it's nothing like the book, it does maintain that moral.And then there's Jim Carrey. Who else could have handled this role? No one. I couldn't help but wonder how much of his performance was scripted and how much was ad-lib.The special effects -- absolutely outstanding. The makeup -- remarkable. And all wrapped up in a film that is truly unique.I was interested to seen Christine Baranski (\"The Good Wife\") here. Somehow I missed that Anthony Hopkins was narrator.For balance, watch this film, George C. Scott's \"A Christmas Carol\" and Bing Crosby's \"White Christmas\".",
    "66": "at first sigh, it is his film. in fact, he is only the key to discover a different, lovely, seductive about the holiday. because Grinch is the perfect puzzle of states of everyone. the old memories, the need of solitude, the joy of the others as dangerous attack to the precious silence. and the metamorphose in front of the family spirit. the film is a nice trip in the heart of childhood. this is all. and the motif to see again and again not only in the period of Christmas but in each time when you become more than lonely. the details, the spirit of a small community, the flavor of innocence and the Grinch who redefines the image of evil are good points who does this film adorable.",
    "67": "Yeah, I think that the makeup and the art direction is enough for a person to watch. Even if you have serious, very serious, reservations about Jim Carrey in this, and even if you feel that Ron Howard just didn't show the skill that he did in Apollo 13, A Beautiful Mind, or The DaVinci Code, you can admire the technical knowhow. The biggest difficulty for me personally is that I kept wishing I was watching the Chuck Jones animation and hearing Boris Karloff's narration instead. It is a shame, in my elfish opinion, that Ron Howard felt it necessary to include vulgarisms, but we all know that G rating isn't supposed to sell as well as the PG rating. I believe a little research throws that assumption out the window when average box office figures for G rated movies are compared to those for those with \"more mature\" ratings. One other disturbing factor to me was that this film didn't come through as well with the theme of Christmas being more than receiving (and even giving) material gifts. I do believe that this is a good enough film to include in your Christmas viewing, but do compare it with the earlier cartoon version.",
    "68": "It is one of the Christmas classics.Jim Carrey is Jim Carrey :)\nIt was fun.",
    "69": "In the hands of director Ron Howard and star Jim Carrey, \"Dr. Seuss' How The Grinch Stole Christmas\", is a loud, obnoxious, excessive, CHARMLESS bore. This very short story is expanded to 1 hour and 45 minutes of grotesque imagery that focuses on repugnant characters, who wear out their welcome within 30 seconds.  Carrey's schtick is beyond unbearable.  Easily one of the worst films I have ever seen.  NOT recommended!",
    "70": "YAWWWWW ARE CRAZY TO RATE THIS MOVIE 6.5!Jim Carrey and everyone else in this movie nailed and executed every line and scene.Never a dull moment with Jim Carrey.",
    "71": "Numerous critics around the world (including well known Robert Ebert) voted this one of the years worst. I assumed they were wrong but as the saying goes I made an ass out of u and me. Trying to take a 20 minute cartoon and stretching it out to 104 minutes just didn't work. I know it made huge bucks, but I claim this to be a remarkably boring and unfunny film. BAH HUMBUG!",
    "72": "What is it with Hollywood re-doing classic stories, and why do they always seem to screw it up? The animated version of this which had Boris Karloff and all the other talented people that made it should have never been re-made. Say what you want but Ron Howard and most certainly Jim Carry should have never been a part of this project. Jim Carry over acts as he always does as the Grinch and Ron Howard just did not have the Director skills. The mountain in the animated story was so different and in Ron Howards version, it is a large pile of trash. Why? Why can't they ever stay true to the original story? If something worked and millions of people grew up loving it than just leave it alone. But when all it is about is money I guess artistic visions mean nothing.",
    "73": "It's unfortunate that this large scale production was not put into a traditional account of the Grinch story. Ron Howard, who has directed so many Frank Capra style movies for mainstream audiences, had to twist the plot around and use special effects for a movie that confuses young audiences and detracts from the message. The cast and special effects could have produced a classic from the Grinch story; a movie to reinforce the Christmas message from Dr. Seuss's wonderful children's book. In the end, the movie did return to the original theme but the story was already ruined. There were so many deviations from the story and over the top scarifying scenes that it amounts to a travesty of a great Christmas tale.",
    "74": "when i first saw the previews for this movie, i was really excited, ever since i have been little, i have read the books watched the movies, the whole thing and then i saw the movie lets just say i wasnt impressed, if you havent seen it, it wasnt as great as anyone expected i dont think.",
    "75": "This came out when I was 10, I loved it then and now that I'm older I absolutely laugh at the grinch's one liners. Bloody love this film!",
    "76": "Originally, in 2000, for some reason I liked this movie. Now, 2003, thinking on it I finally realized how terrible this movie is.  The moral of the story is that it doesn't matter how much you SPEND on Christmas, its the thought that counts and yet this was a very commercial movie with tons of advertising and a huge budget. It doesn't make much sense.  This is kind of a slap in the face to Dr. Seuss and please just do yourself a favor and stick to the original cartoon- or the book.Thanks. 4/10",
    "77": "Saw this for the first time this weekend (November 2019). Now I know why I avoided it for 19 years. It's one of the most boring movies I've ever seen. Never been a fan of Jim Carrey - and this movie solidifies my continued dislike.Terrible Terrible movie. Ron Howard should be ashamed of himself ...",
    "78": "\"How The Grinch Stole Christmas\" is a funny movie. It has a lot of heavy laughs. Jim Carrey is very funny in this film. My brothers love that movie, too. If you have not seen it, see it. It's a must-see for all ages to watch and laugh really hard. **** out of **** stars and 10 out of 10 stars.",
    "79": "(possible spoilers)Someone once asked Dr. Seuss if they could secure the movie rights to his 1957 Christmas classic How the Grinch Stole Christmas. He turned them down, insisting that no one could do better than the marvelous Chuck Jones TV special from 1966 (also in mind, perhaps, was his bitter experience writing the script to 1953's The 5,000 Fingers of Dr. T). When the good Dr. died in 1991, his widow, Audrey Geisel, still obstinately refused to sell the movie rights. But with the commonplace use of CGI effects becoming a reality, Mrs. Geisel had a change of heart. Universal made her a generous offer she accepted; she also accepted the casting of Jim Carrey as the title character. Supposedly she was satisfied with the final result. Well, Mrs. Geisel, that makes one of us.The film was given a $123,000,000 budget (which is more than even Heaven's Gate cost, including the adjustment for inflation), which obviously went towards the very elaborate makeup, set design, and special effects (which are underminedsomewhat by the rather hazy cinematography). Unfortunately, it seems that none of that money was set aside to get a better script than what Jeffrey Price and Peter S. Seaman (scribes of Who Framed Roger Rabbit?, which made much betteruse of a high budget) turned in. Whereas the TV special was a trim 26 minutes without commercials, this film tries to fill a running time of 105 minutes with more background information about the Grinch. It turns out that, as a child, he was the subject of ridicule, including an especially humiliating experience one Christmas at the age of eight. So it turns out that everything that ails our poor Mr. Grinch is directly because of the Whos. Trouble is, it seems like a rather long 105 minutes, with too much dead wood clogging up the story. That might not seem so bad if only the Grinch were a little more...well, Grinchy. The character that Dr. Seuss wrote and Chuck Jones later animated was a sly fox whose slick attempts to hijack the holiday season were undermined by his sudden change (and exponential growth) of heart. Carrey's Grinch is a loud, hyperactive oaf and, at times, a thug who, when made the holiday `Cheermeister,' trashes the Whoville town square in anger(hopefully the scenery tasted as good as it looked). This undermines the script's attempt to make the Grinch more sympathetic, with all the Whos down in Whoville so unsympathetic (at least in this interpretation).The Whoville of Dr. Seuss's vision was a small town populated by honest folk who knew in their hearts the true meaning of Christmas. The Whoville of the movie is a rather noisy and crowded place populated by spoiled, selfish, materialistic ninnies; an obvious attempt to comment on American consumerism. This is offensivelyhypocritical inasmuch as the film industry has benefitted greatly from American consumerism, and as this film contributed to it with a huge merchandisingcampaign.The film also expands and redefines the character of Cindy Lou Who, a small but crucial character in the original. The innocent two-year-old waif who walked in on this spurious Santa is now older and wiser, constantly questioning the false values of the Whos and trying to understand the Grinch's point of view (her one major scene from the original is re-enacted, making it seem out of character). Sheseems to be the only one who would ever know that Christmas is more than just gifts and decorations, thus making her a completely different, and more annoying, character.Those who celebrate Christmas should sooner accept a lump of coal in theirstockings on the morning of December 25 than a copy of this overlong, overacted, excruciatingly tedious, ham-handed, crude attempt to turn the children's classic into a feature film. It proves once and for all that darkness, vulgarity,manipulation, and heavy-handedness are inadequate substitutes for charm, wit, sincerity, and heart. The folks at Universal should get down on their collective knees and thank God that this truly bilious $123 million stink bomb grossed $260 million domestically or they'd not be here today. Furthermore it made Mike Myers' The Cat in the Hat possible!",
    "80": "During his heyday as a comic film star, it was expected that a Jim Carey movie would be over-the-top with his antics, especially if he was playing a milquetoast character who suddenly got some gumption to stop being picked on. With \"The Grinch\" and \"The Mask\", Carey went overboard with the antics, reminding me of that attention seeking kid who could break people up laughing with their silly faces and funny voices but never knew when to stop. In other words, he's perfect for roles like this, yet after a while it can become pretty tiring.As the Grinch, he gives an over cafineated performance, frenetic and sly, barely stopping to get a breath. Of course a lot of that is in the makeup and costume, special effects and the editing, but no one else in 2000 could play that role. This isn't the quiet menace of the Boris Karloff cartoon but something a lot more complex, some of which works and some of which can be eye rolling.The direction by Ron Howard is decent but there's so much going on that you may feel forced to watch it every other Christmas or so to gather it all up. It's beautiful to look at and often funny (especially his love of raw onions), but there's a bit of cloying nonsense with the character of Cindy Lou Who, unfortunately not always easy to understand, especially when she sings.Bill Irwin, Christine Baranski and Jeffrey Tambor provide a few of the familiar faces with Anthony Hopkins almost sounding like Karloff. This must have been a magical set to see for the first time for those involved, and certainly the first viewing can bring on a lot of ooh's and ah's. The town of Whoville though isn't presented as the perfect Christmas town even though it's obvious their favorite holiday. Certain individuals are grinches in their own right. Not bad for an occasional viewing (my third in 20 years), but not one I'd make a Christmas tradition.",
    "81": "I started out not liking this movie. Mainly because I grew up watching the original Boris Karloff television presentation. But now, every year I look forward to this rich, and wonderful film. The production design, attention to detail, story,\ncostumes, makeup, and of course the grinch himself. Jim Carey nails the grinch. Only he could've pulled this off, and his performance makes the film. Ron Howard has really done an amazing job pulling all of this together into a wonderful, funny, heartwarming, comedic masterpiece. That gets better and better with age.",
    "82": "This is the weirdest and dumbest Christmas movie literally ever. It's terribly acted, creepy and just... awful. Why do people watch this filth?",
    "83": "The overall message was sweet.  The characters were cute.  Jim Carrey had his work cut out for him.It was a bit too busy for me.  I felt exhausted after awhile, trying to keep up with it all.  But, perhaps I am not the target audience.  I kept thinking...\"I probably would like this better if I were a child.\"But it's cute.  Felt a bit long.  I guess I am too jaded....",
    "84": "A wonderful modern adaptation of a Christmas classic! Ron Howard doesn't flinch away from modernizing this tale with some dark shades to it's humor, which are expertly delivered by (need I point it out?) Jim Carrey's comedic genius. Carrey's Grinch lines such as \"Be it ever so heinous, there's no place like home\" when describing his filthy mountaintop lair, or that he's looking forward to his night in that home so that he can \"slowly slip into madness\" are genuinely funny. And Cindy Lou Hoo is that rarest of phonomena, a cute youngster who isn't precocious, as rather than that cuteness it's her intelligence and perceptiveness of the Grinch's hidden humanity that are highlighted. I realize that the film received mixed reviews and only moderate box office success as I think many people were expecting merely a live-action version of the original classic animated piece, but kudos to Howard and all the cast and crew for making the Grinch relevant and meaningful for many more years to come.",
    "85": "I know that sounds like an overstatement, but it's true. It doesn't matter how many times you've seen it - it always makes you laugh and cry at the same time (and not just for its cheesy special effects). But if there's one thing about this story that bothers me, it's that it isn't not 5 hours long!You see, The Grinch wasn't a bad little guy; he was just misunderstood. He'd been neglected since he was young and no one loved him. Until Cindy Lou saw him as more than just a green monster. This film is about how being different doesn't mean you don't belong. 100/10 if possible. Thank you. Goodbye.",
    "86": "They did not succeed in expanding this story to a full length feature. Many of Jim Carey's line readings as the Grinch are very memorable--he did a great job. But the script was just not there. The situations just don't work. It's much too busy and overdone. The best Christmas movies create an atmosphere that bring nostalgic feelings of the season. This movie feels like being in a Chuck E. Cheese.",
    "87": "Jim Carrey, Jeffrey Tambor, Taylor Momsen, Christine Baranski, Bill Irwin and Molly Shannon star in Ron Howard's 2000 fantasy based on the Dr. Seuss book and cartoon. This takes place in the town of Who-Ville where we meet The Grinch (Carrey) who despises Christmas since he was young. Soon, he meets young girl, Cindy Lou Who (Momsen) who tries to get him to share the holiday festivities with everyone in town. He decides to take Christmas away from the Whos, but fails when he eventually learns the true meaning of Christmas. Tambor (The Larry Sanders Show) plays the Mayor, Augustus MayWho, Baranski (The Birdcage) plays the Grinch's crush, Martha May Who, Irwin (My Blue Heaven) and Shannon (Never Been Kissed) play Cindy Lou's parents, Lou and Betty Lou. Howard's father Rance, brother, Clint and son, Jeremy also appear and Anthony Hopkins (The Silence of the Lambs) narrates. Carrey is great as usual as well as Rick Baker's make-up effects and James Horner's score. This is a good adaptation of the Christmas classic I recommend.",
    "88": "Beyond the use of too much back story, beyond the decision to jam every bit of design and gimmicks possible into the film so that it is rendered unwatchable, beyond the ludicrous, over-the-top performance to the point that Carrey reminds me of Dr. Frank N. Furter wrapped in a green carpet, the filmmakers completely missed the point of the story. A previous poster said it best: Geisel wanted to give us a character who just happens to be rotten, period. His redemption in the book and cartoon are far greater events because he finds the love in himself to vanquish HIS evil nature which is HIS ALONE. Additionally, the film seems to work overtime to secularize the story, which Geisel didn't try to do.Read the book and see the cartoon, which is a truly uplifting experience. Avoid this load of green-and-red cotton candy.",
    "89": "This adaptation of the classic Dr Seuss story is directed by Ron Howard, whose flair for stunning visuals is matched only by his full head of hair. This looks terrible.  The sets look like something I got free with a Happy Meal.  Remember the plastic rocks in the Flintstones movies?  They were quarried to make these sets.Ron Howard is a great director, but he hasn't got any unique style.  As much as I love Apollo 13, Backdraft and Ransom, they're not particularly exciting to look at.  He's just not the right director for something like this. Couldn't the idiot-execs look for someone else?  Tim Burton isn't the only guy in Hollywood with an imagination.  Okay, he probably is, but you'd think there'd be someone who can fake it better than Ron Howard.  In place of invention, we have only wonky camera angles.  `Hey, guys, put the camera on a 45 degree angle, that'll give it an other-worldly kind of look.'Jim Carrey, in the lead role, is as annoying as always.  Having toned things down for The Truman Show and even for Me, Myself and Irene, he's back to his old rule of comedy for The Grinch: loud = funny.  Look! at his arms flailing around wildly.  See! his face contorted into comical expressions.  Yawn! as you realise you've seen it all before.I haven't read How the Grinch Stole Christmas, so I can't say how this works as an adaptation, but I can say how it works as a movie.  It doesn't.  It doesn't work at all.  There's no magic, there's no awe or wonder.  And it gets the pace and the tone so wrong you'd think this was a first time director.  If this is how Ron Howard's movies are going to turn out from now on he'd better cross his fingers for a  Happy Days reunion.The plot, which is covered in 60-something pages in the book, is too thin for a hundred minute movie.  It is stretched more blatantly than Zsa Zsa Gabor's face.  The result is 50-tog padding, where the running time is allowed to drag at the expense of the pace.  The tone is lost completely. Most kids' movies have a few jokes that serve as a nod to the long-suffering parents in the audience, but the `adult' jokes here suggest that Whoville has racism, infidelity and wife-swapping parties.  Unbelievable.In place of charm, we get sentiment so cloying that tie-in sick bags would have been best-sellers.  The real meaning of Christmas isn't presents  it's about love, it's about being with friends.  The Grinch comes to realise this  an hour too late for my comatose backside  and celebrates Christmas in time for the finale.  Hooray!  We all come to realise that Christmas is about more than money and capitalism and commercialism.  The Grinch took more than 50 million dollars in its opening weekend. Merry Christmas, everybody!",
    "90": "Of course it isn't as good as the animated classic, an immensely charming, beautifully animated gem, that is a family Christmas favourite. I will admit I was a bit sceptical of the remake, but other than some slow scenes in the middle half and a patchy script, this film is surprisingly good. Honestly if you thought this is terrible, and I completely respect anyone who thinks that, I warn you Cat in the Hat was much worse, and gets my vote as the worst Dr Seuss adaptation ever. How The Grinch stole Christmas is very colourful, with great set design, and an unrecognisable Jim Carrey was terrific as the Grinch, he was actually really funny, not like Mike Myers who was miscast as the cat in Cat in The Hat. Everyone else was fine too, particularly the girl, and while he is no Boris Karloff Antony Hopkins does a good job as the narrator. The script is patchy in places, but there are a number of very funny bits, and it was nice having some character context about the Grinch. All in all, a colourful, well performed film, not as good as the 1966 animated classic,and flawed it is, but actually one of the better Dr Seuss adaptations. 8/10 Bethany Cox",
    "91": "I have just read the lead comment for this film that is on the front page with the voting results and cast run down.Why is it that some people can not take a film for what it is supposed to be.This film is supposed to be a light hearted, tonge in cheek, family comedy, things to make the kids laugh and things for the adults, and that is exactly what this film does.I laughed my nuts off at this film, I thought Carey put in a great performance and the whole film (if watched at Christmas) really give you a bit of festive cheerSo to all of you film reviewers stop trying to sound like film students and knock every film because it is not \"Taxi Driver\" or \"The Godfather\" and take films for what they are supposed to be, entertainment!!",
    "92": "In the land of Whoville everyone loves Christmas and count down the whole year until that wonderful time.  However just outside Whoville lives the Grinch, a green hairy twisted creature that hates, and always has hated, Christmas and was rejected by the Who's as a child.  A young girl from Whoville sets out to befriend the Grinch and help him find his love of Christmas but, when it goes wrong early on, the Grinch becomes even more rotten and plans to ruin it for everyone.I have never read the book or seen the original animated version of this story, but I do enjoy a bit of Dr Seuss and was worried about how such imagination would be filled out on the screen.  The film actually manages it very well and the whole film has the look of the books, even if it lacks soul at times.  The plot is stretched out to the running time and could have easily been shorter and punchier, but at heart it is a good little moral that is good from Christmas time.However, aside from the look of the film, the main reason that the film works is Jim Carrey.  I cannot think of another actor who could have pulled off this role as well as he did.  He is manic and really funny although I imagine that if you dislike him and his antics that you'd hate the film totally.  I'm on the fence about him but I did enjoy him here.  Momsen is OK but really just a `cute kid' and, while the support cast has quite a few famous faces, they don't make much of an impact under the makeup and the film is left to Carrey to save it - which he happily does.Overall this film is a little too long and padded out, but while Carrey is onscreen it seems to go pretty fast due to his hyper acting and comedy antics.  However, it's Christmas and it has a nice message while not totally giving in to syrupy sentiment (thanks again to manic Carrey) and it's just perfect for kids and adults at Christmas time.",
    "93": "How the Grinch Stole Christmas (2000) is a movie in my DVD collection that I recently rewatched with my daughter on HBOMAX. The storyline follows the city of Whoville which is filled with Whos. One day a grinch is accidentally delivered there and tries to understand their ways and love for Christmas but fails and comes to loath it. He moves into the far mountains of Whoville and becomes a hermit. When a little girl knocks on his door and tries to get him in the Christmas spirit he decides to take his hate for Christmas out on the locals. Can anyone or anything stop him?This movie is directed by icon Ron Howard (Splash) and stars Jim Carrey (Liar Liar), Clint Howard (The Waterboy), Jeffrey Tambor (Arrested Development), Christine Baranski (Chicago), Molly Shannon (Superstar) and Taylor Momsen (Gossip Girls).Everything about this movie is perfect. The universe is perfectly created and thoroughly captures your imagination. The backdrops, sets and props are stupendous. The costumes, makeup and hairstyles were a lot of fun. Jim Carrey delivers an amazing performance. His dialogue, mannerisms and facial expressions are awesome. The storyline is well written and I loved the way it explains how the Grinch arrived, his childhood, his current state and his evolution. How can you not love Max and the ending was perfect. Even the soundtrack is good.Overall, this is one of the greatest Christmas movies ever made. I would score this a 10/10 and strongly recommend it.",
    "94": "I have been eagerly anticipating the opening of this film for several months.  Being a huge Jim Carrey fan, I easily saw how he could morph himself into Seuss' Grinch and make the character his own.  I was not disappointed.  This movie was pure magic.  Carrey is a master at his trade and no one could have played this role to perfection as he did.  There was plenty to enjoy for both adults and children alike and this movie is sure to become a timeless classic for all to enjoy in the years to come.  I already have visions of my young daughter sitting down year after year to watch this remake on video, and I undoubtedly will watch with her and laugh as I did the first time I saw it.Clearly, this movie has Jim Carrey written all over it, and I do not believe that it would have come together without him.  However, the supporting cast was charming and entertaining in their own right, most notably the adorable Taylor Momsen who was the perfect foil for Carrey's antics.  The set design, musical score and costumes all lent their hands to a magical, fabulous finished product and I believe all involved can be proud. \nIt is not an easy feat to turn a 22 minute cartoon classic into a full length live action film, but Howard has succeeded with flying colours.  For those critics who disagree, perhaps it is your hearts that are 2 sizes too small.",
    "95": "Howard's 'How the Grinch Stole Christmas' is a delightful family flick that both adults and children can enjoy (mostly with each other). It is basically an adaptation of the famous children's books and what the audience gets is a pleasant Christmas treat. Price's screenplay is brilliant as he cleverly manages to include some adult humour.The world of Whoville is beautifully constructed and created, full of colour, life, energy and spirit. The vivacious characters are full of positive energy and while it is over the top, it is all done within the context and none of it appears out of place. The CGI team and makeup crew deserve full credit for making the characters and settings so lifelike, bringing out a lot of detail and appearing authentic. The set designs are stunning and the cinematography is just as energetic as the characters.Child actress Taylor Momsen is absolutely. The cute dog also turns in a fine performance. Jeffrey Tambor, a very sexy Christine Baranski, Bill Irwin and Molly Shannon are first rate. However, what would 'How the Grinch Stole Christmas' be without Jim Carrey? Carrey is simply fantastic as he immerses himself entirely into the character. It's a role that has Jim Carrey written all over it. The actor has immortalized the Grinch on screen.The movie itself is not an exact 100% adaptation of the book as there are a few changes. The romance between the Grinch and Martha May could have been better developed. Other than the actors mentioned above, the rest of the cast hardly have anything to do than make fleeting appearances. Yet, 'How the Grinch Stole Christmas' is a charming little Christmas family film that is dazzling to look at and hugely enjoyable with the whole family.",
    "96": "Big budget remake of the classic cartoon about a creature (Jim Carrey) intent on stealing Christmas.I had rather low expectations for this one... not sure why, as it turned out to be quite good. I just wanted to add a few thoughts here.First of all, Taylor Momsen nailed the Cindy Lou Who part. She has gone on to bigger, better things (\"Gossip Girl\") and good for her. Second, Ron Howard nailed the look of a Seussian world. The faces, the architecture, it all seems so right and I think the good doctor would have approved. I heard that Tim Burton was approached to direct, and I think he would have done a fine job, but how do you beat this? And last, Jim Carrey. Wow. He has had some good and bad career decisions, and this has to be among his best. The physical comedy, the improvised jokes, it was like the role he was born to play. The other choices were Jack Nicholson and Eddie Murphy. Nicholson could possibly have done it ten years earlier, but did he have that range of motion in 2000? And Eddie Murphy? Maybe, maybe not. This was a Carrey role inside and out.",
    "97": "Ron Howard is known for making such dramatic films like Apollo 13, The Da Vinci Code, Angels & Demons and many more, but before those two adaptations of Dan Brown's novels, he adapted the original book of the same from Dr. Suess, a remake of the 1957 cartoon \"How The Grinch Stole Christmas\".The premise, like the cartoon, is the same: The Grinch plots to steal Christmas from all of Whoville, but learns that Christmas comes from the heart. This one, however, has a few tweaks that weren't included in the book. It details the Grinch's past about him being humiliated by the children of Whoville and has a relationship with Martha May Whovier. It wasn't the best origin, but wasn't that bad at all. While this movie stayed true to the spirit of the book (and despite it's crude and inappropriate humor but has a few good jokes) Jim Carrey, although over-the-top, did a perfect job as the Grinch. The rest of the cast did great especially Taylor Madsen as the lovable Cindy Lou-Who.I show some empathy for fans of the book who hated this adaptation, but as for me, I'm recommending this Christmas classic to others highly.Rating: 8.3/10",
    "98": "This is one of those once-in-a-lifetime movies, really. We've had a couple of Seuss-inspired films after it and, for the most part, they've been hit or miss, but nothing has really come as close as this film did to capturing magic.\nJim Carrey gives another stellar performance in this film, because his acting ability combined with the sheer elasticity of his facial muscles allowed him to portray a full range of emotions throughout the film, from the cold and heartless to the kind and gentle, and he does it in a believable way. It's not as if it's two different characters (Nice Grinch/Evil Grinch); it feels very human. Of course, it also goes with the territory that Jim Carrey is hilarious as The Grinch and still, after all these years, the jokes still manage to make me smile.\nThe supporting cast is fantastic, but Jim Carrey really does carry this film, and it makes his countless hours of sitting in makeup worth it for the final product.\nRon Howard did a brilliant job of creating Whoville and the Whos for the film and, from what I've seen and heard, he allowed a fair amount of improvisational work to be done as well. The actors were given the breathing room to find the characters on their own, which creates a very organic, natural feel among them. Their rapport with one another is completely believable (that is, when it's not supposed to be completely zany).\nWith the added bonus Faith Hill's Where Are You Christmas both interspersed throughout the film and featured in the end credits, this is a certified Christmas classic that has made every holiday season so much more meaningful since the year it came out.",
    "99": "How the Grinch Stole Christmas is a great movie with a well written storyline and a good cast.It certainly made a few mistakes with adapting the classic Dr. Seuss book in to a live action movie,there are just certain elements to it that certainly could have been improved upon.It is a film lots of people like to watch at Christmas,and while I'll admit it is a fun movie,it dosen't really put me in to the Christmas cheer the same way movies like Its a Wonderful Life or the Santa Claus do.However,Jim Carrey as the Grinch is certainly a highlight,he's completely unrecognisable in this make up,but the characters personality and mannerisms remind us that it really is him under all that.I remember reading a review by Roger Ebert a few years ago in which he said that this movie focused too much on the meanness of the Grinch,and I would have to agree that this was a problem as we are suppose to feel sympathy for him,but it's hard when all we are seeing is why he's a bad person and seeing very little moments of kindness.It certainly made a few mistakes,but How the Grinch Stole Christmas is still a fun movie that brings the creations of Dr. Seuss to life,and I would recommend it to a family looking for a nice Christmas movie. An evil creature living near the cheery town of Whoville plans to put a stop to Christmas once and for all. Best Performance: Jim Carrey Worst Performance: Molly Shannon",
    "100": "A big part of me hates this movie. It's overblown, the simplicity of the original story is smashed, and the look of the film is garish. They turned the Whos into smug materialists instead of the kind-hearted, wise folks who loved Christmas because it was a time of love and fellowship. Also, no one can replace Boris Karloff as the Grinch. Ever.Still, I cannot deny this film is a major guilty pleasure for me. Jim Carrey is over-the-top and ridiculous, but his overplaying makes me laugh (and I must admit, the make-up on him is fantastic). The disgusting-looking Whos are so terrible-looking, but that's hilarious too. Everything they could have got wrong went wrong, but it's done in such a stupid manner that it makes it kind of charming in a weird, surreal way.I wouldn't recommend it, but at the same time, if you want to do some MST3K for a holiday movie and got tired of Santa Claus Conquers the Martians, then this is the flick for you.",
    "101": "I've seen far many, many reviews of `Dr. Seuss' How the The Grinch Stole Christmas' in which critics can't resist the urge to write in rhyme, and every last one I've read irritates me.  Yet, as I sit to begin my review, I feel the uncontrollable urge to begin rhyming myself. I promise not to.I remember being excited to hear that there would be a live action version of `The Grinch' starring Jim Carrey, and I also remember being disturbed to hear that it would be directed by Ron `Opie' Howard.  I had hoping for an artistic genius such as Tim Burton or a holiday entertainment luminary like John Hughes.  Oddly, Opie pulled this one off.If you want to see a good, fun holiday movie, go see this one.  I'm not going to start comparing it to the classic animated `Grinch,' but I think it did a noteworthy job of giving some back story on the Grinch's character and a little history on the town of Whoville.It also attempted to answer some age old questions- most notably, `Where is Whoville?'  Well, the movie begins by showing, visually, that Whoville exists deep inside a tiny snowflake.  The only problem with this is that the rest of the film goes on to prove that Whoville is actually located in northern Minnesota.I've noticed that Jim Carrey is a lot more fun to watch when he talks like Jimmy Stweart on crack.  Honestly, I don't think anyone else could have pulled off such a classic character.  Carrey's Grinch could be the standard by which we measure all other bastardized Hollywood versions of cherished childhood memories.`The Grinch' is packed with Ron Howard's `in-jokes' and double entendres aimed at disillusioned Gen-Xers.  Seuss purists may find this distasteful, but honestly, why spend millions of dollars on a big-budget remake if you're just going to rehash the same material?Cindy Lou who had gigantic teeth and gigantic hair.  She also sang a nice little tune.  Let's move on.The film's talent award goes to the dog.  If anyone truly lived up to the persona given them in the original Seuss drawings, it was Max.  Some may argue that Carrey's performance was more admirable.  To those people, I say, `but the dog was cute and had an antler on his head for a good portion of the movie.  Did Jim Carrey even attempt this feat?  I think not.'Let's look at `The Grinch' by the numbers.  The props department provided 1,938 candy canes, 152,000 pounds of crushed marble (used for fake snow), 8,200 christmas tree ornaments, and no less than two million linear feet of styrofoam to build the city of Whoville itself.  Opie got the studio to go all out financially, and it shows.  The sets look like you'd expect Whoville to look.  Great stuff.`The Grinch' gets a `B+.'  It won't by any means replace its predecessor as a holiday classic, but you'll leave the theater feeling like a six-year old.",
    "102": "How some people seem not to like this movie is amazing.This movie for me shows Jim Carrey at his best, his acting as the Grinch was flawless, I actually believed that this man hates holidays.The movie is based on Dr. Seuss' How the Grinch Stole Christmas and to me is the best adaptation i have seen. The movie is the second highest-grossing holiday film of all time with $345,141,403 worldwide, only behind Home Alone. And it was a financial success, although critics seem not to like it.The movie is directed by Ron Howard who was responsible for Apollo 13 (1995), A Beautiful Mind (2001) and the Da Vinci Code (2006).Jim Carrey plays the Grinch, who develops a plot to steal Christmas and ruin the whole holiday for everyone.Every other cast in this movie were a little lost to me, but i didn't seem to care, the Grinch was it for me. He just made sure i had a good time.",
    "103": "BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM HONEST ABOUT THESE FILMS.The beloved book and animated special gets turned into a a mega budget movie directed by Ron Howard starring Jim Carrey. In this feature length film we get to see why \"The Grinch\" became \"the Grinch\". The film is packed with the right amount of laughs and heart. All the Whos down in Whoville enjoy celebrating Christmas with much happiness and joy, except the Grinch (Jim Carrey), who hatefully resents Christmas and the Whos with great wrath and occasionally pulls dangerous and harmful practical jokes on them. As a result, no one likes or cares for him. Meanwhile, six-year-old Cindy Lou (Taylor Momsen) believes everyone is missing the point about Christmas by being more concerned about the gifts and festivities. After her two brothers are harassed by the Grinch when they trespass on his domain, and she herself has a face-to-face encounter with the Grinch at the Post office, in which he saves her life, Cindy Lou becomes interested in his history; she asks everyone what they know about him, and soon discovers that he has a tragic past.The Grinch actually arrived in Whoville by mistake when he was a baby, and was adopted by two elderly sisters. Although he showed some sadistic tendencies as a child, he was rather timid and not the cruel, selfish person he would become. He was bullied by his classmates (particularly by Augustus May Who (Jeffrey Tambor), who grew up to be Mayor of Whoville) because of his appearance, with the exception of Martha May Whovier (Christine Baranski), who was courted by both the Grinch and May Who. One Christmas season when he was eight, the Grinch made a gift for Martha, but attempted to shave his face after being made fun of for having a \"beard\", cutting himself by accident. When his classmates saw his face covered with shaving tape the next morning, they ridiculed him yet again. He lost his temper, went on a rampage and ran away to live on a mountain to the north of Whoville, Mount Crumpit.The one scene that should of been cut is when the child sings \"Where are you Christmas?\". It stops the film. The song should of been sung over the closing credits.",
    "104": "A lot of money was spent in turning this Ron Howard production into a full-length feature with JIM CARREY as \"The Grinch,\" but I'll take the 1966 animated version any day over this overstuffed fantasy.The director obviously gave Carrey license to \"go for it\" with some moments of comedy enough to produce a few chuckles, but Carrey's lack of restraint reaches manic proportions before the film is half over and his sickly green and grotesque make-up is an unappetizing sight to behold in those huge close-ups. The film (at all times) strains too hard to be a quirky imitation of the original Dr. Seuss cartoon and is simply not up to the job. It's a mess. Furthermore, none of the supporting characters are more than mildly entertaining. TAYLOR MOMSEN is a lovely little girl but she can't sing and she substitutes a look of placid, wide-eyed wonder for acting while Carrey heats up the screen with his overacted mugging. CHRISTINE BARANSKI has a flair for comedy but she's been seen to much better advantage in other roles and looks more than mildly uncomfortable as the woman secretly in love with \"The Grinch.\" Actually, most of the time she looks as though she can barely tolerate looking at him.There's a perky background score, some over-luxurious sets, some ghastly looking costumes for the Whoville residents, and the overall feeling one gets is that the slim plot has been expanded to the point where it overstays its welcome. The over stuffing doesn't just apply to the sets and costumes and special effects. The script tries to set up a flashback of \"how\" the Grinch became what he is, but it has a dulling effect that only succeeds in slowing down the ponderous pace of the film's last hourThe script rightfully won a \"Razzie\" as worst of the year, so the blame can't be placed entirely on director or star. My advice: If you want to do justice to Dr. Seuss, do it with animation and not live actors.Summing up: Not a shred of charm. It's as if \"Opie\" meets Tim Burton.",
    "105": "This movie really reveals the meaning of Christmas by revealing what It is not about, which is materialism or gifts. By grabbing hold of and finding the strength of the very merry, holly and jolly Christmas, he saves everyone's Christmas instead of stealing or ruining it. They make his Christmas the best one so far, and he makes the Christmas their best ever. By watching this with my grandfather, it really brought out the Christmas spirit in me. It really, truly did. It made my Christmas. The music in this movie brought it up, if just a little. It was nice, it was indeed. I am giving it 6 or 7 stars out of a possible 10. I think I will give it 7, because it made my Christmas a bit better. Bon soir. Goodnight. Guten nacht. God natt. Buenos Noches. Peace & Love God Bless Shevy",
    "106": "I already loved \"How the Grinch Stole Christmas\" when it was released and I'm still loving it now, 5 years later. Still lots of people seem to disagree with my opinion and this movie never really had received much love at the time it came out.Sure, the movie is over-the-top and campy but that at the very same is also the reason why this movie is so charming and fun to watch. All of the sets, costumes and characters are done perfectly over-the-top in a fun way, without ever becoming truly ridicules. It's a visually spectacular movie to watch. It's a campy movie making at its very best! Director Ron Howard really surprises with this fun little Christmas movie.Main reason why the movie works and why it's so much fun to watch is Jim Carrey as the Grinch. He truly carries the movie with his good and fun role. He is of course helped by the convincing make-up, which also received an Academy Award. Of course if you're a Jim Carrey hater you shouldn't even think about watching this movie. This movie is really his movie and he makes it all work and so much fun to watch. Other fun and memorable roles are being played by Jeffrey Tambor, Clint Howard and Josh Ryan Evans as the young Grinch.The movie has a good morale but it is all a bit sappy to me. Perhaps it's because I'm Dutch and we don't really celebrate Christmas that enthusiastic and big here, as in the United States or England. For me the movie was simply fun and entertaining and the morale just left me quite cold to be honest.The musical score by James Horner is good and fun, even though it's your average every day Horner stuff, it still all works perfectly for the movie and helps to make some of the scene's work.Perfect Christmas entertainment.8/10http://bobafett1138.blogspot.com/",
    "107": "Ron Howard, who never met a story he couldn't screw up, takes the delightful holiday cartoon classic and turns it into something gormless, vulgar and awful. The cartoon used imaginative language and iconic animation to create its magical effect. Howard replaces all of that with gaudy art direction and stupid physical humour. The makeup effects are creepy, not cute; the Whovillians are anonymous drones -- and it doesn't help that they look like half pig/half human lab creations. Jim Carrey, who on paper seems like he would be perfect casting, overplays to the hilt, creating exactly the opposite effect to that inspired by the original droll creation of animator Chuck Jones and actor Boris Karloff. The only positive attribute Carrey could have brought to the film, that rubber face with which he could have created any number of comic moments, is buried underneath heaps of prosthetic makeup.This is a foul, terrible movie, and I can't believe that anyone could possibly like it. How it even rated a 5.6 here at IMDb is beyond me.Grade: F",
    "108": "This version of Grinch was a nasty feast I couldn't stand in the least.This full length high budget extravaganza really has little to offer beyond what the classic cartoon already did so well. Truly, the only good moments are those that are directly taken from the original story. The new material that is added here is simply a montage of misguided, mean-spirited, over-wrought highly intense noise; led by the master of hysterical yelling and screaming for no reason whatsoever, Jim Carry. No moral, no insight, no creativity, no entertainment value. We get some long-winded flap-trap about how mean the Whoville residents are to Grinch. How everybody else disturbed him emotionally etc. etc. ad infinitum, ad-nauseum. Be on the lookout also for subplots about some of the Who's, that are unnecessary, unfunny, and inappropriate. Christmas spirit does not exist in this movie (except in the portion that retreads the original story). Kids will be bored, adults will be annoyed. Any fan of Dr. Seuss's work will be offended.The actress playing Cindy Lou Who is about the only positive in this film. I realize she was a no more than two, and a nice character, but I kept hoping she'd push the Grinch off a cliff and mercifully end this disaster.Your heart will not grow three sizes the day you watch this. Stick with the classic cartoon.",
    "109": "Jim Carrey plays the famous Grinch, this sounds promising! Anthony Hopkins is the narrator..and Ron Howard the director, oh yeah, a nice Christmas movie this has to be! It's very idyllic, it's very charming, it's very nice all over...the only problem is; the moral actually! The Christmas moral with the Who people gets a bit too much, I don't know..it gets too much baby stuff, sorry to say it but..well, it is a pity. Jim Carrey does his performance as the Grinch beautiful, very nice! He shimmers him so...evil in a good way..so..very good actually! Very good! But..Carrey should have breaken threw and done this to a pure comedy with many laughs instead of just some laughs. To put it this way; the movie is very entertaining and nice with Carrey on the screen, but instead of that it's just okay. Mr. Grinch he is called...look, well..the movie doesn't entertain that much when it is more about Christmas spirit and taking care, than a lovely Grinch grinning and sniffing like a angry dog or something. If you haven't seen the movie, it's okay, but: The Grinch is a very Christmas coosy movie..and it's very worthy to see! But don't expect a ordinary Carrey hilarious movie. STARS: **** 4/5",
    "110": "I've seen far many, many reviews of `Dr. Seuss' How the The Grinch Stole Christmas' in which critics can't resist the urge to write in rhyme, and every last one I've read irritates me.  Yet, as I sit to begin my review, I feel the uncontrollable urge to begin rhyming myself. I promise not to.I remember being excited to hear that there would be a live action version of `The Grinch' starring Jim Carrey, and I also remember being disturbed to hear that it would be directed by Ron `Opie' Howard.  I had hoping for an artistic genius such as Tim Burton or a holiday entertainment luminary like John Hughes.  Oddly, Opie pulled this one off.If you want to see a good, fun holiday movie, go see this one.  I'm not going to start comparing it to the classic animated `Grinch,' but I think it did a noteworthy job of giving some back story on the Grinch's character and a little history on the town of Whoville.It also attempted to answer some age old questions- most notably, `Where is Whoville?'  Well, the movie begins by showing, visually, that Whoville exists deep inside a tiny snowflake.  The only problem with this is that the rest of the film goes on to prove that Whoville is actually located in northern Minnesota.I've noticed that Jim Carrey is a lot more fun to watch when he talks like Jimmy Stweart on crack.  Honestly, I don't think anyone else could have pulled off such a classic character.  Carrey's Grinch could be the standard by which we measure all other bastardized Hollywood versions of cherished childhood memories.`The Grinch' is packed with Ron Howard's `in-jokes' and double entendres aimed at disillusioned Gen-Xers.  Seuss purists may find this distasteful, but honestly, why spend millions of dollars on a big-budget remake if you're just going to rehash the same material?Cindy Lou who had gigantic teeth and gigantic hair.  She also sang a nice little tune.  Let's move on.The film's talent award goes to the dog.  If anyone truly lived up to the persona given them in the original Seuss drawings, it was Max.  Some may argue that Carrey's performance was more admirable.  To those people, I say, `but the dog was cute and had an antler on his head for a good portion of the movie.  Did Jim Carrey even attempt this feat?  I think not.'Let's look at `The Grinch' by the numbers.  The props department provided 1,938 candy canes, 152,000 pounds of crushed marble (used for fake snow), 8,200 christmas tree ornaments, and no less than two million linear feet of styrofoam to build the city of Whoville itself.  Opie got the studio to go all out financially, and it shows.  The sets look like you'd expect Whoville to look.  Great stuff.`The Grinch' gets a `B+.'  It won't by any means replace its predecessor as a holiday classic, but you'll leave the theater feeling like a six-year old.",
    "111": "How some people seem not to like this movie is amazing.This movie for me shows Jim Carrey at his best, his acting as the Grinch was flawless, I actually believed that this man hates holidays.The movie is based on Dr. Seuss' How the Grinch Stole Christmas and to me is the best adaptation i have seen. The movie is the second highest-grossing holiday film of all time with $345,141,403 worldwide, only behind Home Alone. And it was a financial success, although critics seem not to like it.The movie is directed by Ron Howard who was responsible for Apollo 13 (1995), A Beautiful Mind (2001) and the Da Vinci Code (2006).Jim Carrey plays the Grinch, who develops a plot to steal Christmas and ruin the whole holiday for everyone.Every other cast in this movie were a little lost to me, but i didn't seem to care, the Grinch was it for me. He just made sure i had a good time.",
    "112": "BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM HONEST ABOUT THESE FILMS.The beloved book and animated special gets turned into a a mega budget movie directed by Ron Howard starring Jim Carrey. In this feature length film we get to see why \"The Grinch\" became \"the Grinch\". The film is packed with the right amount of laughs and heart. All the Whos down in Whoville enjoy celebrating Christmas with much happiness and joy, except the Grinch (Jim Carrey), who hatefully resents Christmas and the Whos with great wrath and occasionally pulls dangerous and harmful practical jokes on them. As a result, no one likes or cares for him. Meanwhile, six-year-old Cindy Lou (Taylor Momsen) believes everyone is missing the point about Christmas by being more concerned about the gifts and festivities. After her two brothers are harassed by the Grinch when they trespass on his domain, and she herself has a face-to-face encounter with the Grinch at the Post office, in which he saves her life, Cindy Lou becomes interested in his history; she asks everyone what they know about him, and soon discovers that he has a tragic past.The Grinch actually arrived in Whoville by mistake when he was a baby, and was adopted by two elderly sisters. Although he showed some sadistic tendencies as a child, he was rather timid and not the cruel, selfish person he would become. He was bullied by his classmates (particularly by Augustus May Who (Jeffrey Tambor), who grew up to be Mayor of Whoville) because of his appearance, with the exception of Martha May Whovier (Christine Baranski), who was courted by both the Grinch and May Who. One Christmas season when he was eight, the Grinch made a gift for Martha, but attempted to shave his face after being made fun of for having a \"beard\", cutting himself by accident. When his classmates saw his face covered with shaving tape the next morning, they ridiculed him yet again. He lost his temper, went on a rampage and ran away to live on a mountain to the north of Whoville, Mount Crumpit.The one scene that should of been cut is when the child sings \"Where are you Christmas?\". It stops the film. The song should of been sung over the closing credits.",
    "113": "A lot of money was spent in turning this Ron Howard production into a full-length feature with JIM CARREY as \"The Grinch,\" but I'll take the 1966 animated version any day over this overstuffed fantasy.The director obviously gave Carrey license to \"go for it\" with some moments of comedy enough to produce a few chuckles, but Carrey's lack of restraint reaches manic proportions before the film is half over and his sickly green and grotesque make-up is an unappetizing sight to behold in those huge close-ups. The film (at all times) strains too hard to be a quirky imitation of the original Dr. Seuss cartoon and is simply not up to the job. It's a mess. Furthermore, none of the supporting characters are more than mildly entertaining. TAYLOR MOMSEN is a lovely little girl but she can't sing and she substitutes a look of placid, wide-eyed wonder for acting while Carrey heats up the screen with his overacted mugging. CHRISTINE BARANSKI has a flair for comedy but she's been seen to much better advantage in other roles and looks more than mildly uncomfortable as the woman secretly in love with \"The Grinch.\" Actually, most of the time she looks as though she can barely tolerate looking at him.There's a perky background score, some over-luxurious sets, some ghastly looking costumes for the Whoville residents, and the overall feeling one gets is that the slim plot has been expanded to the point where it overstays its welcome. The over stuffing doesn't just apply to the sets and costumes and special effects. The script tries to set up a flashback of \"how\" the Grinch became what he is, but it has a dulling effect that only succeeds in slowing down the ponderous pace of the film's last hourThe script rightfully won a \"Razzie\" as worst of the year, so the blame can't be placed entirely on director or star. My advice: If you want to do justice to Dr. Seuss, do it with animation and not live actors.Summing up: Not a shred of charm. It's as if \"Opie\" meets Tim Burton.",
    "114": "This movie really reveals the meaning of Christmas by revealing what It is not about, which is materialism or gifts. By grabbing hold of and finding the strength of the very merry, holly and jolly Christmas, he saves everyone's Christmas instead of stealing or ruining it. They make his Christmas the best one so far, and he makes the Christmas their best ever. By watching this with my grandfather, it really brought out the Christmas spirit in me. It really, truly did. It made my Christmas. The music in this movie brought it up, if just a little. It was nice, it was indeed. I am giving it 6 or 7 stars out of a possible 10. I think I will give it 7, because it made my Christmas a bit better. Bon soir. Goodnight. Guten nacht. God natt. Buenos Noches. Peace & Love God Bless Shevy",
    "115": "I already loved \"How the Grinch Stole Christmas\" when it was released and I'm still loving it now, 5 years later. Still lots of people seem to disagree with my opinion and this movie never really had received much love at the time it came out.Sure, the movie is over-the-top and campy but that at the very same is also the reason why this movie is so charming and fun to watch. All of the sets, costumes and characters are done perfectly over-the-top in a fun way, without ever becoming truly ridicules. It's a visually spectacular movie to watch. It's a campy movie making at its very best! Director Ron Howard really surprises with this fun little Christmas movie.Main reason why the movie works and why it's so much fun to watch is Jim Carrey as the Grinch. He truly carries the movie with his good and fun role. He is of course helped by the convincing make-up, which also received an Academy Award. Of course if you're a Jim Carrey hater you shouldn't even think about watching this movie. This movie is really his movie and he makes it all work and so much fun to watch. Other fun and memorable roles are being played by Jeffrey Tambor, Clint Howard and Josh Ryan Evans as the young Grinch.The movie has a good morale but it is all a bit sappy to me. Perhaps it's because I'm Dutch and we don't really celebrate Christmas that enthusiastic and big here, as in the United States or England. For me the movie was simply fun and entertaining and the morale just left me quite cold to be honest.The musical score by James Horner is good and fun, even though it's your average every day Horner stuff, it still all works perfectly for the movie and helps to make some of the scene's work.Perfect Christmas entertainment.8/10http://bobafett1138.blogspot.com/",
    "116": "Ron Howard, who never met a story he couldn't screw up, takes the delightful holiday cartoon classic and turns it into something gormless, vulgar and awful. The cartoon used imaginative language and iconic animation to create its magical effect. Howard replaces all of that with gaudy art direction and stupid physical humour. The makeup effects are creepy, not cute; the Whovillians are anonymous drones -- and it doesn't help that they look like half pig/half human lab creations. Jim Carrey, who on paper seems like he would be perfect casting, overplays to the hilt, creating exactly the opposite effect to that inspired by the original droll creation of animator Chuck Jones and actor Boris Karloff. The only positive attribute Carrey could have brought to the film, that rubber face with which he could have created any number of comic moments, is buried underneath heaps of prosthetic makeup.This is a foul, terrible movie, and I can't believe that anyone could possibly like it. How it even rated a 5.6 here at IMDb is beyond me.Grade: F",
    "117": "This version of Grinch was a nasty feast I couldn't stand in the least.This full length high budget extravaganza really has little to offer beyond what the classic cartoon already did so well. Truly, the only good moments are those that are directly taken from the original story. The new material that is added here is simply a montage of misguided, mean-spirited, over-wrought highly intense noise; led by the master of hysterical yelling and screaming for no reason whatsoever, Jim Carry. No moral, no insight, no creativity, no entertainment value. We get some long-winded flap-trap about how mean the Whoville residents are to Grinch. How everybody else disturbed him emotionally etc. etc. ad infinitum, ad-nauseum. Be on the lookout also for subplots about some of the Who's, that are unnecessary, unfunny, and inappropriate. Christmas spirit does not exist in this movie (except in the portion that retreads the original story). Kids will be bored, adults will be annoyed. Any fan of Dr. Seuss's work will be offended.The actress playing Cindy Lou Who is about the only positive in this film. I realize she was a no more than two, and a nice character, but I kept hoping she'd push the Grinch off a cliff and mercifully end this disaster.Your heart will not grow three sizes the day you watch this. Stick with the classic cartoon.",
    "118": "Jim Carrey plays the famous Grinch, this sounds promising! Anthony Hopkins is the narrator..and Ron Howard the director, oh yeah, a nice Christmas movie this has to be! It's very idyllic, it's very charming, it's very nice all over...the only problem is; the moral actually! The Christmas moral with the Who people gets a bit too much, I don't know..it gets too much baby stuff, sorry to say it but..well, it is a pity. Jim Carrey does his performance as the Grinch beautiful, very nice! He shimmers him so...evil in a good way..so..very good actually! Very good! But..Carrey should have breaken threw and done this to a pure comedy with many laughs instead of just some laughs. To put it this way; the movie is very entertaining and nice with Carrey on the screen, but instead of that it's just okay. Mr. Grinch he is called...look, well..the movie doesn't entertain that much when it is more about Christmas spirit and taking care, than a lovely Grinch grinning and sniffing like a angry dog or something. If you haven't seen the movie, it's okay, but: The Grinch is a very Christmas coosy movie..and it's very worthy to see! But don't expect a ordinary Carrey hilarious movie. STARS: **** 4/5",
    "119": "Despite the misgivings one may initially have about Hollywood turning the still-satisfying animated TV special from Dr. Seuss' book into a big-budget live-action feature, fear not over the look of the piece. Director Ron Howard and his artists have really captured the visual essence of the classic show, and one couldn't possibly hope for a better-looking movie based upon a Seuss story. Jim Carrey is marvelously cast as the Grinch, a green, furry, Christmas-hating malcontent who lives atop a snowy hill overlooking Whoville, although the inhabitants of Whoville present a problem. With make-up designs causing everyone to resemble relatives of Wallace Shawn, distinctive (or likable) personalities were apparently difficult to come by. In expanding this whole scenario, screenwriters Jeffrey Price and Peter S. Seaman were unable to retain the angelic (some may argue, cloying) passivity in Whoville. We now get a Mayor who's a self-serving jerk, a Christmas lights contest between neighbors, and children who laugh and jeer at a moppet version of the Grinch in a very odd flashback sequence. Howard's attentions as a filmmaker begin to wander after a promising opening; he becomes exhausted by the material itself--the bombast wears him out--perhaps causing a few of his quieter moments to flag (particularly an awful sequence with Carrey having fun with his echo, later munching on shattered glass). Bits and pieces work crazy magic, though Howard is no Tim Burton and doesn't always grasp the deliciousness in the macabre undermining (he's too anxious to be funny). Anthony Hopkins narrates in commendable fashion, and there are some marvelous scenes, but interest for adults should wane after the first hour. ** from ****",
    "120": "Director Ron Howard usually makes wonderful films; 'Apollo 13', 'A Beautiful Mind', and I even liked 'Willow'. But he seems to have taken an off day for the big-budget Dr. Seuss adaptation 'How The Grinch Stole Christmas'. 'Grinch' is a mess, drowned in special effects and gaudy production design, and it completely misses the point of the original story.Howard does something here I would never have thought possible: He makes Jim Carrey unfunny. I am not kidding. Carrey is just NOT FUNNY. Oh, he gives it his all, milking every joke 'til it's dry, but his performance, I am unhappy to report, falls flat. It's truly depressing to see a great comic actor in a spectacularly bad role.The overcompensating script by 'Roger Rabbit' authors Jeffrey Price and Peter Seaman doesn't help matters. It tries to 'explain' the Grinch's antisocial behavior. I admire the effort, but that's just not a good idea. The movie does have one good thing in it: Taylor Momsen, who steals the show as Cindy Lou Who. Momsen is the only actor in the movie who understands what she's doing.Howard piles on the sap in the final act, and I groaned more than once during those last 10 minutes. Ron Howard: What happened, man? 'How The Grinch Stole Christmas' is a disaster.",
    "121": "How the Grinch Stole Christmas is based on both the book and the short cartoon under the same name, by the author named Dr Seuss. Now If anyone who either read the book or watch the cartoon you'll know that both of them are completely under 1 hour, you can easily go through the story from beginning to the end around under 30 minutes, But how can an hour and 44 minute film do both the book and cartoon justice? (Spoiler: It doesn't)The jokes are both unfunny and awkward, the town known as Whoville looks cloudy and feels like the colors are muted almost if the camera lens has been wiped down by vaseline, the Whos looks weird and are competitive about Christmas and while the rest of the characters are uninteresting; Jim Carrey I can give him some credit for adding energy while wearing green latex, but for performance he's annoying.Overall I felt the movie was disimproving not only the book, but to the cartoon also, it felt unnecessary to add extra time to a simple short story that didn't have to be shown on a silver screen and that's why I consider the cartoon to be better.",
    "122": "I've been suckered in to giving this film another try several times over the years and it just gets worse every time. Very boring and slow. Always feels much longer than it actually is.Visually, they were trying to do a Tim Burton thing and it just didn't work.It's not sweet. It's not funny. It's just weird and forgetful. Nothing charming about it.On a side note: My brother actually went to an early screening of this with his girlfriend where Ron Howard surprised the audience and came out at the end and talked about the film. It wasn't quite finished at that point. But I remember distinctly my brother saying the film was surprisingly boring. He kind of laughed to himself when describing how dumb it was.I didn't believe him at first because Ron Howard is a great filmmaker and Jim Carrey was one of my favorite actors at the time. But as soon as I watched it, I realized he was totally right.",
    "123": "A loud, chaotic, unrealistic book adaption that I only got through because I was reading something at the same time.  Only seven minutes in do I realize that this is going to be a long morning.  Noisy, unreal scenes abound the first 20 minutes, with \"people\" (or whatever the \"Whos\" were) running about town, practically throwing their money at a store clerk and dashing off, then people crowding a post office counter in hyperspeed yelling for assistance.  Then the introduction of Carrey, the title green geek who's constantly contorting his mouth and inflecting a Sean Connery like accent. You thought Carrey mugged in other films?  Oh, man, look out here. Twisting, turning, dancing, putting emphasis on meaningless dialogue.  Which is another glaring issue.  How could you not take classic lines from a book and make a good movie?  Cuz writers Price and Seaman have severely altered the original story, and left only a few bits from the book for Anthony Hopkins to narrate.  The new material just isn't funny or interesting, and the characters too cartoonish to enjoy.  The singing interludes are painful as well.  Plus the Grinch is pretty sinister.  Who knows why any kid would go for this.  Everything was put into production design and making the Grinch as depressing a villian as possible.  I'd bet there are portions that would probably scare kids, especially the moment where a little girl is trapped in a machine which is about to squash her with a packing lable. Released during the key Thanksgiving thru Christmas period helped it make $259 million bucks.  But I was glad to see the budget was $123 million so their gross wasn't as great as it could've been.",
    "124": "Always loved this movie since the first time I saw it, and every time it's aired on TV during the Christmas period I can't resist the temptation of re-watching it. And it's always great as the first time? Yes. But since there are yet so many reviews and everything about this movie had been yet said I'll be short.HOW THE GRINCH STOLE CHRISTMAS has many great elements for a Christmas comedy: the sets, the soundtrack, and the humour. I have to agree with some that say that this film is a bit too crude for kids, but btw it's a great and funny romp especially since the Grinch (an unrecognisable Jim Carrey in green outfit) appears. He is the best character in the whole movie, and most of his jokes were hysterical. And, if you think that this is the worst Dr. Seuss adaptation, well I am sure you haven't seen THE CAT IN THE HAT with Mike Myers yet! And Carrey is perfect for the role of the Grinch, not like Mike Myers as the Cat, and Anthony Hopkins does a great job as the narrator.However, this movie has many great moments that I strongly recommend it to watch it, especially during the Christmas season!",
    "125": "I agree completely, this film looks extremely overblown, and it is.Though the sets and costumes are visually amazing, they go by too fast too be truly appreciated, and there is the feeling that it is too much crammed into too little.  Besides this, the supporting cast have very little to do, and the presence of Anthony Hopkins as the narrator is rather puzzling.  Besides that, several weak story points are added, for instance, like the romance between the Grinch and Martha May seems completely superfluous.  However, if you want to see this movie, see for Jim Carrey, who steals the show as the title role.  He is simply hilarious!  He does, however, run a close race against Cindy Lou Who, who is unbelievably cute.The difference between this movie, and the cartoon, is that this movie is set more from the point of view of the Grinch.  In the cartoon, the Grinch is the villain, a grumpy old hermit who is jealous of the Whos and their happiness.  The Whos, in the cartoon, are just simple, country townsfolk celebrating Christmas, and when the Grinch finds he cannot destroy Christmas, he knows he cannot make them suffer the absence he feels in his life, and finally understands the holiday spirit. In the movie, however, the Grinch is a slightly more modern take on his character.  Actually, you can't blame him for wanting to do something about the Whos, who, in this movie, are a grim reflection of our society, and the crass consumerism and capitalism that yearly chokes the true meaning of the holiday spirit for material possessions.  The Whos are so immersed in their own greed that it almost seems they deserve it when the Grinch drops the ball on them.  The writers also make them seem as irritating and overly cheerful and loud as possible, with their gaudy decorations and foods, and creepy, sugar-coated style.  Cindy Lou's reaction to this is our own, and she and the Grinch find the real meaning of the holiday.  She and the Grinch are better seen as role models to today's holiday company, as a message not to lose ourselves in our own material greed that has become common to this holiday, but to instead remember what Christmas is.  I think this holiday would get a much better reputation if people made it a routine to imagine a Christmas without presents or trimmings every year, just to keep that image in mind.  But, if you don't want to be annoyed by the Whos, or blinded by the slightly overdone sets and costumes, watch it for Cindy Lou, or, if you don't like 'cute' movies like me, but like Jim Carrey's raunchy, slapstick, Marx Bros. style comedy, watch it for him.",
    "126": "How the Grinch Stole Christmas was not enjoyable, in the slightest. I know that for many, this film is a Christmas tradition and something they love. But seeing it for the first time now, I just wasn't able to find anything to like about it.The biggest problem is the type of humour that this film relies on. Although this is a completely personal problem, it doesn't change the fact that I didn't laugh once during this film. Or maybe I'm just a Grinch. The quippy one-liners might work on the youngest of the family, but they did absolutely nothing for me. And while there are a surprising number of jokes directly aimed at adults, they fell just as flat as everything else. I'm sure that if I had seen this film for the first time as a kid, I would've probably liked it much more. And I'm also sure that kids seeing it for the first time now will really like it. The music is great, and the set design and attention to detail are genuinely impressive. But when the character on the poster ends up being the most annoying thing about the movie, it's impossible for me to like it.That brings me to the characters and the other problem I had with How the Grinch Stole Christmas. When the most likeable and relatable character is a dog, I think that something is off. Max, Grinch's dog, is wonderful, and easily the best part of this movie. Cindy, played by Taylor Momsen, isn't half bad either. Unfortunately, every other character was either annoying or had such a small part that it didn't matter. And as I said, when the main character, whose name this movie carries, is the most annoying part, there's really not much that the movie can do. Again, this is nothing but a personal problem, and as such, it's no wonder that so many people do like this film. I don't think that the writing is that bad either. The type of humour that this film so heavily relies on, unfortunately, isn't the type of humour that I like.I did, however, appreciate the strong stance that this film took against the over consumerism of Christmas. It's evidently clear from the very beginning that Whoville has turned into the capitalistic dream of Christmas. And as we follow Cindy's fight against this ideal, and her attempts to make Christmas what it once was, we have to ask ourselves whether we have fallen into the same formula as Whoville. Most Christmas movies tend to focus on simply making us remember that Christmas isn't just about gifts. How the Grinch Stole Christmas, alternatively, pronounces gifts basically as the root of all evil. As the reason, the Grinch became who he is.Although How the Grinch Stole Christmas has a good heart and an important message, I couldn't bring myself to enjoying it. When a comedy fails to make you laugh, even once, there is something wrong. And while I'm at least partly to blame for that, there wasn't much else to like either. Max was awesome, but that's about it.",
    "127": "Who doesn't love The Grinch? He's just as grumpy as Scrooge but a lot more lovable. I believe Dr. Seuss himself would be pleased with this rendition of his beloved tale.Th sets, props, costumes, hair styles, cinematography, that Grinch costume and Max were all simply terrific! This is the book and animation in a near perfect live action film.Jim Carrey played this role so well - Who am I kidding, everyone in this film was great! Even the animal actor playing Max was spot on.If you haven't watched Jim Carrey's Grinch then you are missing out because he was made to play this part. Best Carrey film ever!A holiday classic that will never go out of style - suitable for the whole family.10/10.",
    "128": "It's wild to think this all takes place on a snowflake. I wonder if our universe exists on a snowflake, surrounded by infinite variations of the same basic atoms in the great blizzard of the cosmos, kind of like those marbles in 'Men In Black (1997)'. That's a pretty good metaphor for the multiverse theory, actually. Is 'How The Grinch Stole Christmas (2000)' really that deep? No. No, it's not. It is surprisingly entertaining, though, and is actually quite a bit better than I remember it being. You've got to give props to the make-up department for delivering some truly seamless transformations, effortlessly twisting the recognisable faces of its cast into the somewhat disconcerting visages of the Whos. The most impressive of these effects is, of course, the chubby, hairy, green and scary Grinch suit, which covers Jim Carey head to toe. The process of applying the makeup was apparently so unbearable that the actor had to learn torture-resistance techniques from an ex-CIA agent. It's an astonishing feat of special effects wizardry, though it's arguably only as successful as it is thanks to the perfect merging between silicon and star. Jim Carey's rubber-faced buffoonery is evident even though not an inch of him is technically seen on screen, with both his body language and stronger-than-usual facial muscles carving a performance out of the metaphorical - and, almost, literal - clay it could so easily have been buried by. He's the main reason that the movie works as well as it does - in addition to the adorable Max (played by a wonderfully subdued Kelley), who must be protected at all costs. Carey chews the scenery, as well as pretty much everything else, like a rabid dog, consistently playing at eleven and never looking as though he's even close to breaking a sweat. The clumsy screenplay, lax pacing and occasional piece of out-of-place raunchiness are all outperformed by the core character's surprisingly enjoyable grumbling and growling. Yet, the piece's somewhat strange tone, fever-dream visuals and stretched-out nature (it should have been ninety minutes at the absolute most) do reduce its effectiveness. It's kind of like a proto 'The Cat In The Hat (2003)' or 'Son Of The Mask (2005)' in its almost upsetting, neon-inflicted surrealism. However, it's notably better than those subsequent pictures. It's a solid slice of Yuletide entertainment that serves as an apt adaptation of Dr. Seuss' source material.",
    "129": "Review:\n'How the Grinch Stole Christmas' is a Christmas comedy-drama film directed by Ron Howard. It is based on Dr. Seuss's 1957 book of the same name.\nJim Carrey as a Dr. Seuss character is crazy. I mean that in the best way. I loved how he became The Grinch. The cartoon is still far superior, but this is an okay movie. You just can't compare the two.\nInside a snowflake exists the magical land of Whoville. In Whoville, live the Whos, an almost mutated sort of Munchkin-like people. All the Whos love Christmas, yet just outside of their beloved Whoville lives the Grinch (Jim Carrey). The Grinch is a nasty creature that hates Christmas, and plots to steal it away from the Whos, whom he equally abhors. Yet a small child, Cindy Lou Who (Taylor Momsen), decides to try befriending the Grinch.\nBut I say, The Grinch is really good, it's something I grew up with, and watch every Christmas today. The Grinch is a good character, all the Who's are creepy looking, you're better off skipping the Whos' scenes and just watching Jim Carrey perform.\nThis movie had about 70 extra minutes to tell the Grinch's story and yet, somehow, they didn't succeed in making the sentimental parts of the movie work for me. I get it, a Christmas movie needs to have a happy ending where everyone celebrates the true meaning of Christmas, spending time with the people you love. I've seen it all before and I will hear it again, I just think that a movie needs more than that to work. You can't just travel the road of Christmas trope after Christmas trope and hope that that's going to get you a good movie, because it's not. This movie, however, is not that. It is exactly what you would expect, but it's not as good as you might want it to be.\nHowever, this movie is not as bad as what I first believed it to be, or what most of the population believes it to be. It's a retelling and reimagining of a story, so you can't expect a new masterpiece.\nOverall, this movie is perfect to get your family around for the holidays. Jim Carrey's performance is fantastically over the top and funny. It's not original even though they had plenty of extra story to tell, but they had fun in little scenes they did have.\n3/5",
    "130": "The Review: Big budget remake of the beloved Dr. Seuss cartoon about a grumpy green creature intent on sabotaging Christmas by stealing it from the unsuspecting, kindhearted townsfolk below.I'm going to take a quote from one user's post:This is a very good film. Better than the animated original.With all due respect to that reviewer, I'm going to put a variation to that quote:This is a very bad film. Completely inferior to the animated original.For me, the animated Grinch special was a special part of my childhood, and yes I proudly count myself amongst the diehard loyalists who border on the word \"nerd\", that had a genuine dislike for this movie. Granted, it really is difficult to take a cartoon and spin it into an hour and a half feature, but the way this film is shot, is completely obnoxious in every sense of the word. You get the feeling that Carrey and Howard weren't proud of this film as it caused them to betray their artistic sensibilities in favor of a really big paycheck. \"The Grinch\" is a far inferior live action remake/adaptation of the beloved Dr. Seuss character where it's lead character is an obnoxious buffoon, it's Jim Carrey in green makeup. Jim Carrey living up to his persona of being Ace Ventura. Don't get me wrong, I'm a big fan of Carrey, but I can honestly say I despised this movie 100%. \"The Grinch\" is a movie that feels genuinely fake, where you can't take yourself away into imagination and fantasy because all you really see on screen is just a bunch of movie sets and some makeup, there's no connection to the material that makes it feel like the cartoon. It's baseless commercial dreck that was only a bore.",
    "131": "I think that anyone who has even just a shred of common sense would see that making a live action AND feature length version of Dr. Seuss' \"How The Grinch Stole Christmas\" is asking for trouble. To begin with, just look at how this movie looks visually. Now, they could have managed to pull off the visual look - the movie \"The 5000 Fingers Of Dr. T\" managed to have live action Seuss-like visuals that worked. But in THIS movie, it looks horrible. It looks artificial, way overproduced, and to make matters worse the green and pink lighting makes it look even uglier than it was originally.Maybe if they had made this a 100% computer animated movie, they could have pulled off the visual look... but there would still be a bunch of problems, mainly with the script. The Whos, except for Cindy Lou, are a bunch of cold-hearted ugly-looking creeps - you'll actually wish that the Grinch succeed in his plans to ruin their Christmas. The story moves at a snail's pace, due to the writers feeling they had to put in a lot of back story. Further evidence of the writers' desperation is that they take several elements of the 1960s Chuck Jones' version of the tale and replicate them here.Carey tries - he is pretty enthusiastic in his performance - but even he becomes quickly exhausting to witness. But he's not to blame here - blame the director and the writers for shoving him and the rest of the movie down our throats.",
    "132": "The 1966 cartoon special \"How The Grinch Stole Christmas,\" co-directed by recently deceased animation pioneer Chuck Jones, has stood the test of time for over thirty years. It's a freewheeling masterpiece about the eponymous yuletide-hating green monster (voiced flawlessly by Boris Karloff), who is so mean and grouchy and so lovable at the same time. He had no complicated reason for his disposition, and there were no forced morals woven into the plot. Sure, he changed his ways in the end, but it wasn't shoved in our faces. It was, and still is, just plain fun. And who didn't sympathize with his loyal yet long-suffering dog, Max? On the flipside, this inevitable live version, directed by Ron Howard, does one hell of a disservice to Dr. Seuss's story. Where do we begin? The weak, preachy script reeks of modern-day political correctness. The sets are poorly designed and claustrophobic. The supporting characters are meaningless. There's even a (gasp!) love interest. And yes, there is dialogue about how Christmas \"doesn't come from a store.\" (Meanwhile, the movie opens to all of Whoville in the midst of a collective shopping spree. Hmm.) The convoluted screenplay was written by Jeffrey Price and Peter S. Seaman, who both penned the still-unrivaled \"Who Framed Roger Rabbit.\"Here, the Grinch (Jim Carrey) is a maligned and misunderstood recluse. The film explains his nasty nature in a very unpleasant and utterly pointless flashback scene, in which he throws a temper tantrum as he is teased by his classmates. The role of Cindy Lou Who (Taylor Momsen, in her film debut) is expanded simply because there has to be the obligatory lone character who sees good in the crabby Grinch. Speaking of seeing, some cartoons were not meant to be seen as live versions (this spelled the downfall of the two \"Flintstones\" films). With all due respect to Carrey's painstaking effort, which included three-hour sessions in the makeup chair, that company definitely includes the Grinch. Think what a live movie starring Bugs Bunny would look like, then immediately clear that sacrilegious thought from your mind.The movie is three times longer than the cartoon, and it resulted in a lot of excess baggage, particularly Carrey's overbearing yet familiar slapstick routine, which was used in order to fill screen time and perhaps take the audience's attention away from the script deficiencies. Despite having a Golden Globe Award to his name, Carrey's film career is in danger of being remembered solely for such minutiae instead of his otherwise solid acting.\nBy now, you may have already surmised that I'm in favor of the animated classic. (On a side note, I saw the trailers for \"Grinch\" while watching another animated classic, \"Chicken Run.\") There's no gentle way to say it: this celluloid defecation is an insult to Dr. Seuss. I don't think I have to elaborate any further on that. Never mind the plot, the characters and the depressing atmosphere of Whoville; what viewers will find to be the most traumatizing scene in the entire film is seeing the Grinch in lederhosen. 3/10",
    "133": "Let me say that making this movie was an abomination to the meaning of the story, and, unless the quality was good enough to overcome such feelings, the people behind this project have their hearts two sizes two small.I hated this movie.  As much as I love Carrey (his one bad movie is Ace 2), this movie should have reigned him in just a little, and yet used his talents.  But, alas, Ron Howard couldn't say \"no\" to a superstar.  The movie then had the difficult job of stretching the small book into a feature length movie.  This is difficult, but it could have been done, maybe in musical style or some other way.The movie seemed to want to become a musical, but it didn't.  It had the \"i want to be a hit single,\" sung by Cindy Lou Who \"Where Are You Christmas?\" While I really liked the song, it was unnecessary, demeaning, commercialized, and insulting to my intelligence.  I think that the song should have been the intro to a musical version of The Grinch or something.Another thing that is bad is the whole new plots.  The actual book really doesn't start for an hour.  They spend almost an hour on WHOLE NEW MATERIAL. Once the actual story comes into play from the book, the movie is actually quite good, but before then, bleh.  First, they make the Whos greedy.  The Whos were never greedy.  They had lots of material items because they could, but they never embellished their happiness on them.  Their happiness came from their heart and from the Spirit of Christmas, not from anything else. Next, they gave The Grinch a traumatizing childhood.  I don't know if this was added as a response to the Columbine shootings, or if they just were trying to attract more groups, but it DIDN'T WORK.So, the movie's first hour sucked.  The movie also lasted too long.  It was TWENTY MINUTES LONGER than South Park.  It had less plot or storylines to keep it moving, and it dragged its feet and plodded along.  There was so much that could have been cut out, the childhood memories, the unnecessary chorus-leader thingy, etc.  CUT IT DOWN IF YOU HAVE NOTHING ELSE TO SAY PEOPLE.THE GOOD NEWS:  Ok, I guess that I liked Carrey acting like Carrey, to a point.  It just would have been so much more endearing in a different movie. The styles were fantastic, along with the devilishly cool camera-work. The whole movie is almost over stylized, but so were Dr. Seuss' books.  If anything, go see it for the sets, the angles, the hairstyles, the clothes, Carrey's make-up, etc.  Its the only reason to go to this waste of celluloid.2/10",
    "134": "I am totally embarrassed to have actually spent money to see this in the theater. With that said, I am shameful to admit having sat through it. Looks like I have nothing better to do at the moment than critique a movie most people have seen already. A horrible adaptation to the classic book I loved as a kid. It was Carrey mugging through the whole film. Carrey is a funny guy, but this was just overdone and lame. I got sick of his antics after 20 minutes. If they would have stuck within the limits of the book and done a half hour show it would have been better. Seeing stupid additional crap was blasphemy, who cares how the Grinch was as a kid. That stuff is better left unsaid. Why are people obsessed with having to know the entire background of a famous villain (Darth Vader, etc) rather than leave it in a shroud of mystery.The only thing that's worse than this movie is the soundtrack. Poorly made up songs with stupid lyrics. I wouldn't even let a 5-year old listen to it for fear of corrupting the poor child with stupidity. Stick to the cartoon and book, which are timeless classics.Most kids love this movie (do they know any better? They also love today's sorry cartoons) most adults and anyone with a full developed brain will hate it. I liken it to sitting in a room for 2 hours with Jar Jar Binks. You'd feel like strangling Carrey's Grinch!",
    "135": "Ron Howard's take on The Grinch Who Stole Christmas is a thoroughly uneven, much too dark, and often violent film that stumbles a fine line between cartoonish children's film and dark, adult comedy.Plot synopsis is unnecessary, because the story is extremely well known and the title says it all: a Grinch steals Christmas, only in true Hollywood fashion, the tale is trumped up with millions of dollars in special effects and elaborate production design, adding nothing to the story.  As the Grinch, Jim Carrey gives it his best, but he is hampered by unfunny lines and Ron Howard's stiff direction.The first half hour of the film lacks any magic or laughs; Howard doesn't seem to know how to unfold the story and instead relies on the twisted scenery and often grotesque makeup of Whoville and the Who's to give a sense of an imaginative film.  The set design seems more nightmarish than cartoonish however, and could easily have been pulled out of a Tim Burton film: curved, dark, twisted, and sparsely lit.  It just does not fit. Equally out of place are scenes of the Grinch chewing glass, popping a red hot screw in his mouth, and engaging in drunken driving.  At one point I was expecting to see Carrey actually murder one of the Whos in a blood bath.Then there's the little girl who portrays Cindy Lou Who, Taylor Momsen.  She delivers her lines as if she's acting in a school play: example: *in whiny voice* \"But Christmas is blah blah...blah blah blah...*  Haley Joel Osment she ain't.  SNL's Shannon and the always sharp and fabulous Baranksi are both wasted as two women who appear to be engaged in a bitter rivalry. After their first scene together, however, this apparent subplot goes nowhere.The Grinch is mired in scenes of grotesqueness and a truly nightmarish set design.  Ron Howard's inept handling of the classic Seuss tale can't even be saved by a tremendously make-upped Jim Carrey.  There are few inspired laughs, special effects to cover up the gaping holes in its pacing, and two very forgettable songs written probably to push the CD soundtrack.  It's a heartless treatment, and call me a Grinch, but the spirit of Christmas is dead in this heap.3 out of 10",
    "136": "This movie, which was painful to view especially with my 7 year old present, totally destroyed the spirit of Dr. Seuss.  In his book the Grinch was a Grumpy old person who just wanted in the end that the people like him.  In this dark comedy we get a vicious beast that tries to kill a little girl without a thought.   The same beast is sought after by a sex craved woman.The director tried to rip off the Munchkin Land (a la Wizard of Oz) look of the town and does a real poor job of it.  There is a lot of camp in this movie which is really poor quality (maybe the director should have watched some old Batman on TV to find out how to get it right).If you are taking the kids I suggest Rugrats in Paris which is a thoroughly entertaining film for both children and adults.  It is also one that you can feel safe taking the smaller kids to unlike this muddled affair.",
    "137": "This movie's budget of $115 million dollars was primarily spent on lavish and exotic sets, incredible make-up, special effects and wonderful props. Of course, I am sure that Jim Carrey got his cut too.But it just proves that throwing big money around does not make a good film.Director Ron Howard has taken the delightful 26-minute children's Christmas fable by Dr. Seuss and padded it, overblown it and turned it into an over-long mish-mash of effects with little-to-none of the heart and soul of the original.  It was also definitely not directed for children  but for their parents.  It also has the biggest make-up crew of any film I have ever seen.This movie does exactly what the cautionary story by Dr. Suess warns about: Christmas is not in the trappings and money spent  it is in the heart  and this movie lacks any heart whatsoever.The sound editing was near perfect; however, the best songs come after the audience has left the theater.  If you are going to see this movie sit and wait for all the credits to roll: there you will find the best music in the movie.No one but the rubber-faced Jim Carrey could have carried off the role of The Grinch.  It would take a hyperactive over-actor like Mr. Carrey to pull it off through all the layers of latex and dyed Yak fur that he is encumbered with.Christine Baranski is always a delight to watch  though she is given little motivation for her character. The rest of the cast could just as easily have been done as animation.  But wait!  Isn't that how the original -- and still the greatest  version of this delightful story was done?",
    "138": "Unmitigated garbage. Ron Howard has never been a big proponent for subtlety. Most of his artwork is house painting, not oils or watercolors. And he uses a sledgehammer instead of a brush. Yet, he has produced a few excellent works--A Beautiful Mind and Apollo 13 come to mind. Here, he takes on Dr. Seuss and his endearing story of the power of grace and giving . . . and repaints it with a Hollyweird 10 pound sledge.What infuriated me the most about Grinch is that Howard apparently, in his infinite wisdom, decided to fundamentally change the story of the excluded and marginalized monster of the Grinch, hateful of and hurting for the transcendent love of his neighboring innocents known as the Who's, who decides to punish them for their goodness, and realizing almost too late that he has nothing to fear from the Who's' limitless love. Instead, Howard turns the Who's into a pack of, to use a line from a Charlton Heston movie, \"rapacious bastards.\" The Who's are so common, so greedy and materialistic, that somehow the Grinch will be inspired to goodness in spite of them. Howard's Who's are repulsive, nasty, and Republican (this is Hollywood, you remember)--there's very little to root for here, except the obligatory one, lone Who who models liberal virtue, Cindy Lou Who and Jim Carrey's breathtakingly funny Grinch.Why change a beautiful story? Probably because of one of two options: The producers of this trash figured we were (and still are) dumb enough as viewers not to notice that the Who's were now rotten to the core or changing the Who's was the only way for Howard to fill 90 minutes of screen time with 20 minutes of story. Either way (or both), How the Grinch Stole Christmas has sold a bazillion tickets and DVD's.I have an in-law who is intellectually stuck on \"concrete-operational\" and can't, for the life of her, understand why I hate this movie (\"How can you hate this movie? It's Fuh-nee!\"). I am not, never have been, never will be, any great intellectual wunderkind, but Ron Howard and company have banked on getting richer yet by playing to the concrete thinkers of the nation. The movie is depressing and dispiriting, and the only way to get away from this loud, offensive gas bubble of a movie is to quietly read Dr. Seuss's lovely little story to your children . . .With no special effects, no zillion dollar stars, nothing but Seuss's words and illustrations.But then again, you've got to be able to read.",
    "139": "With such an iconic 1966 animated 1/2 hour special, it's hard to imagine a reason to reimagine it as a live action movie. If it ain't broke, don't fix it. I'm not particularly angry or hate this. It's just that I couldn't stop asking Why? This one gives a backstory to the origin of the Grinch. He gets delivered by mistake to Whoville. The kids bully him because of his looks. In frustration, he runs away to live on the mountain. Now he is a fully grown loner. Cindy Lou Who (Taylor Momsen) is searching for the meaning of Christmas. She tries to see the good in the Grinch, and keeps trying to bring the spirit of Christmas to him. But the Grinch just can't get into the spirit.I don't have a big problem with the additional backstory or the greater role for Cindy Lou Who. That's to be expected for an expanded Grinch. And Taylor Momsen is a perfectly good child actor. But none of it excites me. The visual design is again expected but without the outlandishness of 'The 5,000 Fingers of Dr. T.' for instance. However it is still great once we get to the last part where the Grinch tries to steal Christmas. All the sentiments are there voiced especially by Cindy Lou Who's father. That part still works. Nothing can change that.",
    "140": "Throughout THE GRINCH I laughed one (1) time, at a throwaway joke about a cash bar. But, generally, this is probably the worst holiday movie I've seen (well, maybe it's not quite as boring as TRAPPED IN PARADISE). I kept getting distracted:-Why did some characters have snouts but others didn't?-Correct me if I'm wrong, but did the Grinch Have Two Mommies?-The movie's secular worldview. Are there no churches in Whoville? Much was said about the true meaning of Christmas, but no mention of the birth of Christ. I'm not religious, but do acknowledge the birth of Christ.-And, speaking of, are there no Jews? I'm awaiting the sequel, HOW THE MESHUGGA STOLE HANUKKAH.-Are there other towns in the snowflake? Is that where the Jews reside, or did they move to the Whoville equivalent of Florida - in the drop of a hurricane's rain?-Why was the visual texture so fuzzy and indistinct, the sets so creepy and unpleasant? Isn't this supposed to be a kiddie movie? -Why didn't the little girl recognize the Grinch in the Santa outfit? Was she stricken with blindness during that scene, or just stupidity?There are other points I've already forgotten, but the biggest thing I hated was the general message. So, someone who hates Christmas is automatically a freak who should be pitied. Guess that makes me one, too.",
    "141": "There is so much wrong with the Grinch...but primarily it's just boring and unnecessary and that is the main feeling that kept coming up while I was sitting in the theater, watching this expensive experiment, waiting for it to find a point or direction. Did it want to be funny? Yes, most certainly so. Was it? It was about as funny as it looks, which is to say...not very funny...unless Jim Carrey squeezing everything he can out of a seriously not funny script...is funny. Whose brilliant idea was it to use a script penned by a team whose last effort yielded the disaster that is Wild Wild West? Come on. If you start with a bad script, which this definitely is, when do you ever get good movie? Seems like they purposely didn't write any jokes, figuring Jim Carrey would just improvise....It doesn't work well...actually not at all. One or two laughs...okay maybe three or four...But they aren't big ones. Howard stretches and stretches and stretches the story out....like it needed to be 1 hour 45 min. How about 1 hour 15...it could of been a nice short well paced movie and that was what you were hoping for the whole time. Unfortunately, the movie suffers the most from being just plain boring....everything good is buried under bad filler. The best parts are when it takes literally from the book...with Anthony Hopkins's narration and Jim Carrey's responses...although they never use it to it's full potential and it's too little too late. Another problem is the Whos...they're just obnoxious...you want the Grinch to ruin it for them. You want him to eat a couple maybe! You want someone to smack them in their ignorant and not so wholesome heads! Also there is this stupid subplot about what is Christmas...is it commercialism?...Hypocritical trash coming from a movie who has more tie-ins than most movies this year. Other questions that come up while watching (not after), which is a really bad sign:Why is the Grinch talking like that? Why is the Grinch manic?Why isn't the dog funnier?Why isn't the Grinch funnier?Why do the whos look like that? Why are they so annoying? Why does it look like they stole the Flinstones' set?Why is my foot itching? Am I still watching this? Is it over?I wonder how much this cost? Why is Molly Shannon in this? Why isn't she funny? Why oh why did they do this? Really so many other directions could of been taken and they chose no real direction at all. They touched on some. They teased you a bit but never followed any good ideas through. Well maybe half-ass spastic zannyness...they followed that through in spades, which was not what Dr. Suess was ever about. Suess seemed to be about dignified fantasy based on very real morals. Not Jim Carrey playing a bipolar fur ball, in Universal backlot heaven. Which leads to production design. The production design teeters between really good and god-awful. Whoville being a backlot seems to take most of the blame. The only winner here is Rick Baker's makeup...which sometimes is downright scary...it carries the movie.  Ron Howard really needs to find his own personality. He is always imitating someone else. First Spielberg with Backdraft, then Cameron with Apollo, and now Burton with this.  Should of left it alone. A story you all know and loved done perfectly as a cartoon which is probably why you'll spend the whole time picturing the cartoon and that great curly Chuck Jones smile that they gave the Grinch and of course the unforgetable voice of Karloff. Stop messing with stories we all love. Try thinking up something more original. If you want to pay tribute or homage to the stories you love, follow Burton's cue with Nightmare Before Christmas. A very original tribute to the stop-motion holiday specials...and look he didn't have to ruin a classic did he.Although Burton himself seems to be losing track of this idea. Sleepy Hollow... and now Planet of the Apes.",
    "142": "...Right off the bat in 2000.  Of course, it was also the biggest hit of 2000, so there you go.  But I think parents dutifully took their kids to this classic \"Christmas Title\" and sat through it because they felt they had to.  They neither knew nor cared if it was any good.Why so bad?Because it manages to insult (1) Dr. Seuss' wonderful original book and (2) Chuck Jones' wonderful 1966 TV cartoon special.Because, in this ostensible children's movie, there is an early scene where the Young Grinch watches the adult marrieds of Whoville have a \"wife-swapping key party.\"   VERY Dr. Seuss. So nice for the little kiddies. What the h--?!!!Because Dr. Seuss' wonderful rhymes were largely tossed aside (as they were NOT in the TV show.)Because everything sweet and meaningful about both book and TV show were essentially raped and converted into a typical modern-day sleaze-and-toilet-joke-fest.Jim Carrey was OK, but buried in make-up and swamped by this awful rendition.   But...he made like $60 million off of it, so what does he care?",
    "143": "Dr. Seuss' How the Grinch Stole Christmas is based on the childrens book by Dr. Seuss. In this live action film, Jim Carrey brings to life one of the most beloved stories of our time to the big screen with the direction of Ron Howard. The plot is taken straight from the book with a few creative liberties along the way. Inside a snowflake exists the magical land of Whoville. In Whoville, live the Who's, A munchkin like species that all love and adore Christmas. Yet just outside of their beloved Whoville lives the Grinch. The Grinch is a nasty, green creature that hates Christmas, and plots to steal it away from the Whos which he equally loathes. Yet a small child named Cindy Lou Who, decides to try befriend the Grinch and teach him what Christmas is really about.  What is probably the most interesting aspect of The Grinch is the cinematography of Whosville that Ron Howard brought to life. It would be very hard to live up to Dr. Seuss' standards in the book, but Whosville itself in this film is basically the only delight you have while watching. Jim Carrey does fit into the Grinch well, but too often we get an Ace Ventura vibe. Now I ask myself even in dramas why Jim Carrey always seems funny, even when he's acting serious, why is this? In the Grinch at times he seems calmed down to a certain degree, but the longer the camera rolls the more he starts to act up and eventually we can just picture Ace walking in that snow instead of the Grinch. One other thing I disliked is that in the cartoon the Grinch never talked much, but in this version all the Grinch does is talk. Of course both these films were taken off the book, but I still think Jim should have shut up half the time instead of rambling and doing wacky and crazy movements (like Ace.) The humor itself consists of only a few funny lines. In one scene the Grinch is sitting looking through his 'schedule' and is saying something like '1:30 Loathe-2:30 Have lunch with myself..I CAN'T cancel that again! 3:30 Feel sorry for myself..' And the scene basically goes on like that. I think that is probably the funniest scene in the film, and if you don't find that funny, you will hate the Grinch. I first saw this film in the theaters and expected too much. Perhaps that is why when I viewed the video release I enjoyed it more. If for some reason you do want to see this film, just don't expect it to be great and you might enjoy it more.  I wouldn't recommend this film unless you're an absolute fan of Dr. Seuss and in your opinion 'must see it.' Other than that, avoid the Grinch's good looks and charm, because there is not much of it in the film. 2/5 starsJOHN ULMER",
    "144": "How the Grinch Stole Christmas is a 1966 classic, but why did they have to remake it? Well, I'll tell you what. It was a bad idea. A disastrous idea, if you will...The Grinch is pretty much plotless. A little girl, Cindy Lou Who (Taylor Momsen), wonders whether the evil Grinch (Jim Carrey) really is all that dastardly and tries to befriend him. The Grinch isn't having any of it and attempts to ruin the Christmas celebrations until, lo and behold, he, and the feckless Whos, discover the much-vaunted true meaning' of Christmas.\nSome lovely costumes and nice set pieces can't save this film. The acting is corny, Jim Carrey is effortless in his attempt to be The Grinch, while Taylor Momsen is unbearable as the dumb-ass little cheesy kid, Cindy Lou Who. On the subject of the Who's...could you get any more annoying, by any chance? Their big noses and wide smiles used to be classical, now they are please-kill-me irritating. Ron Howard's direction is the only thing that is average, and perhaps Anthony Hopkins narration can be credited too.Someone once called this remake memorable. Well, the only thing that is memorable about it is how bad it is.I rate The Grinch 3 out of 10.",
    "145": "There's nothing more distasteful than a movie that helps perpetuate the very evils it supposedly tries to protest.  With this live-action How the Grinch Stole Christmas, for instance, we have a movie that, like the original cartoon, tries to launch a thinly veiled attack on the American consumer culture.  But this movie is a product of the very same ridiculous excess that Seuss tried to discourage.  It is one of the most expensive movies of all time, to the extent that it may just barely turn a profit if it makes more money than any other movie this year, but a huge portion of its budget is completely wasted.  Why hire such expensive actors if you're going to hide them behind those awful rat-nose prosthetics?  Why hire the $20 million Jim Carrey and then render him unrecognizable with 40 pounds of latex (and do half his performance with CGI anyway)?  Why even make the movie in the first place with a script this grating and unbearable?Watching the film, I got the impression that it would have been infinitely better if it had been directed by Tim Burton.  Just look at Edward Scissorhands, or his stop-motion masterpiece The Nightmare Before Christmas--Burton clearly understands the bittersweet 'feel' of Christmas better than any other filmmaker in Hollywood.  But then, of course, I realized why they went with Ron Howard.  They obviously approached Burton first, but he replied, \"A live-action version of the Grinch!?  Are you guys NUTS?\"",
    "146": "Wow, the summary title says it all doesn't it?Now as of me, I do enjoy a good Crimbo film every now and then. You turn on the telly, grab a nice drink of Cola or Coffee or even some random juice or something silly like that, and you enjoy a nice little film.Stuff like The Muppet Christmas Carol, Home Alone, It's A Wonderful Life, all that kind of wonderful stuff. These are beautiful Christmas films that has really good acting, some funny humour and of course something that'll tug your heart till you fall off your seat.Now you're probably thinking, why are you talking about other random Christmas films and not The Grinch my fellow bloke? Well, I say that because unlike all those other films I just mentioned The Grinch will probably instead immediately turn you into an absolute grouch by the time the credits start rolling.I'm dead serious, serious even to the bottom of my legs. I can not for the life of me stand this film whatsoever. Now before you all start chucking Tomatoes and broken TV's at me, I can STILL understand the appeal of this film so I'm not gonna whinge and moan at you all to not watch it because... you still can, I'm not greedy like that you know.What I am gonna do (for the others who don't wanna see it) tell you how awful this film is.First things first and probably most foremost, this is Jim Carrey at his absolute grating. Just look at him, look at him on ya TV screen. Running around, endlessly shouting, spurting out references the entire population will forget in under a second. Jesus, this Grinch gives the current CBBC presenters of today a run for their money.Another thing that's also foremost is Ron Howard's direction. (Spoiler alert: he's completely mis-directed) It feels off. Way too off for something like the Grinch, I can understand that he's going for a sort of wacky Burtonesque feel to it but in my eyes it makes the film look more tacky than it's supposed to be.Speaking of tacky, that sort of explains the jokes too. All tacky and rubbish like that crap joke you get in some cheap Christmas cracker. None of it stuck to me and I completely forgot about any of the jokes.And even at 90 or 100 something minutes, I honestly feel like the film's running 8 hours because everything is so loud and frantic you'll want to bash yourself on the head 8 million times and run around shouting \"THE NOISE! THE NOISE!\" so that the pain will stop.So any good stuff? Well, they kept that \"You're A Mean One\" song in (though it's a prime example I should be watching the far better Chuck Jones version instead).Ummm, Anthony Hopkins did a good job as the narrator. And Cindy Lou Who was the only one I even cared about, honestly I just wanted her to put the Grinch out his misery.So as you probably already knew, I hated this Grinch. Every minute of it was grating and I too now feel like a grumpy Grouch.BAH-HUMBUG! Yeah, you can all put it with your other Christmas classics, as for me I'm putting it in the bin with other Christmas clunkers like Jingle All The Way and Santa With Muscles so I never have to put up with anything like this again.Now if you'll excuse me, I'm off to watch the true version (Chuck Jones) so I can wipe those horrid memories away. Good day sir.",
    "147": "I had hope.  I love the Grinch, and while I had my doubts about a live-action version stretched out over four times the length of the original, I knew it could be done and I know Jim Carrey was passionate about this project...But it stunk.  I was with my father and my sister, who both adore the story as well, and even they came out disappointed.  Aside from how ridiculous it was having on of the most over-budgeted, over-advertised and over-merchandised film of the year try and preach about commercialism, it just didn't work in it's own right.  A lot of the film was just down right spooky (the grinch as a young schoolboy, an over-the-hill Christine Baranski's breasts being shoved in our faces constantly) - they essentially made an average Hollywood kids movie our of a classic story that deserves better.  Most of the movie is an entirely new story, with few redeeming moments, and when the real Grinch story finally begins, about an hour and ten minutes into the film, it had already exhausted my hopes and interest.\nThere were a few good moments. Jim Carrey's version of the \"You're a mean one, Mr. Grinch\" would be great if it wasn't trapped inside such a horrible movie.  But, during many parts, it seemed people around me were amused - even the millionth time they played the dog walking on it's hind legs for laughs.",
    "148": "Ron Howard, nee Opie, made some pictures before,But the Grinch, as a movie seemed just one big bore.Replete with great make-up and various sets,It lacked of a plot and then there's my regrets.It could be perhaps that the writers, obtuse,Used only the plotline of old Dr. Seuss.But I think that the most likely reason of allWas Ron Howard, nee Opie can't do comedy at all.But whatever the reason, whether script or direction,I found myself hating the production conception.For instead of creating a more tender storyWith pathos and heart, it seemed almost gory.The Grinch, well, Jim Carrey, ate metal and glass,Befriended by dog and dimensionless lass.And there in the theatre I sat with chagrinAghast at the plodding Grinch plot that was thin.\"I have wasted two hours!'-this at the conclusion.\"The Grinch stole my life's blood-I need a transfusion.\"Then I grumbled Grinch hatred at the loss of my time.\"What they've done to this story is simple a crime.It's not a Who story of some greenish Scrooge,There was no great redemption, not smallish or huge,Because all of the characters just lacked sympathySo cheered and inane or with great misery.\"And so in the aftermath, when all's said and done.It was not the Grinch who is said to have won,It was not the watchers and, no, not our planetBut the people with money, who burn it and fan it."
}