{
    "0": "I watched this with my grandson. Yes, I still think the original cartoon based on the book is superior. There is a simplicity that really works. The Grinch is downright mean. I love Benedict Cumberbach, but found his voice just too soothing to pull off our guy. There was too much psychological mumbo jumbo as the writers came up with an excuse for the Grinch being the way he was. Of course, it was his childhood. The movie is spectacular in its visuals. There are colorful scenes and excellent structures, making Whoville really magnificent. But the story is watered down and using Cindy Lou Who as an active character didn't work for me.",
    "1": "There is a reason I don't read critic reviews, and it is because I never ever agree with them. Usually when they say a movie is bad, I like it and vice versa. I like to leave reviews for movies and tv shows because I enjoy them, and I don't care about other people's views. I will give you my honest review as just a regular movie lover. Glad I didn't listen to critics on this film. It was great! A sold out theater. Kids and adults all laughed throughout the film. I went with my husband, sister, brother in law, and my niece and nephew. We all loved it equally. I enjoyed Jim Carey's version but I cannot compare them. I was wondering if I could like this without it having Jim Carey but I truly did. Heart-warming film with a slightly different take on it from the last film. To me, the dog, MAX stole the show! Great animation and effects. 3D is even better. To the people saying there was no storyline...ummm, there was! sheesh. Its about...well...THE GRINCH!! You don't take my advice, its just MY opinion, but I advise everyone to see this. Do not expect an Emmy winner, but it is still a great, warm and cozy holiday film.",
    "2": "The technicals of this version are outstanding, great, bright animation, very Pixar-ish. However, it fails in its heart which is always driven by actors' voicing and what a BIG FAIL this was - as many others have noted, so you know it's not just a few of us. First, WTH is Pharrell narrating?! Weakest voicing ever! NOTHING even approaching the dramatic storytelling of the classic's Karloff. And his hip-hop, rap interludes were simply wrong for this feature - maybe if you're setting the story in a rundown urban environment, maybe then it'd have fit, but it was totally out of place here. Then Benedict Cucumber-patch's voicing of our main Grinch character was way off base, nowhere up to the task, it was a pathetic reading of the script, the biggest letdown you could imagine. Finally, the naive, demure Cindy Lou Who from the classic is re-imagined as a hyper-active grrl power character which is also annoying and out of place. We can only hope this version is relegated to the dust bin of some Hollywood warehouse, never to be seen again.",
    "3": "When the movie ended, I looked over at my family and asked \"did they even sing the grinch song?\" which I was highly anticipating with a fun, new modern edge. my nephew responded with \"it was a remix and not the whole song\" what?! Jim Carey made an entire scene out of it! This movie was a let down. Can they stop remaking movies if they're going to be lazy and unoriginal about it? The Jim Carey one and the original Grinch are way better than this",
    "4": "Anyone who gave this a bad rating clearly is just upset because, they don't like a modern Grinch because they grew up with the original classic Grinch cartoon. This movie was one of the most adorable and fun feel-good animated movies I've seen in a long time. Benedict Cumberbatch killed it as the Grinch and, all the gadgets and grandeur of the grinches holiday heist scene is so creative and colourful and fantastical! This is one of the greatest Christmas movies of all time up there with Nightmare before Christmas. This movie was a joy to watch and if you couldn't find joy in this movie maybe, you're the Grinch.",
    "5": "Look I'm probably not the target audience for this movie but I gotta say I smiled I. Laughed I felt flat out joy one of the best of the year simple sweet and fall down funny for once instead of a movie being about war it was about peice and love and joy nothing I regret about seeing this movie",
    "6": "I rarely watch animated movies, so I didn't expect much going into this one. I have to say I like the original and Jim Carrey ones better, but this is still fun. For a family movie, or just a movie to go see with a friend or girlfriend, I think this is a good flick to see going into the holidays! 7/10",
    "7": "The thing about a remake is that there needs to be a reason to make it. When remakes have no reason to exist (other than to make a quick buck or millions of them), they fall flat, usually due to a lack effort. And therein lies the issue plaguing this 2018 version of Dr. Seuss' holiday classic about the mean-green-grumpy Grinch-it's a dull final product that likely resulting from a lack of effort. We know the Grinch stole Christmas, but who stole this movie's creativity?Just about everyone knows the classic Grinch story, but this one is a little bit different, so let's run through it. There's cheery, wintery town called Whoville filled with many delightful people called Whos. The Whos love Christmas, and they know how to celebrate the holiday right. They don't just deck the halls, they deck out the entire town with decorations, lights and a mountain-sized tree. It's all glorious.One young Who named Cindy-Lou (Cameron Seely) has an adventurous spirit and a kind heart, as central figures tend to have in these sorts of movies. She feels for her exhausted single mom who struggles to balance her time at work and at home taking care of Cindy-Lou and the twin boys. So, Cindy-Lou decides to ask Santa to help her mom by doing... something. Exactly what help Santa would provide is unclear, which makes any resolution problematic because we can't recognize the help if it arrives. If you think I'm overanalyzing this movie aimed at children, you're probably right.Any Who... living in the giant mountain adjacent to Whoville is The Grinch (Benedict Cumberbatch). The Grinch I remember as a child was a ruthless and nasty figure. Establishing him this way early on is crucial because it sets up a redemption story. This new Grinch starts off mildly rude at his worst and genuinely considerate at his best. A few half-hearted attempts to display his wickedness that fail and instead make him appear funny. The rest of the time, The Grinch is mostly pleasant. This robs viewers of the need to root for him to change because he's a decent guy the entire time. He politely interacts with an overly-jolly old friend, Mr. Bricklebaum, voiced by Kenan Thompson, who is doing some variation of his SNL character, neighbor Willie. Thompson's jubilance is good for a few laughs, the only ones you'll find in the movie. Despite his best efforts, his limited screen time doesn't afford him enough opportunity to earn this movie an overall label of \"funny.\"The rest of the attempts at humor are comprised mostly of cutaways that play like watered down versions of ones you'd see on Family Guy. There's also a dusting of lazy Who-based puns, like the inclusion a place called Who Foods, a play on Whole Foods. Like the rest of the movie, the jokes clearly were made with little effort.There isn't much else to say. This is a pointless remake that doesn't need to exist. A remake that has a reason to exist should provide a fresh voice while simultaneously honoring the past creation. This film does neither. If you want to watch a story about The Grinch, you'd be much better off revisiting the original cartoon classic or the more recent live-action iteration starring Jim Carrey.",
    "8": "If you don't like Illumination movies, or Minion type movies, you probably won't like this version of The Grinch. Personally, I am not a fan of the original TV special, so I was dreading being dragged along to see this with the family, but I really liked it.It's a very modern take on the classic Dr. Seuss story. The plot line is basically the same, but the humor is a little different and it does play more for laughs.Personally, I prefer this one - my kids said they liked it equally with the original Grinch special.Unlike another reviewer who gave this a 1/10 and said Illumination animation was basic, I don't think it is at all. I think it is crisp and modern, and in comparison to the original, much softer and more likeable, but that's just me.I thought Benedict Cumberbatch was a weird choice for the main character's voice, but on seeing the movie, he was perfect of it.Go into this without any pre-judgment, unlike me, and you're sure to be highly entertained for around 90 minutes.I expected it to be terrible, but it will be a future Christmas favorite for our family!",
    "9": "No matter how much worse the IMDb rating gets, watch the movie for yourself. I love the music, the animation, the voice talents and the storyline! Aside from from having a few goofy moments, the movie was a lot more dramatic and touching.",
    "10": "They picked the absolute worst voice for the Grinch. Also the Grinch didn't even seem bad. In fact, its like a five year old would have considered this movie less than a G rating. The Grinch is known to have a hard stare and grin with a rough voice. They ruined this version.",
    "11": "I love the actors I. It. The dog was cute. And funny moments. But the two previous grinch movies made the grinch clearly hate....loath entirely tye holiday. Where as this one made it feel like he was just avoiding. Doing his taxes. He mingled with the whos in a way that didnt even make him seem like that much of out cast. But the fault was in the writing. But still. A screaming goat is worth 8 stars lol",
    "12": "I just didn't like it. I love the book I read it from November onwards every year to my kids. I love both the older versions but this just got diluted down until it was a poor version of a Christmas movie. The odd funny moments but nothing else. There was nothing mean or awful about the grinch at all he was quite nice to begin with just a lonely sad man who needed friends",
    "13": "Worst adaptation of the grinch ever made. Stick to what you know and what people love....the original cartoon. Too much overacting.",
    "14": "I don't know what to say, really. Uninspiring? Second-tier? First of all Narrator voice, sometimes very decent, than some time you know THIS notes get slip. But its not bad like boooooooring voice acting of Benedict Cumberbatch (he don't killed AS the Grinch - he JUST killed Grinch). Why? Just why?! I know its always obvious cash-grab when in title we have THE GRINCH, like THE ONLY THING YOU CAN FIND IN GOOGLE FIRST PAGES and all sorts of Netflix-amazone-prime catalogs. I am not very amazed by Jim Carrey Grinch, but boy he in live flesh more Grinch then Cumberbatch in animation. It so lazy acting, just WOW you even don't have a little shame, guys from Illumination.",
    "15": "Please don't see this movie in theatres, if you liked the prior Grinch movies, then you won't like this one. It's not mean, it's not funny, it's not accurate to the storyline. It also ruins the iconic grinch song. This isn't a very good movie and you shouldn't waste your money seeing this. Rewatch the Ron Howard and Jim Carey version over and over again to get your fix this year. I know that's what I'm going to do. So many better songs in that version as well.",
    "16": "The Grinch(2018) is a fantastic family holiday film. It is a must see for the holiday season",
    "17": "The grumpy Grinch learns about what the real meaning of Christmas is with the help of a little Who from Whoville. This movie is not only safe for the whole family but this whimsical adaption feels very Seussical. The movie feels pointed towards younger children but I was very engaged and would recommend it to adults as well. I loved the style of animation! I loved the choices for the voice actors! I hope that this becomes a holiday classic! Check out our discussion guide and review at DownTheHobbitHoleBlog.",
    "18": "If you've seen the trailer you've seen the whole movie. It's funny, yes, but the trailer ruins it as it has included every single joke from the movie.",
    "19": "I have absolutely no idea why this movie is not getting good reviews. I'm often extremely critical of kid movies but really enjoyed every bit of this one! I loved that it taught about love and kindness and the need for people without trying to shove any political correctness down our throats. Just a really funny, really good movie! Kids laughed trough the whole thing too!",
    "20": "Wow, just plain stunk. Horrible music, narrator was awful and just overall annoying. The animation was great, but not fitting to this story. Fine they wanted something different than the other movies, but at least take a cue from the book. They should have saved the animation for a cutesy holiday story, not The Grinch.",
    "21": "After seeing the trailer I felt this movie was just an attempt at a reboot of 'The Grinch that stole Christmas' featuring Jim Carrey. After the first 10 minutes my fears were realised, this film is awful. The storyline is all over the place, it wasn't easy to follow for kids and it seemed the writers were just trying their best to be as PC as possible. Out of the whole film there was 4-5 good laughs, these were good but again mostly covered off by the trailer.I could go on further, but it's easy just to say this wasn't a great attempt to reboot The Grinch.",
    "22": "Pretty much the definition of 'average', 'The Grinch (2018)' really is just fine in every way. It's fairly impressive in terms of its visuals and voice-work but is certainly nothing new, or even compelling, when it comes to its narrative. Really, the visuals and voice-work are only really to the expected standard of today's bigger-budgeted animated fare and the strange 'Illumination-esque' designs, combined with the pulled-back (certainly from the, frankly, creepy Carrey incarnation) but still oddball Seuss stylings, prevent the piece from appearing as aesthetically-pleasing as anything that Disney - or, more specifically, Pixar - are putting out today. The point is that the fact that it looks pretty pretty isn't enough of a selling point to recommend the piece and that's probably the biggest selling point it has. I suppose someone who isn't familiar with the source-story and is young (or willing) enough not to notice the basic nature of the narrative may get more mileage from this bland but inoffensive, family-friendly Christmas flick. 5/10",
    "23": "If there was one animated movie this year that I really didn't have high hopes for, it was \"The Grinch\" and there's a good reason why. With the exception of Blue Sky Studios \"Horton Hears A Who!\", every Dr. Seuss movie I have seen has been not good. I didn't like Jim Carrey's take on the Grinch, I thought \"The Lorax\" was a mess, and the less said about Mike Myers' \"Cat in the Hat\", the better. So when Illumination announced they were gonna do another take on How the Grinch Stole Christmas, I got really nervous. Not only was their last Dr. Seuss movie was \"The Lorax\" which like I said was a mess, but the advertising for \"The Grinch\" didn't look very appealing to me. So, you can imagine my surprise when I found out that I actually did enjoy this movie. Yeah, I'm not joking here. \"The Grinch\" is actually a legitimate good Dr. Seuss movie which I never thought I'd see myself utter. Granted it may not be as good as the Chuck Jones television special which I still find a masterpiece, but still I think this film does the classic story justice.While the Who's down in Whoville prepare their annual Christmas celebration, the Grinch (Benedict Cumberbatch) is dreading it's arrival due to his unpleasant experiences he has of it. As the celebration plans to get bigger and bigger, the Grinch then plans to steal the holiday from Whoville by dressing as Santa Claus and taking everything Christmas away with the help of his loyal dog Max. The rest of the film does involve him planning on enacting his plan as well as subplot involving the young Cindy Lou Who (Cameron Seely), but I'm not gonna spoil it here since the advertising didn't do it also.To be honest, I really was expecting to hate this film going in. I didn't think this film was necessary considering we had the Chuck Jones special and I still had bad memories of \"The Lorax\" as well as Illumination's other mediocre movies like \"Minions\" and \"Despicable Me 3\" so I really was surprised to see how faithful the story was the original book. It does capture the original story and it's message perfectly and seeing the Grinch prepare his plot to take the holiday led to some funny moments, but it was the subplot with Cindy Lou Who was pretty much the icing of the cake of the film. I really loved this subplot of the movie because it actually legitimately felt heartwarming and I felt that the writing in the scenes with Cindy Lou and her friends was pretty spot on for young kids. The animation once again is good for an Illumination movie. One thing I was legitimately happy with seeing for this film was that they hired new character designers to work on the movie. I did voice my frustration with having Eric Guillon do the character designers for all of Illumination's previous animated movies as it was pretty unfair for other artists out there, so seeing some new artists work on the film was quite relieving to see. As for the characters, they did have their moments. I do like the new take on the Grinch in this movie and I'll give credit to Cumberbatch and Illumination for doing a new take on the character and not base it off Boris Karloff or Jim Carrey's performances as he does act like the famous Christmas grump we all know and even does have some fun moments with Max. Though it's really Cindy Lou that steals the show for me. She was fantastic due to her determined passion and fun personality and her voice actress Cameron Seely was really good in this movie. I can see a bright future ahead for her and I'm really excited to see what she does next. Even her friends are also a lot of fun and led to some funny moments. Though I did really like Seely's performance in the film, I will say Cumberbatch's voice for the Grinch was really questionable. Rather than doing his regular British accent, Cumberbatch played the character with an American accent and ended up sounding a little odd. In fact, if you didn't tell me that was Cumberbatch I would've assumed that Bill Hader was voicing the Christmas grump. He really sounded like Bill Hader playing this character which made me think if that was the route Illumination was going with then I don't understand why they didn't get Bill Hader to play him. Also, I've got to ask why was Pharell Williams chosen as the narrator? I get that he commonly works with Illumination, but I find it very odd for him to be narrating the film and not even do songs for it. I'll also say some of the jokes do fall flat as well. Like \"Smallfoot\", this film does have another screaming goat joke which I really think is old and tired now. Though luckily there were other funny jokes that made up for it.And you know what, I think \"The Grinch\" gave me what I wanted to see for a Dr. Seuss movie. It gave me a story that was faithful to the original without getting annoying or insulting, animation that was bright and colorful that would go well with the book, and characters that had fun and charm although some of their voice over work did come off questionable at times. I still am up for debate to decide if this movie is better than Horton or not, but in the end I still think it's a good Dr. Seuss movie and I'll take that any day over a bad one.",
    "24": "As someone who remembers the premiere of the half hour animated classic, I loved seeing it updated with wonderful animation. I liked the additions to the story as well and the funny animal characters. The Ox alone is worth watching. Where it misses the mark is the casting of voice artists. The Grinch in particular is a really bad choice. There is no evil darkness to the grinch and a voice like Boris Karloff was a necessary component. Pharrell was not the best choice for narration and I'm a huge fan. Hits outweigh the misses, it's a fun update, and you can still watch the original too.",
    "25": "This movie was not needed. It's just Illumination's typical bland, unfunny humor and bland, uninteresting story. This movie reeks of laziness and cheapness, but it's from Illumination, so that much is expected. This movie is equivalent to jingling keys in front of an audience for an hour and a half.Save your money, and watch the better two Grinch movies instead. You'll remember those, but you'll forget about this one as soon as you finish it.",
    "26": "The Grinch Is A Great Christmas Animated Movie For All Ages!Warm,Lovely and I Recommend It",
    "27": "As a kid, I hated the Grinch. In fact I was terrified of it. So I was obviously hesitant at the idea of seeing the remake. But the movie was excellent, really gave me the Christmas vibes and Mr. Grinch is actually really nicer then he seems. The graphics/drawings (however you wanna call them) are mind blowing ! It's a great movie that shows kids how Christmas is not about receiving gifts, but about spending time with the loved ones.However, I felt like they didn't represent the Grinch's mean side enough before gradually showing his nice side. And the script was a little (a lot) lame and cheesy, but I'm not going to base my review on that.Don't hesitate to watch it with kids, it was very touching:)",
    "28": "It is the classic story of The Grinch we all know so well. So yes its predictable, yes we know what's going to happen and how it ends, but even so it was a joy to watch and the kids really enjoyed it. This version of the grinch is a little less disgusting and you see a bit more kindness from him, which I liked. It had quite a few laughs and some very sweet moments. I personally liked it better than the Jim Carry version. But nothing beats the original.",
    "29": "Very family oriented and clear cartoon, and got a deep idea about Christmas agenda- thanksgiving before presents.\nRecommended for everyone",
    "30": "If you're going to see this movie wait till it's on Redbox so you can rent it for a dollar. We watched it tonight, opening night, the very first showing our theater head and my husband fell asleep. Our kids got antsy. My grandpa said he didn't like it at all. And I was very disappointed. Save your money save your time and watch the original grinch cartoon that's only like 25 minutes long and you'll be a lot happier. Every funny moment in this movie with shown during the previews. And if you were hoping to see that adorable chubby reindeer for any period of time during the movie you will be disappointed also. He makes a very short appearance and everything that he does in the movie you have already seen in the previews. I didn't care for the narrators voice either. And let me tell you I am a Christmasholic. I listen to Christmas music in July. I buy Christmas presents all your long & stock them up. I usually have my Christmas tree up the first week in November. So I have been looking forward to this movie since the moment I found out it was coming out. I am so sorry I saw it.",
    "31": "With all the Christmas haters and Christophobes all over the Earth, this is the movie best for family and kids, to tell the true spirit of Christmas, the wonderful of love and joy, a great culture that we must preserved.",
    "32": "Very colourful, and beautiful visuals. I DESPISED the Hip Hop soundtrack though.",
    "33": "This was the first movie theater experience for my 3 year old son. At 1 hour and 30 minutes he did get a tad restless in the later half of the film, which is to be expected. But he did love the film and the experience.\nAs for me, nothing will top the classic cartoon from my childhood. And bits of this felt a bit more stretched out than needed be. But overall I found it cute, lighthearted entertainment that managed to capture the spirit of the original. The voice acting and a animation were solid. The songs, while not as good in my 43 year old eyes as the original tunes, were still serviceable.",
    "34": "Your smaller kids will love it! Incredible animation, had fun watching it in dbox.",
    "35": "Well maybe in the distant future. I mean it was watchable but not amazing. I expected it to be funnier. Benedict has nothing on Jim Carrey and I can't help but compare and it's light years away from that amazing movie.",
    "36": "The Story: Very festive holiday movie. Heartfelt & warm. Definitely bring up the Christmas spirit. However, maybe because I had watched the play & musical of the story. When I watched this movie, it seems flat. Didn't really get me the \"awwwww\" moment.The Animation: Since there are more & more animation movies out there. Compared to others, the animation in this movie is just a so-so to me. Didn't really \"wow\" me.",
    "37": "I just didn't enjoy this version at all. This is not a patch on the Carey version from 2000.",
    "38": "Unfortunately I was a bit of a grinch in expecting this to be a flop and was proven correct. The 60's classic short that really sets the tone of a Christmas story we all want is superior in every way to this version and Jim Carrey magnificent take on the Grinch was always going to be close to impossible to top. That's not to say that this film isn't enjoyable but it just didn't feel like a Dr. Seuss beauty that we have come to love and know.",
    "39": "This is a reboot for modern times. The differences:First thing I noticed is that Boris Karloff and Thurl Ravenscroft are gone. They are pitifully replaced Benedict Cumberbatch who sounds like a real geek. The hip-hop version of the song was equally bad. Cindy Lou Who is being raised by a single mom. Whoville has some token diversity in the background, but not any main characters.The songs were Jesus oriented and not secular as before, however on the flip side, the Whos were concerned their presents were gone, unlike the first feature where they broke out in song, which I found more spiritually uplifting than their Christmas songs. What kid would recognize Nilsson? And anybody who does would have seen the original and be let down by this one. Who was the target audience?And did the guy giving away reefs sound like he said reefer? Couldn't they get Tony Todd or Samual L. Jackson to read the parts?",
    "40": "This movie is wonderful. It truely makes you get into the christmas spirit. The cast in this movie was great, especially Benedict Cumberbatch. He really put alot alot of power and character into the Grinch. Even better than Jim Carreys Grinch imo. The grich is a pretty lonely character so he has max to get along with. Max is a great character, though a dog, he's still loveable. The chemistry between Max and Grinch works great. In my opinion they could have given Frank a better exit than the way they did. I felt like the process of the Grinch becoming Santa was pushed a little late in the film, and that they spent too much time showing grinch just wondering around. There wasn't a whole lot going on with the story/plot. It was kinda just the same as the previous live action film with Jim Carrey, but the new characters kind of helped with that. Also what made it a little better was that they gave Cindy-Lou a motive for being in the movie, which was her just trying to help her mom. I was expecting to get some kind of cameo from past illumination characters, but i did like the callbacks to the previous grinch film. I feel like thus movie will only be popular for the next couple days. I dont really plan on seeing this again. Its not amazing but still a fun watch. Great movie for the kids.",
    "41": "Don't watch this movie. Trust me. Watch the classics, watch Jim Carrey, don't watch this. It is a waste of money and time and you'll regret it",
    "42": "Completely missed the mark, I am angry and disappointed.",
    "43": "If you have watched the grinch before, this movie offers few surprises. There were some additions, like the single mother and the reindeer, that were cute, but they didn't offer any entertainment. The choice to add more of Max, The grinch's dog, was a good one, as it gave the grinch a more \"human\" aspect, showing that there was some potential there for improvement and that he wasn't that bad after all. Actually, the grinch here was more of a loner rather than the bad guy. So, overall, it was just another grinch movie.",
    "44": "I can't believe people hate the Jim Carey version but then make this. I almost fell asleep several times! Not to mention they ripped off the Jim Carey version several times, gave Cindy the most ANNOYING VOICE, killed off Cindy's dad for some reason, made G more slightly depressed and lonely than hateful and angry, and changed the message from greed to ??? I don't even know. And since when do whos believe in the Bible? Why were they so religious? Surprised there were no nativity scenes. At least Pharrell always has work with Illumination.",
    "45": "Okay, so I saw this film about two years ago, when it was released in theaters. It..was not very good.First, this film was not very funny. Second, it did not really have much depth. And finally, there was nothing special, spectacular, or interesting about this film overall. It was very bland.This version of The Grinch is not the WORST or anything, but it was quite mediocre and missed the mark on so many levels. Basically, its only redeeming quality is that it was composed by Danny Elfman, a composer who I admire very much.",
    "46": "The narrator sounded like it was his first time narrating anything. Couldnt get into it. Didnt enjoy the grinches voice nor cindy lou. Just didnt suit them. Maybe it was the wishy washy story. As creepy as the jim carrey one was it was more engaging than this. Nice to look at though",
    "47": "Before I saw this movie I read a lot of negative things about this movie, and reading all of it made me a little nervous to see this cause I mainly didn't want to waist my time, but walking out theater I was surprised at how great it was. The movie is animated beautifully and has a fantastic moral and story about how Christmas can't be stolen because it's always with us (as a reference to Jesus Christ being born in Christmas). I think this is one of the best movies of this year (which isn't saying much) but it's still great and everybody needs to see this.",
    "48": "I went to go see The Grinch with my daughter who is 8 years old and we both enjoyed it. I laughed a little more than she did but she loved it! It follows along the typical Grinch storyline but with some new characters. If you are a fan of the Grinch, this movie will not disappoint and it's especially great for the kids who seemed to all enjoy it. Overall, a great family movie that delivers a great message in the end.",
    "49": "I love this movie so much! I have memorized the whole movie basically and am probably going to see it many more going to see it many more times in my life!",
    "50": "Very plain script. No added humor to the main story and characters whatsoever as one might expect from illumination. Couldnt wait to exit the theater. My kids barely sat through it.",
    "51": "Previously, Dr. Seuss' book \"How the Grinch Stole Christmas\" was filmed in drawn animation by Chuck Jones with Boris Karloff voicing the title character as well as narrating and in live action by Ron Howard with Jim Carrey playing that same character. Now, Benedict Cumberbatch voices him in computer animation by Illumination Entertainment, makers of the Despicable Me movies. It admirably changes some things and adds some other characters in expanding the story. Chuck Jones' version is still the definitive one and the Howard/Carrey version has some good moments but this current version does make this Grinch a little more sympathetic even before his transformation. In summary, me and my movie theatre-working friend really enjoyed The Grinch.",
    "52": "After heating theating terrible reviews of this movie I wasn't sure what to think going to see it but boy am I ever glad I did I haven't laughed at a family comedy so hard this year and I was surprised that the level of heart was so high it was a very sweet joyful film for young and old alike the movie was something I wouldn't recommend missing it was brilliant",
    "53": "What is this EXCREMENT? The style is all WRONG. The buildings and layout don't look anything like the illustrations from the book or cartoon. The Whos don't even look like Whos. The characters new personalities are unapealing. The Narrator is positively unbearable. The choices of addition songs and music is nauseating. And they changed the ORIGINAL SONGS! You DON'T mess with a classic unless you can improve it... And they DID NOT! This dreadful mess should be BURNED!",
    "54": "Spoilers...Why does everyone feel it's necessary to change the story? Now Cindy Loo Who is the child of a single mom?And the voice of the narrator is very normal, boring even. No deep voice, nothing interesting, and at times hard to understand.And the rap music was a turn off for me. It's a Christmas story...Visually it was great. The only reason I give it 4 stars instead of 1 is because, I love Christmas! But this, was a disappointment.",
    "55": "The updated Grinch isn't horrible, but it isnt great. This is a kinder, gentler Grinch. The magic of the classic is the voice work of Boris Karloff. Benedict Cumberbatch and narrator Pharrell Williams just don't have the same wicked tone. I'll stick with the original.",
    "56": "I am not quite sure why the overall rating is a 5, because this movie was amazing! It was funny, cute silly, heartfelt, and inventive! It will just absolutely melt your heart, the same warm feeling you get with hot cocoa in the snow, and give you that Christmas joy(unless it is made stone and two sizes too small) A great modern tale to the classic Grinch story. Fantastic and appropriate for the whole family. A great way to kick off the holiday season with all your favorite Christmas songs! I absolutely loved it!",
    "57": "Save your money.. Watch the original... Where is the dark undertone? What kind of PG nonsense is this. If I had children, I'd forbid them to watch this...Animators, you did a decent job. Well done.",
    "58": "Trashiest movie of the year. Unfunny, boring, and added nothing new to the original grinch story. First of all the whole movie the grinch was too nice to be the grinch but at the end when he finally turned nice he turned to nice to fast. The Jim Carey grinch is still the best. Trash.",
    "59": "This third screen adaptation of Dr. Seuss's 1957 children book 'How the Grinch Stole Christmas!' was not good. Don't get me wrong, the 2018's computer-animation movie produced by Illumination Entertainment & released by Universal Pictures was not a holiday stinker. However, it was indeed, a huge disappointment. It doesn't have the unique, risky, yet funny entertaining humor of the 2000 live-action film version nor the charm of the original 1966 hand drawn animation television special. It was just adequate and that's really sad. Most of the blame, can be said with how they portray the reclusive, Mr. Grinch (Voiced by Benedict Cumberbatch) who decides to ruin Christmas for the cheery citizens of Whoville by stealing all their gifts and everything holiday related. He really not that mean. He should had been a heel that should had been cuddly as a cactus. A being that charming as an eel. Yet, throughout the movie, he really is not that bad to be around. Even before, Christmas even came, he already had a heavy heart to certain key characters. He doesn't exploit or mistreat them, much at all. That's a problem, because the Grinch is supposed a bad banana, with a greasy black peel who heart is 'two sizes too small', but he's not! Even his reasons for hating the holiday is kinda muddled. I get that, Christmas, kinda remind him, about how alone and unwanted, he thinks, he really is, but the Who People don't really treat him, that way to justified that type of thinking. Throughout the film, people like Bricklebaum (Voiced by Kenan Thompson), who by far, is the best character in the flick, really go out of their way to befriend him. There's nothing to suggest the Grinch is ostracized by the Who People. Now, if the film make the citizen of Whoville look like selfish materialism consumer bullies like the 2000 film version did. It gives a good reason why the Grinch would think of stealing gifts is fine idea to stop Christmas. Even the original 1966 film, gave an understandable motive for him, trying to steal their gifts, as he couldn't stand, all the noise. He found their loud hedonism nature to be annoying. People can related to that. In this film, only the out of blue carolers are highly obnoxious with their over-stalking forcing of religionist beliefs type singing. Everybody else is just normal and fine. While, this movie hints that he might suffer from some type of social anxiety. It never states, outright if he does has it. Because of this lack of depth, the character motive might seem confusing, and very lost. Another problem with the Grinch is the voice. Benedict's American accent voice has no weight. It's sound a little bland. It didn't seem powerful or sinister at all. The tone had no kick. What happened, here!? Was the Smaug or Khan's voice, too dark to use in a kid's movie!? I doubt it. After all, they got Frankenstein Monster, himself, Boris Karloff to voice the titular character & the narrator in the original version. Look, I get that the film will never outdo the original film, but gees, the 2018's remake directed by Scott Mosier played it, way too safe with the Grinch. Even the narrator felt out of place. Pharrell Williams was not a good choice. Not only did he never did any kind of voice acting, before this. He didn't really, have that seniority traditional storytelling depth & tone, need for this piece in the first place. It felt like he was nervously, reading off, a script, as quick as possible rather than helping, expanding the depth of this world like Sir Anthony Hopkins did in the 2000 film. Also, it was somewhat irritating that the writers didn't keep focus on the original story poem-like rhythm for most of the sequence, he was speaking. Things get more frustrating when the movie try to update the original song 'You're a Mean One, Mr. Grinch' by music performer, Thurl Ravenscroft with one from hip hop artist, Tyler the Creator, whom been criticized in the past for his use of homophobic slurs, racial stereotypes, his graphic depictions of violence against women and his allegedly misogynistic lyrics. While, his version was indeed catchy, it still feels dirty to listen to. I can see people, easily getting turn off by it, due to the negatively surrounding his personal life. It will only have niches amount of listeners. It will quickly seem passes. It will never hold the same candle to the Ravenscroft's version; which spiritual transcendence all time. As for the upbeat jazzy version of this song by Bob Malone. I see this one, having more of a shelf life. It's a lot more fun to listen to. As for the humor, in the film. The jokes were not that funny. Nothing really did landed for me. The movie also has pacing problem. Lots of pointless filler scenes that run the time, a little too long like the reindeer hunting sequence & the b plot of Cindy Lou (Voiced by Cameron Seely) trying to capture Santa Claus. None of them, were that compelling nor matter much. At least, the animation was good. It maintaining a colorful and festive atmosphere. Overall: I just wish, the story stood out more. It felt formula, generic & worst of all, recycled. There were too many similar to 2010's film 'Despicable Me' for me to like. If one of your characters sounds & acts like too much like Agnes from 2010's film 'Despicable Me', then you got a problem. In the end, while, I wouldn't say, don't touch this with a 39 ½ foot pole. Given the choice between watching this, again and watching a movie about a seasick crocodile. I'd take the seasick crocodile! At least, I know that film will have some bite to it. Sadly, for me, this will be one time watch.",
    "60": "This movie was decent and while the kids enjoyed it, the original is still so much better.It was interesting to see a different take on the story of The Grinch and the animation was very well done, but it seemed like the writers had trouble finding out ways to make such a short story into a movie. Most of the jokes are meant for little kids and I don't think adults will find that funny.While this version of The Grinch is not bad and good for kids, I still perfer the original version much more as it I felt it captured the story better and did it all in only a short running time. This is really only worth watching if you have kids that want to see it.",
    "61": "They did a great job expanding upon the story. It's a beautifully animated movie, and safe for the whole family. I also appreciated the combination of classic Christmas carols, modern music, and orchestral score. This is a new annual Christmas movie for us!",
    "62": "Most of the tradition was lost. Loved the characters and animals but it was so far off. It couldn't even qualify as a Dr. Seuss movie. They didn't even sing The Who song, hoe do you not sing The Who song?! The added songs were weird/hip hop. Not that I have anything against hip hop, it's just didn't belong here. I do give props to the Grinch for being more nice to Max. The characters were sweet but the movie ran way too long. It's better than the Jim scarred version by far. The narrator was way to young, another element that just didn't fit when the original narrator made the movie.",
    "63": "Review:\nFor an animation movie made for kids, I actually enjoyed this film. Maybe I'm going soft! The animation was top class, and the vibrate colours and attention to detail was quite impressive. The director stuck to the original concept, which was a plus, and I must admit, I did get a bit emotional towards the end. Don't get me wrong, it's not in the same league as the old Pixar movies, but there is something for the whole family, especially the little ones. The movie kicks off in the town of Whoville, were the humanoids called Who's are filled with excitement about celebrating Christmas. The only one who isn't amused is a cantankerous, green-furred creature called The Grinch (Benedict Cumberbatch), who has a heart \"two sizes too small\" and lives in a cave on the top of Mount Crumpit just north of Whoville. The Grinch has a pet dog named Max and they both only visit Whoville when the Grinch needs to buy food and do bad things. Meanwhile, 5-year-old Cindy Lou Who notices that her mother Donna is overworked trying to take care of herself and her baby twin brothers, Buster and Bean. At First, she decides to send a letter to Santa Claus to help her mother, but after encountering the Grinch, who sarcastically says that she'll have to talk to Santa face-to-face about it, she then decides to go to the North Pole to talk to Santa, but when Donna tells her that it would take a month to get there and back home, her final decision is to try and trap Santa with the help of her friends. With Christmas approaching, all the Whoville festivities give the Grinch a flashback, recalling his disjointing childhood spent mostly alone and unwanted in an orphanage. The Grinch soon decides that he will steal Christmas from Whoville to assuage his distress. He acquires a fat reindeer whom he calls Fred to help him pull a sleigh that he stole from his neighbour, Mr. Bricklebaum. After a test run, the Grinch discovers that Fred has a family. With a heavy heart, he lets Fred go home with them. On Christmas Eve, after making a Santa Claus disguise and dozens of gadgets to help him with his plan, the Grinch and Max, who pulls the sleigh in Fred's place, go down to Whoville to steal the decorations and presents. He soon encounters Cindy after falling into her trap. Her request to help lighten her mother's workload, and her kind advice about listening to the Who's singing to alleviate his sadness, touches the Grinch's bitter heart, but he still carried on with his mission. After stealing every Christmas present, the Who's wake up and are shocked to see that the presents and decorations are gone. At first, Cindy believes that she's to blame because she trapped Santa, but Donna tells her that Christmas is more than just about presents and that Cindy's the best thing that ever happened to her. The Who's then join together and sing, which puzzles the Grinch because they are still celebrating Christmas, despite the theft. After heeding Cindy's advice and immersing himself to their singing, his small bitter heart grows up three times it's original size. The Grinch and Max decide to return to Whoville to return the stolen items. A guilt-ridden and remorseful Grinch admits his crimes to the Who's, and apologises before returning to his cave. Feeling sorry for the Grinch, Cindy Lou comes to invite him to celebrate Christmas at her house, and he awkwardly attends. When seated down for dinner, he realises and confesses that it wasn't really Christmas he despised, but being alone and his bitterness over being neglected. Before carving the roast beast, the Grinch affects a toast \"To kindness and love, the things we need most. What a sweet story! Personally, I can't see myself watching it more than once, but I still enjoyed this adaptation of an old classic. Although he was a grumpy so and so, I liked the relationship between the Grinch and his trustee companion Max, who was always there for him. I did think that the soundtrack didn't suit the film, and the narrating got on my nerves after a while but judging by the box office takings, and the decent reviews, it's still worth a watch. Watchable!Round-Up:\nThis is the first major release for director Scott Mosier, who did a decent job with this project, even though it has been made a few times before. It was also directed by Yarrow Cheney, who was co-director for the Secret Life of Pets, The Very First Noel and the Minions short, Puppy!. After watching the bonus material, It's amazing to see the amount of work that goes on behind the scenes in the animation world, which is why it takes so long to release movies in this genre. Every hair, colour and facial expression is finely detailed, which goes through many processes before it's final render, so I appreciate the work that went into making this film. With that aside, I do think that the humour could have been much better, and I would have liked to have seen some more depth from the various characters but it's still fun for the whole family.Budget: $75million\nWorldwide Gross: $512millionGenre: Animation, Comedy, Family, Fantasy, Musical\nCast: Benedict Cumberbatch, Cameron Seely, Rashida Jones, Pharrell Williams, Tristan O'Hare, Kenan Thompson, Sam Lavagnino, Ramone Hamilton, Angela Lansbury, Lori Alan and Michael Beattie. 6/10",
    "64": "Oh look, it's another cash grab from illuminations. Who would have thought that they were gonna milk every penny they can from Dr. Seuss and his work.Don't watch this...",
    "65": "The narrator, the Grinch's voice and especially Cindy-Lou's voice are all wrong. The narrator should be deep, cozy and well christmassy , the Grinch should be more \"evil\" and what's up with Cindy-Lou? She should be sweet and soft, not that awful ugh what ever that is. Also the song? They turned in to some kind of hiphop, rnb garabge.",
    "66": "I wanted to walk out. It was so boring, long, not funny and honestly Cumberbatch gives a really lazy and half-hearted performance. I can't blame him though, this material was just complete trash. I can't speak for everyone, but I'm quite done with Illumination's \"spend 60 mil on the movie, and 300 mil on marketing it\" strategy. Ugh.",
    "67": "Ok I get this movie isn't getting very good reviews and I for one don't get why I personally loved it I laughed out loud and felt joy In my heart this is a movie I'm so happy I payed money to go see the heart was there it really made me ready for Christmas and the spirit was there I totally recommend you go see it",
    "68": "This is NOT an improvement on the 26 minute, 1966, made for TV, Classic HOW THE GRINCH STOLE CHRISTMAS. It's not as bad as the 2000 live action version, but it begs the question, \"Why mess with success?\" As a stand alone, animated, seasonal movie, it has some good points: the animation is good (the young Grinch is absolutely adorable and will probably sell a lot of merchandise - which may be the point of making this remake), it has some entertaining and diverse additional characters and it has an additional umbrella morale about the sacrifice of mothers and value of family. However, Benedict Cumberbatch is wasted in this movie (indeed any nasal toned American actor would have done as well), Pharrell Williams offers up some lame rhyming narration that doesn't come close to the excellence of Dr. Suess' craft. Cindy Lou Who is aged about 5 years and loses the innocent charm of the original. Under the stand alone criteria, I might give it a 6 (fair) out of 10 {Holiday Animation}, but, as an updated version of the original work, I give it a 5 (unnecessary remake) out of 10. {Christmas Classic}.",
    "69": "So yes there was the Jim Carey one (which you may think is the original, but seems like Boris Karloff would like to disagree according to imdb at least), but if you watch them back to back and with any nostalgia excluded, you may feel like me ... and see this as the superior movie. Though I have not seen the Karloff one, so I'm not saying the ultimate Grinch.Having said, the Carey Grinch was live action and this is animated. So maybe you prefer one over the other anyway. If that is the case, I will not be able to tell you what's what anyway. But this does take things that I personally would consider \"flaws\" from the Carey adaptation and succeed in making them work (like the santa sleigh with the presents to name one). Very well animated and voice talent that deserves that name and then some. Great kids movie that grown ups can enjoy too",
    "70": "Good film for the family, worth the money seeing it at the cinema and when it comes out on sky and when it comes out on Blu-ray",
    "71": "Illumination made their version of How the Grinch Stole Christmas. They've adapted one Dr. Seuss story already (The Lorax) back in 2012 and this How the Grinch Stole Christmas adaptation really misses the mark, in my opinion. Being this is the second remake of this classic story; I don't think I need to give a little bit of the plot in this review, at least.Because of the last couple of Illumination movies, Illumination is quickly becoming one of my least favorite big animated studios. The only movie from them I've really enjoy is the first Despicable Me. Everything else they've made over the years have been either very safe, mediocre films, or films I've really despised. The Grinch falls somewhere in between. I liked the first teaser trailer they put out when The Grinch being rude in the grocery store. I thought the movie might take place after he stole Christmas, like as a sequel, because of how he casually walked through the grocery store without whos fearing him. But as more trailers came out and proved this was a remake, I started worrying The Grinch would be really bad.There is at least some good I can say about the film. For one, the animation is good. I don't know if it's thanks to Dr. Seuss' stories having such a distinct look or if Illumination made more of an effort with this animated film versus their last couple of movies, but The Grinch's animation is really good. I'd almost give the animation category an 8, but there are a few character designs I did not like. In most cases with something is being adapted, I like when something is added to it that makes it it's own, like a specific director's style or look. There are things about some of the character designs (especially Max and Cindy-Lou Who) that remind me of Illumination's previous works. For some reason, when Illumination does something like this, it feels lazy, as if their reusing character designs of their earlier works and just tweaking things a bit. Max felt like he'd fit in the Secret Life of Pet's world and Cindy-Lou Who kept reminding me of one of Gru's adopted daughters in Despicable Me. I found it a little irritating.I like some of the gadgets The Grinch creates to steal Christmas and when it actually gets to that point in the movie (an hour into the film, give or take), I enjoyed it. There two other scenes I liked in the movie. One small scene is when The Grinch comes up with his plan. When he walks up a spiral staircase, his shadow is evil and twisted and it's the only moment in the movie that it's too safe and lets The Grinch actually look evil. The other scene I thought was actually good is the final scene in the film where The Grinch is invited to a Christmas party. I thought it was a sweet moment in the film. And that's really the only things I liked about the film: the animation and three scenes. Everything else was either bland or just plan bad.The absolute worst thing about the film and the thing that makes it a bad remake is that The Grinch doesn't even feel like The Grinch! The Grinch isn't mean enough or disgusting enough to be The Grinch. The only bad things you see him do are all in the trailers or when he finally tries to steal Christmas at the end of the film. He's nice to his dog, Max, and he only seems slightly annoyed with the whos. The creators of this film played it way too safe, wanting us to relate and feel bad for The Grinch. For the most part, he's just sad about being alone. This might have been fine, but the narration reminds us that The Grinch's heart is three times too small. In no way does The Grinch ever seem like his heart is three times too small. He's way too nice. His voice doesn't help either. Benedict Cumberbatch was a great choice for The Grinch, but he wasn't used properly. He should have had one of his deeper voices for The Grinch, but instead we get a wimpy nasally voice for The Grinch. I wonder if they thought his deeper voice would have been too scary for the children. It was such wasted positional.There were so many pointless side stories and filler in this movie to make it full length. Cindy-Lou Who in this film wants to trap Santa Claus so she can speak with him and ask him to help her mother for her present. They stretched this story-line so pointlessly. It even gets to a point where she suddenly has a gang of kids to help her. They're introduced like they might be important, but then they have one scene where they test out the Santa trap and then they practically leave the movie! The side plot of the fat reindeer was also pointless. I knew he was not going to be used in the stealing of Christmas, because even in the trailer The Grinch tells Max that he will guide his sleigh. There was one brief moment where Max gets jealous of the reindeer and I thought that maybe the side plot would lead to Max getting rid of the reindeer, but then the jealously is never brought up again, because The Grinch discovers the reindeer has a family and lets him go. The only reason the reindeer is in this movie is for filler, to be cute, and to have an excuse to have the reindeer and his family to save the sleigh from falling off the cliff instead of The Grinch!This is just a pointless and overly long remake of a classic. You're better off watching the original How the Grinch Stole Christmas. Hell, the Jim Carry one is better than this version. The Jim Carry version might have it's fair share of problems, but at I can appreciate it's boldness of trying to make it live-action and also have the added theme of the over commercialization of Christmas. Illumination's The Grinch is just too safe and misses the point of The Grinch's character. Imagine of Scrooge wasn't all that bad in the countless Christmas Carol adaptations.And don't get me started with Tyler, The Creator's rendition of \"You're a Mean One, Mr. Grinch\". It's among one of the worst song remakes I've heard.Story: 3\nActing: 3.5\nCharacters: 2\nDialogue: 6\nCinematography: 6\nAnimation: 7\nEditing: 6\nScore: 2\nDirecting: 4Critical Score: 4.39Personal Enjoyment: 3\nFinal Score: 3.70",
    "72": "Benedict Cumberbatch's voice acting was inconsistent and didn't fit the character.Pharrell's music didn't work for me.",
    "73": "Apart from the minor fact that the narrator's adolescent voice tone lent no gravitas, sophistication, or other quality point to the film, the entire package was a perfectly acceptable new interpretion of the character and story.The music was fine, and the delightfully festive Whos of Whoville even managed to sing two traditional hymns - God Rest Ye Merry Gentlemen and Silent Night.We were three generations who saw it, and each generation found something to enjoy. How wonderful that this relatively modern story about the true spirit of Christmas continues to find new outlets for interpretion.(The negative critics do realize this is a work of fiction, right?)",
    "74": "I went to this movie today with my 3 and 7 year old kids and we all enjoyed it! This movie is an easy classic that will be in our Christmas movie rotation every year. It's so nice to see a take on the story that sticks pretty close to the original without doing what kids movies do so often these days - create over the top sad and heartbreaking back stories. Visually the movie looks great and the story moved along quickly enough to keep my 3 year olds attention. The characters are adorable and had everyone in the theatre laughing. If you're looking for a good easy going kids movie this one is great for the whole family.",
    "75": "The animation is wonky and it's generally unremarkable, but some of it works. Cindy was so cute and Benedict Cumberbatch was a great choice but his voice sounded odd like a Cumberbatch, Ryan Reynolds, and Bill Hader mix. It's not gonna wow anybody but no one will regret seeing it either. It sucks having to be compared to the fantastic original but for the most part The Grinch satisfies enough.",
    "76": "The obvious banishment of the word Christmas is a set up for this okay but unnecessary remake with a varnishing of PC lacquer. The Grinch is far more mellow, a but grouchy but not scary and abusive like the original. He's just sad and lonely- though so was the original. He's a lot more hygienic. There's also a tired, single mom.",
    "77": "Honestly lost interest in the first 10 minutes, the whole film just feels really stretched out. The emotion and magic that we felt in \"How the Grinch Stole Christmas\" (2000) has been completely stripped to force trends. Why they decided to use rap music for the soundtrack I have no idea, it doesn't fit at all.",
    "78": "This is an immediate festive classic. Benedict Cumberbatch puts in a faultless performance.I really don't understand the negative reviews. This finally lays the Jim Carrey abomination to rest.Everyone in the cinema was laughing from the start with the sure touch of the studio famous for hits like Despicable Me and Minions providing a raft of visual and verbal gags.I want to spend Christmas in this Whoville and anyone who doesn't isn't welcome at my house this Christmas!",
    "79": "The Grinch is good, clean, wholesome, honest, family fun. We took three generations to the movie (grandparents, parents, grandchild) and everyone enjoyed this.This version of The Grinch far out shadows the Jim Carrey version. Benedict Cumberbatch brings a sour, grinchy, but somehow loveable Mr. Grinch to this adaptation of the classic Seuss story. Keeping fairly close to the source material, but still taking some fun creative license, this movie encapsulates Dr. Seuss's original meaning behind the tale.Those who give this movie a poor rating, citing that the movie is too clean and wholesome, clearly don't have children. Dare I say that those reviewers may be grinches themselves, clearly not understanding the meaning of Christmas as Dr. Seuss himself would have us understand it.",
    "80": "I am 64. My wife is 51. We loved it!!\nImaginative and colorful, beyond our imaginations. Heartwarming story too.",
    "81": "Intended to rent the original to watch with my grandchildren. Selected this by mistake. Decided to watch it since it was paid for.Yes, the CGI is more real than the original cartoon, but the rest is un-inspiring and unremarkable. Like so many other remakes, they have tried to uncover the sad childhood that made the Grinch evil, added some 2020 cultural values.The music has been updated which made it common rather than unique.Thanks, but when it's finally finished playing I'll rent the original.",
    "82": "I loved the original cartoon. Grew to adore the live action remake which managed to keep the spirit and message if the original. This one fails on all fronts.The grinch is not scary, not even a little bitty.Cindy Lou is not cute, might have been better had she been mute.The script was changed in the worst of ways, leaving many to wonder why waste so many days?The voices were wrong, from start to end, so this movie I simply cannot recommend.Sorry that I have this to say, this is not worth a minute or second of my day.",
    "83": "This Grinch who stole my money. I'll watch the classic and Carrey's version. Thanks. Did we really need this? Cash grab for this generation of kids. Seuss is rolling in his grave.",
    "84": "The Grinch is a colourful and visual spectacle and a guaranteed joyride for the children and even for the adults too. Even though the critics response were mixed, I suggest every person with his family should have a go for this one. Benedict Cumberbatch nailed as witty yet emotional 'The Grinch'..",
    "85": "Horrible remake. Terrible writing & script. Epic casting failure from the voice of the grinch right through to the narrator.",
    "86": "I was on the fence about this one from the start as I really don't see anything toping Jim Carey's Grinch.. but I really Benedict Cumberbatch and figured my kids might enjoy it too. Overall it was a pretty decent funny film with some different spins on it which made it a worthwhile watch. Don't understand why there's so much hate.. it's a movie. If you don't like it then don't watch it. I'd recommend this to anyone with kids.",
    "87": "I want to say first off that I love the original 30 minute Christmas special that started it all! It is classic and it is the best. Many critics and people who have bashed the new movie say that the original is the only one needed. They say that this one is too bloated with extra details and additions to the story. From just my recent viewing of the film I have to disagree completely. The new characters and additions to the story made it even better and gave us more insight into why the grinch is so bitter. Overall The Grinch is a heartwarming film that spreads the true message of Christmas while keeping the simplicity of the original and adding thoughtful new characters and backstories to give greater meaning to the story by dr. Seuss. Don't listen to the critics and watch it yourself!!!",
    "88": "I was one of those who grew up with the 1966 original. I never liked it. I liked the story, but it lacked something. And the 2000 story left me bored and uninterested. Leave it to Illumination to make me fall in love with the Grinch! The bright colors, the sounds of carols (kudos for the use of religious music!!!) and interesting enough, I could feel the warmth of Whoville and the cold of the Grinch's cave on Mount Crumpet. I could smell the Christmas cookies and taste the red velvet Christmas cake. It was a feast for the senses. Six enthusiastic thumbs up from a 50 year old, her 48 year old hubby and her 8 year old son.",
    "89": "The grinch isn't angry enough andThe story line is just depressing. It's not about th grinch hating Christmas, it's about him avoiding Christmas.This just makes you wanna watch the Jim Carrey remake",
    "90": "We just saw this in the theater and we loved it. My kids are 3 and 5 and they sat and watched the whole time. As a parent, I loved the story. The world needs a little kindness and love. I",
    "91": "While this version of the Grinch is certainly is a more visually stylistic, less threatening and socially relevant one, I can't help but feel that it was over-stuffed and a little unoriginal. The side story with Cindy Loo Who trying to trap Santa in order to help her overworked single mother seemed to only be a tool to fill up time.Nevertheless, despite not being the target audience, I did find this film funny and entertaining. I truly loved this version of the Grinch character because I relate to him a lot (social anxiety, depression caused by loneliness and emotional eating). Benedict Cumberbatch does a great job at providing a nuanced, witty portrayal of a person embittered by years of solitude.Although it does suffer from being third in place in the adaptation of the Dr Seuss story, it's probably my favourite one so far.",
    "92": "Illumination just after monney. The original was so perfect well made story. The new one just make me angry. It took several days to just finishing the movie, never thought an animated movie would be that boring. My provided point is just to the artists whose effort made the movie so eye pleasing. I like Benedict Cumberbatch, but here just waste of his talent. May be kids would like the movie!!!",
    "93": "Why take a classic and ruin it! Just a pathetic attempt, and so wrong. Truly horrible.",
    "94": "The Grinch in this version is not as mean just misunderstood and treats his dog Max as an equal and best friend, but his only friend.He grew to dislike Christmas due to a childhood incident. That made him despise the holiday and in the wanting to plan to \"steal\" Christmas meaning gifts and toys and decorations.People who grew up with the original with the late Boris Karloff will bring their own kids to see this and it kind of still follows that version.But the people of Whoville are happy go lucky and that they love each other and show kindness even to the Grinch. Will they turn on him as he \"steals\" their Christmas?Benedict Cumberbatch is great in the role of in the titular character. Cynic but sympathetic and misunderstood all at once.",
    "95": "Hilarious and amazing, it brings back so much childhood memories! 😁😊😊😊😊",
    "96": "What Illumination does with the source material is to bring this to an entirely new level; the depth of the animation is fantastic and detailed, and the story itself is funny and relevant. The casting is spot on, the Danny Elfman score is inspired, and the song selection is nearly perfect. I say nearly, as the new version of \"You're a Mean One, Mr. Grinch\", by Tyler the Creator, is a mumbled mess. There's no beating the classic version, sung by Thurl Ravenscroft, But what Tyler the (okay, I'm seriously not writing out that ludicrous name again) does to the annunciation of the lyrics is borderline inane. Pairing him with children is creepy and just plain weird. At least it is only a brief cut, and we aren't subjected to a full version of the song.\nThe highpoints are Pharrell Williams' narration, Cameron Seeley as Cindy Lou Who, and (most of the time) Cumberbatch's Grinch. Easily the best animated film of the year.",
    "97": "The Grinch certainly looks like another deeply average animated flick, but is certainly not. The Grinch shines with vibrant animation and some fun voice work that works more than it should. It certainly is entertaining, but much of the fast moving story line, seems unneeded, an is only put there as an excuse to make a longer run time. At the end, even with its sometimes corny predictability, The Grinch is able to put everything together and make it work, even with a surprisingly sweet message upon its finish.\nMy Rating: 7.5/10",
    "98": "I expected so much from this movie, but was disappointed. The animation is great but character design is awful and derivative of other Illumination films. The story is good but lack what made the original so beautiful and touching. The new content introduced in this film isn't that interesting and overall hurt the pacing and drag on a bit even tho it has a friendly runtime. The voice acting, well, is good but I got a mixed feeling about Benedict Cumberbatch as The Grinch. And I find the narration by Pharrell Williams to be annoying.\nOverall, The Grinch has a beautiful animation but the story felt short and dragged on. 6/10.",
    "99": "You'llbe laughing from the time you sit down until the credits start rolling. Heart warming and fun, it's a great movie for the whole family. And it doesn't have the terrible jokes and weird feeling of the Jim Carrey version...",
    "100": "\"Political correctness\" is ruining movies. The grinch in the original version you could even say was scary. He had a cruel and mean personality and Cindy Lou was lost and did not understand how who's celebrated Christmas. I was really disappointed and boared. I didn't even like the voice of Benedict Cumberbatch as the grinch. Just horrible!!!!",
    "101": "The Grinch presents a zestful and umfaltering melodic that combines sheer voice acting with a complete yobeling. After such an impressive voice role as smaug in the Hobbit series, the casting of Benedict Cumberbatch as the lead voice actor is a je ne sais quoi that fits the bill for a successful box office",
    "102": "Sitting in the theater part way through my initial thought for a title to a review was \"Empty calories\", but in this case that would be too harsh. More accurate would be something like \"Innocuously & mildly entertaining\". This is quite a different Grinch, more of a victim than the ultra-nasty villain from the book and original TV show. As Kamunrah might say \"he's not bad, just vaguely grouchy\". So he gets in Wiley Coyote situations while ineffectively trying to spoil the Who's Christmas. This is brought to you by the same mindless folks that did Minions, so there's little soul to this movie, but there is a smidgen of real warmth and a nice wrap.",
    "103": "\" . . . he just stole our stuff,\" proclaim the victims of perhaps Universal Movie Studio's scariest monster yet, THE GRINCH. Universal has long recognized that Ecclesiastical Ogres in general--such as THE MUMMY, and the Egyptian priests manipulating him--and Roman despoilers in particular, including THE HUNCHBACK OF NOTRE DAME, are especially threatening because they ring so true to Real Life. As Hollywood's pre-eminent House of Horror, Universal pulls out all the stops for THE GRINCH, giving him the same sort of cavernous hide-out, massive pipe organ, and self-pitying misanthropy displayed nearly a century ago by its PHANTOM OF THE OPERA. However, a screaming Lamb gets in the last syllable of THE GRINCH. This is appropriate, since the Lamb of God would no doubt react more violently to most any opulent modern-day Temple than He did to His birth \"den of vipers\" in Jerusalem. Universal must be commended for taking on Organized Gloating during the Holiday Season with this horror offering for all ages, THE GRINCH.",
    "104": "Took my five year old daughter and this movie was amazing. Loved the concept and it was just too adorable. Highly recommend!",
    "105": "Worst remake ever! I Absolutely despise the Grinch theme song They butchered it!",
    "106": "Ok so going to see this movie i wasnt sure what to think yet after all the negative reviews but boy am i glad i did it may have been short on length but it was big on what mattes most the heart of the movie plus the added humor helped out too",
    "107": "A nice family fun movie! Recommended this to everyone.",
    "108": "Nothing like the book!! They changed everything and the Grinch is nice now. WTH?",
    "109": "Ok! So I went to see this on the day of release and I can say, as a 14 year old, I enjoyed this a lot. I haven't laughed so hard at an illumination film since the first despicable me. There are plenty of scenes that allow laughs, tears and most importantly allow you to have fun. If you love the original starring Jim Carey then you will definitely love this!",
    "110": "First off, this movie is not about THE Grinch. It is about a man named Grinch who is sad and lonely. His heart never grows in size because it was never smaller in the first place. The movie tries to make the Grinch relatable, but in doing so, they remove the essence of the character.Beyond that, there really isn't any kind of substance beyond the original story, which means this 1.5 hour film definitely feels 3 times longer than the original 30 minute cartoon because it really drags on.",
    "111": "I saw \"The Grinch\", starring the voices of Benedict Cumberbatch-Dr Strange in the Marvel movuies, Star Trek:Into Darkness; Cameron Seely-The Greatest Showman, The Jim Gaffigan Show_tv; Rashida Jones-Angie Tribeca_tv, Parks and Recreation_tv and Kenan Thompson-SNL_tv, Snakes on a Plane.\nThis is an animated version of the Christmas classic-I think the last version was a live action movie starring Jim Carrey. Benedict plays the Grinch, an unhappy and miserable creature that lives just outside of a town called Whoville. Everyone in Whoville are just the opposite of Benedict; they are friendly and happy and love Christmas. Benedict decides to make all the residents as unhappy as he is by disrupting their holidays. Rashida plays the mother of Cameron, a little girl that wants to teach Benedict the true meaning of Christmas and Kenan is another cheerful resident of Whoville. It's a fun family film-a little early for the holidays-that has a lesson to be learned.\nIt's rated \"PG\" for rude humor and has a running time of 1 hour & 30 minutes.\nI enjoyed it and would probably buy it on DVD for the grandkids to watch.",
    "112": "If you're familiar with the Dr Seuss children's classic \"How the Grinch Stole Christmas!\", you'll be familiar with this story as well. How can the Grinch ensure he gets some peace and quiet while Whoville celebrates? Why he's going to take matters into his own hands, of course! Along with his trusty dog Max, the Grinch plans to steal all the decorations and gifts from the entire town in one single night, and toss them off into an abyss. This re-imagining doesn't deviate too much from the original story but adds some subplots and characters to give it a bit more flavour. Animation wise, Illumination knows precisely how to make their characters visually endearing as evident by everyone's favourite Minions. They create a broad canvas by making Whoville larger-than-life, then filling it with a lot of tiny details and a splash of colour that gets you right into the spirit of Christmas. And that's really what this film is all about.There is a timely and relevant message on kindness and acceptance that's firmly rooted in the screenplay. This becomes evident towards the third act and gives the film more to look forward to than merely having a bad guy trying to burst everyone's happy bubble. Cindy Lou Who, voiced by Cameron Seely plays a crucial role in this aspect. Benedict Cumberbatch has a lot of campy fun voicing the Grinch, and he goes all out to embrace the grouchy and grumpy character. There's a slight menace to his take on this character, but Cumberbatch also adds some heart to the otherwise pessimistic persona, and that's when the movie pulls on your heartstrings just a little bit.As long as they can sit through the first two acts, this gives something for adults to look forward to. Otherwise, the interactions between the Grinch, his dog Max and a huge reindeer Fred lend to the most entertaining moments. Pharrell Williams as the narrator speaking in rhymes from the original book adds a nice touch that threads the film. While 'The Grinch' isn't exactly groundbreaking or fresh, it has just enough Christmas magic to justify another modern retelling of an old story",
    "113": "Okay so I loved the movie and it made me laugh and feel very warn inside it had a ton of humor heart and loads of good lessons for young and old alike it made me feel all Christmas like so I hope it'll do the same for you and yours",
    "114": "Great to see the grinch back.. my kids loved and so did I!",
    "115": "We don't need the Grinch's psychology; the character's original intent is to serve as a stand-in for anyone who has forgotten \"the meaning of Christmas\". Making him a secluded, unloved orphan takes away all the joy in the story, and completely changes the message. And whose BRILLIANT idea was it to change and dumb-down Seuss' brilliant narration? The line to apologize to Jim Carrey and Ron Howard starts behind me.",
    "116": "The movie is cute, and the animated set-pieces are works of art, but the movie does little to make the Grinch truly 'Grinchy.' Sure, he's rude, grouchy, and hates Christmas; he feels more like a grouchy neighbour, rather than someone who truly hates the Whos.\nIt is a good take on the Grinch for young kids though.",
    "117": "I don't think I or my family laughed at one joke. The story was stretched thin and the new added parts were worthless. The grinch and max looked right but Cindy was all wrong. The narration was meh and the music was no good. The remixed grinch song was garbage. Visually it looked great. I thought the animation was pretty good but man it's a slog to get through.",
    "118": "The movie is just Ok.The character Grinch has been portrayed so well as we understand what made Grinch steal the christmas and feels bad for him.But the narration and screenplay is so weak that the comedies falls flat and it fails to engage.",
    "119": "I love the original Grinch movies. This one was awful, the story was rushed there was no connection with the characters. This is more of a propaganda movie than anything. The random Christmas rap songs? Not good.",
    "120": "Not as good as the original but still a very good film to watch with the family and to get in the Christmas mood.",
    "121": "I have to admit The Grinch was a very good film. The only downside was the size of the Whos' noses and how the cinema told me 2 hrs and 10 minutes which was highly inacurate. This film was very good, but I didn't understand why Benedict Batch-of-Cucumbers had to put on an American accent. The Grinch is an annoying, cuddly character and honestly I don't understand why Mr. Batch-of-Cucumbers wasn't in the original. (I went to the film in my special Grinch slippers)",
    "122": "I took my 7 year old to see this movie and almost fell asleep. If you think slapstick humor is funny, then this movie is for you. Its not well written, few spots to laugh at and it not even remotely what the Grinch is about. Pass on it and save a trip to the show.",
    "123": "Well, I came across this movie, didn't know it existed so I thought, What the heck, its Christmas time, lets give it a try.... OMG, what a waste of time.I tried and I tried for around 30 minutes to watch this totally UN-FUN and Rapped out version. Sorry, but since when do they need Rap to make a Grinch movie?Well, my girlfriend, who LOVES everything Christmas, was begging me to turn it OFF and I was like, Well, lets give it a little bit more and see if it gets better.... NOPE... never got better and we both fell asleep on it. The Grinch's voice was simply TERRIBLE, the story line totally rewritten and not in a good way... and pushing the Rap music in a Christmas movie was the end.Sorry, one strike, two strikes and three strikes YOU'RE OUTTA THERE!!!",
    "124": "Maybe children will enjoy this film? But honesty I feel that aside from the beautiful animation there is nothing else to keep any audience member engaged. It's way too long. The voice and demeanor of the Grinch is all wrong. The story rambles in different directions. The hip hop music intervals are a mismatch. And the narration is flat. It plugs in elements of the original Dr Seuss rhyming story but loses ALL of the fluid poetry, meaning and charm!",
    "125": "As being a GRINCH specialist ... I have loved it from the start ... THIS REMAKE drags on and on and on and on and on and on! Not like the original that keeps you engaged.There was a some funny parts but half the time I found my mind drifting. I am open to give remakes a chace but THIS MISSED THE MARK BIG TIME!",
    "126": "I know this will upset some folks, but the 2000 version of Dr. Seuss' classic, \"How The Grinch Stole Christmas\" was an abomination. First, the entire message of the original story was lost...and was, in fact, the opposite of Seuss' story. Second, the story was all about Jim Carrey and his mugging for the camera....everything else seemed secondary. Because of this, I was terribly disappointed, as I loved the original story and the great 1966 cartoon. Because of this, I was very reticent to watch this 2018 incarnation. But, in hindsight, my fears about the latest film are mostly unfounded.Because the film is about an hour and a half long, I already realized that the story had to be padded and include some new material...this is just inevitable. However, I was surprised how much I liked this material...such as the Grinch's cute reindeer. It was very pleasant and all contributed to the story instead of distracting from it. And, as far as the story goes, it stuck pretty close to the book--even using many exact quotes from the classic tale.As far as the quality of the film goes, it's a mixed bag but mostly good. The animation was eye-popping and wonderful. It really is great on the big screen and the 3-D effects were magnificent. I also liked that they made the Grinch a hater of Christmas but NOT a hateful or evil character. He was kinder and more sweet at times....even though he hated the holiday. The only things I wasn't thrilled about were the narration by John Legend and the voicework for the Grinch himself by Benedict Cumberbatch. I had the distinct impression that BOTH were used simply because the studio could get them--not because they were appropriate for the film. Legend is apparently a nice guy...but his nice-guy voice wasn't what you'd want or expect from a narrator. The same for Cumberbatch--who DID sound very different from his usual English accented voice but still was too 'normal' a voice for a character such as the Grinch.Overall, despite my voice talent complaint, the film is a great family film...one that honors the book and 1966 film instead of ignoring it like the 2000 incarnation. Well worth seeing and amazingly heartwarming...especially at the end as well as when the Grinch is interacting with his dog and pet reindeer.",
    "127": "Took the grandkids to this movie...they didn't think it was very good. It seems like something that was produced for the dollars it could make rather than a story that needed to be told.The good: it was not very long. The colors are brilliant and visually stimulating. Max was remade with a little more of a fun personality.The bad: Grinch somehow seemed wrong. I'm not sure if it was the voice, the artistic effects, or just a general un-Grinchiness. The story was a retelling that didn't need to be. The biggest negative is the feeling that this movie is forgettable.I'm sure I'll never watch it again. I've watched the original about a billion times, and the Jim Carrey version nearly the same.Bottom line...save your money and rent it later.",
    "128": "Part of me was interested in seeing 'The Grinch', being a fan of the original Dr Seuss story and especially the 1966 animated version with Boris Karloff voicing Grinch (do like the Jim Carrey version better than most) and being someone who likes Benedict Cumberbatch and a lot of what he's done. Was nervous though too because the trailer did not look good, the reviews are mixed to not great and did question whether it was necessary.Dr Seuss adaptations have been very hit and miss. The animated short television specials have fared significantly better than the feature films, Dr Seuss' work lends itself better to adaptations of a short length and the television specials were not only great adaptations and true in detail and spirit but great on their own. Of the feature films, the best one is by far 'Horton Hears a Who' with the worst being the live action 'The Cat in the Hat' (to me among the worst films ever made). Illumination has also been variable, loved the first two 'Despicable Me' films while not caring for 'Minions'.Saw 'The Grinch' anyway as someone trying to see and review as many 2018 films as possible and loving the story and Christmas films, also to see how Cumberbatch would fare as Grinch. Seeing it, it is nowhere near as good as the 1966 version and is neither a Christmas cracker or a bah humbug. It is also neither among the best or worst films of the year, somewhere in the middle for me.There are definitely great things here. The animation cannot be faulted, so much gorgeous and meticulous attention to detail and rich vibrant colours that really immerses one into the world of Whoville. Some of the soundtrack has a festive and infectious feel. There are funny and emotional moments, the former with the funny and adorable (plus more interesting) Max and the latter with the Cindy Lou subplot, that and the character herself being the sweet and charming heart of the film.It is not a film without soul, having a warm glow more than once and some spirited elaborate set pieces, it does well with sticking to the spirit of the story and with the back and forth between Mount Crumpet and Whoville. It is not too long and has a lively pace generally. As said, Max and Cindy Lou are the best characters. Mostly the voice acting is good, with Cameron Seely being the clear standout.Having said all of this, 'The Grinch' could have been better. It does offer very little new or fresh, trying to be faithful to the source material while not moving enough beyond that that it all feels too safe. It could have done with more humour and heart generally, could have done without the repetitive and tired screaming goat gag and outside of the Cindy Lou subplot soul is missing.Found myself mixed on the pretty unrecognisable Cumberbatch. He does well providing a curmudgeonly touch and has moments of grinchy- meanness, plaudits too for not making Grinch too scary or resorting to excessive mugging. Do feel though that he was not mean or Grinchy-enough and he would have fared much better using his own voice for the character which would have fitted better. Had a big issue with the annoying, intrusive and over-explanatory narration that was not always necessary and with a rather out of place Pharrell Williams. Other parts of the soundtrack grated and too reminiscent of commercial music neither catchy or to my taste that didn't gel with the setting or the rest of the film. Too many of the supporting characters are forgettable and one-dimensional.Overall, better than what the critics have generally said but was rather mixed on a film with a lot of great merits but feels too safe and one does question the point of it. 6/10 Bethany Cox",
    "129": "Illumination is a studio known for producing gutless, boring, paint-by-numbers, mass appeal movies that focus more on cute gimmicks and marketing than they do on actual storytelling and character development. If you've seen anything else from Illumination, you practically don't need to see this movie, because you can probably just predict every scene in your head and just about get it right. While The Grinch isn't Illumination's worst, it's still a thoughtless and emotionless product only meant to sell toys and theater tickets before charm and charisma.Benedict Cumberbatch's Grinch is boring. I do like Cumberbatch and I did think he'd be great to voice the Grinch, but he's terrible in this movie. His voice doesn't match the character whatsoever, and does nothing to bring the character more to life. At least Jim Carrey put energy and emotion into his performance, whereas Cumberbatch sounds like he's disappointed about the small paycheck he's just been given. The Grinch himself is written in a way that pulls all punches and has to cave in to cutesy kids logic instead of a clever way that tells a good story. Instead of making The Grinch actually funny or interesting, they make him the typical 2018 grumpy hipster who's a good guy at heart but just needs his morning coffee. Making him a mostly good character really undermines the climactic payoff of him finally understanding the meaning Christmas towards the end.Sadly, both the character and the overall movie as a whole share the same problems; it's boring, uninspired, and vanilla. Much like the character, the movie sucks out anything interesting in favor for playing it safe and selling toys. The music is even done by rapper Tyler The Creator, and even as a moderate fan of his work, the music here is terribly uninspired and obviously an attempt to make the film more hip. Most of the jokes are entirely predictable. Actually, the entire movie is predictable. I don't mean we've seen the original movies, I mean the film follows every generic story you'll ever see in a kids movie. The film feels more like it was written by a computer and less like a team of engrossed screenwriters. One of the film's running gags is the ex-popular 'screaming goat' meme...seriously, I thought that meme stopped being funny in 2013.Truthfully, this film is not the worst thing to come out of Illumination. It may not be a good movie, but at least it doesn't completely bastardize and miseducate its message like The Lorax did, and at least it isn't as excruciatingly for-the-masses as Minions or The Secret Life Of Pets. The Grinch, as well as every single other Illumination Studios movie, is like a cute untamed puppy; it may urinate on your rug and chew up all of your shoes, but it's cute and looks at you with big puppy dog eyes and does silly things, so you don't punish it and let it slide when it really shouldn't be forgiven so easily. When are we as an audience going to stop letting these thoughtless movies slide solely because of their cuteness? Regardless, moms and kids alike will continue to enjoy these movies without the slightest care, simply because it's cute and nothing more.",
    "130": "Dr Seuss short story of The Grinch gets a second big screen treatment.There was a very good short animated cartoon made in 1966 where the Grinch was voiced by Boris Karloff.This CGI animated version is colourful but bland. The songs have been updated by they come across as mediocre. The voice acting is below par. Benedict Cumberbatch does not come anywhere near Jim Carrey never mind Karloff.Here the Grinch hates Christmas because as a child he was always lonely at Christmas. Forced to go into Whoville during the run up to Christmas to stock up on food. The Grinch sees consumerism gone rampant over the festive period. Everything is bigger including the Christmas tree and there is forced jollity.The Grinch has a twisted idea to ruin everyone's Christmas. One girl Cindy-Lou wants to speak to Santa as she has a special wish. Maybe she can make the Grinch's heart two sizes bigger.Obviously the kids will enjoy this overlong movie. It lacks the wicked fun and zest of the 1966 cartoon.",
    "131": "I'm going to keep this review short since you know the story most likely.I was enchanted by this movie from the moment it started. It was a fun animated movie, with gorgeous animation, a lot of heart, and even some humor. The 90 minute run-time makes the movie fly by.And the Grinch is evil but not scary. This has been ridiculed, but I like that the movie was trying to make it more comfortable for the little ones.The ending, even though I knew it was coming, was very uplifting. The Grinch's heart grew 3 times bigger, but guess what? So did mine!This is one of my favorite animated movies now, and my #1 Dr. Suess adaptation. This is the movie to see this holiday season!Note: If you found this review helpful, please click on cinephile-27690 to read my other reviews!",
    "132": "Boris Karloff was the voice of the original animated Grinch of 1966, and although he wasn't scary even when I was eight, the Karloff voice brought gravity to the\nproceedings. The Grinch in this film has the harmless sounding voice of Benedict Cumberbatch. And although the original Grinch was a grouch, this Grinch is nothing more than dissatisfied. I realize that the Grinch can't go around abusing his dog Max like he did in the original - times have changed. But here he is practically the dog's life coach, telling Max that he can do things if only he believes in himself.But one thing that didn't NEED to change was having Cindy Lou Who be the oldest child of an overworked single mother, Betty Lou Who. How can Cindy Lou be the smallest who in Whoville if she is an older sister? But I digress. Cindy Lou Who has just one wish - for her mother to have it easier and not be so overworked. As for the technical details, the art design tries to be too CGI. I liked the basic Chuck Jones illustrations in the 1966 version that were not meant to look the least bit real. So like most modern films, this one makes the art design photorealistic and completely misses the point of the original tale or at least throws in so many modern subplots that there is no nostalgia or charm for fans of the original.",
    "133": "This is another film by illumination animation, a company known for their very cheap animation, generic cookie cutter plots, low brow humor, Pop music, and those annoying minions. Yet despite this list of grievances they are highly successful, because they make lowest common denominator movies anyone between 1 month and 100 years old could watch.This brings us to the Grinch, a needless remake that no one asked for or wanted. After the Lorax's dreadful adaptation, the quality of this trash should come as no surprise. Yet it represents almost everything wrong with entertainment; it doesn't exist because an artist was inspired to craft a loving adaptation telling a story he/she wanted to tell. It exists because it's a Dr. Seuss property and a Dr. Seuss movie prints the money itself.Anyway this movie is as lame and as generic as you could possibly imagine. The Grinch is comically sympathetic, but isn't likeable. I'm stunned that the filmmakers managed to suck out all character, nuance, and personality of the Grinch and leave him as a hollow shell who acts like an A**hole. Also the Grinch who should be a foul/gross weirdo looks too clean and basic thanks to the simplicity of the cheap animation.The townsfolk are either comically evil, ignorant, or innocent. The setting is awful and feels empty, the music sucks, and the pop music REALLY makes your ears bleed in this one folks!One positive is the color pallet, very Christmas-y and very easy on the eyes. But again the animation is so basic and simplistic that each character looks so bland and unmemorable I can't even remember more than 4 character designs.Ultimately the quality doesn't matter (the studio knows this, which is why they sold this movie out to any company that would advertise it), people will see this and it'll make over $500 million at least. If somehow you like illumination animation movies, you'll like this one. if you don't then you'll hate this.",
    "134": "I honestly do not get the impressionable casuals who say that any critic who dislikes a movie they like is wrong. Using that logic, YOU'RE wrong for liking it. But that's not true, because it's all subjective. With that out of the way, allow me to explain why I didn't like this movie:It's dull and boring. It's not interesting, it's only funny in certain places and even then it only resulted in a small smile. If what's advertised to me as a comedy movie isn't that funny to me, I think it's failed as a movie. This could've had the potential to be a pretty decent movie and it's not the first time Illumination has done a Dr Seuss movie. Expectations weren't exactly through the roof, but I expected them to do so much better than this. The animation is pretty good, as expected for Illumination, but it can only dazzle me for about 5 minutes before I realise how dull and uninteresting this movie is.Again, if you liked this then good for you, but I just can't enjoy this movie.",
    "135": "This adaptation was a pathetic retelling of the classic Grinch Story. It was more like a TV movie...it should have gone straight to video. Comedic moments were quite predictable and not very clever. And I guess even in Whoville there is death and/or divorce...the little girl did not have a father...only a mother.However, what really helped spoiled the whole experience was the voice they chose for the Grinch...it was definately not Grinch like. The voice was way too human...it sounded like the actor was just voicing himself without putting any feeling into being a true Grinch. The voice acting was quite bad with other characters also...the little girl's voice was high pitched and quite annoying...I wanted her to be quiet. They also had a stereotypical northwoodsman type of character that was voiced like he was a stereotypical character that just got off the train from South Chicago.Overall, this movie was really bad!",
    "136": "The Grinch (Benedict Cumberbatch) hates Christmas. To his horror, he has emotionally eaten all the food and is forced to go into Whoville during the Christmas season. It doesn't go well and he comes up with the idea to ruin Christmas by impersonating Santa Claus. Meanwhile, Cindy Lou Who needs to talk to Santa about her wish. She recruits her friends to catch Santa.The 1966 special is perfect. This movie tries to improve on it by expanding on the story. It's a fool's errand. It could never improve on perfection. I actually don't mind the expansion in general. There are two big no-nos. The Whos look way too human and where are their antennas? They're just people with tiny noses. If the Whos are humans, then make Grinch a human and make this a live action movie. I wouldn't recommend it but at least, that could be interesting. This movie tries to be too modern. It needs to get rid of the electronics. The Whos exist in a specific world and the closer it gets to the modern world, the worst the visual content gets. The Whos have a certain style. At some point, it's no longer Dr. Seuss. At least, it's short. As for the voice work, the original had the greatness of Boris Karloff and the iconic song with Thurl Ravenscroft. These are iconic voices like Darth Vader. It doesn't get better than the best. Now it can be argued that Karloff was not the Grinch but rather the narrator reading the Grinch's dialogue. He's still the voice of the Grinch to me and Cumberbatch is doing something less compelling. I can see how the voice fits the character but it comes off weakly. Cindy Lou Who is older which is fine but the Whos sound too modern. They lack the wide eyed innocence that is inherent in their world. Nobody is evil but there is a stress in some of them especially the mom. Finally, there is the Grinch underwear. I get the joke but I'm conflicted about the results. Overall, this is an impossible job. Unless the filmmaker is willing to take unhealthy risks, it could never achieve much more than this movie. It's fine but this will be soon forgotten.",
    "137": "There are some Christmas traditions that are non-negotiable for a vast majority of people; gifts, excessive spending, eggnog, mistletoe and of course, watching some of your all-time favourite Christmas movies. While everyone has their own personal favourites, I can easily bet that one of those holiday tradition films, thats easily labeled as a 'required viewing' for the festive season is the 1966 Boris Karloff TV special How The Grinch Stole Christmas! Growing up and even today, its hard to flip through the channels without catching the original special. Yet, no matter how many times we've seen it before, or what part the special is on once you flip onto it, you can sure bet that the special will more than likely be watched until its heart-warming ending. Too bad, I'm sure the same can't be said with the 2000 live action remake starring Jim Carrey.Luckily, 2018 has brought us a new, brighter and greener Mr.Grinch. From Illumination, the studio that brought us those adorable little minions we can't get enough of, The Grinch is a vast, richly coloured, fun and most importantly, loyal addition to the Dr. Seuss canon; proving that sometimes, changing too much of a good thing, isn't always better. Instead, Benedict Cumberbatch's newest interpretation of the Grinch is loyal to the Boris Karloff original, channeling his wicked sense of humour, dark and twisted hate of a joyful holiday and its gleeful spirit and most of all, some exceptionally great voice work.While almost everyone knows the basic narrative of the original story, this version pits us in a similar Whoville that we are all used to, but this time, the Mayor of Whoville, Mayor McGerkle (Angela Lansbury, yes the mayor is now a woman) declares Christmas be three times bigger; kind of ironic for a guy who's heart is three times smaller than the average heart.At an hour longer than the original film, you would think that screenwriters Michael LeSieur and Tommy Swerdlow would dabble deeper into the past of a cute and small little fella, yet, despite brief flashbacks of a baby grinch in an empty orphanage, these questions aren't really relevant in a child-friendly animation film in 2018 thats main intent is to cash in on cute and memorable commercial products for the 2018 holiday market. Even with very short and quick flashbacks of The Grinch's Christmasless past, our miserable antagonist cannot seem too shake off these awful memories, no matter how much people around him, including the most cheerful who-of-them-all, The Grinch's neighbour Mr.Bricklebaum (Kenan Thompson) tries to cheer our foul smelling greenie; nothing seems to glow his cold, cold heart.Although its been over fifty years since the original aired, and almost two decades since the live action remake, there is something special about experiencing such an iconic cinematic character being cherished by children for the first time. Luckily for myself, despite all the genuine laughs, gags and jokes that I found myself chuckling to, one fo the best parts of experiencing The Grinch was hearing the cheers, laugher and questions of the kids around me in the theatre. Asking their parents why he is so mean, why is our titular character is so green when everyone is 'normal', and if the movie is done with every fade out. Despite the endless kicks to the back of my seat from the youngster behind me, nothing melted my heart more than hearing their little chuckles with every thrown snowball and sight-gag involving The Grinch.Illumination, who luckily decided to really modernize the original story, and add its signature flare of whacky colours, vibrant animation and silly humour, does a fantastic job of staying true to the original, without ever compromising the fresh and radiant look of this 2018 version. Keeping many of the original characters was also a great choice, including the girl who challenges the grumpiness of favourite animated Scrooge, Cindy Lou Who (Cameron Seely), as well as, one of my loyal favourites, Max, the Grinch's trusty yet sweet and loyal sole companion. Max warms your heart with each smile, wag, bark, drool and use of his powerful puppy-eyes.Yet, while the 2018 Grinch is a faithful interpretation, there are a few additions that we cannot help but fall in love with, including a yack-like looking reindeer Fred. Fred may be a tad overweight, have a slight obsession with whipped cream and pretty well eat anything in his sight (including Grinchie's hair), Fred is a fantastic addition to the world of Dr.Suess, especially this adaptation of The Grinch. Along with Max, the two front-runners to guide the Grinch's sleight that night, give the audiences the majority of the laughs to a newly vamped up Christmas classic.While The Grinch's message of warmth and wonder is simple and never really changes between fifty years and three adaptations, it seems like each and every year, all of us need a real reminder of what the holidays are all about. Changing the ending slightly to fit in a much more grounded and relatable holiday setting, especially for children, 2018's The Grinch is a warm and welcomed addition to our holiday traditions.",
    "138": "It's certainly not bad; the film is colourful and well-animated, it has some positive messages, and the cast all do a good job, however it doesn't offer anything new and is quickly forgettable. I can see it amusing young children, but the humour totally relies on basic slapstick and I didn't really find it funny at all. The slapstick sequences are fairly long and come often, and this highlights the fact that this story is a short one that has been stretched-out to feature length (barely as well; the film only lasts 86 minutes). Another problem is that The Grinch's motivations for stealing Christmas don't seem believable, since in this version he's not even hated by the people of Whosville; instead he simply doesn't like the Christmas period. Here lies another problem: The Grinch isn't even 'evil'. Sure, he does some nasty things on his first visit to the town, but overall it comes across more like he's a bit of a grumpy loner than an 'evil grinch' who purposefully makes other people miserable. I think that this representation of the character somewhat takes away from the narrative and principal character arc. Overall though, 'The Grinch' is okay. There are far worse family films out there, and if you want something to pass the time during the Christmas period with young children, it would be a decent choice. 5/10",
    "139": "Cheer up: \"The Grinch\" is a respectable, if safe, retelling of Dr. Seuss' holiday classic.This computer animated fable - which follows the televised 1966 cartoon special and 2000's Jim Carrey-starring live action version - honors the original \"How the Grinch Stole Christmas!\" and preserves Seuss' wonky visual style.If this Grinch is considerably cuddlier than the green monster you remember - his edges are rounded rather than sharp, his eyes soft rather than twisted and menacing - that's just the reality of today's marketplace. Can you imagine the uproar if the Grinch was an actual, you know, Grinch?Benedict Cumberbatch ditches his accent to voice the Christmas-hating heel, who lives in a cave by himself high above Whoville. Cumberbatch's reading is rather sanitized; if directors Yarrow Cheney and Scott Mosier didn't want a British Grinch, Cumberbatch was a curious choice.The holiday season is fast approaching, and ol' Grinchy is forced to go into Whoville and interact with its cheery inhabitants, who are preparing for a Christmas celebration that promises to be three times larger than the average holiday blowout. The Grinch - aided by his trusty dog Max - devises a scheme to rob the residents of Whoville of all their Christmas bounty while dressed as Santa Claus, until his plan is foiled by young Cindy Lou Who (voiced by Cameron Seely), who puts a little love back in the Grinch's rotten, decrepit heart.You know the story, and \"The Grinch\" wisely sticks to the basics without modernizing the details (the Grinch doesn't suddenly have an Instagram account) or greatly altering the structure. The 2000 version spent a good deal of time diving into the Grinch's backstory, making him a victim of childhood bullying; that's gone here. And since the original book runs just 69 pages, \"The Grinch\" doesn't stretch for material, and wraps in a concise 86 minutes.Pharrell Williams narrates the story, but doesn't have much flavor in his phrasing; somewhere, there's a voice actor cursing the day celebrities took over the voiceover field.Illumination Entertainment, responsible for the \"Despicable Me\" movies and \"The Secret Life of Pets,\" is in charge here, and gives the film a brightly lit, visually appealing aesthetic.\"The Grinch\" doesn't reinvent the story of the Grinch, nor does it top the crudely drawn charms of the original TV version. (It's tough to beat Boris Karloff's Grinch, and Cumberbatch doesn't put up much of a fight.) But by the end it opens it arms and spreads a fair amount of holiday cheer, which is obvious to even those whose hearts are two sizes too small.",
    "140": "Just watched The Grinch in theatre I work at. From the first released trailer they hooked me, so I had an advanced screening today. For me only.Story seemed to me kinda empty (obviously I had higher expectations), but it is just classic retelling of the same. The plot is classic Grinch tale - Whovilles are happy, Grinch hates it, they love Christmas, he steals it. But the little guy who really steals the entire show is Grinch's dog - Max! Every scene he is at - is so funny and cute,\nThe characters are great and charming, especially Grinch's dog and moose and Cindy Lou Who's friends. Other than that...it seemed to me pretty blank.As a years-long fan of Grinch's character - charmingly grumpy and bad, lovably mean Grinch, I give the movie score 7 of 10.Usually I will give the movie score 5 of 10, but thanks to great characters I gave 2 stars more.\nI recommend this movie to take your kids in theaters - they will have fun, and hopefully you will too. If the story is not that good for you, the feel of classic Christmas spirit is what you get here and that I am sure you will enjoy.",
    "141": "I watched this movie less than 24 hours before I wrote this review and, despite a pretty good memory, I've forgotten approximately 90% of this movie.The Grinch isn't all that grouchy. The music isn't all that catchy. And the jokes aren't all that clever. Most of the attempts at comedy come from A) an appropriately timed frown from the Grinch or B) someone being hit by something or C) animals making silly noises. The quirks and playful ingenuity of Who-ville in the original inspires smiles and warmth; totally unlike the mechanic, blandly colored inventions of this version.A) is what works so well in the original, but fails so spectacularly here. The Grinch is never all that mean (except once, in a supermarket) and never really adequately demonstrates his hatred toward Christmas. Instead of the oddly relatable, fuzzy green scrooge of the original, we get a decently sentimental guy who doesn't like people bumping into him.Thematically, the movie never runs ahead with anything of value. Does the Grinch not like Christmas because of consumerism and materialistic obsession? Who knows, its not developed. The unique commentary could've been there, but it wasn't.The only positive I can think of is the animation. I don't like the style they went with, but the craftsmanship is undeniable. The fuzziness of each character is photorealistic.I'd like to plead with the reader to skip this movie. Your kids may have a fun time, but that's because kids see animation and promptly think they're having fun. However, as I may note, the kids in the theater that I attended did not seem to erupt with laughter as much as I expected. Some laughs were had, but there was never a moment of infectious theater energy that other animated movies may have.",
    "142": "Watched this with my 8 year old son when he was sick from school. He said he really liked it but I noticed he wasn't laughing very often. I think the story is so timeless and characters so rich that just the fact that it's The Grinch is enough to satisfy. But for me, an adult that actually enjoyed Jim Carey's over the top movie, and of course the universally loved magnificent Chuck Jones version, I just thought this was dull. Very few laughs (although certainly some), nothing new visually, no real imagination. The opening was the best part, as The Grinch wakes and dresses in a fun way. But after that, just kinda of cruises along, one pop song after another.The animation however, is truly fabulous. Looks amazing, bright and colorful and beautiful. Max the dog is cute. The snow really crunched and you can feel the cold.It's been said so often that it's hardly worth saying again - but why remake something and not significantly change it, offering something new to the story? How about setting the story after The Grinch steals Christmas instead of retelling exactly the story we've already seen and enjoyed? Just doesn't make sense to me.",
    "143": "The well-known story gets a fresh, new look with this 2018 version. I so badly wanted to like it, but unfortunately it was not to be.The animation is fantastic and the 'camera angles' are really good for an animated film. None of the characters really stood out as special, though, except for the dog Max, who was by far my favorite character. I didn't find the Grinch's story believable or interesting. The film itself is over-sentimental at times, while other scenes are simply too childish, looking like a cartoon instead of an animated feature.'The Grinch' (2018) is definitely more for children, as I doubt it will have the desired effect on adults. This was not as special as films like 'Arthur Christmas', 'The Polar Express' and the more recent 'Klaus'.If you've purchased the DVD, its worth watching the 3 Mini Movies included. They are much funnier than the feature film.https://paulsmoviereviews.wordpress.com/2019/12/03/the-grinch-2018/",
    "144": "This is a rather odd take on the holiday closet. I was puzzled by the posters, which showed not the Dr. Seuss Grinch, who looks like he's made out of terry cloth, but a cute and fluffy version.That's pretty representative. While the original Grinch was motivated by an inexplicable malevolence, this Grinch is more like an irritable guy who yells at kids to get off his lawn. It's a sort of Jon Lovitz version, although weirdly enough he's voiced by Benedict Cumberthatch, whose own posh, sardonic voice would have been more appropriate.Turning Cindy Lou Who from a quiet 2 year old to a rambunctious 10 is also an odd choice, but admittedly you have to find *some* way to get a full movie out of the slight story, and if you put the original out of your head I guess its fine.There are some clever bits, the animation is good, and I like the idea of Grinch as an ingenious inventor, which allows for some fun creativity in the enterprise. But it's vastly inferior to the amazing original cartoon short from Chuck Jones, and if you can't at least get close to that, what's the point?Perfectly watchable, kind of cute, but not a valuable addition to the list of Seuss adaptations.",
    "145": "Now I've seen four versions of the Dr. Seuss story. The excellent Boris Karloff version, the overly long Jim Carrey version and the Matthew Morrison musical are the others. I don't know how I missed this on TV last year but maybe I thought it was one of the others. Of all of these, I won't say this was the worst, but just the least good.I've heard great things about Benedict Cumberbatch, but this isn't a good example of what he's capable of. Still, he was a likable Grinch. Not truly evil like Karloff. And the explanation for his attitude is different. One weakness of this movie is that they didn't really do much with the reason for the Grinch's hating Christmas. There was a different reason this time, but unlike with Carrey they didn't really go into detail. The Grinch just had a bad attitude about the holiday, like so many people do. As we all know, the Grinch changed his attitude, and how this movie did that was quite different. Still very nice.A lot had to be done to make this movie long enough, and I found myself bored at times. There was just too much added that wasn't very interesting. But the best addition to this movie was the Cindy Lou subplot. She was adorably drawn and well acted by Cameron Seely. If something had to be added I'm glad it was the scheme with the kids to capture Santa Claus.However, Cindy Lou's one wish for Christmas was for her mother not to have to work so hard. As played by Rashida Jones, this single mom of three was an angel and quite pleasant, never really getting mad and always happy despite all she had to do. This isn't realistic, and no one bothers to explain the absence of a husband or who takes care of the kids when she's at work. Also, Cindy Lou says she works all night and takes care of the kids all day. When does she sleep?Kenan Thompson added something as an overly joyful man with too many decorations, but why the Jewish sounding name?Angela Lansbury did a good job in one of her final roles as the mayor. I knew that voice immediately.Not sure how Fred the reindeer fit into the story since Max is supposed to pull the sleigh. Anyway, while huge (the line about how he ate the other seven was great) Fred was funny and adorable.So much detail! I don't think certain scenes were intended to be seen in theaters. I record everything and it takes a few times rewinding to see all that is going on in some scenes. Really nice art and jokes that are easy to miss. I probably still missed some of them.Here's something strange: The grinch wears clothes. Yes, they look just like his green fur. But he wears underpants like little boys do. This was addressed once and then never mentioned again.I'm also curious where everything came from. Is there an outside world? They don't make everything in Whoville, do they?I also wonder how the Grinch hated the largest tree so much and yet he never found a way to get rid of it. I think his attempt ended up being quite funny as it resulted in some of the comic violence that didn't really hurt our villain.On the subject of music, the song the Whos sang was there, but with some different lyrics. I should mention the Whos reacted quite differently when they found out what happened, but ultimately they gave us the real message of Christmas.The Grinch found some songs annoying and I know there are people who hate that music. I have to admit even young Michael Jackson got on my nerves that one time, but most of the other songs were good. Brief, but good. See, the Grinch had to keep getting rid of the songs quickly.One thing never done in any version of this movie was acknowledging Jesus, though this was done only in song lyrics. I found \"God Rest Ye Merry, Gentlemen\" pleasant, until Pentatonix did that weird stuff that made it clear who they were and made me agree with the Grinch. But that was funny how the carolers chased after him.And rap music? Really? And there were four songs with rap. Bah humbug!I wondered if there was a point to this, but this story hasn't been done with animation in a full-length movie before now. Yes, I guess this was needed.",
    "146": "Time honored classics hold a special place in our hearts, sometimes to the point of being unable to ever be touched by remakes or other twists. Still that does not stop Hollywood from trying to find ways to make an idea modernized to help reel in new generations. Sometimes these twists are amazing to the point of becoming the new standard, while others should remain in the thought pool to develop some more. Tonight, Dr. Seuss' legendary Grinch tries to come in with a chance to make itself relevant to the new age. Will it run with the two previous versions that are the big dogs in holiday cinema? That's where I come in. Robbie K back this week for the first review on:Movie: The Grinch (2018)Directors:\nYarrow Cheney, Scott Mosier\nWriters:\nMichael LeSieur (screenplay by), Dr. Seuss (based on the book by)\nStars:\nRashida Jones, Tristan O'Hare, Scarlett Estevez\nLIKES:Animation: In the modern age of computer cinema, I agree that the new visual style is a welcome addition to the series. Illumination's style goes well with this movie, the cartoony visuals, bright colors, and odd shapes fitting right into the imagination of Dr. Seuss. Little ones will appreciate all the energy in the design and the magical heart of Whoville in their love for Christmas. In addition to all the colorful and fun displays, the Grinch and company have wonderfully smooth animation, crisp and clean to capture all the slapstick shenanigans these movies are famous for.Voice Acting: Not many here, but Benedict Cumberbatch is the lead in this movie, showing off his voice acting skills once more in a fun manner. Perhaps not the most elaborate character in his repertoire, this Grinch has a number of octaves and mannerisms to get my nod of approval, as Cumberbatch once again adds life to the artificially crafted characters. Cameron Seely as Cindy Lou Who has some sass to the classical, good souled who that still has that innocence, but with the modern twist. As for Kenan Thompson, he is funny in his one-liners that take you back into the 90s where he reigned king.Cute: The movie is a family friendly film, with that youthful energy to kick off the holiday season and get you onto the mood. The Grinch brings that modern tale to full light and the new twist has been tailored towards the target audience of 4-10-year-old kids and the young at heart. In addition, all the comedy and story will potentially make your heart grow three sizes.The Creativity: Say what you want about the others installments of this film, but this Grinch gets bonus points for the clever twists brought into the heist scene. Yes the first one was brilliant and went in time with the song, and Jim Carey's version had the darker, fun delight that was a little spooky giving the lighting. This one though, adds gadgets and technology that were rather Seuss-like and most likely the subject of action figures and toys alike. Still, the Grinch's new genius is just another nice twist to the mix, again matching the talents of the voice actor who portrays him.The Dual Stories: One part is the tale we've come to know and love, while the other running tangent is a small story that gives us more Cindy Lou Who. The Movie does a nice job of having the two key characters trekking down their own paths, each blazing their own path as they head to the fateful night. It's not the most character centric story, but it works well for me and gives little girls a new animated character to pull for.DISLIKES:A Little Too Simple: The Grinch's modern twist is perfect for the modern age of kid themed movies, being innocent, sweet fun that leaves you with a feeling of Christmas. Yet, the movie still is a little to simple, lacking those qualities the previous installments held that made the memorable. Perhaps a little more story, a little more heart, or just some more injection of adult components into the mix could have taken this film farther.More Character Development: The Grinch seemed rather simple, but the Jim Carey version proved this green curmudgeon held more story than ever imagined. Sadly, this version sacrificed characters for the slapstick gimmicks to net kids in. Sure, there are backbone framework established, but there was so much more discovery and tales to tell to help strengthen the film. Other characters could have been involved as well, but they were only momentary colors on the screen, with a few one-line jabs to get some chuckles. Nevertheless, the movie needed more character utilization for this guy.Predictable/Shown In Trailers: No surprise that the Grinch is predictable, but why could it not have escaped the curse of the revealing trailers. The Grinch's surprises are ruined mostly by the glimpses in the trailer, leaving you with little to discover past the meat of the film. There are still some special gifts hidden under the trees, but perhaps not in the brightest, shiniest style it could have been.More Cindy Lou Story: I know it's called the Grinch, but they opened the flood gates for another story that could have been even cuter. Cindy Lou's story introduced lots of characters that could have again established more of that twist, perhaps giving it that special something this version needed. Fortunately, there was a major finale to help wrap up and inspire, but some more development was needed in this component to really add that final finesse.The VERDICT:The Grinch is a tough challenge to take on given the champion films we have in the past. Still, this reviewer enjoyed the fun adventure that is appropriate for the whole family. The animation, design, and comedy are all for the intended audience and one might enjoy seeing their little one's face light up at the magic of Christmas unfolding. Sadly, the movie still has some work in terms of bringing more to the table, taking the story and gimmicks to the full potential by injecting a few more unique features to escape the trailers revelations. Still, I applaud the new twist for the creativity and think that a family outing can warrant a visit. Yet, the classics are free and available at home, and that may be difficult to miss when they are so good.My scores are:Animation/Comedy/Family: 7.5\nMovie Overall: 6.0",
    "147": "Dr. Seuss' The Grinch is an animated adaptation of Dr. Seuss' 'How The Grinch Stole Christmas'. The Grinch(Benedict Cumberbatch) hatches a sinister plan to steal Christmas, from the citizens of Whoville.Dr. Seuss' The Grinch is an awesome film. Directors Yarrow Cheney & Scott Mosier have given us an entertaining movie, that shows its protagonist in a more empathetic light that previous adaptations. The animation is fantastic. The ending will melt your heart. One flaw of this film is that, it is not as hilarious as so many other animated movies. The vocal performances of the cast, are the highlight of the film. Benedict Cumberbatch is spectacular as The Grinch. Cameron Seely is outstanding as Cindy-Lou Who. Rashida Jones is amazing as Donna Who. Pharrell Williams is superb as the Narrator. Tristan O'Hare is adorable as Groopert. Kenan Thompson is excellent as Mr. Bricklebaum. Dr. Seuss' The Grinch is not a must watch. However, it is worth watching with the full family, during Christmas season. Have a merry & Grinch-y Christmas!",
    "148": "In the light of a new Christmas season, here comes a slew of holiday specials for a reason. Many stories like A Christmas Carol, The Polar Express and The Nutcracker come to mind, How the Grinch Stole Christmas is a magnificent, glorious find. It's no wonder why the Dr. Seuss classic is told over and over again. It's message about commercialism and warm feelings roll around every year like a train. As a book and holiday special, it's become a classic fable. As others have tried to tackle it (like the Ron Howard live action adaptation), it's been slapped with an odd label.I'll admit that I find the Jim Carrey version a guilty pleasure. His over-the-top performance and ability to act in the suit makes Christmas a leisure. While the make-up and design are weird, the movie is something I still find revered. In the past years, we've gotten a new line of animated Dr. Seuss movies. The problem is that what we get is a mixed looney. When I heard the Christmas classic was getting an animated remake, I was curious. Upon viewing The Grinch, there is a lot of good and bad that's various.All the whos in Whoville liked Christmas a lot, but the Grinch (played by Benedict Cumberbatch), who lived just north of Whoville, did not. The Grinch spends his days sulking at the whos for their overly cheerful attitude towards Christmas. Except with his loyal dog Max, everything seems to be going along as business. A trip down into town reminds him why he sulks at the songs and decoration; it constantly pounds his head in Holiday madness and carnation. One who-child who seems to have more worries is little Cindy Lou Who (played by Cameron Seely). She is concerned for her overworked mother Donna (Played by Rashida Jones) who never demands a \"Thank You\".With Christmas Eve coming soon, The Grinch is irritated by the incoming \"noise, noise, noise\"; all those toys that'll be played by girls and boys. In typical fashion, the Grinch gets a wonderful, awful idea. The plan to steal Christmas, it's decorations, toys and food makes him say eureka. With a coat and a hat, he makes himself look like St. Nick. By taking it all away, he hopes that this'll make a wonderful Grinchy trick. Meanwhile, Cindy Lou-Who sets her plan to catch Santa Claus. She wants to talk to him and help her mother with a cause.So does The Grinch outdo the original or even the live action movie? It depends if you want something more sentimental or goofy. Why don't we start with the Grinch himself, who feels too harmless. His personality doesn't spew annoyance and heartless. Benedict Cumberbatch plays him more like an eccentric loner who isn't that mad at the world. I guess I expected his performance to be a but more curled. Jim Carrey at least had the ability to go all the way with his image. It was an eccentric grump to the finish.So what's better then before? The animation and design galore. This is a movie that looks colorful, nice, and very Christmas filled. Seeing all those decorations and snow within the mountains makes me feel thrilled. It even feels more Christmas spirited then The Nutcracker. It's muted look and lack of plot made that more of a slacker. Even the live action Grinch's design seemed more polluted and cluttered. The new movie's way of working with the Dr. Seuss designs along with current Christmas decorations make it something to be uttered.But what about the morals? Does it dive into the Christmas issues that are still relatable today? Sometimes it does it fine, but other times it's a cliché. At points, it does look into the sadness of those that are alone. But given it never goes into the story's frustrations on commercialism, it does inspire a groan. At times, it feels like they don't want to adapt too much from the book. You think that by using much of the dialogue from before (which doesn't happen often), it would be more of a hook. I'll say that narrator Pharrell Williams just didn't work for me. Guys like Boris Karloff and Anthony Hopkins were more dignified and had voices that felt like sitting around the Christmas tree.I'll give this five Grinch faces out of ten. I think the heavy amount of families and children that'll like this will keep this alive. This doesn't replace the original. This just puts it with the others and becomes mixable. I'm okay with this, even if I wouldn't recommend it for myself. I'm more likely to watch the TV special that feels like an annual Christmas elf. Go see it, and see if it makes a mean one out of you."
}