{
    "0": "The film is a devastating look at one man's loneliness. Andrew Scott is giving a brilliant performance. With a simple facial expression, he can tell an entire story. He is one of the best actors around. (Scott, Mescal, Bale, Day Lewis -all great all non-American. Where are the great young American actors? But I digress..)\nClaire Foy is wonderful and radiant. Jamie Bell has less to do but is very effective in his scenes with Scott. Paul Mescal is excellent- when you can understand him! His first scene when Harry comes knocking on Adam's door needs subtitles! The powerful ending is simultaneously chilling, frightening, and heartbreaking. There's a couple of ways to look at it. But I leave that for the viewer to determine. Do not miss!",
    "1": "Don't want to give away much here. Suffice to say that all four of the main actors here are simply amazing and that the writing is excellent. I would pay to watch Claire Foy read takeout menus, but here she is especially captivating. Andrew Scott is simply incredible.The interaction between the main character, Adam, and his parents is poignant, sweet and hilarious and it was gut-wrenching to hear him have the kinds of conversations with his folks that many of us never get to. The relationship between Adam and Harry is similarly well-done - if only relationships could be that deep in real life. :-(Be warned, however, that if you're looking for the \"feelgood movie of the year\"....this isn't it.",
    "2": "I also caught All of Us Strangers at the London Film Festival. I started ugly-crying after about 15min, and I didn't stop until after the film ended. There was a standing ovation with people cheering and whistling through their tears. What an experience.All of Us Strangers is a tale of Complex Post Traumatic Stress Disorder (C-PTSD). It shows how multiple traumas compound inside us (or \"get tangled up inside your chest\" as Andrew Scott's character says). This causes people to live in 'survival mode,' self-medicate, and engage in self-protective behaviours. These three coping mechanisms are quick and easy ways to ruin your own life. But what other option do traumatised people have? All of Us Strangers attempts to answer that question.Andrew Scott is a popular and likeable actor, but this film is an opportunity to see him at the top of his craft. His performance is very restrained and his micro-expressions are heartbreaking.Paul Mescal... has ruined another pop song from the 1980s!",
    "3": "Adam (Andrew Scott), a shy writer, lives in a tower block that is largely deserted apart from one other resident, Harry (Paul Mescal). By a happy coincidence both men are homosexual, so they pair up. While Adam adjusts to his new romance, he also spends time visiting his parents in their suburban house. The strange thing about that is, his parents died when he was a child, several decades before...The audience is never given an explanation for how Adam is talking to his dead parents, and this ambiguous approach raises a number of questions: are the encounters all in his mind? In that case, how is Harry also able to see them? Also, indications are that the family's house has stood empty since the parents' deaths (the long-empty childhood home being a staple of many fictional genres) but is that really realistic in densely-populated, housing-short Britain? Perhaps I am over-analysing, but it seems strange that while time is taken to provide an explanation why Adam speaks with an Irish accent when both his parents are English, other questions remain unanswered.The acting is good; Scott is nicely subtle and Jamie Bell, as his father, is noteable for his believable, naturalistic performance as a suburban dad. I do not understand why Mescal puts on an English accent; if the character had to be English, why did the producers not hire an English actor? And if Mescal specifically was required, why not let him play it Irish? Such is his pulling power it would hardly have adversely affected the viewing figures. It must also be hoped the shaggy moustache Mescal sports in this never makes a reappearance! (Ditto that sported by Bell.)An odd film in many ways; it is a ghost story with a gay romance thrown in. Either storyline would have made a film by itself, but neither detracts from the other one. An enjoyable, tear-jerker film.",
    "4": "Words alone can not describe the messages and feelings this gem transports. Absolutely epic. Be prepared to be left utterly breathless and devastated.The story centers around two British guys having their typical family traumatas, dealing with feelings of being left alone and not fitting in.Don not wanna take away too much but have to fill up the required chararacters, sooooooI will protect you from the hooded claw\nKeep the vampires from your door\nWhen the chips are down I'll be around\nWith my undying, death-defying love for you\nEnvy will hurt itself\nLet yourself be beautiful\nSparkling love, flowers\nAnd pearls and pretty girls\nLove is like an energy.",
    "5": "I saw it at the Stockholm Film Festival. The movie has everything in it and punches you hard. It covers a wide range of emotions, from the excitement and fear of falling in love to questioning all your relationships (including the one with yourself). It also depicts the beautiful joy of experiencing small moments that bring immense happiness and the devastating sadness and grief of loss. What I especially like about this movie is that it transcends the genre of \"queer movies.\" Even though it definitely depicts some specific experiences that queer people could find easier to relate to (which is another strength of this movie), All of Us Strangers is so deeply human that everyone can feel it. I definitively recommend this movie and be prepared to be thinking about it and feeling it for some time after you have seen it.",
    "6": "I read the book Strangers by Taichi Yamada a few years ago, and this was a beautiful retelling of that story. I didn't realise before going in that it was based on that but the story felt familiar. Andrew Scott was the perfect lead, the whole cast supported him wonderfully. I'm sure many people have wondered what they would say to loved ones they've lost, and this film explores that deeply. Can one find acceptance and peace with a tragedy a lifetime later? Great soundtrack and ambience throughout. So nostalgic. I've also been listening to The Power of Love since leaving the screen. Highly recommended.",
    "7": "The whole movie is full of sad colors, retro electronic music, cold blue scenes, and the speeding tram. Everything is fast. Only when the protagonist is with his parents and lovers do everything seem to stop. The film is performed in the most emotional language, but it is very restrained. There are many flashbacks in the movie and even a little like a horror movie. I like the beautiful blue-toned scenes in the movie, and I also like the funny scenes in the movie. Although the climax lines are a little too sensational and everything is too straightforward, I still prefer the Christmas scene of my parents and the protagonist. My parents reconciled to the past through songs. With the music and everything in the past, my eyes are still wet, and the final anti-transferor is caught off guard. We are always lonely. To the world, but I believe he will say goodbye to himself and the past more calmly, as the last line said, \"I will accompany you to wait for the arrival of death...\"",
    "8": "An intimate portray of a grown man who struggles with the loss of his parents during a car crash. Besides the protagonist, it shows that he falls in love with his neighbour, who also has a struggling family story. It is a very deep and subtle love story between two guys who fall in love with each other. Although I liked the intimate scenes a lot which were also very sexy. It seemed a bit forced, that his partner/neighbour also died in the end. I did like the beginning especially, the confusion of him seeing his young parents and him having fever dreams and often switching between his real life and his imagination.But apart from that it did not have something original in it or unexpecting. I would have wished for a better ending.",
    "9": "Had the privilege of catching this film early as it screened at the London Film Festival. I had high hopes after seeing the critics reviews and it did not disappoint.The story follows Adam and his neighbour Harry, with whom he develops a romantic relationship with, as he deals with the grief from his parents tragic death when he was child.The film cuts across genres. At times it is funny, sad, romantic, and even horrifying. It is a damning depiction of the loneliness epidemic among younger men while also dealing with the added challenges faced by those within the lgbt community in trying to fit in.The chemistry between Scott and Mescal is brilliant, while Foy and Bell really hit the right note in their roles. The film is also beautifully shot and has a lovely palette of colours within.It's a tough watch and left me with a lump in my throat for the entire final third, but it thoroughly deserves all the praise it has received so far.9/10.",
    "10": "I saw this at the Cork International Film Festival, so seeing 2 Irish leads like Andrew Scott and Paul Mescal performing as they did was a tantalizing factor for me and those watching.The film brilliantly captures one man's complex processing of grief and loss, with the protagonists particular story holding different factors for viewers to latch on to. It is a raw watch, which touches on the themes of loss, pain, and love.The 2024 awards season should look favourably on Andrew Scott's performance in this film. His portrayal of this mans intriguing, yet sensitive approach of coming to terms with such tragic events in his life could not have been played better by any other actor. An enormous amount of credit must to go Andrew Haigh's directing and writing, who produced a flawless ensemble to play off of a script where every scene and word was situated perfectly.",
    "11": "Rating: 7.7\nOverall, a well-written movie that is carried out by its good performances (especially Andrew Scott's) as the blurred perception of reality creates a unique movie about dealing with trauma and identity, though it is very slow and a victim of its own convoluted storytelling at times.Decent to Pretty Good Direction (Has a very unique way of telling the story as subtly creates a sense of blur and mystery in what is reality and what is an illusion, and he uses cinematography and editing well to create this effect; has somewhat control on a microscale as the one-on-one scenes between actors are directed well; gets a decent amount from his actors (it is just the movie is a bit dry in getting as much as he can)), Good Acting (Very Good from Andrew Scott (The center of the movie and really embodies someone who is dealing with repressed trauma from the loss of his family, dealing with his sexuality in a heteronormative culture, and finding love when very few love him back), Pretty Good from Paul Mescal (Mumbling the whole movie so it is so hard to hear what he is saying; does have good chemistry with Scott), Good from Jamie Bell (Plays off of Scott very well (Especially in their one-on-one scenes)), Good from Claire Foy (Shows a lot of emotion when dealing with her son (especially in their one-on-one scenes and their final scene in the movie)), Good from the rest of the cast (There is no other cast besides these four)), Good Story (A unique story and is told very subtly (to help keep with the mystery and blur what is reality); this storytelling and construction is really minimal and leaves a lot open for interpretation on what actually happened; the flow between sequences is not really that clear (which can be argued is the point as it helps show how unreliable a storyteller the protagonist is); the character writing for the protagonist is good as the movie unpeels a lot about his backstory and trauma the more the movie goes on (with the ending showing who he really is)), Very Good Screenplay (The dialogue is pretty minimal and simple (but does a good job and is profound when it needs to be); the romantic and emotional moments are captured very well in the screenplay and act as a good blueprint for the story to unravel; the symbolism is very profound and used very well to show the message and themes; the foreshadowing is very good and helps with creating the twist in the end), Decent Score (Pretty minimal and just used to set the tone), Very Good Cinematography (Very artsy and helps show how skewed the protagonist's view of reality was), Bad Sound (The dialogue sound mixing was bad because it was muffled and just hard to hear; the aspects of sound just felt like they were cheap (especially in the beginning)), Decent to Pretty Good Editing (Artsy for the most part; felt a bit tacky at times (especially the opening shot and the drug scene)), Plot Structure was a bit more complex as the dream sequences interject the story from moving forward as the protagonist uses them to fight his issues from the past (in a good); the culmination to the climax and the eventual exposition is laid out very well, Pacing was slow (and the exposition was incredibly slow); the runtime could have been cut 10-15 minutes by making the pace a bit faster, Climax was executed very well as it was both closure for the protagonist and a big twist as it opened the door for interpretation, Tone felt a bit sci-fi with its blur in reality (and felt like a really stripped down Eternal Sunshine with it favoring more of a dramatic tone), Saw a premiere at Austin Film Fest.",
    "12": "Andrew Scott has always shown that his career choices are both bold and aimed at beautifying the human experience. All Of Us Strangers isn't an exception. This movie is so powerful, so subtle and creative in telling a story about grief, loss, loneliness and love, while never feeling like it is reheating common places. It is deeply moving, doesn't shy away from complicated emotions and the tough process of dealing with them, while never being either boring or poorly written.Andrew Scott once again proves that he is one of the rarest talents of modern cinema, carrying beautifully this complex, flawed and touching character throughout a heartbreaking story that will haunt you long after the end credit.The rest of the casting is just as engaged and strong, in a rare and balanced demonstration of their craft.I was lucky enough to attend a premiere and there wasn't a dry eye in the theatre. If you need a movie that will deeply question the depths and paradoxes of humanity, look no more. Do yourself the favor of seeing All Of Us Strangers, your soul will thank you for it.",
    "13": "Virginia Film FestivalMovie also handles the heavy themes of sexuality, masculinity, loneliness, and trauma with such delicateness and respect. A dreamlike and wistful state I was in. I felt seen. I died.The conversations that center around sexuality and upbringing felt so natural to me and at points I related. And at some points, the audience was laughing at this majority melancholy film.Haigh and Ramsay's cinematography do it right to show the chemistry and tenderness between Scott and Mescal. The music switches between Emilie Levienaise-Farrouch's dreamy, ethereal score and 80's Britpop bangers.Will watch again when it gets into theaters.",
    "14": "Greetings again from the darkness. So many people allow unresolved issues from their past to weigh down or complicate their efforts to live for today. Writer-director Andrew Haigh has loosely adapted the 1987 novel \"Strangers\" by Taichi Yamada most notably by a shifting of locale and gender. It features the powerful literary trio of loss, loneliness, and love, none of which come easy for Adam, played beautifully here by Andrew Scott.Adam is a reserved London-based writer in his 40's who recognizes that he has failed to fully repress one particular fact of his childhood. Since his parents died in a car crash thirty years ago when he was twelve, he never had the opportunity to come out to them as gay. Now, he is often burdened by being the kid/grown-up whose parents never go to know the real Adam.An unusual meet-cute in the mostly vacant apartment tower they both reside in, has neighbor Harry (a terrific Paul Mescal) knocking on Adam's door carrying a bottle of spirits. Adam turns him away, but there's clearly an attraction. The progression after this night leads Adam down a tricky road. His writing forces him to face the lingering complexity with his parents, and this occurs in a few excellent sequences with Adam re-visiting his childhood home (actually director Haigh's childhood home) and finding his parents (Jamie Bell and Claire Foy) living there, unaged since he last saw them. Adam comes out separately to each, resulting in quite different reactions. Mom's words, \"It's a sad life, isn't it?\" cut like a knife while also emphasizing the social changes over the past 30 years. After claiming he would have been one of those schoolyard bullies, dad confesses he's sorry for not coming to Adam's room when he was crying.These interactions with the past allow Adam to begin to move forward, and that includes Harry, who has his own issues with the past. Together, the two are natural, and their debate of queer versus gay is beautifully executed. We understand how Adam dealing with his grief and guilt opens him up to a hopeful future of love, as leaving the past behind delivers the courage necessary to open up. Taichi Yamada recently passed away (November 2023), and it's likely he would have approved of Haigh's film. Andrew Haigh is proving to be quite an artist with this latest on the heels of his LEAN ON PETE (2017), 45 YEARS (2015), and a couple episodes of \"The OA\". This film is somber and slow moving, but the direction is excellent and the two leads Scott and Mescal (rumored to be the next James Bond) make this work.Opening in theaters on December 22, 2023.",
    "15": "After a chance meeting with a troubled stranger, a man faces his past and go to his old home where his parent got murdered, only to his surprise, meet them seemingly alive and well. This makes him open up yet again for more opportunities AND maybe even another stranger on his arm.I just want to firstly to say that the acting in this film is superb. Foy, Bell, Scott and Mescal did everything and superbly. All will have a big moment in this film but all were given a time to shine. Mescal and Scott especially. They highlight well the feeling of urban loneliness and has great chemistry something missing with almost every modern pairing. The ending is just masterclass acting. You should be excited seeing that.Which points to the screenplay. I do think that the biggest strength of this film is that it is pointed film. The addition of the supernatural elements help meld the judgmental past to a much more open future. And see two of this thinking contrast each other. Its a lovely touch since the Scott's character is all alone and seemingly wanting of a familiar touch. AND happily, it also stuck its ending. Probably one of the better film ending this year.I do put a big minus for two things. I do think the pacing of the first twenty minutes of the film does feel too slow. AND I do think the setup was too convenient for its own good. They just rolled with it, waiting for the viewer to forget.Highly recommended. Would probably rewatch too.",
    "16": "Saw this at the 2023 filmfestival Gand (Belgium). The best terms to label this movie are not easy to find, thereby not implying it is a mixed bag, the latter usually used in the negative sense, certainly not my intention. Being \"officially\" labeled Drama and Fantasy, I find it has also a flavor of Romance, SciFi and Horror, at least a mixture of all of the above, with the latter three a bit on the back seat. Fact is that one continuously wonders where the story is heading, only to be surprised by the next unexpected plot twist.Given the large apartment block, an upwards looking image of it opens (and ends) the movie, one tends to think it is important. Nearly empty, dark windows all over, only two inhabitants on separate floors, a cliche décor for a Horror. One would assume it to be the center piece of the story, an initial feeling that proved to be completely wrong. It is only important for the start, a vehicle to let the two inhabitants meet. It is started by Harry on the lookout for someone to share a drink, thus ringing the door of his only neighbor Adam. Rather than inviting him in, the logical thing to do when you are lonely too, Adam sends him away as Harry appears a bit drunk. However, that is not the end of their relationship.Next, I think I missed a clue. We see Adam travelling to the house where he grew up. I missed the reason why he did that. He rang the bell, and he meets his parents as they were on the age they died, some 30 years ago. They recognize him and welcome him home as if nothing happened. None of this is a spoiler (yet). This information is included in all descriptions of this movie. But it is also the stopping point. No further details are to be given away after this, to enhance the surprise. I announce even multiple surprises underway.In multiple visits, inventive dialogs between Adam and his parents are to follow. The best example is about him being openly gay (\"you mean gay as in homosexual?\", asks his mother, who is apparently behind with modern terminology). As usual, parents try to find an explanation why their son is not \"normal\", and they even speculate whether they felt it already when he was young.The finale took a turn that I found difficult to follow. Maybe you stand a better chance to tie is all together. The overall story and execution warrant a score 8/10, but I subtracted a point for the finale I did not understand."
}