{
    "0": "When you choose to make a film based around a holiday you run the risk of the film being bypassed once that holiday is over. Even during the holidays I had no real desire to see the film LAST CHRISTMAS. So imagine my surprise to find it one of the most delightful films I've seen in some time.Emilia Clarke stars as Kate, a young woman living in London who works in an all year round Christmas shop dressed as an elf. Her boss is simply named Santa (Michelle Yeoh), an owner who has a habit of stocking some unusual items in her store. While working there Kate also attempts to launch a career singing in productions, auditioning for nearly any part available and never landing a role.Kate is in the middle of a bad period in her life. Her career is going nowhere, she has no place of her own to live, counting on the kindness of her friends to put her up. But even there her luck runs bad as she doesn't take long to do something that results in her being kicked out. Her love life is on the outs as well with frequent hookups that lead to nothing more serious than a one night stand. Her relationship with her sister is one of mutual disapproval and the one with her mother is even worse.Kate's mother (Emma Thompson who also wrote the story and produced the film) calls her by her proper name Katerina and worries about her non-stop. Much of this is due to an illness Kate had the previous year which we don't get details on until later. When all of her friends boot her out Kate has no choice but to return home to live.Then one day something happens. She sees an attractive young man outside the shop looking up at the sky. Going out to see what he's looking at, he points out a bird to her claiming it's unusual to see this bird in the city. They talk a bit and he convinces her to walk with him later. Doing so he shows her a small alley, giving her the history of it and showing that it ends up in a small garden courtyard with benches that people can sit on.Kate becomes infatuated with the man who she learns is named Tom (Henry Golding). He tells her he works late nights but before he goes to work they continue to spend time together. One place he lets her know he works is a mission for homeless people. When Tom doesn't show one night, she goes there looking for him only to be recruited into helping.The relationship between Tom and Kate builds as the movie progresses but they never sleep together. He tells her he's old fashioned like that. As they spend time together things begin to change for Kate. She becomes happier. She becomes less selfish. She starts helping other people, especially at the homeless shelter. But will that happiness carry on? Will Tom be there for her forever? Will something happen that changes everything?In spite of revealing a lot of what takes place in the film so far I'm holding back on much of it. That's because this movie did something that so few do for me these days. It surprised me. It caught me off guard. I've seen so many movies that rarely happens and when it does it make me happy to see that this is still possible.The surprise is not all that makes me recommend this movie. It has a bright, fresh feeling to it in spite of the life that Kate lives when we first meet her. The film doesn't rely on naked bodies or four letter words to present a story of two people in love unlike most films today. Instead it harkens back to the romantic screwball comedies of the past relying on witty writing, great performances and a story that captures the heart.Clarke is known mostly for her role in GAME OF THRONES but shows that she has so much potential to move past that into Sandra Bullock territory, a romantic lead with the ability to make you laugh as well. Golding is a surprise, having only been in six films to far, his first being CRAZY RICH ASIANS where he did an amazing job as well. Thompson is hilarious here as an immigrant fearful of everything and concerned for her children.As I said at the start, I had no interest in this movie when it was released. I not admit that the film was a charming, refreshing change of pace that will entertain, enlighten and make you think twice about the world we live in. With music obviously written by the late George Michael used throughout, it's a movie that you should watch, in spite of Christmas having come and gone.",
    "1": "The real mystery is not the plot twist. The real mystery is, what happened to our expectations about movies to make so many people think they can easily find a \"better\" X-mas movie somewhere else, making it OK to give this one a low rating? For the last few decades, some 95% of all the X-mas movies produced have come from Canada, using basically the same actors and writers, and they do not even come close to this one. This is a real movie that engages and holds the attention, with real talent both in front of and behind the camera. Cmon people, follow the example of the main character in LAST XMAS, grow up.",
    "2": "I don't understand why the critics have been so harsh on this film - I thoroughly enjoyed it!Yes, it's predictable, but what Christmas film isn't really?With a wonderful central performance from the ever lovely Emilia Clarke and with good support from Emma Thompson, this is a wonderful film with a lovely message.I would say give it a chance, you won't be disappointed.",
    "3": "I think this is the most captivating Christmas movie since \"The Bishop's Wife\" and \"Miracle on 34th Street\".It just takes a while to realise it.Kate (Emilia Clarke) is beautiful and likeable, but she's too self-focussed, which tends to make her careless, testing the tolerance of friends and family. When she meets Tom (Henry Golding), a young man who comes and goes, she is challenged to become a better person and turn her life around. Eventually we find out how and why.The backdrop is London at Christmas and among the Christmas lights and pre-COVID streets packed with shoppers we get George Michael songs, Eastern Orthodox church services; lines of homeless waiting in the cold; an over-the top Christmas gift shop where Kate works dressed as an elf; and Kate's overly clinging mother, Petra, played by Emma Thompson going to town on her \"Former Yugoslavia\" accent.There is almost too much happening. I wondered how it would all come together. However it does and finishes on a high. Luckily, I hadn't seen any spoilers and didn't see it coming - I definitely got my money's worth.Topping the whole thing off like the brightest star on the Christmas tree is Emilia Clarke. There is no shortage of brilliant, beautiful British actresses who also shine on countless talk shows. However, none have ever outshone Emilia Clarke.\"Game of Thrones\" is one thing, but the real phenomenon is how much fun she has generated talking about it and every other aspect of her life to people like Ellen DeGeneres, David Letterman, Jimmy Fallon, Jimmy Kimmel and especially Graham Norton, who has the rare knack of eliciting revelations about sex scenes and embarrassing moments without seeming sleazy.Emilia has discovered the charm of self-deprecating wit; she can tell a story against herself. Anyway, whenever she's lost for words, she has that infectious laugh and those amazing eyebrows - not only that, she can sing!She lights up the screen from the moment she appears. The combination of Emilia Clarke with good-looking, uber-charming Henry Golding gives \"Last Christmas\" a touch of magic.There are plenty of Christmas movies, literally hundreds, but there are only a few that are perennial classics. I think \"Last Christmas\" is destined to be one of them.",
    "4": "The movie may appear to be cliched, but the film is so far beyond what the trailers made it look. Also a great tribute to the late singer George Michael, a good portion of his songs are playing through out.Kate(Emilia Clarke) has become a train wreck, after a heath scare a year ago, her family life is gone crazy. And her job is also going down, and during the time of Christmas. And things start to change when she meets Tom(Henry Golding), a handsome nice guy who tries to take her out of her misery, but is he too good to be true?\nI really like the way the film was not trying to be predicable, I mean you think it's going in one direction, and it surprises you. There is a twist, which I won't reveal, although I kind of saw coming. Emilia Clarke does shine has Kate, scenes you like her even though at times you're not supposed to like her, but you can't help but like her. Henry Golding is also quite charming, his scenes with Clarke, are quite joyful to watch. Michelle Yeoh is also good. A well made comedy drama Christmas movie.",
    "5": "I liked the fact that this wasn't your typical overly saccharine Christmas romcom. Some light and quirky comedy bits well placed within a heartfelt and mature storyline that doesn't try to go too deep. The result is a good little watch that makes you feel improved slightly for having seen it.",
    "6": "A nice little Christmas Romantic Comedy with a fantastic cast directed by Paul Feig. Nothing special, just your typical Rom-com with a great soundtrack from George Michael.. Or so I thought. I won't go into any details, just watch it, brilliant.",
    "7": "Such an easy film to watch, Emilia Clarke is wonderful. Not much else to say really. A very enjoyable film.",
    "8": "\"Last Christmas\" is a funny, heartwarming, ultimately profound movie. It's being marketed as a romantic comedy but it's more of a dramedy. There are funny lines throughout, but \"Last Christmas\" deals with some tough issues, and towards the end it sends a beautiful message.Emma Thompson co-wrote the script. Thompson previously won an Academy Award for best adapted screenplay for \"Sense and Sensibility.\" \"Last Christmas\" traffics in unflattering stereotypes of Eastern Europeans and it tries to hard to be politically correct, but its wit, warmth, and the chemistry of its stars, Emilia Clarke and Henry Golding, won me over.The movie opens in the former Yugoslavia, in an Orthodox church, of all places. Petra (Emma Thompson) is watching her daughter Katrina sing a George Michael song.Fast forward decades later, and move to London. Kate (Emilia Clarke) is an unlikable mess. She works as an elf / clerk in a year-round Christmas store run by Santa (Michelle Yeoh). Kate is homeless and couch surfs, sleeping with friends and one-night stands. She dresses in clothes that are a little bit slob and a little bit tramp. She's hard to like.One day she looks out the window of her Christmas store and sees Tom (Henry Golding.) He's a very nice guy. Charming, handsome, and kind. Kate is suspicious.Eventually Kate and Tom get close enough that Kate confesses her dark secret to him. She had been ill for a long time. Her mother seemed to enjoy too much having a chronically ill daughter, so Kate had to move out of the house. A year earlier, Kate had had a heart transplant, and she hasn't felt like herself since. Tom encourages Kate to get her life together.Kate returns to her natal family, now living in London. Petra, Kate's mother, is a stereotypical Eastern European. She is always sad, she sings mournful songs, she uses outlandish curses - \"I will nail you to my p----\" - and she refers to a dessert brought by a gay guest as \"lesbian pudding.\"The TV broadcasts coverage of Brexit protests and Petra bemoans that people dislike her because she is an immigrant. But she is a bigot herself, albeit a comical one. \"I blame the Poles,\" she says, about current anti-immigrant sentiment in the UK. All this is played for laughs. Otherwise, the movie bends over backward to be politically correct. Four relationships are highlighted in the film, and all four are biracial, and one is a lesbian couple. The one group this politically correct film recognizes it is okay to make fun of is Eastern Europeans. Even so, I loved the movie.There are no spoilers in this review, so I can't tell you how the movie handles Kate's transformation, from a total mess at the beginning of the film, to someone we can take to heart at the end, but I found the plot device to be quite poignant, and I left the theater with tears rolling down my face. The critics who have given this film a low score need to have their credentials revoked and their minds and hearts opened. Emilia Clarke and Henry Golding have terrific chemistry, and I'd love to see them reunite in a more traditional romantic comedy.",
    "9": "Last Christmas tells us an interesting story.Kate has a lot of troubles: she had an audition, arrived late and failed: at home her relationship with her depressive mother is quite tense.She works in a Christmas shop and there was a burglary .Then appears a man, Tom, who wants to speak with her, who has a walk with her,who comforts her.Later in the film the spectator will understand who is really Tom.Because of these facts Last Christmas is different Christmas film.\nI enjoyed very the performances of Emilia Clarke and Henry Golding.",
    "10": "I really want to say I liked Last Christmas - Henry Golding is disarmingly charming, the happiness is helping other people message is sweet. This is how a Christmas film should be....you laugh, cry, laugh some more ...with a theatre full of strangers who are doing exactly the same. Not ashamed to say I loved it.",
    "11": "Beyond my expectation. Now I know why it's called \"last christmas\" because of its lyrics. A feels movie. Boy meets girl vibe with christmas spirit. Good twist tho.",
    "12": "Such a great holiday movie! Loved the plot twists!",
    "13": "Last Christmas tells the story of Kate(Emilia Clarke). Kate is at a low point in her life & she begins working as Santa's elf, at a Christmas supplies store. Soon, Kate meets Tom(Henry Golding). Nothing will ever be the same again.Last Christmas is a superb movie. Director Paul Feig has given us a hilarious, heart-warming & emotional film. The soundtrack featuring George Michael's songs, is an absolute delight. The plot is not predictable but, the plot twist is a tad bit disappointing. The performances are the highlight of the movie. Emilia Clarke is spectacular as Kate. Henry Golding is outstanding as Tom. Emilia Clarke & Henry Golding share effortless chemistry, in all their scenes together. Michelle Yeoh is excellent as Santa. Emma Thompson, Boris Isakovic & Lydia Leonard are fantastic as Petra, Ivan & Marta, respectively. The supporting cast is brilliant. Last Christmas is worth a watch for romantic comedy fans. A perfect film for the Christmas season.",
    "14": "Maybe I'm in a cheesy mood. Maybe it's because it's a Christmas movie. I love Emilia Clarke as well. Combine all that, and I loved this movie. I saw it with my parents and fiancé. It made us laugh and look forward to the holidays even more. Ignore any negative reviews. This movie is perfect for what it sets out to do. It reminds you what the holidays are all about.Enjoy!",
    "15": "Surprisingly good was expecting a cheesy rom/com holiday film. But instead the Movie make you look up and appreciate what you have in life 😊",
    "16": "I loved it! A very sweet (and different) story. It pulled me in enough that I got invested in the characters, which allowed me to laugh and cry (a few times) at the end. It's movie that, if you allow it to, makes you think - and appreciate. I loved it!",
    "17": "Some parts of this movie are pretty awful and some parts are quite good. The good thing is because of the surprising twist ending it doesn't feel like a typical Hallmark style Christmas romance. It was actually quite moving. Emma Thompson acts quite well as the Yugoslavian immigrant.Some of the dialogue is too fast and many of the jokes fall flat. The way Michelle Yeoh's character acts is painful at times. Luckily Emilia Clarke is winsome enough to smooth over the rough edges. And she and Henry Golding have a good rapport.\nThere is an anti Brexit message. And a very diverse cast racially and by sexual orientation. The George Michael song sounds quite good too.",
    "18": "I love Christmas movies and I love a good feel hood chick flick so I loved this. Emilia Clark and Henry Golding were a great pair. I've read many harsh reviews but I thought it was great.",
    "19": "Yugoslavia in 1999? Did not exist. I am from Serbia and I agree with fellow croatian who said it is very much confusing and why did they escape from Croatia 1999? How strange.\nAnyway the movie is cute and christmasy so why not enjoy in it.",
    "20": "A charming rom-com based on George Micheals song Last Christmas! Paul Feig is pretty good at making most movies except the rubbish ones. Typical romance movie with quite a bit of brightness and heartwarming vibes. Very lovable in many ways, I'm glad it was more appreciated by many!",
    "21": "First Hit: It started off on the silly side, and by the end, I was very touched by this heartfelt story.I'd seen the previews for this story and thought, oh, this could be a silly sort of way to spend an hour and a half. However, I'm glad I didn't judge the movie by the preview. It has a beautiful and deeply touching message.The story begins with watching a young Kate (Madison Ingoldsby as young Kate) being the lead singer in a Yugoslavian church choir. Her mother, Petra (Emma Thompson), Ivan her father (Boris Isakovic), and her sister Marta (young Marta played by Lucy Miller) are in the audience watching. There is a moment in this scene that plays out later with the sister Marta looking at another person in the choir.Roll into the future, and the twenty-something years old Kate (Emilia Clarke) is living in London as is her whole family. Kate is working at a Christmas store that's open year-round, owned by \"Santa\" (Michelle Yeoh), who loves Christmas and the magic it brings. Kate is her employee and dresses like an elf. We get that Kate isn't a perfect employee but that Santa likes her for some reason.Kate rushes out of the store to make singing and acting auditions but is usually late, rarely prepared, and seems to have lost her ability to sing as well. We soon get that Kate's in a rut, which is compounded by her almost always homelessness. She's often shown dragging around her roller suitcase. At times, when she needs a place to sleep, she picks up guys in bars, sleeps with them, but something invariably happens, and she's back on the streets.Her friends, like Jenna and Rufus (Ritu Arya and Ansu Kabia respectively), give her a room, but within two days, she's messed this up, and they ask her to leave. She tries to reconcile with her family, but her mom is tough, and her father hides from her mom as much as possible. She and her sister Marta (Lydia Leonard) seem to be at each other's throats, and there appears to be no love lost anywhere. The family dynamics are really screwed up.All during these scenes, we are under the impression that Kate has no common sense, is flighty, and very ungrounded. Some would say unlucky. There is some hint that something happened to Kate about a year ago, but at this stage in the film, we are not privy to that part of the story. Did this event cause this ungrounded flighty nature?One day Tom (Henry Golding) pops into her life one day and impresses upon her to take a walk with him. She declines, but on the second random meeting, they walk, and you can see his caring and compassion for others, including Kate. The chemistry is strong between them, and he just seems like a wonderfully lovely person who's taken an interest in Kate. She wants to see him again and asks for his mobile number, but he says he doesn't use it, and it's kept in a kitchen cupboard at home, so giving Kate his name would be useless.On one of the walks, Tom takes her to a homeless shelter. Thinking he's trying to get her to stay there, she discovers; differently, he volunteers his time at the shelter and says she could help as well. But as Tom is prone to do, Tom disappears for days at a time. No one seems to know where he is.Kate begins to sing outside the shelter, collecting money, hoping that Tom will pop-up again. Alas, he doesn't, but just as she becomes even more despondent Tom shows up again.One evening she tells him what happen to her a year ago and why she doesn't feel like a whole person anymore. It is genuinely a sweet scene. He tells her that she can change her life by being open to others and by making kinder decisions. She's not a victim and can change her life.Tom's influence has a positive effect on Kate. She starts to make amends with \"Santa,\" her mom, dad, and sister. She volunteers more at the homeless shelter and is more thoughtful. An example of this is early in the film we see her getting picked up at a bar from some guy using a standard line. Now, we see her in a bar, she gets the same pickup line from another bloke, and she makes a better decision.A fun secondary story is about \"Santa\" trying to find companionship dates for herself. One day \"Santa\" meets \"boy\" (Peter Mygind), and how they engage with each other is so sweet and funny.I cannot delve into what happens to Kate that made her feel the way she does, nor how Tom is there to help her see the light, but the story is sweet, and the ending was fun and touching.Clarke is a hoot and actually inspirational as the film moved along. She did a great job of making this character work. Golding was beautiful as the man who pops into Kate's life to provide hope and inspiration. Yeoh is hilarious as the Christmas store owner who can see Kate's sweet side. Mygind was excellent as \"boy,\" the man who brought joy to \"Santa's\" life. Arya and Kabia are fantastic as Kate's friends, who keep supporting and allowing her to get better. Thompson was oddly funny and entertaining in her role as Kate's mother. Isakovic was terrific as the browbeaten husband of Petra and Kate's father. Leonard was harsh in her role as Kate's sister, with whom there were a lot of animosities. I didn't think this part of the film was developed enough, and their conversations felt too jarring at times. Thompson and Bryony Kimmings wrote this screenplay that didn't telegraph the ending, and that was a good thing. Paul Feig got the feel of this story right.Overall: After the end credits, I was surprised by how much I ended up liking this film.",
    "22": "I was almost not going to see this movie because of the rating! I'm so glad I decided to give it a go because I would've regretted it. This movie is great and I dont even like Christmas romance comedies! It wasnt overly sappy and filled with sex scenes like the regular theater movies and even with people spoiling the \"plot twist\" it was still well worth the watch! The storyline is very simple but nothing wrong with a little simplicity. Not all movies should be unpredictable. Predictable doesn't mean unsatisfying. I find the more UNpredictable the movie, the less satisfying because who wants to watch a whole bunch of random scenarios happen in one movie? Not this girl. That would be wAY too much.",
    "23": "What a sweet holiday movie! I like the little twist in the movie. I also love the message in the movie... helping each other.",
    "24": "I don't know if it's because I had no expectations but I found this movie fun and enjoyable and there's also a surprise ending. It definitely stands out from the generic cheesy romance movies and is a really good Chrismas movie to watch.",
    "25": "Better than I expect it to be, this is one really heartwarming film. Not your typical rom-com or holiday film. The story is a 10/10 for me. Emilia Clarke and Henry Golding really shines in this, also Michelle Yeoh and Emma Thompson. The movie also has a lot of lessons in it.",
    "26": "Greetings from Lithuania.\"Last Christmas\" (2019) is not the most memorable romantic comedy you will ever going to see, but its a pretty solid one. This is a sweet and cute movie. Performances were very good and story was pretty involving and surprising as well. Add here a superb soundtrack by my all time favorite George Michael and this a sweet movie i can only recommend it to watch. A good Christmas movie as well as a good date film.",
    "27": "If you're looking for a lighthearted feel good movie, this is perfect. Sure the script and plot aren't out of this world, but the movie had me smiling and shedding a few tears too. Emilia Clarke and Henry Golding were amazing (as always) and the ending really touched my heart.\nDeducted one star for historical accuracy, but then again the family's background was not the central focus of the film so the inaccuracy did not take away from the plot. Nonetheless, for such a renowned team of filmmakers it's weird to see such a slip-up happen.\nDon't pay attention to the reviews bashing it for the inaccuracies and 'political intentions' of the film, it's a wonderful feel good movie that really touches you.",
    "28": "This has so obviously been review bombed. The movie is the truest form of christmas giving. It will join my collection of xmas greats that must be seen every year. Bravo",
    "29": "Last Christmas... the movie was so so so beautiful.. made me cry ... love hearing George in the cinema. It was like voice of a angel ..very emotional ..",
    "30": "Good rom-com!Her smile and energy are fantastic. It was a bit early for a Christmas movie for me but it didn't seem to matter.",
    "31": "Things are starting to look up for Emilia Clarke. From all of her work, this might be the best so far. Her singing was amazing. Yet it's not the best acting from her. She was just alright. I just never really felt that her character Kate seem that alcoholic and depress about her past near death experience. Don't get me wrong, she does do a bundle of bad decisions including one that should had gotten her fired from her job as an elf in a surprising year round Christmas shop never seem to have an off day with customers. However, the movie directed by Paul Feig & written by Bryony Kimmings and Emma Thompson, who co-wrote the story with her husband, Greg Wise doesn't go too dark on her struggles and explore her trauma too much due to the PG-13 rating. We never get an explanation of why the surreal events are just now happening. Instead, the movie focus way too much in the beginning digging through her childhood rather than her troubled adulthood. Like honestly, did we really need all those historical inaccuracies scenes involving Yugoslavia in 1999? It could had been cut. The film is also oddly over political about the current immigration problem. Those scenes like the one on the bus felt a bit random, forced and somewhat one sided on the issue. Plus they don't really related to the main story as much as it could had. Despite that, I get what they were going for. I hate discrimination against minorities but I do understand those who travel to another country to live should do it legal through their host immigration laws. It's a very complex issue that the film try to make it seem so easy. It wasn't really needed for a film like this. As with the sub plot of her sister Martha (Lydia Leonard) being afraid to come out as a lesbian to her parents, Petra (Emma Thompson) & Ivan (Boris Isakovic). I felt it try to be too current and took away some of the focus of Kate's main story. Regardless it was just nice to witness such a diverse well acted cast of characters especially the leading man. Asian Male Love Interest is very rare to see in European movies. Henry Golding was great as Tom Webster even if his dream boat good looking but kind character seem one dimensional all boy-scout too good to be true. I just wish he suffer similar issues like Kate but dealing with it better. After all both share a huge bond once you figure out the plot twist. Don't get me wrong, both Clarke & Golding had great chemistry with each other. However the way their characters met could had been better with a more sophistical mature approach. Instead of a silly random out of the blue curiosity scene involving a bird outside her store. The movie could had shown them briefly meeting before Kate's unexplained illness, and then meeting at the hospital much later as he is one getting sick while Kate drink herself to death in front of him. Better yet just have him be related to Santa (Michelle Yeoh) to show why the boss is bitter with Kate's current life choices yet cool exterior enough not to make Kate's life worst by firing her due to irresponsibility. These might have help fill some of the bigger plot holes like how Kate gained access to Tom's apartment or know how Tom look like once the plot twist is reveal and why was on the phone in the cupboard and what is in it. Those weren't never explained. Just think how stronger the story would had been if they went those types of routes. Nevertheless the plot twist is pretty predictable seeing how the title of the movie is based on a song about giving a piece of yourself to your love ones or the fact that the singer George Michaels die from dilated cardiomyopathy. You didn't need the dumbing of the audience flashback to explain what happen to Tom in the past once the plot twist is revealed. The title is good enough. Even if you didn't pay attention reading the title, the movie overplays that song to the point that you have to be deaf not to figure the twist out. The song does get somewhat annoying as well due to the repetitive nature. After a while I really couldn't stand listening to it any longer. Despite that the rest of the soundtrack was pretty good even if it's clearly a collection to Michaels' greatest hits. I just wish the movie establish the music being sung in story a little better than a minor mention of Kate being a huge fan of Wham & a cameo during the Christmas show. As for humor the movie was a mixed bag for me. Some like the mean-spirited judging panel and the homeless people stealing biscuits was out right awkward to laugh at. I just found the majority of the jokes to be meh. Since comedy is subjective; others might find it funnier or a lot duller. Overall: Despite the bitter sweet ending and the movie not being that romantic or comedic. The film still has a very strong message about trying to be happy by doing good deals for others or at least be thankful that you're living rather than six feet under. While not the best romantic Christmas movie. At least, this Christmas rom com is better than most Hallmark Channel films. It's still worth watching.",
    "32": "I love romantic comedies, but this one hasn't caught my heart. The two leads don't have much chemistry, mostly because their encounter is very contrived. Kate is very unlikable, which doesn't help at all. The most likable character is actually the sauerkraut expert, a very minor character.",
    "33": "Never mind the bad critics. Go see the movie. A lovable feel good holiday movie. The storyline is not very strong though. These days most movies are about horror, evil, action. Mostly senseless. This film is about unconditional love; a woman who loathes herself, but has her heart on the right place; about being there for one another despite differences, with wit and humor. Also about family. \"The real meaning of Christmas is the giving of love everyday.\" Song by the Ray Conniff Singers in the sixties. That song came to my mind.",
    "34": "Great fun, laughs a plenty a few tears and a generally heartwarming experience with extremely likeable leads and a perfect pace. Best Christmas film and Rom com in general for a good few years. A real must watch.",
    "35": "The movie really made my smile and lifted my morale. It doesn't matter how incorrect the facts are but one has to understand that is not the point of the movie. Throughly enjoyed it. Certainly recommend.",
    "36": "Often people get too caught up in the deeper meanings and quality of movies and rate them as if each film expects to be Oscar worthy. In reality some movies are made to entertain, not just preach a life lesson or sob story with A list actors and prestigious directors and win awards. \"Last Christmas\" was fun, entertaining, heart\nwarming, and thought provoking. Surprise! Sometimes the simplest of movies are the best at what film should do. This movie is what you expect and more, and does so to the best of its ability. Now call me crazy but to me that's a 10/10.",
    "37": "Is there a plot-hole?\nI'm not sure whether there it is or not.\nI see just a something like delusional vision or imagination, or even a miracle.\nBut above that all, I like Kate's slice of life that shows us a moral value about being a good person is a good thing.\nRom-com movie that shows us an easy-to-follow plot and a bit entertaining.",
    "38": "With the film industry laden with drugs, war, death, shady politics, doom & gloom, this is a bright little ray of sunshine in a very dark world.\nIt's so nice just to be able to go to the cinema & laugh again. We NEED more joy in our lives. The soundtrack is just phenomenal too, I mean, too much George Michael is never enough!\nI thoroughly enjoyed this movie. Being a George MEGAFAN, no doubt I'll be watching this every year until the end of time. Do you you know what, the thought of that makes me super happy.\nJust go to the cinema, check your worries at the gate & just enjoy yourself for a bit. It won't disappoint, I promise!",
    "39": "This is one of the best Christmas movies I've seen lately. The thing I liked best about it was that it felt fresh and original. It was heartfelt and sentimental, but not obnoxiously so. It was a great middle ground between the saccharine sweet Christmas offerings of Hallmark and the cynical, anti-Christmas offerings of Hollywood, such as \"Four Christmases\". The authentic, British flavor of the London-based story was also quite enjoyable.The performances were top-notch, particularly from Emilia Clarke as Kate. I disliked her character for much of the movie, as she was basically a selfish jerk, but Clarke played this aspect of her character to perfection. And, of course, her character arc required her to be that awful so she could go from bad to good through the course of the movie. I really didn't understand why she was such a hot mess, though. Her life had been miraculously saved by a heart transplant. It didn't make sense that she would become so cynical and self-destructive because of that. But Clarke as Kate was sufficiently cute, engaging and relatable to make us care about her character and want her to get to a better place in her life.Henry Golding as Tom was likable and charming throughout the movie. How could our cynical, standoffish protagonist Kate possibly resist him, or fail to be affected positively by his influence? I guess you could call him a manic pixie dream boy. You knew from the first that there was something different about him. I'd already read spoilers about the plot, so I wasn't surprised by the surprise ending, but my wife and daughter were, though they did guess he was some kind of angel.The supporting actors gave decent performances, especially Emma Thompson as Kate's mom, and Michelle Yeoh as her boss. They are award-winning actresses, after all. Not sure why they couldn't have cast a Yugoslav actress to play the role of Kate's mom, though, other than the fact that Emma Thompson co-wrote the screenplay for the movie. I'd be interested to hear the reaction of the British Yugoslav immigrant community to this movie. I'd suspect that parts of the movie would be borderline offensive to them. Seems like Kate's mom was a bit of a stereotype. It works to play members of an ethnic group for laughs if those producing the movie are from that ethnic group themselves, such as Nia Vardalos in \"My Big Fat Greek Wedding\". Otherwise, it can come across as condescending.The ending was bittersweet. I don't know if you ever really thought that Kate and Tom would become a couple, but it was still sad to see Kate realize who Tom really was and that she could never be with him. But the ending after that, with Kate nicer, her family relationships repaired, and her producing a joyful Christmas show for the homeless shelter, was definitely happy and upbeat. Perhaps a bit too much so, as it seemed things were a little too nicely and neatly tied up. Leaving a few unresolved loose ends might have made the story more realistic. But who cares about realism, in a fantasy story such as this?Any minor flaws aside, this movie was fun, emotional and entertaining, and the perfect antidote for the tired, cliched Christmas movie. Definitely worthy of a watch or two.",
    "40": "Quite good performances from all actors. Nice visuals and music.\nCute story and adequate Christmas stuff.The small political nods (Brexit, racism, lesbianism) were totally unnecessary, but they didn't ruin the movie. It's just annoying when writers feel a need to cram in political commentary in an otherwise unpolitical and cute film.",
    "41": "Yugoslavia in 1999? Did not exist. I am from Serbia and I agree with fellow croatian who said it is very much confusing and why did they escape from Croatia 1999? How strange.\nAnyway the movie is cute and christmasy so why not enjoy in it.",
    "42": "A charming rom-com based on George Micheals song Last Christmas! Paul Feig is pretty good at making most movies except the rubbish ones. Typical romance movie with quite a bit of brightness and heartwarming vibes. Very lovable in many ways, I'm glad it was more appreciated by many!",
    "43": "First Hit: It started off on the silly side, and by the end, I was very touched by this heartfelt story.I'd seen the previews for this story and thought, oh, this could be a silly sort of way to spend an hour and a half. However, I'm glad I didn't judge the movie by the preview. It has a beautiful and deeply touching message.The story begins with watching a young Kate (Madison Ingoldsby as young Kate) being the lead singer in a Yugoslavian church choir. Her mother, Petra (Emma Thompson), Ivan her father (Boris Isakovic), and her sister Marta (young Marta played by Lucy Miller) are in the audience watching. There is a moment in this scene that plays out later with the sister Marta looking at another person in the choir.Roll into the future, and the twenty-something years old Kate (Emilia Clarke) is living in London as is her whole family. Kate is working at a Christmas store that's open year-round, owned by \"Santa\" (Michelle Yeoh), who loves Christmas and the magic it brings. Kate is her employee and dresses like an elf. We get that Kate isn't a perfect employee but that Santa likes her for some reason.Kate rushes out of the store to make singing and acting auditions but is usually late, rarely prepared, and seems to have lost her ability to sing as well. We soon get that Kate's in a rut, which is compounded by her almost always homelessness. She's often shown dragging around her roller suitcase. At times, when she needs a place to sleep, she picks up guys in bars, sleeps with them, but something invariably happens, and she's back on the streets.Her friends, like Jenna and Rufus (Ritu Arya and Ansu Kabia respectively), give her a room, but within two days, she's messed this up, and they ask her to leave. She tries to reconcile with her family, but her mom is tough, and her father hides from her mom as much as possible. She and her sister Marta (Lydia Leonard) seem to be at each other's throats, and there appears to be no love lost anywhere. The family dynamics are really screwed up.All during these scenes, we are under the impression that Kate has no common sense, is flighty, and very ungrounded. Some would say unlucky. There is some hint that something happened to Kate about a year ago, but at this stage in the film, we are not privy to that part of the story. Did this event cause this ungrounded flighty nature?One day Tom (Henry Golding) pops into her life one day and impresses upon her to take a walk with him. She declines, but on the second random meeting, they walk, and you can see his caring and compassion for others, including Kate. The chemistry is strong between them, and he just seems like a wonderfully lovely person who's taken an interest in Kate. She wants to see him again and asks for his mobile number, but he says he doesn't use it, and it's kept in a kitchen cupboard at home, so giving Kate his name would be useless.On one of the walks, Tom takes her to a homeless shelter. Thinking he's trying to get her to stay there, she discovers; differently, he volunteers his time at the shelter and says she could help as well. But as Tom is prone to do, Tom disappears for days at a time. No one seems to know where he is.Kate begins to sing outside the shelter, collecting money, hoping that Tom will pop-up again. Alas, he doesn't, but just as she becomes even more despondent Tom shows up again.One evening she tells him what happen to her a year ago and why she doesn't feel like a whole person anymore. It is genuinely a sweet scene. He tells her that she can change her life by being open to others and by making kinder decisions. She's not a victim and can change her life.Tom's influence has a positive effect on Kate. She starts to make amends with \"Santa,\" her mom, dad, and sister. She volunteers more at the homeless shelter and is more thoughtful. An example of this is early in the film we see her getting picked up at a bar from some guy using a standard line. Now, we see her in a bar, she gets the same pickup line from another bloke, and she makes a better decision.A fun secondary story is about \"Santa\" trying to find companionship dates for herself. One day \"Santa\" meets \"boy\" (Peter Mygind), and how they engage with each other is so sweet and funny.I cannot delve into what happens to Kate that made her feel the way she does, nor how Tom is there to help her see the light, but the story is sweet, and the ending was fun and touching.Clarke is a hoot and actually inspirational as the film moved along. She did a great job of making this character work. Golding was beautiful as the man who pops into Kate's life to provide hope and inspiration. Yeoh is hilarious as the Christmas store owner who can see Kate's sweet side. Mygind was excellent as \"boy,\" the man who brought joy to \"Santa's\" life. Arya and Kabia are fantastic as Kate's friends, who keep supporting and allowing her to get better. Thompson was oddly funny and entertaining in her role as Kate's mother. Isakovic was terrific as the browbeaten husband of Petra and Kate's father. Leonard was harsh in her role as Kate's sister, with whom there were a lot of animosities. I didn't think this part of the film was developed enough, and their conversations felt too jarring at times. Thompson and Bryony Kimmings wrote this screenplay that didn't telegraph the ending, and that was a good thing. Paul Feig got the feel of this story right.Overall: After the end credits, I was surprised by how much I ended up liking this film.",
    "44": "I was almost not going to see this movie because of the rating! I'm so glad I decided to give it a go because I would've regretted it. This movie is great and I dont even like Christmas romance comedies! It wasnt overly sappy and filled with sex scenes like the regular theater movies and even with people spoiling the \"plot twist\" it was still well worth the watch! The storyline is very simple but nothing wrong with a little simplicity. Not all movies should be unpredictable. Predictable doesn't mean unsatisfying. I find the more UNpredictable the movie, the less satisfying because who wants to watch a whole bunch of random scenarios happen in one movie? Not this girl. That would be wAY too much.",
    "45": "What a sweet holiday movie! I like the little twist in the movie. I also love the message in the movie... helping each other.",
    "46": "I don't know if it's because I had no expectations but I found this movie fun and enjoyable and there's also a surprise ending. It definitely stands out from the generic cheesy romance movies and is a really good Chrismas movie to watch.",
    "47": "Better than I expect it to be, this is one really heartwarming film. Not your typical rom-com or holiday film. The story is a 10/10 for me. Emilia Clarke and Henry Golding really shines in this, also Michelle Yeoh and Emma Thompson. The movie also has a lot of lessons in it.",
    "48": "Greetings from Lithuania.\"Last Christmas\" (2019) is not the most memorable romantic comedy you will ever going to see, but its a pretty solid one. This is a sweet and cute movie. Performances were very good and story was pretty involving and surprising as well. Add here a superb soundtrack by my all time favorite George Michael and this a sweet movie i can only recommend it to watch. A good Christmas movie as well as a good date film.",
    "49": "If you're looking for a lighthearted feel good movie, this is perfect. Sure the script and plot aren't out of this world, but the movie had me smiling and shedding a few tears too. Emilia Clarke and Henry Golding were amazing (as always) and the ending really touched my heart.\nDeducted one star for historical accuracy, but then again the family's background was not the central focus of the film so the inaccuracy did not take away from the plot. Nonetheless, for such a renowned team of filmmakers it's weird to see such a slip-up happen.\nDon't pay attention to the reviews bashing it for the inaccuracies and 'political intentions' of the film, it's a wonderful feel good movie that really touches you.",
    "50": "This has so obviously been review bombed. The movie is the truest form of christmas giving. It will join my collection of xmas greats that must be seen every year. Bravo",
    "51": "Last Christmas... the movie was so so so beautiful.. made me cry ... love hearing George in the cinema. It was like voice of a angel ..very emotional ..",
    "52": "Good rom-com!Her smile and energy are fantastic. It was a bit early for a Christmas movie for me but it didn't seem to matter.",
    "53": "Things are starting to look up for Emilia Clarke. From all of her work, this might be the best so far. Her singing was amazing. Yet it's not the best acting from her. She was just alright. I just never really felt that her character Kate seem that alcoholic and depress about her past near death experience. Don't get me wrong, she does do a bundle of bad decisions including one that should had gotten her fired from her job as an elf in a surprising year round Christmas shop never seem to have an off day with customers. However, the movie directed by Paul Feig & written by Bryony Kimmings and Emma Thompson, who co-wrote the story with her husband, Greg Wise doesn't go too dark on her struggles and explore her trauma too much due to the PG-13 rating. We never get an explanation of why the surreal events are just now happening. Instead, the movie focus way too much in the beginning digging through her childhood rather than her troubled adulthood. Like honestly, did we really need all those historical inaccuracies scenes involving Yugoslavia in 1999? It could had been cut. The film is also oddly over political about the current immigration problem. Those scenes like the one on the bus felt a bit random, forced and somewhat one sided on the issue. Plus they don't really related to the main story as much as it could had. Despite that, I get what they were going for. I hate discrimination against minorities but I do understand those who travel to another country to live should do it legal through their host immigration laws. It's a very complex issue that the film try to make it seem so easy. It wasn't really needed for a film like this. As with the sub plot of her sister Martha (Lydia Leonard) being afraid to come out as a lesbian to her parents, Petra (Emma Thompson) & Ivan (Boris Isakovic). I felt it try to be too current and took away some of the focus of Kate's main story. Regardless it was just nice to witness such a diverse well acted cast of characters especially the leading man. Asian Male Love Interest is very rare to see in European movies. Henry Golding was great as Tom Webster even if his dream boat good looking but kind character seem one dimensional all boy-scout too good to be true. I just wish he suffer similar issues like Kate but dealing with it better. After all both share a huge bond once you figure out the plot twist. Don't get me wrong, both Clarke & Golding had great chemistry with each other. However the way their characters met could had been better with a more sophistical mature approach. Instead of a silly random out of the blue curiosity scene involving a bird outside her store. The movie could had shown them briefly meeting before Kate's unexplained illness, and then meeting at the hospital much later as he is one getting sick while Kate drink herself to death in front of him. Better yet just have him be related to Santa (Michelle Yeoh) to show why the boss is bitter with Kate's current life choices yet cool exterior enough not to make Kate's life worst by firing her due to irresponsibility. These might have help fill some of the bigger plot holes like how Kate gained access to Tom's apartment or know how Tom look like once the plot twist is reveal and why was on the phone in the cupboard and what is in it. Those weren't never explained. Just think how stronger the story would had been if they went those types of routes. Nevertheless the plot twist is pretty predictable seeing how the title of the movie is based on a song about giving a piece of yourself to your love ones or the fact that the singer George Michaels die from dilated cardiomyopathy. You didn't need the dumbing of the audience flashback to explain what happen to Tom in the past once the plot twist is revealed. The title is good enough. Even if you didn't pay attention reading the title, the movie overplays that song to the point that you have to be deaf not to figure the twist out. The song does get somewhat annoying as well due to the repetitive nature. After a while I really couldn't stand listening to it any longer. Despite that the rest of the soundtrack was pretty good even if it's clearly a collection to Michaels' greatest hits. I just wish the movie establish the music being sung in story a little better than a minor mention of Kate being a huge fan of Wham & a cameo during the Christmas show. As for humor the movie was a mixed bag for me. Some like the mean-spirited judging panel and the homeless people stealing biscuits was out right awkward to laugh at. I just found the majority of the jokes to be meh. Since comedy is subjective; others might find it funnier or a lot duller. Overall: Despite the bitter sweet ending and the movie not being that romantic or comedic. The film still has a very strong message about trying to be happy by doing good deals for others or at least be thankful that you're living rather than six feet under. While not the best romantic Christmas movie. At least, this Christmas rom com is better than most Hallmark Channel films. It's still worth watching.",
    "54": "I love romantic comedies, but this one hasn't caught my heart. The two leads don't have much chemistry, mostly because their encounter is very contrived. Kate is very unlikable, which doesn't help at all. The most likable character is actually the sauerkraut expert, a very minor character.",
    "55": "Never mind the bad critics. Go see the movie. A lovable feel good holiday movie. The storyline is not very strong though. These days most movies are about horror, evil, action. Mostly senseless. This film is about unconditional love; a woman who loathes herself, but has her heart on the right place; about being there for one another despite differences, with wit and humor. Also about family. \"The real meaning of Christmas is the giving of love everyday.\" Song by the Ray Conniff Singers in the sixties. That song came to my mind.",
    "56": "Great fun, laughs a plenty a few tears and a generally heartwarming experience with extremely likeable leads and a perfect pace. Best Christmas film and Rom com in general for a good few years. A real must watch.",
    "57": "The movie really made my smile and lifted my morale. It doesn't matter how incorrect the facts are but one has to understand that is not the point of the movie. Throughly enjoyed it. Certainly recommend.",
    "58": "Often people get too caught up in the deeper meanings and quality of movies and rate them as if each film expects to be Oscar worthy. In reality some movies are made to entertain, not just preach a life lesson or sob story with A list actors and prestigious directors and win awards. \"Last Christmas\" was fun, entertaining, heart\nwarming, and thought provoking. Surprise! Sometimes the simplest of movies are the best at what film should do. This movie is what you expect and more, and does so to the best of its ability. Now call me crazy but to me that's a 10/10.",
    "59": "Is there a plot-hole?\nI'm not sure whether there it is or not.\nI see just a something like delusional vision or imagination, or even a miracle.\nBut above that all, I like Kate's slice of life that shows us a moral value about being a good person is a good thing.\nRom-com movie that shows us an easy-to-follow plot and a bit entertaining.",
    "60": "With the film industry laden with drugs, war, death, shady politics, doom & gloom, this is a bright little ray of sunshine in a very dark world.\nIt's so nice just to be able to go to the cinema & laugh again. We NEED more joy in our lives. The soundtrack is just phenomenal too, I mean, too much George Michael is never enough!\nI thoroughly enjoyed this movie. Being a George MEGAFAN, no doubt I'll be watching this every year until the end of time. Do you you know what, the thought of that makes me super happy.\nJust go to the cinema, check your worries at the gate & just enjoy yourself for a bit. It won't disappoint, I promise!",
    "61": "This is one of the best Christmas movies I've seen lately. The thing I liked best about it was that it felt fresh and original. It was heartfelt and sentimental, but not obnoxiously so. It was a great middle ground between the saccharine sweet Christmas offerings of Hallmark and the cynical, anti-Christmas offerings of Hollywood, such as \"Four Christmases\". The authentic, British flavor of the London-based story was also quite enjoyable.The performances were top-notch, particularly from Emilia Clarke as Kate. I disliked her character for much of the movie, as she was basically a selfish jerk, but Clarke played this aspect of her character to perfection. And, of course, her character arc required her to be that awful so she could go from bad to good through the course of the movie. I really didn't understand why she was such a hot mess, though. Her life had been miraculously saved by a heart transplant. It didn't make sense that she would become so cynical and self-destructive because of that. But Clarke as Kate was sufficiently cute, engaging and relatable to make us care about her character and want her to get to a better place in her life.Henry Golding as Tom was likable and charming throughout the movie. How could our cynical, standoffish protagonist Kate possibly resist him, or fail to be affected positively by his influence? I guess you could call him a manic pixie dream boy. You knew from the first that there was something different about him. I'd already read spoilers about the plot, so I wasn't surprised by the surprise ending, but my wife and daughter were, though they did guess he was some kind of angel.The supporting actors gave decent performances, especially Emma Thompson as Kate's mom, and Michelle Yeoh as her boss. They are award-winning actresses, after all. Not sure why they couldn't have cast a Yugoslav actress to play the role of Kate's mom, though, other than the fact that Emma Thompson co-wrote the screenplay for the movie. I'd be interested to hear the reaction of the British Yugoslav immigrant community to this movie. I'd suspect that parts of the movie would be borderline offensive to them. Seems like Kate's mom was a bit of a stereotype. It works to play members of an ethnic group for laughs if those producing the movie are from that ethnic group themselves, such as Nia Vardalos in \"My Big Fat Greek Wedding\". Otherwise, it can come across as condescending.The ending was bittersweet. I don't know if you ever really thought that Kate and Tom would become a couple, but it was still sad to see Kate realize who Tom really was and that she could never be with him. But the ending after that, with Kate nicer, her family relationships repaired, and her producing a joyful Christmas show for the homeless shelter, was definitely happy and upbeat. Perhaps a bit too much so, as it seemed things were a little too nicely and neatly tied up. Leaving a few unresolved loose ends might have made the story more realistic. But who cares about realism, in a fantasy story such as this?Any minor flaws aside, this movie was fun, emotional and entertaining, and the perfect antidote for the tired, cliched Christmas movie. Definitely worthy of a watch or two.",
    "62": "Quite good performances from all actors. Nice visuals and music.\nCute story and adequate Christmas stuff.The small political nods (Brexit, racism, lesbianism) were totally unnecessary, but they didn't ruin the movie. It's just annoying when writers feel a need to cram in political commentary in an otherwise unpolitical and cute film.",
    "63": "Since this is a new-ish movie I was very pleasantly surprised at how good it is. Of course, the great Emma Thompson being involved not only as a writer but in the movie as well probably played a large part, but the two leads, Emilia Clarke and Henry Golding were spot on. I truly don't understand the overall low ratings, I would expect this to be 7.5-8 here on IMDb. Maybe the mystical aspect was over the top for a lot of people? Maybe a lot of people don't like George Michael's music which was played throughout the movie? I don't know but I would recommend this over many of the mundane, mediocre movies offered this season.",
    "64": "It was such a pleasant surprise to watch this and it was much better than I expected. Its a very sweet and heartwarming movie, and having Wham and George Michael playing in the background was an added bonus for me.I have watched some terrible Christmas movies but this one was lovely and I think it should be in the list of Christmas movies to watch, along with Love Actually and The Holiday.Don't believe the negative reviews - do watch it and sing along to George Michael. It really made me smile!!",
    "65": "I really enjoyed Last Christmas, and it was not as I expected but that was good. It was a nice simple story that is well told and beautifully acted with great casting. It wasn't laugh a minute but not was it meant to be. It is one young woman's rediscovery of herself and purpose in life with some funny moments. Don't expect it to be like Love Actually and you will enjoy. Let yourself go, and enjoy. And yes that is Amelia Clarke actually singing. If anything it's a bit Bridget Jones grows the f up!\nThis will be a Christmas TV favorite in years to come and I think will be more enjoyed in the future when people no longer expect it to be Love Actually or Bridget Jones.",
    "66": "Forgetting all about Thanksgiving and moving to Christmas, Last Christmas is the perfect Holiday movie about how miracles can change lives. A story laired over the sounds of the late Great Gorge Micheal. Is this how those broadway musicals inspired by recording artist work? I'm guessing Emmy Thompson who starred produced and wrote this movie had a thing for the singer.\nOverall,Last Christmas does get you in the mood for Christmas but the magic of the Holliday is not all there. Sometimes it's trying harder than it needs to making it cornier than it needs to but I guess that's ok for getting us into the Christmas spirit. Although it does make the movie feel like it should be on the Hallmark channel not it theatres.",
    "67": "Luvvie celebrity crap. Nothing really about Christmas other than the shop. BREXIT is not Christmas, forced politics is not Christmas. Bad enough we have to listen to millionaire celebs banging on about how the average person is a racist and how they understand the world from their ivory tower. JOG ON.Film about a selfish person who was ill, gets better, becomes a better person. Oh and London is full of xenophobic middle class white people.Dont care if you want to make this crap, everyone is entitled to make whatever films they like, just be honest on the synopsis. Should read. Preachy celebs, shoe horn politics into extremely dull film that occurs around Christmas, may contain humour.",
    "68": "Emma Thompson really annoying, brexit, clean London, happy homeless, cliche after cliche and the 2 policewomen....dont get me started. Gave it 4 out of 10 only because its Xmas and I'm in a good mood.",
    "69": "Wow, this Emilia Clarke is cute rare and it pierces the screen in this movie. Pretty funny movie and Kate is really a goof who is forgiven for everything until she pushes too much.There are a lot of very good ideas in this film not rahrah England at all. The actors are of many colours and even our family of heroes comes from Croatia. A lot of immigrants from Eastern Europe want and are established in England.Quite pleasant and touching towards a typical Christmas movie ending. There is a little surprise though that is funny and touching at the same time. Very nice voice from Emilia. The show finale is very uplifting.",
    "70": "I don't see why people are hating on this movie. Yes it was predictable but still funny and emotional .",
    "71": "Written by Emma Thompson and Bryony Kimmings, based on 'Last Christmas' by 'Wham!', this romantic comedy brings the lyrics of George Michael's song to the big screen, with the prettiness of Emilia Clarke and Henry Golding who breathe all their humanity into their endearing and touching respective roles.In the sweetness of Christmas London, Katarina 'Kate' Andrich, a budding young singer who fled the war in Yugoslavia with her family as a child, wanders the streets of the British capital in search of a purpose in life.Her heart is so big that she wants to please herself by bringing joy to everyone. But her mind has yet to find peace and wisdom. So, even if her intentions are pure, her actions often remain clumsy and end up ruining the daily lives of the people who become attached to her.Until 'Kate', embodied by Emilia Clarke, becomes her boss's confidante at a Christmas shop where the true spirit of Christmas lives thanks to a charming, kind-hearted and strict, Chinese owner calling herself 'Santa ', who is portrayed by Michelle Yeoh.This is a period when Kate begins to fall on Tom, a big-hearted young man of British-Malay origin, with whom she begins by arguing before realizing that he is an angel, who teaches her to take small steps to improve her life, from love disorder to true love.I'm not going to write more about the falling action of this deeply touching and truly beautiful film, because I wouldn't dare spoil the importance of the conclusion, before you experience it for yourself.'Last Christmas' is a modern tale, telling us about mistakes that can be made in life, and how they can be fixed, when we open our hearts to everyone, regardless of the barriers or differences that can pollute the mind. And how important it is not to wait until it's too late to do so.",
    "72": "Last Christmas is not nearly as good as I expected it to be. This film is a mess. I can't even list all the things that are wrong with it. Emma Thompson playing a Yugoslavian mother? Really??? George Michael songs that, on their own merit are great but, are played during scenes that are inappropriate for what the song is about. Multiple storylines that are shoved together without properly being fleshed out. It's like this was a school project that the students procrastinated on doing and threw it all together in a rush to make deadline. This film had so much potential but in the end is disappointing.",
    "73": "The story of Katrina (Kate), working as an elf full time, meets a wonderful gentleman and realises that she's quite heartless. Superbly executed and wonderful characterisation. Katrina has a little Bridget Jones about her and this is t a typical low budget seasonal flick.",
    "74": "Seldom you watch a movie that makes you cry.... it's truly a heart touching movie!! It's sad that movies with such innocence are not made these days..... all the actors did their best! Would love to watch it again!!",
    "75": "Seemingly made $100m - but on all except the shallow levels it is just boring. Goes nowhere and has no magic that one might expect. A rip off of Bridget Jones might look similar but it might have more charm.\nPeripheral Characters such as the mother dreadful and false. Horrid Easter European characatures totally wrong.\nJust not funny despite wanting this to be good with significant actors.\nGive it a miss if you are looking for anything with a thoughtful screenplay.\nYawn",
    "76": "This film is obviously inspired by Love Actually and tries to produce a Love Actually feeling but it fails.\nPeople are sometimes very critical of Love Actually but if you watch Last Christmas you see how good Love Actually is and how hard it is to make a good Rom Com or Christmas film.\nI won't give any plot spoilers but it is surprises me how badly made this film is.\nThe plot looks good on paper but it does not convince on screen.\nThe whole thing is based on George Michael songs but they don't add much to the plot.\nThere are no good performances in this,and I write as an Emma Thompson fan.\nBut every film has its good points,the good things about this film is that it makes London look great.\nThis film makes Notting Hill look like a Ken Loach film.\nEmilia Clarke as the female lead is pretty and energetic but the whole thing is not believable.",
    "77": "This one really warms your heart. Don't read any spoilers and just go with the flow of the film. Such a wonderful and clever script. Lots of fun and quirky tidbits and odd little nuggets of joy. Oh and some extra loving-love must go out to Emma Thompson - a master of so many scills. I'm such a huge fan of all things EMMA!",
    "78": "I was a little skeptical at first, but I gave it a try. I REALLY want to like this movie as I love The Holiday, for example. But for me there are several things that didn't quite fit in my Christmas Holiday film concept.The idea is great, the fact that they used \"Last Christmas I gave you my heart..\" message is a nice plot trigger, but the execution is a whole lack of that Christmas aura we expect from a Christmas film. It doesn't feel like a Christmas movie you want to watch all over again every year with a cup of hot cocoa in your cozy pajamas.The metaphor between the song and the fact she got a heart transplant is GREAT, and the fact that you start questioning if Tom is real a little after the middle of the movie is great too. But they totally wasted it by not adding that Christmas spice we were all expecting.",
    "79": "I hadn't really watched the trailers so I didn't know what to expect. I was ready for an OTT Rom Com, instead I got a beautiful story that made me sob (a little close to home), with a fabulous performance from Emma Thompson who had me in stitches. It was laugh out loud and a sob fest in one. My only criticism, not enough George Michael/Wham songs but that's just the nostalgia kicking in.",
    "80": "Probably the best Christmas film since love actually. Was really well done with a great cast and the story was unexpected with a good twist. Really emotional and heart warming and a perfect Christmas story.",
    "81": "\"Last Christmas\" opens in the beautiful setting of a church in Yugoslavia. A child with an angelic voice is singing in a choir. We instantly fast forward a number of years when the child is a young woman residing in London. After being picked up in a bar and spending the night with a man she just met, the woman is confronted by the man's live-in girlfriend, who returns early from a trip and asks her \"Did you shag him?\"The disconnect described above reveals a deep flaw in this film. For nearly half of the movie, the character of Katrina (Kate) is the Grinch trying her best to ruin Christmas for everyone. She is a recalcitrant worker in a shop selling Christmas toys. She is estranged from her Croatian family and her doting mother. She is a human wrecking machine for all who surround her.Then, at the midpoint of the film, we learn that Kate had a bum ticker and received a transplant. She now has visions of her donor, a kind man named Tom Webster, for whom a bench is named in London. Kate begins to help the poor and sing for shillings outside a shelter. She now lives by Tom's adage, \"Every little action of the day makes or unmakes character.\"The film would have been better if we had learned the background on Kate's heart at the start of the film. As it stands, it was difficult to feel for the character, based on her Scrooge-like conduct for the first half. When Tom tells her, \"Take care of my heart. It was always going to be yours one way or another,\" the sentiment comes much too late. The Grinch-like Kate looks up to the sky and receives bird poop in her eye. The reformed Kate looks up and sees miracles. This movie is two separate halves that never come together.\"Last Christmas\" was a film that failed to deliver much genuine feeling. It was also unfortunate that the actress playing Kate appeared to have a nice singing voice, but it was under-utilized in the film. The production values were decent, and the cast was good. But the intended heart-warming effect of the film came far too late and failed to deliver much holiday cheer.",
    "82": "Okay, so you have a Christmas-themed movie with Emma Thompson in it and it's not Love Actually. Guess what? It's not trying to be Love Actually! So, if you give it a chance, and simply suspend disbelief, you might find yourself enjoying it. It's kinda like Christmas in that respect. As George Michaels would say, \"Ya Gotta Have Faith.\" No, it's not going to become an annual Christmas classic, but so what. It's a sweet, decent, amusing and (believe it or not) somewhat endearing little tale of redemption and humanity. It's not complex or deep, and it's not trying to be. So, ignore the Grinches out there and go see it. But be careful. You just might have fun!",
    "83": "George Michael had two Christmas hits in 1984. His song Last Christmas reached number 2 with Wham. His vocal contribution for Band Aid's Do They Know It's Christmas landed at Number 1.Ironically Michael died on Christmas Day in 2016. How can I forget, my wife was in tears for the rest of the evening after his death was announced!So you could argue that there is an element of bad taste in releasing a film that features songs from George Michael and Wham.Last Christmas purports to be a romantic comedy with a story by Emma Thompson and Greg Wise.Kate (Emilia Clarke) left the former Yugoslavia as a small girl. Now she works as an elf in a year round Christmas store in London and couch surfs with various friends.Kate plans to be a singer but is stuck in a dead end life with an overbearing mother. She feels loss especially after her emergency heart transplant.As an example of the rut she is in. She forgets to lock up the shop after work and it is robbed. Her boss covers up by claiming it was robbed.One day Kate meets Tom Webster (Henry Golding) who always seems to be there when she needs him. Tom volunteers in a homeless shelter and it pushes Kate to use her singing talents to raise money for the homeless.Emma Thompson appeared in Love Actually and this movie tries to channel the same groove. However this is a flat movie and not that romantic. Some of the social commentary feels bludgeoned in despite how well intentioned it was meant to be.I think Last Christmas bears comparison with Anthony Minghella's Truly Madly Deeply. In the latter Alan Rickman (who was Thompson's husband in Love Actually and who also died in 2016) plays a ghost who returns so her grieving lover could move on in her life. Truly Madly Deeply was small scale but it was more warm hearted and genuine. It also made points about the immigrant experience.The twist in Last Christmas owes more to The Sixth Sense. I regard the movie as an empty cynical cash in on both George Michael and Christmas movies in general. On the other hand my wife really liked the movie.",
    "84": "The film was much more than expected. The beginning seemed like the movie will not offer a great, deep story, but just wait till the end and you will me amazed. There are also plenty of really funny moments and Emilia is just wonderful in portraying them.",
    "85": "This is a sickly wishy washy load of rubbish that is really not worth spending time or money on.The story has no credibility whatsoever and is jam packed with stereotypical performances of one dimensional characters - and an obvious lack of research by the writer.All in all this was the waste of a film budget so that the 'luvvy' brigade can massage their own egos. it is purely a cash generator.I strongly suspect that the high rating reviews are false - because this gets nowhere near even a 4 however you look at it.",
    "86": "The first half of the movie was a big smile on the face all along. Emilia Clarke is amazing, cute, beautiful and perfect for this part. Henry Goulding is good too. I didn't like the big twist at first, but after some thinking I think it can work. I'm not completely sure how I feel about it. Lovely movie with a great cast.",
    "87": "Wow ! I didn't see that one coming. Absolutely brilliant. Beautiful story.",
    "88": "A beautiful film. It's not trying to be anything mind blowing but it has laughs a tears, perfect for this time of year.Highly recommended.",
    "89": "I saw this film in theaters last december and was initially FURIOUS at how obvious it was. everyone pointed it out and i thought 'they can't possibly think we're that dumb'. they did and i was PISSED. but on a second viewing, it's a sweet movie and genuine romcom, which i can't say for 'crazy rich asians' which was NOT funny. this was genuinely funny until the end, where it tears your heart out. knowing the end does tear your heart out on the second viewing (and begs logistical questions) but its worth it.",
    "90": "The very title reveals that this film takes place in flashback. (Obtaining clearance to shoot all those London locations must have been absolute hell.) The end result is a chick flick which makes our capital city look shinier and more cheerful than it ever seems to folk who actually live there.Emilie Clarke - who meets cute with the hero dressed as an elf - is a charmingly robust heroine (the scene where she reveals her scar from a heart transplant must represent some sort of first).Even in a party hat Emma Thompson (who gets to resemble her mother more every day) resembles a morose bird of prey as the heroine's mother. The most pleasant surprise is probably Michelle Yeoh as Clarke's brittle boss who discovers love with an expert on sauerkraut.",
    "91": "No girl from Yugoslavia would lay down on bed in her shoes, never! 😂",
    "92": "\"Last Christmas\" would be a major hit on Netflix and LIfetime without the A-list ensemble or top-shelf boss. But this romantic comedy is a subpar experience as a cinematic element, where aspirations are naturally lower. \"Last Christmas\" is so candy sweet that even the most optimistic of Santa's Elves will leave a bad taste in the mouth. \"Game of Thrones\" actress Emilia Clarke plays Kate, a twenty-something reckless woman who works in a London seasonal store run by a woman who goes by Santa (Michelle Yeoh). Santa respects Kate as an employee but has recently taken its toll on Kate's growing cynicism and self-destructive behaviour. A fun montage reveals that Kate and most of her peers have burned bridges. And make matters worse, a medical problem cut off Kate's singing career. But when she meets Tom (Henry Golding), the kind and considerate, Kate's prospects start looking up. The highlight of the film is the performance of Emma Thompson as Kate's daughter, Adelia (Emma Thompson), a Yugoslav immigrant who is overly protective. Thompson, who is co-writing here, saves for herself all the best jokes. She puts on a thick accent and has an excellent comic timing. The rest of the picture is tonally distorted, synthetic, and lazy flat-out. Those who demonized \"Green Book\" last year's Oscar winner could also easily send their rage on \"Last Christmas.\" Part of the narrative is about the work of Kate in a homeless shelter. You will instantly recognize the artificial essence of the one depicted here if you have ever visited or worked in one of these important places. Kate steps in as the facility's sort of savior. It's wince-inducing negatively. It's cinematic experience incapable of unsophisticated filmmaking. My wife and I have happily watched the latest Netflix Christmas deals for the last two holiday seasons. These cheesy films are lovely time-wasters. We put them on in my office last year while wrapping presents secretly, and these absurd films provided cheerful background noise. \"Last Christmas\" is better seen in that atmosphere, where you only sporadically concentrate on the film, enjoying the funny parts. But the cracks are magnified if you are forced to sit silently in a crowded theatre.",
    "93": "Last Christmas is sweet and sappy and the lead actors are charming. The media reviews have been bad, but this is a great Holiday feel good movie that I really enjoyed, so back off with the cynicism professional reviewers.",
    "94": "Last ChristmasThis movie was much better than the often over-sentimental mush we usually get every Christmas. Emelia Clarke was great and is quite a comic talent, and she sang really well as well.The script was tight the whole ensemble were great and the subtle way George Michael's music was woven in was a triumph and watch out for Andrew Ridgley in the crowd.I really enjoyed this 6/10",
    "95": "So someone had the 'idea(!?)' to take the lyrics from Wham! song quite literally to create this clichéd, virtue signalling, politically correct, stereotype ridden Richard Curtis-esque mess of a movie.It is just dross from start to finish; stealing ideas from all the other Christmas feel good movies out there, introducing a twist which has been done over & over and for some reason cramming it full of unnecessary political correctness whilst stereotyping and misrepresenting the culture and history of the Eastern European family at the core of the story.It is supposed to be a 'love story' but this movie only seems to be in love with is blinkered self.",
    "96": "This movie is very like a Bridget Jones film meets Elf. It's sweet and Emilia Clark is charming!Henry Golding is enchanting and Emma Thompson as ever riveting! Add some great characters like Michele Yeoh and Lydia Leonard and you have a sweet treat! Grab some popcorn and have an enjoyable time!",
    "97": "100% of its goodness is in its performances, especially Clarke's. Her comedic timing and voice are so surprisingly strong, and she brings an ineffable likability to an easily unlikable character. The \"surprise\" is unsurprising, and the ending is a corny mess; still, this old-fashioned rom-com has enough rom and com to make it worth visiting, especially for fans of the genre.",
    "98": "Let me start off by saying I'm not into this type of genre of films as you know what's going to happen from the start but this is not your typical romantic Christmas film. I normally can guess the plots on these films which I find boring. This movie took me by surprise at the end which I did not expect for that I enjoyed it plus I love the George Micheal songs throughout the movie even shed a little tear towards the end.The Last Christmas song fits this film perfectly very clever.",
    "99": "Straight away you understand smth is wrong with this man I picked it up that either his girlfriend or him is the dead person . This movie is so cringe. Before you create characters you need to do some researchin history. Croatia didn't suffer that much in war. It was Bosnia and Kosova. Ema Thompson was so awful . No one speaks English in their families if you are not English born. Find a Croatian actor at least. So much dogma as the e brexit issue or lesbians etc . Too many issues in a movie don't make sense. Movies now need to include a gay a lesbian etc . Cringe movies.",
    "100": "This is a christmas film but not really. with all the negative reviews apparently you are going to give this a one or a 10. emilia clarke is incredible in the movie and just love her facial expressions. the storyline is totally different than the usual hallmark stuff and the ending brings it home. emilia is a mess through much of the movie but through some help from her handsome new friend she pulls herself up and turns her life around. fun movie don't listen to the haters just enjoy the ride.",
    "101": "I love Christmas movies!! I love happy endings!! I love love! That being said ...I thought that ending was sad. I wanted more. Sure she matured at the end... The twist was a downer.\nAnd why the political message? There was no need for it!!!",
    "102": "George Michael had two Christmas hits in 1984. His song Last Christmas reached number 2 with Wham. His vocal contribution for Band Aid's Do They Know It's Christmas landed at Number 1.Ironically Michael died on Christmas Day in 2016. How can I forget, my wife was in tears for the rest of the evening after his death was announced!So you could argue that there is an element of bad taste in releasing a film that features songs from George Michael and Wham.Last Christmas purports to be a romantic comedy with a story by Emma Thompson and Greg Wise.Kate (Emilia Clarke) left the former Yugoslavia as a small girl. Now she works as an elf in a year round Christmas store in London and couch surfs with various friends.Kate plans to be a singer but is stuck in a dead end life with an overbearing mother. She feels loss especially after her emergency heart transplant.As an example of the rut she is in. She forgets to lock up the shop after work and it is robbed. Her boss covers up by claiming it was robbed.One day Kate meets Tom Webster (Henry Golding) who always seems to be there when she needs him. Tom volunteers in a homeless shelter and it pushes Kate to use her singing talents to raise money for the homeless.Emma Thompson appeared in Love Actually and this movie tries to channel the same groove. However this is a flat movie and not that romantic. Some of the social commentary feels bludgeoned in despite how well intentioned it was meant to be.I think Last Christmas bears comparison with Anthony Minghella's Truly Madly Deeply. In the latter Alan Rickman (who was Thompson's husband in Love Actually and who also died in 2016) plays a ghost who returns so her grieving lover could move on in her life. Truly Madly Deeply was small scale but it was more warm hearted and genuine. It also made points about the immigrant experience.The twist in Last Christmas owes more to The Sixth Sense. I regard the movie as an empty cynical cash in on both George Michael and Christmas movies in general. On the other hand my wife really liked the movie.",
    "103": "The film was much more than expected. The beginning seemed like the movie will not offer a great, deep story, but just wait till the end and you will me amazed. There are also plenty of really funny moments and Emilia is just wonderful in portraying them.",
    "104": "This is a sickly wishy washy load of rubbish that is really not worth spending time or money on.The story has no credibility whatsoever and is jam packed with stereotypical performances of one dimensional characters - and an obvious lack of research by the writer.All in all this was the waste of a film budget so that the 'luvvy' brigade can massage their own egos. it is purely a cash generator.I strongly suspect that the high rating reviews are false - because this gets nowhere near even a 4 however you look at it.",
    "105": "The first half of the movie was a big smile on the face all along. Emilia Clarke is amazing, cute, beautiful and perfect for this part. Henry Goulding is good too. I didn't like the big twist at first, but after some thinking I think it can work. I'm not completely sure how I feel about it. Lovely movie with a great cast.",
    "106": "Wow ! I didn't see that one coming. Absolutely brilliant. Beautiful story.",
    "107": "A beautiful film. It's not trying to be anything mind blowing but it has laughs a tears, perfect for this time of year.Highly recommended.",
    "108": "I saw this film in theaters last december and was initially FURIOUS at how obvious it was. everyone pointed it out and i thought 'they can't possibly think we're that dumb'. they did and i was PISSED. but on a second viewing, it's a sweet movie and genuine romcom, which i can't say for 'crazy rich asians' which was NOT funny. this was genuinely funny until the end, where it tears your heart out. knowing the end does tear your heart out on the second viewing (and begs logistical questions) but its worth it.",
    "109": "The very title reveals that this film takes place in flashback. (Obtaining clearance to shoot all those London locations must have been absolute hell.) The end result is a chick flick which makes our capital city look shinier and more cheerful than it ever seems to folk who actually live there.Emilie Clarke - who meets cute with the hero dressed as an elf - is a charmingly robust heroine (the scene where she reveals her scar from a heart transplant must represent some sort of first).Even in a party hat Emma Thompson (who gets to resemble her mother more every day) resembles a morose bird of prey as the heroine's mother. The most pleasant surprise is probably Michelle Yeoh as Clarke's brittle boss who discovers love with an expert on sauerkraut.",
    "110": "No girl from Yugoslavia would lay down on bed in her shoes, never! 😂",
    "111": "\"Last Christmas\" would be a major hit on Netflix and LIfetime without the A-list ensemble or top-shelf boss. But this romantic comedy is a subpar experience as a cinematic element, where aspirations are naturally lower. \"Last Christmas\" is so candy sweet that even the most optimistic of Santa's Elves will leave a bad taste in the mouth. \"Game of Thrones\" actress Emilia Clarke plays Kate, a twenty-something reckless woman who works in a London seasonal store run by a woman who goes by Santa (Michelle Yeoh). Santa respects Kate as an employee but has recently taken its toll on Kate's growing cynicism and self-destructive behaviour. A fun montage reveals that Kate and most of her peers have burned bridges. And make matters worse, a medical problem cut off Kate's singing career. But when she meets Tom (Henry Golding), the kind and considerate, Kate's prospects start looking up. The highlight of the film is the performance of Emma Thompson as Kate's daughter, Adelia (Emma Thompson), a Yugoslav immigrant who is overly protective. Thompson, who is co-writing here, saves for herself all the best jokes. She puts on a thick accent and has an excellent comic timing. The rest of the picture is tonally distorted, synthetic, and lazy flat-out. Those who demonized \"Green Book\" last year's Oscar winner could also easily send their rage on \"Last Christmas.\" Part of the narrative is about the work of Kate in a homeless shelter. You will instantly recognize the artificial essence of the one depicted here if you have ever visited or worked in one of these important places. Kate steps in as the facility's sort of savior. It's wince-inducing negatively. It's cinematic experience incapable of unsophisticated filmmaking. My wife and I have happily watched the latest Netflix Christmas deals for the last two holiday seasons. These cheesy films are lovely time-wasters. We put them on in my office last year while wrapping presents secretly, and these absurd films provided cheerful background noise. \"Last Christmas\" is better seen in that atmosphere, where you only sporadically concentrate on the film, enjoying the funny parts. But the cracks are magnified if you are forced to sit silently in a crowded theatre.",
    "112": "Last Christmas is sweet and sappy and the lead actors are charming. The media reviews have been bad, but this is a great Holiday feel good movie that I really enjoyed, so back off with the cynicism professional reviewers.",
    "113": "Last ChristmasThis movie was much better than the often over-sentimental mush we usually get every Christmas. Emelia Clarke was great and is quite a comic talent, and she sang really well as well.The script was tight the whole ensemble were great and the subtle way George Michael's music was woven in was a triumph and watch out for Andrew Ridgley in the crowd.I really enjoyed this 6/10",
    "114": "So someone had the 'idea(!?)' to take the lyrics from Wham! song quite literally to create this clichéd, virtue signalling, politically correct, stereotype ridden Richard Curtis-esque mess of a movie.It is just dross from start to finish; stealing ideas from all the other Christmas feel good movies out there, introducing a twist which has been done over & over and for some reason cramming it full of unnecessary political correctness whilst stereotyping and misrepresenting the culture and history of the Eastern European family at the core of the story.It is supposed to be a 'love story' but this movie only seems to be in love with is blinkered self.",
    "115": "This movie is very like a Bridget Jones film meets Elf. It's sweet and Emilia Clark is charming!Henry Golding is enchanting and Emma Thompson as ever riveting! Add some great characters like Michele Yeoh and Lydia Leonard and you have a sweet treat! Grab some popcorn and have an enjoyable time!",
    "116": "100% of its goodness is in its performances, especially Clarke's. Her comedic timing and voice are so surprisingly strong, and she brings an ineffable likability to an easily unlikable character. The \"surprise\" is unsurprising, and the ending is a corny mess; still, this old-fashioned rom-com has enough rom and com to make it worth visiting, especially for fans of the genre.",
    "117": "Let me start off by saying I'm not into this type of genre of films as you know what's going to happen from the start but this is not your typical romantic Christmas film. I normally can guess the plots on these films which I find boring. This movie took me by surprise at the end which I did not expect for that I enjoyed it plus I love the George Micheal songs throughout the movie even shed a little tear towards the end.The Last Christmas song fits this film perfectly very clever.",
    "118": "Straight away you understand smth is wrong with this man I picked it up that either his girlfriend or him is the dead person . This movie is so cringe. Before you create characters you need to do some researchin history. Croatia didn't suffer that much in war. It was Bosnia and Kosova. Ema Thompson was so awful . No one speaks English in their families if you are not English born. Find a Croatian actor at least. So much dogma as the e brexit issue or lesbians etc . Too many issues in a movie don't make sense. Movies now need to include a gay a lesbian etc . Cringe movies.",
    "119": "This is a christmas film but not really. with all the negative reviews apparently you are going to give this a one or a 10. emilia clarke is incredible in the movie and just love her facial expressions. the storyline is totally different than the usual hallmark stuff and the ending brings it home. emilia is a mess through much of the movie but through some help from her handsome new friend she pulls herself up and turns her life around. fun movie don't listen to the haters just enjoy the ride.",
    "120": "I love Christmas movies!! I love happy endings!! I love love! That being said ...I thought that ending was sad. I wanted more. Sure she matured at the end... The twist was a downer.\nAnd why the political message? There was no need for it!!!",
    "121": "Just when we think the gush of Christmas commercials and specials are over, along comes LAST CHRISTMAS, and if ever there were a film that could enchant, this is one that does. Written by Emma Thompson (who also plays a significant role in the movie) and Greg Wise with screenplay adaptation aided by Bryony Kimmings, the film seems a bit of fluff, overly decorated, until the messages begin to sink in. And by the end the film is elevating, thanks to some fine acting and direction. George Michael's music plays a primary role, also.Katrina/Kate (Emilia Clarke) is a young woman subscribed to bad decisions. Working as an elf in a year round Christmas store owned by 'Santa' (Michele Yeoh) is not good for the wannabe singer. However, there she meets Tom (Henry Golding), a kind-hearted man with a mysterious past who challenges her cynical worldview. Kate slowly comes to realize that Tom is 'significant' and her life takes a new turn. For Kate, it seems too good to be true. Completing the entourage is Kate's Yugoslavian immigrant family - mother Petra (Emma Thompson), father Ivan (Boris Isakovic) and sister Marta (Lydia Leonard) - each with conflicts and problems of their own. It all comes together with a discovery (one that should not be shared) and the grand finale at the homeless sanctuary is rich in honest goodwill - 'helping each other.'This is a feel good movie, well acted, and one that can be uplifting - if you've a mind to be uplifted!",
    "122": "A surprisingly clever, funny, and charming flick- Last Christmas hits its heartfelt moments tenderly in all the right ways, even with providing some small funny moments throughout. Emilia Clarke and Henry Golding are by far the standouts in the film, providing some truly great chemistry and poignant performances in the film. The acting is just one surprise of many in the film, as it is often clever with it's writing and progression of the story taken forward. The film does have a bit of an issue with editing, but nothing that ruins the film in a whole. It also is a bit corny and formulaic at times, providing typical tropes seen in movies of a similar nature, that just feel out of place, and if not, just plan obvious. However, the film is able to turn itself around from these remarks and become something truly special, and by all means heartwarming. The film is purely enjoyable, at times surprisingly inspiring, and full of an absolutely wonderful soundtrack of tunes from the legendary George Michael. In the end, Last Christmas surpassed my expectations on every account, and proves to be more than just a christmas romance film in all the right ways.\nMy Rating: 9/10",
    "123": "Kate/Katarina (Emilia Clarke) is an immigrant to Britain, with her family, coming after Yugoslavia broke up. Once singing in church, she longs to make it in musical theater. However, life has thrown her off track. Her mother (Emma Thompson) is overbearing, her sister is a successful lawyer with sharp disagreements with Kate, and our Katarina has health problems. So, now, Kate works at a year-round Christmas store, as an elf-saleslady under the direction of store owner, Santa (Michelle Yeoh). Its a living? Well, yes, but Kate has been couch surfing and has no permanent home but her parents house. One day she meets a handsome man on a bicycle, Tom (Henry Golding) who advises her to \"look up\". Its akin to stop and smelling the roses but Kate wants none of this gooey philosophy, at first. But, on subsequent encounters, Kate begins to notice things she's never seen before and to appreciate the friendship/love Tom has been offering. Can Tom change Kate's life for the good? This lovely new addition to the repertoire of Christmas cinema has a strong foundation in its script by Emma Thompson, a wonderful cast, lovely sets and costumes, and the eternally grand music of George Michael in its soundtrack. Be prepared for laughter and tears, as unexpected happenings keep arriving. But, in short, don't be last in line for Last Christmas!",
    "124": "I must admit, I was pleasently suprised after seeing the film. Had read some really negative reviews about this one.Emilla Clarke and Henry Golding wins my heart in this one.The story is simple yet very unusual. Kate(Emilla Clarke) is young woman who is known for her bad decision. She meets a mysterious man Tom(Henry Golding) who brings out the best in her.But the movie takes a turn. Tom is not what Kate thinks he is.What I liked about the movie is the simplicity and some of the tiny details I saw i this movie. The script is funny and touching at the same time. Cinematography is excellent. You will fall in love with London and the night cinematography is absoultely beautiful. Music compeltely gels with the visuals and story.The story and its execution would make you emotional, some people like me would even have tears in the eyes.Its's a really really well made movie and surely very underrated.",
    "125": "Katarina \"Kate\" (Emilia Clarke) survived a life saving surgery and is now a mess. She is temporarily homeless and couch surfing her remaining friends. She's bad at her job at Santa (Michelle Yeoh)'s Christmas store. She's avoiding her mother Petra (Emma Thompson). She keeps running into nice guy Tom Webster (Henry Golding).Obviously, somebody was inspired by Mamma Mia to do another musical with a different artist. This time, it's George Michael. Emilia Clarke is being her super adorable self and this is mostly a cute single sitcom gal trying to fix her messy life. I actually like her chemistry with Michelle Yeoh the most. Emma Thompson going ethnic is a little bit off. Henry Golding is a nice guy but he doesn't have much heat with Emilia. I do like his niceness rubbing off on her. As for the reveal, I was working out two competing twists at the time and it ends up being a combination of both. I actually don't like reinterpreting the song but that's a minor sour note. In that one, the problem is that the rest of the song gets sung. All in all, Emilia's natural cuteness and the story's harmless niceness make this a cute, appealing Christmas film.",
    "126": "Actually what you listened to ... last christmas! This may be the one song that is equally loved and hated! And the hate is not even its fault ... it comes from the fact that you can hear it year after year ... sometimes months before ... well Christmas time.So the movie is based on the song ... or takes the song and makes a movie out of it. But that is not all ... it also takes more songs of Wham/George Michael (I think he even wrote one especially for the movie? I may be wrong about that) and incorporates them into the movie. For better or worse that is ... I love the songs but as with Last Christmas there may be people who are not too fond of them.Also this is a romantic comedy ... what do you expect to happen here? Still the charisma especially from our ... GoT star Emilia Clarke is phenomenal ... she is so lovely and cute ... how can you not love her? Add an amazing supporting cast all around ... and that music/soundtrack ... well you sort of have a winner here ... if you are into this kind of thing.",
    "127": "Thank you Emma Thompson for producing this very underrated movie. Does it have the quality of Game of Thrones character development and storylines? No. Does it have the same appeal as Crazy Rich Asians? Probably not. But, does it do a great job putting a musician's catalog of songs into a fictional story? ABSOLUTELY!If you're a George Michael fan, and watch the movie from his song's perspective and get past the romantic comedy category that this film falls under, you'll appreciate what it does to his music. Is there cheese? Sure, but that's part of the charm to get to the twist.Not knowing the twist is the best way to watch this movie to experience what it is doing in dedication to George Michael.I would have rated this movie a 10, but they missed out on some of George's songs that they could have included, but for whatever reason, they didn't.If you got this far in my review and you haven't seen it, and you're a George Michael fan, and you're into the Christmas spirit... Go see it.",
    "128": "Christmas is, always has been, and always will be, my favourite time of year. Not just the gifts, spending time with family and festive traditions, but also seeing over and over many Christmas films, specials etc. Have never had any bias against romantic comedies and the cast was not a bad one. Emilia Clarke was great in 'Game of Thrones' and have also loved a lot of Emma Thompson's performances (she also has a great talent for screen-writing).So there was never any bias against 'Last Christmas'. Far from it. Actually thought it looked like a pleasant diversion and wanted it to work, and am being completely honest here. Seeing it, a large part of me was underwhelmed. By all means 'Last Christmas' is not a complete bah humbug and there are things that make it semi-watchable. There is however sadly nowhere near enough to it to make it a Christmas cracker and, despite good intentions, has too much wrong with it and ones not much different to flaws that a good deal of Christmas films made today have.'Last Christmas' does have good things. It looks lovely, those locations and how they utilise the festive season are just magical complemented beautifully by the photography. The soundtrack adds a lot to the atmosphere with a healthy dose of George Michael, it's great music on its own and actually didn't have as major a problem with the placement as others did.There are moments of charm and amusing moments, while Clarke is an earnest but not overly so lead and not out of sorts in the comedy department. Michelle Yeoh also shows bundles of charm.Was not impressed with the rest of the acting. Did find Henry Goulding quite bland and slightly too creepy, while Thompson is disappointingly a bit too on the melodramatic side. The chemistry seemed to lack warmth and that's what the story, on top of being paper thin and too conventional, generally seemed to lack too. The whole thing feels competent but too bland, complete with a bizarre and not particularly necessary twist. Paul Feig's direction is a long way from amateurish but it seemed to lack spark and seemed too safe.Found the script to be disappointing and quite weak, which surprised me seeing as Thompson co-wrote it and it was difficult to believe that it was from the person who wrote the sparkling script for the wonderful 'Sense and Sensibility'. The comedy was not enough and lacked freshness and wit, found it very try too hard. The romance needed more warmth and veered on a bit on the creepy side, while the drama was a bit too maudlin from sentiment being laid on too thick. Also felt that they were not always well balanced. While its good intentions were admirable, the film tackles politics and homelessness for examples and they felt shoe-horned and needed more subtlety.Summing up, appreciated its good intentions but wanted to like it much more. 4/10",
    "129": "\"Last Christmas\" the Wham song, long ago joined the pantheon of classic festive numbers almost the second it was released, especially in the U. K. but of course that pleasant association of Christmas and George Michael changed irrevocably when the singer sadly died on Christmas Day 2016, a final parting shot to music fans at the end of a year which had already taken David Bowie and Prince before their respective times.Perhaps this seasonal movie named after the song, set in London and featuring a soundtrack based almost exclusively on Michael songs, was some kind of attempt to emphatically claim back the holiday positively for the late singer with a hoped-for perennial Christmas classic film but if that was the aim, it failed to do so.Emilia Clarke is Kate, not Katerina, an aspiring actress, a kooky young Londoner and devoted George Michael fan, no kidding, who lives a peripatetic life-style, of no fixed abode, rolling from one friend's house to another, flitting from boyfriend to boyfriend, avoiding her eccentric Croatian parents and working in the world's worst Christmas gift shop by day when not trying out for singing parts in shows. Oh, and this is important, she underwent major surgery the Christmas before which incredibly, none of her friends or family mention at all, for a very good reason in fact, as it turns out...Her indulgent boss at the store is Michelle Yeoh, herself looking for love from an older man and who is struck by Cupid's arrow which sees her somewhat inexplicably fall for a middle-aged but decidedly weird middle-aged dreamboat who keeps coming back to the shop. But Kate too has her own mysterious admirer, a handsome young Asian man who flits in and out of her life, helps her out and picks her up when she's down, without coming onto her too heavily.By the end, in a surprising twist, the identity of her reluctant suitor is revealed in the most extraordinary and unbelievable only-in-pictures circumstances when we learn at last the significance of a throwaway line in Michael's classic Christmas song which I'm pretty sure wasn't the way its writer intended.While I liked this tour of festive London and especially its less salubrious spots, as well as the music, no real effort was made like say \"Mamma Mia\", to align the songs to the actual story. The characters to a person are unbelievable, all seeming to have stepped out of that oddly unnatural Curtisland, you know those wonderfully lovable people who frequent \"Notting Hill\", \"Love Actually\" and \"Four Weddings And A Funeral\" where they seem like everyday people but in fact talk in sentences people just never use.The attempts at humour fall flat, especially those involving Emma Thomoson's Croatian mother while the moralising vignettes on racial and sexual intolerance, plus a sideswipe at Brexit, are embarrassingly naive and ineffectual.Co-written by Thompson and director Paul Feig, this is one Christmas film from which I'd say it's better to keep your distance and to save you from tears, give your heart to something (more) special, instead.",
    "130": "Thank you Emma Thompson for producing this very underrated movie. Does it have the quality of Game of Thrones character development and storylines? No. Does it have the same appeal as Crazy Rich Asians? Probably not. But, does it do a great job putting a musician's catalog of songs into a fictional story? ABSOLUTELY!If you're a George Michael fan, and watch the movie from his song's perspective and get past the romantic comedy category that this film falls under, you'll appreciate what it does to his music. Is there cheese? Sure, but that's part of the charm to get to the twist.Not knowing the twist is the best way to watch this movie to experience what it is doing in dedication to George Michael.I would have rated this movie a 10, but they missed out on some of George's songs that they could have included, but for whatever reason, they didn't.If you got this far in my review and you haven't seen it, and you're a George Michael fan, and you're into the Christmas spirit... Go see it.",
    "131": "Christmas is, always has been, and always will be, my favourite time of year. Not just the gifts, spending time with family and festive traditions, but also seeing over and over many Christmas films, specials etc. Have never had any bias against romantic comedies and the cast was not a bad one. Emilia Clarke was great in 'Game of Thrones' and have also loved a lot of Emma Thompson's performances (she also has a great talent for screen-writing).So there was never any bias against 'Last Christmas'. Far from it. Actually thought it looked like a pleasant diversion and wanted it to work, and am being completely honest here. Seeing it, a large part of me was underwhelmed. By all means 'Last Christmas' is not a complete bah humbug and there are things that make it semi-watchable. There is however sadly nowhere near enough to it to make it a Christmas cracker and, despite good intentions, has too much wrong with it and ones not much different to flaws that a good deal of Christmas films made today have.'Last Christmas' does have good things. It looks lovely, those locations and how they utilise the festive season are just magical complemented beautifully by the photography. The soundtrack adds a lot to the atmosphere with a healthy dose of George Michael, it's great music on its own and actually didn't have as major a problem with the placement as others did.There are moments of charm and amusing moments, while Clarke is an earnest but not overly so lead and not out of sorts in the comedy department. Michelle Yeoh also shows bundles of charm.Was not impressed with the rest of the acting. Did find Henry Goulding quite bland and slightly too creepy, while Thompson is disappointingly a bit too on the melodramatic side. The chemistry seemed to lack warmth and that's what the story, on top of being paper thin and too conventional, generally seemed to lack too. The whole thing feels competent but too bland, complete with a bizarre and not particularly necessary twist. Paul Feig's direction is a long way from amateurish but it seemed to lack spark and seemed too safe.Found the script to be disappointing and quite weak, which surprised me seeing as Thompson co-wrote it and it was difficult to believe that it was from the person who wrote the sparkling script for the wonderful 'Sense and Sensibility'. The comedy was not enough and lacked freshness and wit, found it very try too hard. The romance needed more warmth and veered on a bit on the creepy side, while the drama was a bit too maudlin from sentiment being laid on too thick. Also felt that they were not always well balanced. While its good intentions were admirable, the film tackles politics and homelessness for examples and they felt shoe-horned and needed more subtlety.Summing up, appreciated its good intentions but wanted to like it much more. 4/10",
    "132": "\"Last Christmas\" the Wham song, long ago joined the pantheon of classic festive numbers almost the second it was released, especially in the U. K. but of course that pleasant association of Christmas and George Michael changed irrevocably when the singer sadly died on Christmas Day 2016, a final parting shot to music fans at the end of a year which had already taken David Bowie and Prince before their respective times.Perhaps this seasonal movie named after the song, set in London and featuring a soundtrack based almost exclusively on Michael songs, was some kind of attempt to emphatically claim back the holiday positively for the late singer with a hoped-for perennial Christmas classic film but if that was the aim, it failed to do so.Emilia Clarke is Kate, not Katerina, an aspiring actress, a kooky young Londoner and devoted George Michael fan, no kidding, who lives a peripatetic life-style, of no fixed abode, rolling from one friend's house to another, flitting from boyfriend to boyfriend, avoiding her eccentric Croatian parents and working in the world's worst Christmas gift shop by day when not trying out for singing parts in shows. Oh, and this is important, she underwent major surgery the Christmas before which incredibly, none of her friends or family mention at all, for a very good reason in fact, as it turns out...Her indulgent boss at the store is Michelle Yeoh, herself looking for love from an older man and who is struck by Cupid's arrow which sees her somewhat inexplicably fall for a middle-aged but decidedly weird middle-aged dreamboat who keeps coming back to the shop. But Kate too has her own mysterious admirer, a handsome young Asian man who flits in and out of her life, helps her out and picks her up when she's down, without coming onto her too heavily.By the end, in a surprising twist, the identity of her reluctant suitor is revealed in the most extraordinary and unbelievable only-in-pictures circumstances when we learn at last the significance of a throwaway line in Michael's classic Christmas song which I'm pretty sure wasn't the way its writer intended.While I liked this tour of festive London and especially its less salubrious spots, as well as the music, no real effort was made like say \"Mamma Mia\", to align the songs to the actual story. The characters to a person are unbelievable, all seeming to have stepped out of that oddly unnatural Curtisland, you know those wonderfully lovable people who frequent \"Notting Hill\", \"Love Actually\" and \"Four Weddings And A Funeral\" where they seem like everyday people but in fact talk in sentences people just never use.The attempts at humour fall flat, especially those involving Emma Thomoson's Croatian mother while the moralising vignettes on racial and sexual intolerance, plus a sideswipe at Brexit, are embarrassingly naive and ineffectual.Co-written by Thompson and director Paul Feig, this is one Christmas film from which I'd say it's better to keep your distance and to save you from tears, give your heart to something (more) special, instead.",
    "133": "Renowned luvvies Emma Thompson and her lap dog Greg Wise have penned this ingenious screenplay inspired by the George Michael song.I'm afraid it turns out to be a complete insult to the great man's legacy; a moralising, preachy load of rubbish.It is a script full of cheesy platitudes, Brexit-bashing, happy homeless people dancing, a squeaky clean London, an overt attempt to ram home \"diversity\"... this is the definition of politically-charged schmaltz.The story is weak and terribly boring, not to mention completely predictable. I was rolling my eyes every 5 minutes.It is also supposed to be funny. I didn't laugh once. Thompson and Wise try to have their insufferable lead Emilia Clarke utter what they believe to be the wittiest lines you've ever heard. Newsflash, talking at 100mph and using stupid similes/metaphors isn't funny.This is probably the most annoying film you'll see this year.",
    "134": "I don't foresee this being a classic. I thought it was a fun 3/4 of a movie. The two leads seem to have good chemistry with each other. I love Michelle Yeoh, but she seemed unnecessary in this movie. I guess they need more than one mother-figure who criticizes Kate/Katarina.\nUnfortunately, the pleasantness has a twist. Not a good one either. It feels like the rug is pulled out from under the audience. The remainder of the film tries to bring a happier closure, but the damage is done. I understand the message it tries to bring, but being a Christmas movie, you kind of expect a more positive or happy ending. Perhaps if it wasn't set at Christmas time, the downer could be over looked. Or maybe there could have been a way to rescue the film. Unfortunately, while the twist was something different and unusual, it was like walking happily on a street, then falling down a sewer when you didn't know the manhole cover was missing.\nIf you want to see a cheerful Christmas movie, I'm not sure if this is the one for you. It's also a bit more sexually suggestive in language and content, so it's not a family movie.\nMaybe somewhere down the line, someone could do a remake of this film, perhaps give it a better recovery from the depressing ending. So I give it a pass because it is a fairly good movie up to a certain point.",
    "135": "Oh Dear! Now I wouldn't go as far as saying I had \"high hopes\" for this film, but as a real fan of the goo-fest that is \"Love Actually\" I at least thought this might fill some seasonal void in the run up to the festive season. \"Best Christmas film of the decade!!\" screams the marketing. Er... no.This review will be spoiler free.The plot: Kate (Emilia Clarke) is an immigrant from the former-Yugoslavia now living in London. She has a dead-end job working for \"Santa\" (Michelle Yeoh) in a Christmas shop in Covent Garden. She is perennially lubricated both with drink and other bodily fluids thanks to her hedonistic lifestyle. And she really likes George Michael.But life just seems vacuous and to have no purpose for her anymore. Her composure is not helped by her mother (Emma Thompson) constantly fussing about her health, since Kate has only recently recovered from a serious illness.Dropping into her life then comes Tom (Henry Golding). Smartly dressed and calmly reassuring, Tom seems to have the potential to start turning Kate's life around. But is she prepared to listen?There are startling similarities here with Phoebe Waller-Bridge's triumphant tribute to hedonistic 30-something sex-addicted females everywhere.... \"Fleabag\". Kate is similarly louche, hopping from bed to bed in a heartbeat. She has a dysfunctional family and - most strikingly - she has a particularly difficult relationship with her high-achieving sister. This is not helped by a remarkable similarity between the actress playing Marta (Lydia Leonard ) and Fleabag's Clare (Sian Clifford). But whereas Fleabag is both brilliantly written, heart-rending and hilarious, this simply is not.There were a total of two laughs in the movie for me. Period. Both were lines delivered by Emma Thompson, and if you've seen the film you probably know the ones. Now, I'm aware that Thompson co-wrote the script and she is, of course, a national acting treasure. But here the script is clunky and all of the \"comic\" scenes are so laboured and forced that they land like leaden weights.And some of it makes no sense whatsoever. There is some strange Danish sauerkraut salesman (Peter Mygind) with a crush on \"Santa\". He suddenly appears in the shop acting like some escaped mental patient. When he first appears, acting bizarrely, you think, \"oh, there must be some fascinating backstory between these two - a murky past they are trying to rekindle\". But no! This is the first time they have EVER met? It's completely bonkers!Much was made of this being Michelle Yeoh's \"first comedy\". Sorry, but if she proves anything here it is that she is not a comic actress.Emilia Clarke is still looking to land in a decent mainstream role outside \"Game of Thrones\", after a failed Terminator sequel, a half-decent weepie (\"Me Before You\") and the commercial failure that was \"Solo\". Here she certainly looks curvaciously cute as the Christmas elf. But unfortunately cute can't save her from the car-crash of a script.Similarly Henry Golding is well-dressed eye-candy for the ladies, almost doing a re-tread of his cool and laid-back character from the excellent \"Crazy Rich Asians\". Without the same need to be \"zany\", he fairs slightly better from the script. But again, this feels like one to shuffle into a quiet corner of his CV.What can I say that's even remotely good about this? Three things:1) London. It looks glorious, decked out in lights like some chocolate-box-cover cum tourist-board publicity shot. London is one of the most photogenic cities on the planet, and I could relate to Tom's mantra to \"look up\" and see all of the architectural quirks and foibles that exist around every corner in that wonderful city;\n2) The payoff. Exactly when you get the payoff will depend on how much you know going in (if you've managed to avoid the trailer... continue to avoid it!) and how attentive you are. There's an \"aha!\" moment. And it's nicely played out.\n3) There's a topical xenophobic Brexit angle, that's a little clumsy in the exposition but - in my view - is good for the telling.This is a movie desperately trying to blend \"Love Actually\" with another Christmas classic (no... not \"Die Hard\"... but to say more would introduce spoilers!) But in my view it misses badly.The director is Paul Feig, famous for \"Bridesmaids\" and \"Spy\" and infamous for the female \"Ghostbusters\" reboot.There are clearly lovers of this film. At the time of writing it has made an impressive $51M on its $25M budget. But I went with another three cinema-goers from my family, all of differing ages and sentiments: and we all universally agreed on the rating for this one.(For the graphical review, please check out One Mann's Movies on Facebook or the web. Thanks).",
    "136": "How can you go wrong by blending a full suite of George Michael's classic hit songs, a Christmas themed film that is so well written (with a surprise twist) and stars the very multi-talented actress Emilia Clarke. Mrs. Shullivan and I decided t make this our first Christmas film of this the 2020 holiday season, and the film left us with a full heart of FEEL GOOD romance, family dynamics, social inclusiveness, and most importantly it left us both with that wonderful Christmas spirit reminiscent to watching an age old Christmas classic such as \"It's a Wonderful Life (1946)\" and/or \"Miracle on 34th Street (1947)\".This was a great Christmas spirit themed film and sure to become an annual Christmas classic for many decades to come, on so many entertainment and family value levels. Michelle Yeoh, plays store owner Santa, in her Christmas themed two storey retail store in which she employs Kate as her top elf and salesgirl. Emma Thompson who plays Emilia Clarke's immigrant Yugoslovian mother who suffers from depression and we see that the family dynamics between Katarina/Kate (Emilia Clarke) her mother Petra (Emma Thompson), her father Ivan (Boris Isakovic) who has a law degree from his homeland of Yugoslavia but has to settle being employed as a mini cab driver in London, and her estranged sister Marta (Lydia Leonard) who has a secret of her own not shared with her parents.Katarina/Kate is struggling to find peace, sanity after enduring a serious illness a year ago and to come full circle with her parents and her sister and as the film progresses we see how Katarina slowly through a series of her own misfortunes she finally comes to attain her inner peace in both her mind and her soul that we all strive to achieve in our own personal life struggles and our own family dynamics. Mrs. Shullivan and I laughed, and we cried, and the music score of so many George Michael's classic songs made the film a perfect 10 out of 10 IMDB rating. We also get to see the city of London, England dressed for the holiday season, and as the popular holiday song written by Frank Loesser in 1944, Baby, It's Cold Outside, the actors worked through the cold London winter on the River Thames to make this a Christmas classic for the ages.It's a MUST SEE and will become an annual Christmas classic on many top ten holiday lists. Watch it and you won't be disappointed.",
    "137": "I'm not a huge Paul Feig fan. I've seen a few of his films and I raise a slight chuckle from time to time, but on the whole he's a 6/10 filmmaker for me.In all honesty this film follows suit for the first two thirds. Not a bad film but not exactly good. Emilia Clarke plays a selfish screw up who can't get her life sorted, then a new guy steps in to her life and things start to change for the better. All this is set around Xmas and to a score of George Michael hits.It's all very formulaic until the final third. A genuinely moving end and a warm festive feel propel the film from an average run of the mill rom com to tear jerking, feel good, happy sad film. If there is such a thing.Cynics won't like it and I've seen a few people on here picking up on historical inaccuracies and cultural mistakes. But jeez!!!!! We're not watching Schindler's list, we're watching a Xmas rom com.If you like things like the holiday and love actually, then you'll most likely enjoy this.",
    "138": "I just got out of Last ChristmasThere are several laugh out loud moments in this and my audience seemed to really enjoy it, but it didn't always work for me.George Michael's music is the highlight of the movie. They especially use the track Heal The Pain really well, even more so than the use of Last Christmas.Emilia Clarke (Danaerys Targarean from Game Of Thrones) is an actress I have a real soft spot for, and she does well here, probably the best I have seen her in a movie since Me Before You. Henry Golding is fine as the male lead, Michelle Yeoh made me smile a few times, but for me Emma Thompson got the biggest laugh in the movie.Clarke's character is not particularly likeable to begin with, she is a selfish, promiscuous, heavy drinker who constantly upsets her friends and does not seem to care about her actions. You know she will have changed come the end, as in all good Christmas movies, but if anyone but the loveable Clarke played the role, if have had a hard time caring about her.It is more than a tad predictable and is heavy on the foreshadowing and at times hits you over the head with its message, I don't think it is designed to be a Christmas classic, but it's an ok 90 minutes, especially if you like George Michael's music, Emilia Clarke or Emma Thompson.My cinema was pretty full, And they seemed to enjoy it",
    "139": "Hot on the heels of a raft of films using classic pop as their driver - Bohemian Rhapsody, Rocketman, Yesterday, Blinded by the Light - comes Last Christmas.Directed by Paul Feig and co-written by Oscar-winner Emma Thompson, who also appears, Last Christmas uses the music of Wham! and George Michael in its bid to usurp Richard Curtis's copyright on all things London rom-com.The story centres on Kate/Katarina (Emilia Clarke), the daughter of Croatian refugees (Thompson and Boris Isakovic), who works as a sales elf in a Covent Garden Christmas store. Recovering from life-saving surgery, her chaotic lifestyle leaves her dependent on the goodwill of friends for places to live. Unfortunately, her annoying habits soon dry up any good will and she is constantly moving on. Into her life comes the mysteriously benevolent Tom Webster (Henry Golding) who flits in and out seemingly arbitrarily.Perhaps Emilia Clarke plays the irritating Kate too well as it's difficult to have much sympathy with her homeless plight; she rather brings it on herself you feel. Henry Golding as Tom is expected to do little but smile and look winsome, as he did in Crazy Rich Asians, and he does this with consummate ease.The script from Emma Thompson, her husband Greg Wise, and Byrony Kimmings is low on humour, preferring to take aim at what it perceives as a xenophobic strand of British society. Yet Emma Thompson herself goes for cheap laughs with her fractured English and misunderstanding of English idioms. It culminates in a penile joke, the like of which hasn't been aired since Mr Humphries asked if he could have Spotted Dick in the Grace Bros staff canteen circa 1975.The film's use of George Michael's pleasant pop also misfires through lack of imagination. In Rocketman, Elton John's music was used extremely well as a compliment to the evolving storyline. Here, the songs simply strike up on random play adding nothing to the plot or purpose of the film.Oh, and 'the twist' and its denouement was a carbon copy of a Hollywood classic from twenty years ago. This, and the obligatory shots of a gleamingly lit pre-Christmas London seen many times before, sum up the whole film as derivative and unoriginal. It was also unforgivably tiresome.Is there anything good to say about Last Christmas? Well, after watching this you'll probably think of Love Actually as being a seminal work of art.As the whole film was a self-contained cliché, it seems quite appropriate to describe it as a Christmas turkey to be avoided like the plague.",
    "140": "I really like Emilia Clarke but she has to get a new agent. She carries this movie on her back. But it isn't enough to save it from the paper thin screenplay. Can we all just admit right now that Emma Thompson is just not that great a screenwriter? I mean sure if she is tweaking a great writer like Jane Austen she can do ok but on her own - very over rated.The movie concerns Kate a young woman who had a heart transplant last Christmas. Since that time she has been lost and making a series of poor decisions. Kate likes to sing but no one seems to want her to as they won't pay her to do it. In the meantime she works at a Christmas store. Kate meets Tom who is too good to be believed and somehow gets her to start making better decisions.Like a lot of Feig productions 30% of the screen play is ad libed. 3 sub plots are in this movie but seem to have none or little relation to it.In the end Kate is taking care of herself, happy and helping others... but the big question is why. No one convincingly wrote a story whereby we would really see why. All of that is just glossed over. Loving or liking someone else has zero relation to that.",
    "141": "Fans of schmaltzy rom-coms rejoice! Last Christmas is here and it's a sickly-sweet holiday treat that will either leave you wanting seconds or asking for the bill after the first bite. Call me The Grinch, but I wanted a refund.The film stars Emilia Clarke as a hapless mid-20-year-old stuck in a dead-end job as a Christmas store elf. Things take a turn for the better when a mysterious stranger (played by Henry Golding) enters her life, helping her piece her life back together just in time for Christmas.It's never a good sign when the film's trailer feels like the whole movie, but you would be right on the money with Last Christmas. As soon the first trailer hit the web, the film's twist had already been dissected in the YouTube comments and those holding their breath for something more will leave sorely underwhelmed.Sure, you don't go into a film like this expecting to be surprised but neither do you want it feeling like it's three steps behind you just because you've seen the trailer. Yet, as soon the film delivers its climactic plot twist with the earnestness of a kid tying their shoelaces for the first time, the film quickly trips over its own feet.It's hard to lay blame on the marketing department as there's not much to work with in terms of the film's story. Taking its title from the 1984 Wham! pop song Last Christmas, the film treats George Michael's music with the same depth as Yesterday treated the Beatles; as window dressing. When it comes to the actual film, it's nothing more than your typical Hallmark movie of the week. Watching Clarke bumble around is endearing enough for the first half or so but it wears thin quickly and the predictable story line does little to keep things interesting.So, the question remains: how far can a film go based on charm alone? Well, your mileage will undoubtably vary based on your tolerance of saccharine love stories as Last Christmas is as sweet as they get. Its lack of cynicism and Clarke's infectiously bubbly lead performance will likely be its saving grace for many, but Last Christmas' story feels like a lump of coal wrapped up in pretty packaging.",
    "142": "Last Christmas is a new romantic comedy directed by Paul Feig, the director of Bridesmaids, Spy and The Heat.The film is about the young Kate (Emilia Clarke), who has had a difficult period behind her back, which makes her now a bit more moody. For example, she works as a cherry elf in a Christmas shop, while she would prefer to earn her money as an independent singer or a singer in a Christmas choir. When she meets the mysterious boy named Tom (Henry Golding), her life seems to take a positive turn. Kate keeps on seeing Tom again and again and the chemistry between the two starts to grow, causing Kate to fall in love with Tom.This film is a somewhat early romantic Christmas comedy, which remains good for a long time with the story of the film. The film does contain a plot twist, but it is somewhat predictable. The twist first comes across in a beautiful way in the film. Unfortunately, the film is also filled with extra separate story lines that deal with the problems of other characters, for example, or political messages to make the film more up-to-date. Because of all these extra storylines, the film suddenly no longer seems to focus on the main story about the relationship between Kate and Tom. It would have been better if they could end this film a little earlier and leave out all these extra storylines for a better story and conclusion.The title of the film is based on the song of the same name by Wham !. This film is also filled with well-known songs from the band and others from lead singer George Michael. With all this music and other Christmas elements, they are trying to get you into a Christmas mood with this film, but we are only in the beginning of November. This makes these attempts to get you in the Christmas mood a bit too early. They should have released this film a month later in the cinemas.",
    "143": "There's no doubt that it means well, with this Emma Thompson penned and George Michael inspired feel-good effort always having its heart in the right place but its overtly sappy and almost too clean feel makes Last Christmas a wannabe Love Actually like yuletide classic that never truly gives off that special Xmas cheer.Curiously directed by Paul Feig, who really dials things back from what you'd expect from the man behind Bridesmaids and Spy, Christmas tells one of those too good to be true like love stories and finding oneself drama's as it focuses on Emilia Clarke's ditzy but kind-hearted struggler Kate, who finds potential love and direction in her budding friendship with Henry Goulding's mysterious Tom in the lead up to a wintery U.K festive season.Everything about Christmas feels fairly familiar, with both Kate and Tom cut well and truly from the cloth of movie romantic tropes but the chemistry between Feig's two leads never heats up proceedings and his cast and Thompson and Bryony Kimmings script ticks off a series of predictable boxes that not even a supposed twist finale can help overcome.Instead of creating its own world and own vibe, Christmas feels constantly like its playing the easy game with its storytelling and delivery and while usually Feig is accustomed to delivering some very funny cinematic moments, Christmas is devoid of any standout moments of comedy genius as it trudges along its way through a procession of movements and scenarios that aren't going to be surprising anybody that's ever seen such a film.With this being the case, there was an extra load of pressure on Clarke and Goulding to push things up a notch but they're not given a lot to work with here with both Kate and Tom relatively so-so lead characters that don't do a lot to make us want to invest our emotions in them, even if the film seems intent on trying to wring out some unworthy emotions come the latter stages.Christmas isn't a terrible film and for what it is its most certainly watchable but with its underused foundation in George Michael's back catalogue and with an overall sense of blandness and acceptance of just being another member of the pack, you can't help but feel as though there's no real reason to recommended that anyone spend their quality time in this particular adventure.Final Say -A calmer Paul Feig gives Last Christmas a professional edge but its so-so story, weak chemistry between its leads and generic procession ensures it's not even close to becoming the new festive classic it clearly wanted to be.2 narrow alleyways out of 5",
    "144": "I just got out of Last ChristmasThere are several laugh out loud moments in this and my audience seemed to really enjoy it, but it didn't always work for me.George Michael's music is the highlight of the movie. They especially use the track Heal The Pain really well, even more so than the use of Last Christmas.Emilia Clarke (Danaerys Targarean from Game Of Thrones) is an actress I have a real soft spot for, and she does well here, probably the best I have seen her in a movie since Me Before You. Henry Golding is fine as the male lead, Michelle Yeoh made me smile a few times, but for me Emma Thompson got the biggest laugh in the movie.Clarke's character is not particularly likeable to begin with, she is a selfish, promiscuous, heavy drinker who constantly upsets her friends and does not seem to care about her actions. You know she will have changed come the end, as in all good Christmas movies, but if anyone but the loveable Clarke played the role, if have had a hard time caring about her.It is more than a tad predictable and is heavy on the foreshadowing and at times hits you over the head with its message, I don't think it is designed to be a Christmas classic, but it's an ok 90 minutes, especially if you like George Michael's music, Emilia Clarke or Emma Thompson.My cinema was pretty full, And they seemed to enjoy it",
    "145": "Hot on the heels of a raft of films using classic pop as their driver - Bohemian Rhapsody, Rocketman, Yesterday, Blinded by the Light - comes Last Christmas.Directed by Paul Feig and co-written by Oscar-winner Emma Thompson, who also appears, Last Christmas uses the music of Wham! and George Michael in its bid to usurp Richard Curtis's copyright on all things London rom-com.The story centres on Kate/Katarina (Emilia Clarke), the daughter of Croatian refugees (Thompson and Boris Isakovic), who works as a sales elf in a Covent Garden Christmas store. Recovering from life-saving surgery, her chaotic lifestyle leaves her dependent on the goodwill of friends for places to live. Unfortunately, her annoying habits soon dry up any good will and she is constantly moving on. Into her life comes the mysteriously benevolent Tom Webster (Henry Golding) who flits in and out seemingly arbitrarily.Perhaps Emilia Clarke plays the irritating Kate too well as it's difficult to have much sympathy with her homeless plight; she rather brings it on herself you feel. Henry Golding as Tom is expected to do little but smile and look winsome, as he did in Crazy Rich Asians, and he does this with consummate ease.The script from Emma Thompson, her husband Greg Wise, and Byrony Kimmings is low on humour, preferring to take aim at what it perceives as a xenophobic strand of British society. Yet Emma Thompson herself goes for cheap laughs with her fractured English and misunderstanding of English idioms. It culminates in a penile joke, the like of which hasn't been aired since Mr Humphries asked if he could have Spotted Dick in the Grace Bros staff canteen circa 1975.The film's use of George Michael's pleasant pop also misfires through lack of imagination. In Rocketman, Elton John's music was used extremely well as a compliment to the evolving storyline. Here, the songs simply strike up on random play adding nothing to the plot or purpose of the film.Oh, and 'the twist' and its denouement was a carbon copy of a Hollywood classic from twenty years ago. This, and the obligatory shots of a gleamingly lit pre-Christmas London seen many times before, sum up the whole film as derivative and unoriginal. It was also unforgivably tiresome.Is there anything good to say about Last Christmas? Well, after watching this you'll probably think of Love Actually as being a seminal work of art.As the whole film was a self-contained cliché, it seems quite appropriate to describe it as a Christmas turkey to be avoided like the plague.",
    "146": "I really like Emilia Clarke but she has to get a new agent. She carries this movie on her back. But it isn't enough to save it from the paper thin screenplay. Can we all just admit right now that Emma Thompson is just not that great a screenwriter? I mean sure if she is tweaking a great writer like Jane Austen she can do ok but on her own - very over rated.The movie concerns Kate a young woman who had a heart transplant last Christmas. Since that time she has been lost and making a series of poor decisions. Kate likes to sing but no one seems to want her to as they won't pay her to do it. In the meantime she works at a Christmas store. Kate meets Tom who is too good to be believed and somehow gets her to start making better decisions.Like a lot of Feig productions 30% of the screen play is ad libed. 3 sub plots are in this movie but seem to have none or little relation to it.In the end Kate is taking care of herself, happy and helping others... but the big question is why. No one convincingly wrote a story whereby we would really see why. All of that is just glossed over. Loving or liking someone else has zero relation to that.",
    "147": "Fans of schmaltzy rom-coms rejoice! Last Christmas is here and it's a sickly-sweet holiday treat that will either leave you wanting seconds or asking for the bill after the first bite. Call me The Grinch, but I wanted a refund.The film stars Emilia Clarke as a hapless mid-20-year-old stuck in a dead-end job as a Christmas store elf. Things take a turn for the better when a mysterious stranger (played by Henry Golding) enters her life, helping her piece her life back together just in time for Christmas.It's never a good sign when the film's trailer feels like the whole movie, but you would be right on the money with Last Christmas. As soon the first trailer hit the web, the film's twist had already been dissected in the YouTube comments and those holding their breath for something more will leave sorely underwhelmed.Sure, you don't go into a film like this expecting to be surprised but neither do you want it feeling like it's three steps behind you just because you've seen the trailer. Yet, as soon the film delivers its climactic plot twist with the earnestness of a kid tying their shoelaces for the first time, the film quickly trips over its own feet.It's hard to lay blame on the marketing department as there's not much to work with in terms of the film's story. Taking its title from the 1984 Wham! pop song Last Christmas, the film treats George Michael's music with the same depth as Yesterday treated the Beatles; as window dressing. When it comes to the actual film, it's nothing more than your typical Hallmark movie of the week. Watching Clarke bumble around is endearing enough for the first half or so but it wears thin quickly and the predictable story line does little to keep things interesting.So, the question remains: how far can a film go based on charm alone? Well, your mileage will undoubtably vary based on your tolerance of saccharine love stories as Last Christmas is as sweet as they get. Its lack of cynicism and Clarke's infectiously bubbly lead performance will likely be its saving grace for many, but Last Christmas' story feels like a lump of coal wrapped up in pretty packaging.",
    "148": "Last Christmas is a new romantic comedy directed by Paul Feig, the director of Bridesmaids, Spy and The Heat.The film is about the young Kate (Emilia Clarke), who has had a difficult period behind her back, which makes her now a bit more moody. For example, she works as a cherry elf in a Christmas shop, while she would prefer to earn her money as an independent singer or a singer in a Christmas choir. When she meets the mysterious boy named Tom (Henry Golding), her life seems to take a positive turn. Kate keeps on seeing Tom again and again and the chemistry between the two starts to grow, causing Kate to fall in love with Tom.This film is a somewhat early romantic Christmas comedy, which remains good for a long time with the story of the film. The film does contain a plot twist, but it is somewhat predictable. The twist first comes across in a beautiful way in the film. Unfortunately, the film is also filled with extra separate story lines that deal with the problems of other characters, for example, or political messages to make the film more up-to-date. Because of all these extra storylines, the film suddenly no longer seems to focus on the main story about the relationship between Kate and Tom. It would have been better if they could end this film a little earlier and leave out all these extra storylines for a better story and conclusion.The title of the film is based on the song of the same name by Wham !. This film is also filled with well-known songs from the band and others from lead singer George Michael. With all this music and other Christmas elements, they are trying to get you into a Christmas mood with this film, but we are only in the beginning of November. This makes these attempts to get you in the Christmas mood a bit too early. They should have released this film a month later in the cinemas.",
    "149": "There's no doubt that it means well, with this Emma Thompson penned and George Michael inspired feel-good effort always having its heart in the right place but its overtly sappy and almost too clean feel makes Last Christmas a wannabe Love Actually like yuletide classic that never truly gives off that special Xmas cheer.Curiously directed by Paul Feig, who really dials things back from what you'd expect from the man behind Bridesmaids and Spy, Christmas tells one of those too good to be true like love stories and finding oneself drama's as it focuses on Emilia Clarke's ditzy but kind-hearted struggler Kate, who finds potential love and direction in her budding friendship with Henry Goulding's mysterious Tom in the lead up to a wintery U.K festive season.Everything about Christmas feels fairly familiar, with both Kate and Tom cut well and truly from the cloth of movie romantic tropes but the chemistry between Feig's two leads never heats up proceedings and his cast and Thompson and Bryony Kimmings script ticks off a series of predictable boxes that not even a supposed twist finale can help overcome.Instead of creating its own world and own vibe, Christmas feels constantly like its playing the easy game with its storytelling and delivery and while usually Feig is accustomed to delivering some very funny cinematic moments, Christmas is devoid of any standout moments of comedy genius as it trudges along its way through a procession of movements and scenarios that aren't going to be surprising anybody that's ever seen such a film.With this being the case, there was an extra load of pressure on Clarke and Goulding to push things up a notch but they're not given a lot to work with here with both Kate and Tom relatively so-so lead characters that don't do a lot to make us want to invest our emotions in them, even if the film seems intent on trying to wring out some unworthy emotions come the latter stages.Christmas isn't a terrible film and for what it is its most certainly watchable but with its underused foundation in George Michael's back catalogue and with an overall sense of blandness and acceptance of just being another member of the pack, you can't help but feel as though there's no real reason to recommended that anyone spend their quality time in this particular adventure.Final Say -A calmer Paul Feig gives Last Christmas a professional edge but its so-so story, weak chemistry between its leads and generic procession ensures it's not even close to becoming the new festive classic it clearly wanted to be.2 narrow alleyways out of 5"
}