{
    "0": "Seems like it was pieced together from some recipe book for a bad movie.Girl heroine? Check!Innocent farmers? Check!Super disgusting bad guys? Check!Magnificent Seven? Check!Fight scenes just for the sake of it? Check!Bad guy resurrected in the end? Check!There's very little arc to the story.It's has very poor pacing.And doesn't make sense.You have advanced robots? Put them to work as the farmers, kill the farmers so they don't rebel.The king is dead, I think? Why not take over in his place?The whole plot line is catching the assassin? Why would I care if I crown myself the new kind? I guess the king isn't totally dead then.The whole thing seems cookie cutter to me.Please, do something original. This was far from it.",
    "1": "Ah, the bittersweet symphony of \"Rebel Moon.\" I hear you there, fellow traveler to Pandora and Tatooine. We can both appreciate Zack Snyder's stylistic flourishes - the slow-mo ballet of violence, the operatic landscapes, the characters carved from myth. But as the curtain falls on \"Part One,\" a mournful sigh escapes. This could have been a glorious space opera, a love letter to sci-fi's golden age, yet it stumbles over familiar tropes and squanders its vast potential.Snyder's fingerprints are all over the screen. The visuals are undeniable - gargantuan spaceships casting ominous shadows, crimson blades carving through darkness, desert vistas whispering forgotten empires. He paints with a grand brush, but the canvas starts to feel repetitive. We've seen the grizzled warrior with a troubled past, the damsel in distress with hidden fire, the villain who chews scenery like it's his birthright. It's a well-worn costume rack, and while Snyder drapes it with his signature flair, the threads of originality begin to fray.The plot, a familiar melody of rebellion against tyranny, starts strong but loses its harmonic richness. Characters, instead of complex chords, become predictable arpeggios. Their motivations are thinly veiled, their backstories a rushed montage. The dialogue, meant to resonate like thunder, echoes with the hollowness of recycled sci-fi cliches.What hurts most is the unrealized potential. The glimpses of a deeper world, the whispers of ancient powers, the seeds of a nuanced conflict - all wither in the harsh glare of action sequences. Snyder loves his spectacle, and \"Rebel Moon\" is awash in it, but spectacle alone can't sustain a film. We crave emotion, depth, resonance. We want to be swept away, not merely bombarded.So, as the credits roll, a bittersweet symphony resonates. We acknowledge the maestro's talent, the flashes of brilliance, the echoes of what could have been. But the lingering taste is one of missed notes, of potential left unrealized. \"Rebel Moon\" is a spectacle, no doubt, but a hollow one, leaving us yearning for the sci-fi opera that might have been.",
    "2": "I was looking forward to this so much over the past year, and really looking forward to seeing it, so much so I wouldn't start it until I had all Christmas shopping out of the way and I would have no distractions of any kind. To say it's a disappointment is an understatement. The acting is very average,poor even. The dialog is terrible and wooden. You know what the character is going to say nearly before they say it, and it's not anything witty or poignant. There is a scene early on that perfectly encapsulated the tone of the film. See through curtains, they are there look ok but pointless. I watch a lot of sci-fi and various movies and TV shows. But this is not at the standard you'd expect. Henry Cavill blurred out mustache CGI. Dull fight scenes, and utterly forgettable. (Edit:watched it twice just to be fair. It's actually worse than I thought. 3-4 out of 10 ⭐ max.",
    "3": "Like some others have said...it's got all the pieces but it's disjointed on so many levels it's hard to put a finger on it. Story could be something to build on but it's executed in such a hallow way the characters seem overly ridiculously evil or naive . Fight scenes are annoying my shot from fast to slow motion, not in a good way.They have good actors, I'm not sure why everyone seems so wooded in their dialect.Did I mention scenes go to slow motion for no paticular reason, then go back to normal speed. I'm curious if it's a funding issue. It almost seem the script was very loosely boarded and everyone improvised.",
    "4": "I really enjoyed this movie because I didn't go into it with any expectations or previews. I just went in open minded and ended up liking all the characters and the story. Yeah the setting and the themes are reminiscent of Star-Wars, but Zack executed it in a new way.I really hope that Netflix gets the outcome that they expect out of this so they can make more than just two parts. I am looking forward to the second part. Key take aspects that made me like this movie were the characters, setting, Visuals, and the story...A lot of people are just following their circles and are afraid of being ridiculed for enjoying this film. If you go into it open minded you will enjoy it, but if you are a Star-Wars fanboy you may not like it.",
    "5": "Rebel Moon is definitely in the hunt to be one of the worst movies I've seen this year. I'm struggling to find one thing I liked about it. The acting is rehhhhh, the dialogue is blehhhh, the story is mehhhh, the CGI is fehhhh and the usage of slo-mo by Zack Snyder needs to please end. Every slight bit of action is just drenched with slo-mo which I loved in 300 but now he has lost his mind with it. It ruins every single action scene which wasn't that great to begin with.I always find it hard to get behind a scrawny lead action woman who can take down 10 men twice her size, I find it hard enough to believe a man the same size can pull that off. Kora trading blows, knocking them all out while Gunnar who is a decent size guy punches one in the face but it just eats his punches. I know it's sci-fi and yada yada but some things still have to be believable and I find my self rolling my eyes every time. At least get a more imposing woman for these action roles, they all seem to be 5\"6 and 60kg. There's a reason there's weight classes.For a movie that felt like every scene ended in an action piece it was so boring. The fighting and shooting just sucks because of stupid action cliches and I'm sick of it. Kora beating a room full of soldiers who a few of them had guns but can't just all shoot at her? Instead let her get to them and fight them all one on one ahhh I hate it, easy my biggest pet peeve in cinema and it needs to stop.The gathering the crew together is also such a boring cliche these days and half the time I couldn't work out why half of them even joined up with them so fast. I don't care about any of the characters because you don't know any of them, it's just here's a bunch of characters and you will like them and want them to win because here.CGI on the spaceships just kept taking me out of what I think was suppose to make me think 'aww sweet these ships landing looks so cool'. It just looks like cheap CGI from older sci-fi shows and if this movie relies on anything it's hoping you're in awe of the alien worlds and cool spaceships.I don't know how Zack Snyder keeps getting these gigs but maybe he needs to have a swing at a drama or something completely different and try restart his art. Can't believe there's a part 2 filmed and being released early 2024.If you need a movie to watch this weekend I'd take Saltburn on. Completely different genre but really well made, acted and interesting.",
    "6": "First the good things, some great acting talent including the smoking hot babe from Hotel Artemis, some cool effects. It's a better experience than most of what Netflix puts out. But... this is just a basic rehash of the original Star Wars. Nothing new to see here, please disperse. What Netflix really excels at is copycatism, and this is the most recent and most glaring example. Time and time again we see this copycat nonsense from Netflix. Nothing original. A writer's room full of spider monkeys could have come up with something more original. They have a Luke, Leia, Han, even a 3P0... WHAT IS THIS?",
    "7": "As someone who is a huge fan of Zack Snyder's filmography when I heard he was delving back into original films again I got super excited, when I heard it was an original Sci-fi I got even MORE excited. Rebel Moon is definitely good enough, I had extremely high expectations, and it did not meet all of them, and it is a VERY different movie from what I was expecting and in some ways that's very good but in some other ways its not as good. I definitely think the story, settings, visuals, plots, side plots, performances, & characters are all fantastic. Where I think the movie could have benefitted more was if more of its limited runtime was spent with the character interactions and just how they get along with each other. It almost feels as though we are in a similar situation to when Batman V Superman came out and we only had part of a movie, but this time I feel it more with this specific one. All in all, it's worth a try, has enough huge enjoyable moments that balances the bad with it and has huge potential. Looking forward to the directors cut that hopefully fixes these issues.",
    "8": "I do not like writing reviews on content that I do not finish, but I saw all that I needed to see of this one. Some of the few things I saw that made it unwatchable were the ... strike that. It's one thing, and one thing only. The 100 pound female that is tilling fields and absolutely man handling most of a squadron of armed and armored soldiers. There was also excessive use of the slow-mo cam, and a really jarring backdrop of a ringed planet that just looked ... stupid. The main bad guy that we have been introduced to so far is over the top bad. I could be wrong, but I am guessing that there will be no actual depth or any nuances to his character. So, he is obviously a standard issue white guy. Duh.Again, this is only a partial review, but it truly felt that the show had entered an unrecoverable nose-dive, and it was just going to only get more and more annoying. It felt very \"simple\". Almost, color-by-numbers, if you will. Maybe it gets better after the 40-minute mark, but I'll probably never know.",
    "9": "Decided to stop watching this crap after 45 minutes of wasted time. It has the feeling of being made by amateurs, rather than by a professional crew. Some of the animations were okay, but if that is all there is, then really, you have nothing. Every scene seems \"borrowed\" from other movies, and where have we seen rebels against the empire before? The thing that ruined it for me, really utterly and completely ruined it, were those dumb slow-motion shots, as it takes away all believability that one is immersed in some extragalactic fairy-tale. This seems more like an ongoing Sci-Fi horror show of C-grade quality. Can't believe that this \"movie\" has blown away $90,000,000 (or more). Please, we need real directors and producers with actual talent and new great stories, as this is just garbage, no, worse than garbage!",
    "10": "I was so excited for this movie. I watched it the second it came out and man was I disappointed. I don't understand how this could be made. Everything about this movie is boring. Every action scene is in slow motion... Literally every part... Not just a key moment here and there to highlight something but the entire action scene is in slow motion. So the movie plods along with hard to hear dialogue with pretty backdrops and then when you think you're finally going to get some action it's in slow motion.I like Zack Snyder movies but this is easily his worst movie. I won't bother with the sequel and I suggest you don't bother with this movie. I'm so glad it wasn't in the theater.",
    "11": "For the love of god Zack, find a writer. Snyder is top of the class when it comes to visuals, action, and imagination, but the man's ability to tell a story is not up to par. This movie is almost Sucker Punch all over again - one of the best looking movies you'll see, but story and dialogue fall short.I love the cast he put together and the creativity in Rebel Moon is as good as any movie made. I had little investment in any character or their story though, too much was trying to be done in a short time. I have no doubt that I will care more as the story continues to unfold in part 2. The planned R rated directors cut will certainly elevate this movie.Critics are being way too hard on this movie, for certain I enjoyed it more than The Force Awakens, or the Dial of Destiny. Snyder is very talented, he just needs some help in the writing department! Looking forward to part 2!",
    "12": "I gave up on this after about half an hour. It's slow, acting is strained and everything is over-delivered, as if the actors are trying to add gravitas to every line, make everything seem important.It takes about twice as long to get anywhere than is needed, every moment feeling stretched out to near breaking point.The cinematography is strange, often with parts out of focus in a distracting way. The vocals feel seperated from the characters, like a poorly dubbed vocal track.All in all I had to give up, with no sense that.it was going to suddenly get any better. Hugely disappointing as I was looking forward to this.",
    "13": "Really wanted to like this film.. Had so much potential as an adult star wars.. But it just felt like it was bits of films that had already been made, cobbled together to make a new film. We found ourself playing 'name the film: ooh.. Bugs life, ahh - Dune, this bits the Cantina.. Etc.. Etc.. Charlies ' irish' accent was the bit that finally made us turn it off to revisit when we were in a different mood. Why couldn't he just use his own accent, being space Irish didnt bring anything to the character.. The space German uniforms of the bad guys made us roll our eyes as did the complete lack of depth of the villagers.. 'well now we have to fight' said with no emosh at all 🤣 I'm Afraid Snyder isn't the director I thought he was after the brilliant Watchmen, man of steel and Dawn of the dead remake.. Something changed and he's lost his way. I can't put my finger on it but this left me feeling insulted, the same way army of the dead left me feeling. Shame.",
    "14": "I finally got the chance to watch Rebel Moon, and I gotta say, it was incredibly cinematic and pretty action packed when it comes to Zack Snyder who made Dawn of the Dead, 300, Man of Steel, BvS: Dawn of Justice, and Zack Snyder's Justice League and Army of the Dead. I pretty much enjoyed this movie because of Zack Snyder who knows how to make movies so cinematic in the most possible way for his filmmaking industries.Sofia Boutella was great and so brilliant, as she played the most badass character known as Kora. I also loved her in The Mummy (2017), Star Trek Beyond, and Kingsman. The Cast and Crew, did a really good job with their roles, and the acting was pretty good, and the story was not that bad when it comes to true storytelling from your very own making.For me it was totally cinematic, and I say this is worth a movie to watch 100% and it's also Zack Snyder's movie of the year in 2023!",
    "15": "Rebel Moon is the worst movie I have watched in years.The best way I can describe it is that you have a series of channels, all playing fantasy and sci-fi movies, and you switch between them every 10 minutes and watch a scene. There is no connective tissue in this movie. Nothing makes sense. It is a goddamn mess with people who can normally act but don't here. Nothing is original. Everything we have seen in dozens of movies before. Zneyder brings nothing new to the table. Its super slow and lazy and i am sure nobody wants to see the second part. Nobody asked for this or wants to see this. Useless movie.",
    "16": "About halfway through. Kai is Hans Solo. \"You need to get to another planet, little lady?\" I thought, He's got a ship in port. Probably a clunker.\" Wry humor, cynical survivor. Chewy hasn't appeared yet. First a stop off that becomes a Magnificent Seven reference. \"Putting together a group to fight for our little village\". Horse/Dragon Whisperer commences. Then a little Rescuers Down Under. Now Aliens with the Mother able to speak. Nice touch. Oh, they made the James Coburn character into a woman with magic swords!! Pushing some Electra vibes, too. Now Princess Issa is channeling Tangled heroine. Loved Tangled. Big 300 vines off the General Titus scenes. Snyder going back to his roots. Maybe I'll finish it tomorrow.",
    "17": "Zach Snyder is a hack. He stopped making decent movies years ago, and this might just be the worst in his career. Its clear for all to see that he has been reading Jodorowsky & Moebius' The Incal, and tried to come up with something as epic as that, only to fail miserably. Nothing works here, absolutely nothing. Neither script, actors, costumes, music, effects, NOTHING. Its like watching a car crash in slow motion. How bad can it really get? Speaking of slow-motion, the use in here is so over-used its ridiculous. The style and rythm is completely broken with the use of it. Worst Ive seen in 23.",
    "18": "The trailer looked promising; however, the movie is terrible. There are ZERO original ideas. Everything looks like it was poorly borrowed from other films like Star Wars, Star Trek, to name a few. Not a single of these actors looks like they belong in this \"world\". Characters are just cruel to be cruel with no rhyme or reason.The special effect during fight scenes are also terrible. Characters shooting hundreds of times to hit one target but miss every single time and the main character takes down dozens of arms men? Ummm Puuuulease!I don't understand why people are so ride or die when it comes to Zach Snyder. His las couple films have been terrible. Yes, he's had some good ones, but this is not it. Fans are fighting online like they are defending a masterpiece and I can't help but watch this terrible movie and laugh at their idiocy.",
    "19": "Caffeine free diet Star Wars i.e. Colored water with bubbles. The plot was transparent and bland with a 100% predictable \"twist.\" There were a couple of interesting characters, but mostly it was filled with clichés, particularly the cliché 90lb girl who takes out half a dozen men twice her size. So dumb! And of course the ending set up the \"sequel\" i.e. The same movie all over again. By modern standards (Rings of Poop, The Marvels), the movie was tolerable, but in relation to the well told stories of the past this is a two at best. Truly we are suffering through the dark ages of entertainment.",
    "20": "This film by the, often consistent and great, Zack Snyder, is indeed a nice blockbuster around christmas times, and a good placeholder for a Star Wars film we never got - especially in times when Star Wars has been a bit absent in terms of cinematic experiences.Without actually using the Star Wars brand, as originally intended, it does include many of the franchise's signature items: a hero's journey, an evil Galactic Empire, over the top villains, lightsabers (or somewhat similar) and android robots. It does in many ways feel like a welcome return. Even if it is a bit lacking with the same depth that made Star Wars so great.The effects are great though, very beautiful in terms of cinematography, cutting and editing, and overall a great mix of CGI and practical.A fun adventure, to say the least - and in a bit of a new age of Star Wars, maybe these inspired-by smaller adventures is the right way to go?",
    "21": "I had hoped for something fresh! In love Sci Fi,\nbut this was just a journey through the same human tragedy! The village of peaceful people taken from \"Brave Heart\". It just felt too \"Been there done That\"!! I must admit I lost interest after the first fight! I will have to try watching this again! But judging by the other reviews I won't find much to change my mind!!Forgot to mention the Nazi uniforms! Big opportunity lost to create a fresh villain's!! Good writing wouldn't need the characters to look like what we have in our memories to get the points across as to who stands for what in their story!!Note: this is my first exposure to the Rebel Moon world maybe it's supposed to reference the same old stuff we kept seeing over and over!",
    "22": "The first 30 minutes were promising. For a while it looked like this could be a Snyder classic in the making but as soon as they hit a bar full of alien vagabonds the whole movie slumped.The heroes of the movie set out to recruit a gang of clichés to join their posse and head out to fight the villains. The plot is pretty weak as we spend nearly an hour watching the gang trudge planet to planet in search of new freinds in their quest for justice.The acting was poor overall with a special shout out to Charlie Hunnams cheesy attempt at an Irish accent. Ed Skrein was the one saving grace as the head honcho bad guy.You'll sit through it but you're unlikely to enjoy it.",
    "23": "Trashiest of trashy movie....\nWill remind you of the Mila Kunis fantasy movie it looked like a spoof\nParody\n.Zack Snyder has been fooling producers and fans for years\n...this movie is flat boring with no new element\n.most fantasy saga bits have been sewn together for Zack Snyder and his cronies to fool the human kind of another movie\nPerformances are bad because the script and the idea of the movie is bad.Some scenes just make you wonder if you surely watching a parody movie or not. The genius of Snyder is thriving you to waste another 2 hours of your life\nOn this waste ....of ott money.just avoid.",
    "24": "As an avid fan of sci-fi and fantasy films, I had hopes for Zack Snyder's \"Rebel Moon: A Child of Fire - Part One.\" However, my initial interest quickly faded, leading to disappointment and disengagement after just 20-30 minutes. I ultimately decided to abandon the film due to a combination of uninspiring performances, a lackluster script, and unoriginal storytelling.The most significant factor contributing to my loss of interest was the lack of convincing performances from the majority of the cast. Despite my initial enthusiasm for the selected actors, I found their portrayals to be unconvincing and lacking authenticity. In particular, the main lady's character failed to resonate with me, as her interactions with the supporting cast felt forced and devoid of chemistry. My suspension of disbelief was especially shattered when she effortlessly defeated a room full of trained male soldiers, leading to further detachment from her character's journey.Beyond the subpar acting, the film suffered from an unoriginal and predictable storyline. It followed a well-worn formula of a young hero rebelling against a tyrannical regime, offering little in the way of fresh ideas or innovation. The inclusion of clichéd \"Nazi-SS-Russian\" inspired villains only added to the film's lack of originality, leaving me feeling increasingly disappointed as the plot progressed.While the film boasted visually stunning moments, the focus on aesthetics came at the expense of character development and narrative coherence. By the 30-minute mark, I had yet to experience any meaningful emotional connection or depth, leaving me increasingly detached from the story.Furthermore, the dialogue failed to rise above trite clichés and lacked the necessary complexity to engage intellectually. Attempts at philosophical and political commentary fell short, leaving me yearning for more thought-provoking exchanges between characters. Unfortunately, as time passed, the dialogue failed to improve, further contributing to my declining interest in the film.Ultimately, after reaching the point of complete disinterest by the 30-minute mark, I made the decision to give up on \"Rebel Moon: A Child of Fire - Part One.\" The combination of lackluster performances, a derivative script, and a lack of character development.",
    "25": "Zack Snyder delivers again! Love or hate the man, but he knows entertainment. It's a mixture of movies and genres, drama, war, sci-fi. Dune, Star Wars, Seven Samurai, Monuments Men. But it's beautiful, epic in scope, action packed (Ed steals the screen in his scenes) Charlie Hunnam gives a performance I didn't see coming, Sofia is beautiful as always, don't take my word for it, watch it, suspend your hatred for Snyder and just watch it. I wasn't let down, the action is epic in scope, story is great, effects are absolutely top tier. Part 2 comes out next year, it'll be up there with Dune in later years. It's impossible to describe. Just watch it! Don't have to be a Snyder fan or anything. Trust me!!!",
    "26": "I hated the film after 5 minutes but continued watching nevertheless because I was curious about where It would lead..\nClichés, stereotypes (the villains look like Nazis), bad acting and directing, empty swollen dialogues, you'd think it's a (bad) Shakespeare play.Pathetic storytelling (take the scene with the girl and the robot)Entirely predictable, a story like you have seen a thousand times, video game levelVisuals are impressive but lack authenticity and credibility (if you can say that about a space opera)\nNothing compared to the latest Dune, which combines great CGI with a consistent story.Too bad, I have been hoping for it to be a GOOD SF film, but not a cheap Star Wars knock off.",
    "27": "I'd almost want to see a version of this that was 40 minutes shorter and half the dialogue cut out. It is over scripted with tragic exposition that makes me sigh every scene.There's plenty other things not working here in performances, frustrating lens/aberration choices that distract alongside every cliche dished out.Some accents pulled out of thin air and backgrounds that look lifted from a stock footage website... there's enough to make you drift off half way to write a review.Zack Snyder did a short film shot on an iPhone that was 100% superior to this. Give Zack Snyder less money and no VFX and CGI budget and see what he comes up with. Too many toys and money without the reasonably delivery of either.",
    "28": "I really suffered through umyje 2 hours and 15 minutes. Where I suffered the most were the slow motions that are annoying and useless. They made probably the whole movie in one go, and then decided to add a lot of slow motions to create two parts out of it.The special effects are sometimes at a level of late 90ties film, not mentioning about a crap acting that calls for the use of AI that would probably make a better job.Only the initial part in the village is interesting. Ok... there are a lot in common with Star Wars but we are introduced a plot like from the Magnificent Seven, just jn space and with much weaker acting.Waste of time!",
    "29": "Zack Snyder has a great talent for spectacle, but unfortunately not a lot of talent for making a good, coherent story. He's gone full Michael Bay with this film... Everything about it is style over substance.The nonsensical plot and setting strongly remind me of Jupiter Ascending, another visually great yet overall boring movie of the same vein. Large elements are clearly mimicking the Avatar movies, making them feel stale and recycled. And while there were promising actresses and actors cast in various roles there wasn't anywhere near enough depth or coherent story in this movie for them to do much more than recite their trite (often outright stupid) dialogue while looking dirty and sad in literally every scene.You can by all means enjoy the great visuals in this flick... but it's not good science fiction. It's just old Hollywood trash with extra glitter.",
    "30": "The only 2 slightly unbelievable elements were:\n1 - the speed of which the insurgents were recruited. That was unbelievably accelerated despite the later claim t hat they'd join for a sack of grain; and\n2 - the northern irish accents; my goodness they were a horrific mix of north and south and why do we (I'm N irish) have to be the bad guys. We're lovely.Outside of that, it was just fast moving, filled with outrageous special effects and characters. There's a lot of grey out there too; clearly Gunnar and maybe even Kai are going into a redemption arc after some extremely questionable decisions, and our main heroine is unashamedly looking for redemption, though that's more for letting people she loved down (issa and her boyfriend).I'm incredibly pumped for part two of this, but it's just a shame that won't be for several months. Netflix is such a tease.",
    "31": "I was really looking forward to this movie but almost immediately into the film disappointment set right in.Dialogue and the acting has zero emotion behind it. Exception to that is the immediately obvious villains who are so overly nasty as to strain credibility.The film is somewhere between a bad Star Wars script and a heist flick where the \"genius\" crew is magically assembled from far and wide!While the ships/craft look well done, the backdrop of a massive and impossibly close planet that appears spray painted in its lack of detail wrecks that.It felt as if the story could have been a sweeping one but was whittled down to just enough to fit an allotted time. Rushed and somewhat ridiculous.I'll watch the second part but only if there's nothing else on.",
    "32": "If you're here to watch an original, new franchise set in space then don't bother watching. The vast majority of this movie's world-building is almost one-to-one plagiarism of Dune. From the way the empire is structured to the very leadership of it, almost everything world-building related is stolen. In a best case scenario you can say Zack Snyder plagiarised Dune and mixed it in with some minor elements from Warhammer 40K's empire but all in all, this is one of the most egregious cases of blatant writing theft I think I've ever seen Hollywood commit. Please don't waste two hours of your time on this movie, just watch Dune.",
    "33": "Typical Snyder: endless slow motion, uselessly overcomplicated scenario, poor hero psychology and caricatural archs.Presenting it as a potential Star Wars heir couldn't be farther from the results. It's closer to the bad movies from the Riddick trilogy, except that Riddick didn't take it too seriously. I don't know what else to add as it's so poor. Oh yes, another dispensable Netflix movie, adding to a long list and proving that Netflix doesn't know how to do a good movie.Watch back a Star Wars instead. The story is simple but powerful, the actors show feelings, the style doesn't age. Start again Snyder. Or don't.",
    "34": "Rebel Moon pt. 1 is built on the backs of the juggernaut sci-fi franchises that inspired it. There isn't a single original ideal in the entire film. Zack Snyder, although I'm sure he means well, cherry picks designs, plot points and characters from nearly every sci-fi franchise to ever exist. Its an amalgamation of STAR WARS, Star Trek, Farscape, District 9, Alien, Dune, Firefly/Serenity, and The 5th Element all shoe horned into one movie. There's tons of character development missing as the team assembles throughout the film, although I assume this is included in an extended cut, because of course there is another cut adding 30 minutes of additional footage. Maybe that cut will throw out an original idea.If you're a fan of Zack Snyder's other works you'll undoubtedly like this one. However until the rest if the story is told this film is nothing short of derivative garbage.",
    "35": "Rebel Moon - Part One: A Child of Fire\" directed by Zack Snyder is a visual and narrative triumph, setting a new standard for fantasy films. The meticulously crafted universe, stunning visuals, and compelling characters immerse audiences in a world on the brink of chaos. The film's pacing, blending action and character development, keeps viewers on the edge, while the ensemble cast delivers stellar performances. \"Rebel Moon\" transcends the fantasy genre, exploring profound themes with a thought-provoking and emotionally resonant touch. In just 100 minutes, Zack Snyder crafts a cinematic gem that leaves audiences eagerly anticipating the next chapter in this epic saga.",
    "36": "Aspires to be Star Wars, but falls flat from the very beginning. Visually brilliant, but as usual terrible screenplay as expected from Snyder.Snyder got more than sufficient resources an able director would desire to create cinema, but he shows once again that he is not worth it.I wished the studio or the Netflix would have spent the resources with an able director. They should be wise not to spend any more resources for a sequel/sequels.I'm waiting for his toxic fans to defend this disaster as a masterpiece.I hope he doesn't return with an argument of watching a director's cut to see what he wanted to show.",
    "37": "It's difficult to say anything good about this nonsense, except that the actors are top notch and the CGI is good enough for streaming. I felt sorry for the actors having to give voice to the script which vacillates from comic speech bubbles to giant chunks of exposition. There's little emotional connection between characters which is the tell of AI writing. Whether it is or not, it's just disjointed guff. Part one had in it's core a story-line pinched from Seven Samurai, which was re-used in the Magnificent Seven. Both those films were excellent. Rebel Moon takes the story into space where it dies. As it jumps from warrior to warrior to save the simple farmers there's enormous gaps on logic. The decision to go from one to another is random and has a element of aimlessness - decisions are not made based on reason, just \"oh, that's a good idea.\" There's no suspense, no tension, no investment in characters or their quest, no coherent history of the universe where this occurs; there's nothing but noise.",
    "38": "I read some of the negative reviews before I watched this so I watched this with somewhat lowered expectations but I thought this was a great science fiction action film.The plot is basically that of \"The Magnificent Seven\" or \"Seven Samurai\" in space so it is fairly predictable but there is a reason that plot line has been re-used so many times.The visuals are very cool and the action is great. I am not sure what other reviewers were looking for, I was expecting a good science fiction action film and that is what I got.I watched this the night after I had watched \"The Creator\" and I was disappointed in that film which I thought was a bit of a mess but I was not disappointed in \"Rebel Moon\".",
    "39": "Zack has provided here all the parts of a movie, especially one in the format of Seven Samurai. Each individual scene is laid out, often filled with talent and set design. Where we get into problems is that we have no mortar between each of these blocks. A Star Wars cantina scene here, a Wild West horse breaking scene there... but they don't link to each other beyond our heroine being in both.Perhaps more damning is each block is shot in such a way that suggests Zack didn't really get why the original was so good. The Star Wars cantina scene, for example, as each odd or unusual character given a 2/3rd mid scene framed shot of it, rather than just being allowed to be something weird in the background. We weren't limited to only characters that would be important to the scene either, but rather a sort of showcase of 'isn't this imaginative?' Which defeated the purpose of how unusual these things are. Especially as the variety of life shown in one bar on one planet outstrips all the variation in the rest of the movie.Every character has been pulled from a different movie, they don't really have reasons to work with each other beyond revenge against X part of Y.. so why not fight Y.You can taste the different movies when their scene is up. Our villain is inspired by Dune and has a scene stolen from that cutting room floor. The technology is wildly varied between locations, which doesn't practical for industrialized mass produced items inside a galactic struggle, but would be totally at home in a lot of tabletop RPGs.Which is I think the source of much of my frustration with this movie. If it was a tabletop game the players would have done so much better to have a session zero where they talked about character history and wove themselves a shared motivation. The storm trooper aim is a staple of science fiction, the laser swords are better then a gun ditto... but the mashup of different elements of different movies feels like a player group and not the work of a single narrative. Disjointed and as it knows it's a part one so much gets left unresolved.All over 10,000 bushels of food. Roughly ten semitruck trailers worth. Most of a whole agricultural moons worth according to this tale.",
    "40": "Where to begin? This movie was straight up bad. Filled with illogical conveniences at every turn. There was always someone willing to join their merry band of strangers without questioning the authenticity of their group. Assembling their crew was just too easy. Everything was predictable. It was obvious Kai would betray them, obvious Gunnar would save her, and, where did that rope come from when she was about to fall off during her fight with the bad guy. Child of fire? More like child of unexplainable luck. The dialogue either lacked subtext or was just unnecessary. And that girl who knew the robot could talk yet didn't know he was a soldier, meanwhile being a soldier was his primary function. How convenient so he could later show up and save her. I would recommend this show to people who don't care about plot and are only after cool action scenes. Speaking of which, what was up with the needless slow motion cuts in literally every scene? This movie had more slow motion cuts than your average Indian show. Terrible movie, but what more did we expect from Zack Snyder?",
    "41": "Rebel moon part one is really solid & enough for me to continue the journey most critics or bad reviews are comparing this to legendary star wars whilebit might look similar or under the same genera but it differently made and remember it's a huge world building and most of the characters need more times which is coming in Zack Snyder cut and part two the story given to us is a bit of each and every other characters making Kora the centre of it .Visually it's a piece of arts every Frame is breathtaking the chemistry between the cast and changing lines of dialogue is good a very solid 8/10 looking forward for part two.",
    "42": "Sorry not sorry, but I think Netflix only green-lit this movie because of the Snyder fanboys. My best guess is that Snyder wrote the script when he was still a teenage Star Wars fan and never revised it, because it is extremely amateur. The plot goes like this: village is threatened by the soldiers of the evil empire, village wants to fight back so the hero sets out to find people to help their fight. The evil empire has an army, huge spaceships and guns and the village has nothing, the heroes have no special plan, there is no Death Star to be destroyed. The villagers have less of a chance to survive than the people of Alderaan had. It doesn't make sense, it's not samurais against bandits, it's a handful of samurais against a whole organised army with plenty of resources. Over all it's a mess of a movie, with exposition heavy dialogues and glaring problems regarding of the plot.",
    "43": "What happening to story telling as a skill. This is terrible, I literally don't care for not even one of characters. The only who I can sympatyze with the most is Noble, the evil dude. He has much more layers and is presented more in detail than any other character. I feel this is the problem with 90% of the movies today. People think that SGI and action can compromise the lack of story, characters and love for the film, but they really can't and that's why we are seeing more and more of these terrible movies. I wasn't moved by one scene in a movie, the main character isn't presented as it should, the other are there obviously just to be there and the worst thing is the literally have no impact in the movie.... I don't know, it just very bad, shame on you Zack.",
    "44": "This film had me yawning about twenty minutes. I laughed at the many cliches, the ridiculous technology on display ( a gun that needs a hammer action, really?) the use of many South African extras with that awful nasal twang of an accent and a soundtrack lifted straight from some game with no leitmotif...nothing resembling the great Williams soundtracks. Boring, pretentious nonsense.The CGI was acceptable but not great. The acting was wooden. The script is just laughable. I felt no connection with this film...none. It did not blow me away the way Star Wars did back at the beginning of 1978. Even Star Wars and its light script is light years better than this stuff. You want to watch this...fine. If you are a young person grown up in the digital gaming age I suppose you will like it. People looking for more substantial science fiction might need to look elsewhere. Sorry.",
    "45": "It's an extraordinary warp-speed journey; Snyder's visuals are mind-blowing, jaw-dropping - a cosmic spectacle 💯. Narratively, it ties mythology, sci-fi, and human resilience. All the cast members owned their space, @Junkie_XL is a sonic boom of excellence; his music elevates every emotion and has a lot of banger soundtracks. Fight choreography is one of the best of the year. RebelMoon lore is pure and crazy. Director's cut and part 2 are going to be even crazier ✅\nRebelMoon\" isn't just a movie; it's a cinematic revolution! Snyder's dedication, a stellar cast, and a universe that defies limits make this a masterpiece that demands celebration.",
    "46": "The story is just plain bad. It's lifeless and doesn't bring any impact or meaning. I knew the second someone said it was the new Star Wars it would be bad. I hate to say it but Star Wars is liked because it was different than anything before. This has literally no connection or anything that could be resembling Star Wars other than energy guns and different planets. The action scenes as others have mentioned are all in slow mo which is cool for some but when you're trying to get across that the battle is crazy you need it to be fast paced with stuff blowing up everywhere causing disorientation so you get the intensity of the battle. Having a few slo mo scenes of the battle can get this across too, however every action scene is in slow mo. Like literally all except 2. I genuinely am so disappointed with how horrible this movie is. It had a ton of potential and couldn't decide what it wanted to do so it tried everything and came up with nothing. I would skip this 2 hour piece of junk.",
    "47": "Rebel Moon is a good start for a franchise\nIt is not the best Snyder movie but definitely not also the worst I enjoyed it a lot.A better version than the recent Star Wars Movies and series.It is also a good start for the franchise.Im sure this movie will be streamed a lot.I recommend this movie.But I gonna be sure will be better.The critics on Rotten Tomatoes are wrong 25 procent is to low the audience score is more right 72 procent is more right.Zack Snyder haters gonna hate this movie definitely.Zack Snyder fans gonna love this movie a lot for sure.It's a shame that Netflix did not release this movie world wide In cinemas.",
    "48": "Some have already stated \"Great special effects\"! This is true. That is the end of the positive. There is zero character development and a very thin plot line. I tried to find some empathy for any of the characters and the only one who made the cut (not by much) was the spider lady. The villain never really lived up to his potential and there were unexplained scenes concerning suction marks on his body and the creature who was either feeding him, having sex with him, or feeding off of him. The writing had to have been done during the strike because the dialog was super cheesy. As I'm writing this, I'm even questioning why I gave it four stars. It was a waste of two hours of my life.",
    "49": "There is very little to like but there where some positives. Solid world building, beautiful visuals among them. Although way too much slo mo. The Empire & it's hierarchy was very interesting but we didn't see much of it which was a shame. Instead we got the main character going around catching characters like pokemon. Each character gets a short showy little intro when they are introduced & that's about it. We don't hear much from any of those characters again except action scenes with them. Very little else in terms of story depth. It's all shiny surface level stuff. Hard to get invested in the story or care for the characters with such a shallow weak story.",
    "50": "I'm gonna give my completely honest and unbiased review of this film. Now before I start I normally dislike Zack Snyder films however this film was freaking great. I had some issues in terms of the pacing but it was an absolute blast and I really hope it does well on Netflix and the second film is good because it was super fun. The film is a gorgeous visual masterpiece and it has some amazing performances from lots of the cast and it's nice to finally see Ray Fisher in another film and he does an awesome job here. Kora gives an absolutely breathtaking performance and I thought she was great I do wish there were things in the the film that were different but I can't say it without giving spoilers. All I can say tho is if u are looking for a super fun and gory sci-fi universe with Black-jack and hookers this is right up ur alley!!",
    "51": "Aspires to be Star Wars, but falls flat from the very beginning. Visually brilliant, but as usual terrible screenplay as expected from Snyder.Snyder got more than sufficient resources an able director would desire to create cinema, but he shows once again that he is not worth it.I wished the studio or the Netflix would have spent the resources with an able director. They should be wise not to spend any more resources for a sequel/sequels.I'm waiting for his toxic fans to defend this disaster as a masterpiece.I hope he doesn't return with an argument of watching a director's cut to see what he wanted to show.",
    "52": "It's difficult to say anything good about this nonsense, except that the actors are top notch and the CGI is good enough for streaming. I felt sorry for the actors having to give voice to the script which vacillates from comic speech bubbles to giant chunks of exposition. There's little emotional connection between characters which is the tell of AI writing. Whether it is or not, it's just disjointed guff. Part one had in it's core a story-line pinched from Seven Samurai, which was re-used in the Magnificent Seven. Both those films were excellent. Rebel Moon takes the story into space where it dies. As it jumps from warrior to warrior to save the simple farmers there's enormous gaps on logic. The decision to go from one to another is random and has a element of aimlessness - decisions are not made based on reason, just \"oh, that's a good idea.\" There's no suspense, no tension, no investment in characters or their quest, no coherent history of the universe where this occurs; there's nothing but noise.",
    "53": "I read some of the negative reviews before I watched this so I watched this with somewhat lowered expectations but I thought this was a great science fiction action film.The plot is basically that of \"The Magnificent Seven\" or \"Seven Samurai\" in space so it is fairly predictable but there is a reason that plot line has been re-used so many times.The visuals are very cool and the action is great. I am not sure what other reviewers were looking for, I was expecting a good science fiction action film and that is what I got.I watched this the night after I had watched \"The Creator\" and I was disappointed in that film which I thought was a bit of a mess but I was not disappointed in \"Rebel Moon\".",
    "54": "Zack has provided here all the parts of a movie, especially one in the format of Seven Samurai. Each individual scene is laid out, often filled with talent and set design. Where we get into problems is that we have no mortar between each of these blocks. A Star Wars cantina scene here, a Wild West horse breaking scene there... but they don't link to each other beyond our heroine being in both.Perhaps more damning is each block is shot in such a way that suggests Zack didn't really get why the original was so good. The Star Wars cantina scene, for example, as each odd or unusual character given a 2/3rd mid scene framed shot of it, rather than just being allowed to be something weird in the background. We weren't limited to only characters that would be important to the scene either, but rather a sort of showcase of 'isn't this imaginative?' Which defeated the purpose of how unusual these things are. Especially as the variety of life shown in one bar on one planet outstrips all the variation in the rest of the movie.Every character has been pulled from a different movie, they don't really have reasons to work with each other beyond revenge against X part of Y.. so why not fight Y.You can taste the different movies when their scene is up. Our villain is inspired by Dune and has a scene stolen from that cutting room floor. The technology is wildly varied between locations, which doesn't practical for industrialized mass produced items inside a galactic struggle, but would be totally at home in a lot of tabletop RPGs.Which is I think the source of much of my frustration with this movie. If it was a tabletop game the players would have done so much better to have a session zero where they talked about character history and wove themselves a shared motivation. The storm trooper aim is a staple of science fiction, the laser swords are better then a gun ditto... but the mashup of different elements of different movies feels like a player group and not the work of a single narrative. Disjointed and as it knows it's a part one so much gets left unresolved.All over 10,000 bushels of food. Roughly ten semitruck trailers worth. Most of a whole agricultural moons worth according to this tale.",
    "55": "Where to begin? This movie was straight up bad. Filled with illogical conveniences at every turn. There was always someone willing to join their merry band of strangers without questioning the authenticity of their group. Assembling their crew was just too easy. Everything was predictable. It was obvious Kai would betray them, obvious Gunnar would save her, and, where did that rope come from when she was about to fall off during her fight with the bad guy. Child of fire? More like child of unexplainable luck. The dialogue either lacked subtext or was just unnecessary. And that girl who knew the robot could talk yet didn't know he was a soldier, meanwhile being a soldier was his primary function. How convenient so he could later show up and save her. I would recommend this show to people who don't care about plot and are only after cool action scenes. Speaking of which, what was up with the needless slow motion cuts in literally every scene? This movie had more slow motion cuts than your average Indian show. Terrible movie, but what more did we expect from Zack Snyder?",
    "56": "Rebel moon part one is really solid & enough for me to continue the journey most critics or bad reviews are comparing this to legendary star wars whilebit might look similar or under the same genera but it differently made and remember it's a huge world building and most of the characters need more times which is coming in Zack Snyder cut and part two the story given to us is a bit of each and every other characters making Kora the centre of it .Visually it's a piece of arts every Frame is breathtaking the chemistry between the cast and changing lines of dialogue is good a very solid 8/10 looking forward for part two.",
    "57": "Sorry not sorry, but I think Netflix only green-lit this movie because of the Snyder fanboys. My best guess is that Snyder wrote the script when he was still a teenage Star Wars fan and never revised it, because it is extremely amateur. The plot goes like this: village is threatened by the soldiers of the evil empire, village wants to fight back so the hero sets out to find people to help their fight. The evil empire has an army, huge spaceships and guns and the village has nothing, the heroes have no special plan, there is no Death Star to be destroyed. The villagers have less of a chance to survive than the people of Alderaan had. It doesn't make sense, it's not samurais against bandits, it's a handful of samurais against a whole organised army with plenty of resources. Over all it's a mess of a movie, with exposition heavy dialogues and glaring problems regarding of the plot.",
    "58": "What happening to story telling as a skill. This is terrible, I literally don't care for not even one of characters. The only who I can sympatyze with the most is Noble, the evil dude. He has much more layers and is presented more in detail than any other character. I feel this is the problem with 90% of the movies today. People think that SGI and action can compromise the lack of story, characters and love for the film, but they really can't and that's why we are seeing more and more of these terrible movies. I wasn't moved by one scene in a movie, the main character isn't presented as it should, the other are there obviously just to be there and the worst thing is the literally have no impact in the movie.... I don't know, it just very bad, shame on you Zack.",
    "59": "This film had me yawning about twenty minutes. I laughed at the many cliches, the ridiculous technology on display ( a gun that needs a hammer action, really?) the use of many South African extras with that awful nasal twang of an accent and a soundtrack lifted straight from some game with no leitmotif...nothing resembling the great Williams soundtracks. Boring, pretentious nonsense.The CGI was acceptable but not great. The acting was wooden. The script is just laughable. I felt no connection with this film...none. It did not blow me away the way Star Wars did back at the beginning of 1978. Even Star Wars and its light script is light years better than this stuff. You want to watch this...fine. If you are a young person grown up in the digital gaming age I suppose you will like it. People looking for more substantial science fiction might need to look elsewhere. Sorry.",
    "60": "It's an extraordinary warp-speed journey; Snyder's visuals are mind-blowing, jaw-dropping - a cosmic spectacle 💯. Narratively, it ties mythology, sci-fi, and human resilience. All the cast members owned their space, @Junkie_XL is a sonic boom of excellence; his music elevates every emotion and has a lot of banger soundtracks. Fight choreography is one of the best of the year. RebelMoon lore is pure and crazy. Director's cut and part 2 are going to be even crazier ✅\nRebelMoon\" isn't just a movie; it's a cinematic revolution! Snyder's dedication, a stellar cast, and a universe that defies limits make this a masterpiece that demands celebration.",
    "61": "The story is just plain bad. It's lifeless and doesn't bring any impact or meaning. I knew the second someone said it was the new Star Wars it would be bad. I hate to say it but Star Wars is liked because it was different than anything before. This has literally no connection or anything that could be resembling Star Wars other than energy guns and different planets. The action scenes as others have mentioned are all in slow mo which is cool for some but when you're trying to get across that the battle is crazy you need it to be fast paced with stuff blowing up everywhere causing disorientation so you get the intensity of the battle. Having a few slo mo scenes of the battle can get this across too, however every action scene is in slow mo. Like literally all except 2. I genuinely am so disappointed with how horrible this movie is. It had a ton of potential and couldn't decide what it wanted to do so it tried everything and came up with nothing. I would skip this 2 hour piece of junk.",
    "62": "Rebel Moon is a good start for a franchise\nIt is not the best Snyder movie but definitely not also the worst I enjoyed it a lot.A better version than the recent Star Wars Movies and series.It is also a good start for the franchise.Im sure this movie will be streamed a lot.I recommend this movie.But I gonna be sure will be better.The critics on Rotten Tomatoes are wrong 25 procent is to low the audience score is more right 72 procent is more right.Zack Snyder haters gonna hate this movie definitely.Zack Snyder fans gonna love this movie a lot for sure.It's a shame that Netflix did not release this movie world wide In cinemas.",
    "63": "Some have already stated \"Great special effects\"! This is true. That is the end of the positive. There is zero character development and a very thin plot line. I tried to find some empathy for any of the characters and the only one who made the cut (not by much) was the spider lady. The villain never really lived up to his potential and there were unexplained scenes concerning suction marks on his body and the creature who was either feeding him, having sex with him, or feeding off of him. The writing had to have been done during the strike because the dialog was super cheesy. As I'm writing this, I'm even questioning why I gave it four stars. It was a waste of two hours of my life.",
    "64": "There is very little to like but there where some positives. Solid world building, beautiful visuals among them. Although way too much slo mo. The Empire & it's hierarchy was very interesting but we didn't see much of it which was a shame. Instead we got the main character going around catching characters like pokemon. Each character gets a short showy little intro when they are introduced & that's about it. We don't hear much from any of those characters again except action scenes with them. Very little else in terms of story depth. It's all shiny surface level stuff. Hard to get invested in the story or care for the characters with such a shallow weak story.",
    "65": "I'm gonna give my completely honest and unbiased review of this film. Now before I start I normally dislike Zack Snyder films however this film was freaking great. I had some issues in terms of the pacing but it was an absolute blast and I really hope it does well on Netflix and the second film is good because it was super fun. The film is a gorgeous visual masterpiece and it has some amazing performances from lots of the cast and it's nice to finally see Ray Fisher in another film and he does an awesome job here. Kora gives an absolutely breathtaking performance and I thought she was great I do wish there were things in the the film that were different but I can't say it without giving spoilers. All I can say tho is if u are looking for a super fun and gory sci-fi universe with Black-jack and hookers this is right up ur alley!!",
    "66": "\"Wow, just wow. Rebel Moon blew me away! From the stunning visuals to the complex character development, this sci-fi epic had me hooked from start to finish. I was so invested in the story and the characters that I didn't even think to pick up my phone.Zack Snyder's latest masterpiece is a feast for the senses - the fight scenes are intense, the world-building is immersive, and the character development is rich and nuanced. The story kept me on the edge of my seat the entire time, and I can't wait to watch it again to catch any details I may have missed the first time around.If you're looking for a sci-fi movie that will keep you engaged, entertained, and on the edge of your seat, Rebel Moon is a must-see!",
    "67": "Well, I had great hopes for this, all the hype and everything behind it so far, pretty predictable, pretty lame old trope that's been dragged out time and time again. I'm a third way through so far and I will probably persist but does certainly have to improve a real lot for me to be interested in watching part two. They real need to pick up the game. Here is one of the other reviewers says good candy, but an empty shell. I often wonder why things like this get all the money spent on them, and great shows like raised by wolves or even colony just get killed off, and they are so much better than this tripe.",
    "68": "I've anticipated this awhile I enjoy most Zack Snyder films especially Dawn of the Dead remake, Watchmen, Sucker Punch and even Man of Steel is quite enjoyable but this has a lot of slowness for an epic action movie it feels lacking and gets fairly better overtime. The action is the best aspect by far, the sci-if/futurist vibe is great, has some top notch bits mashed in well, and the cast is excellent I don't understand why Sofia Boutella is on the bottom credit members that should be fixed she's a lead! I like how it's got a Star Wars spinoff vibe to it mixed with other several types which is intriguing, this is great at times I imagine Part Two will be better.",
    "69": "Let's get straight into it - this film is terrible. It's 7 Samurai meets FireFly but nowhere near as good as either. It's a very slow start, 100% exposition, then when we get to the first action scene, it's done in slow-mo...and so is every other action scene. Credit to the designers and effects team, and a gallant cast trying their hardest to make wooden dialogue and cliched characters come to life, but it's all just a slow-mo snore fest. It even has the obligatory terrible movie scene of a character jumping off a cliff and landing on a flying critter. Makes the SW prequels look like Citizen Kane.",
    "70": "Every overused sci-fi gimmick is overused in this film. Slow motion fight scenes for every fight scene. Faceless \"guardsmen\" that have no purpose. Robots with moral compasses. Cybernetics with no good reason to have them except tgey let us know that it the future.The characters are not likeable and I found myself wondering why I should care about them. They do alot of posing and that gives them advantages in a fight. There are some good actors in the cast that have nothing to work with in this movie.The plot is stale. I have seen it done before and so much better.The visuals and sound are great and the reason I gave it 3 stars.",
    "71": "The 7 Samurai is considered as best influence movie of all times, now director Zack Snyder have turn it into a space epic. That is something hard to pull off, well here re my two cents first i felt that the story was rushed to much, that didn't gave us more backstory to some of the characters, second that the lead actress Sofia Boutella playing Kora was kind slow n pretty random for her backstory as for rest of the cast well I thing feel a challenge of non of them. I mean ye got Djimon Hounsou playing a beat up general in coliseum without seen him in action, if they would give him some action then ye 've interest, but the only one that did was Starz Nair that play the slave Tarak. Now what did like is something that Snyder is well known those are he's visual from the mining planet to the last action sequence, the shooting battle was amazing by far, some of the fight's weren't good cause there's lots slow mo that the director is well know, but I will give him credit for the spider showdown that Bae Doona that play Nemesis was neat.They really wanna turn it to franchise but is so hard went you're focus to the action n lees on the plot. So I will ended that film is gonna be #1 on Netflix most watch, but he needs put some effort for the 2nd part.",
    "72": "I was really looking forward to this film. I ignored my fears that releasing straight to Netflix meant it would be bad and held out hope. If this was a low budget sci fi or a tongue in cheek space opera it might be forgiven but sadly this was a serious attempt to make a major sci epic. For a director like Snyder to release a film so badly produced and directed is inexcusable. It lacks soul, finesse or story line. The acting is sub par, the action is clunky, the fight scenes are poorly choreographed and telegraphed and the special effects aren't good enough to make up for Many scenes seem to be lifted directly from other films and the whole film is riddled with cliches and over used tropes.This was originally conceived as a 2 part Star Wars film and I'm so so glad it was turned down.",
    "73": "I really enjoyed this film. You can definitely feel the influence of seven samurai, and I'm here for it. The first outing is a bit bogged down by character introduction, etc. But I'm kind of OK with it. I think it could potentially build into an extremely good series of movies. I do find the world quite interesting. I really want to learn more about the characters, especially the main defense team. It honestly feels like an anime. I think there's a ton of potential here, and I hope that it sees some growth.Snyders overreliance on slow motion and lens flare is absolutely here. As a stunt fighter myself, sometimes action looks better in real speed. I think that this movie would actually benefit from that. Some of the dialogue is a bit rocky.I'm gonna say it again, I really hope this gets some sequels, to iron out some of the weaker points.",
    "74": "What's wrong with Snyder ? Such a useless movie .can't even finish..tried a lot .After 1 hour 20 minutes felt exhausted. No good action scenes no character Development..absolute disaster..\nSnyder is always weak when it comes to story telling and character Development bit this is his worst ..unwatchable.Not sure what Netflix had in mind when they took a premise like this .Such a waste of time ..\nHeard there is a snydercut for this ? This guy don't know at all how to make a proper movie on first than stating a cut of directorial talents? Come on ..this is ridiculous..too bland too bad\nWorst movie.",
    "75": "As a trans woman this really spoke to me and I aplaaud Zach Snyder for making such amazing inclusive material. Sure there are the usual tropes and cliches but this one really hits the mark. Offering gender affirming care at my practice gives me access to a number of the important issues and many are addressed by mr Snyder via his film. Hopefully the second one will expand on these inclusive issues wjth story telling just as good. All around this is some of the best content Netflix has put out in a long time. Hopefully this trend in quality will continue for the foreseeable future and the next generation.",
    "76": "I'm leaving this review as the movie is running in front of me... The fact im leaving it during the movie says a lot.At the time of review exactly im at the 90min mark and another 45 mins to go.Uninspiring dialogue, weak action scenes, sterotypical characters you've seen a million times before. And tbh, pretty bad actingThere's nothing redeeming about any of them. If they were suddenly killed off you wouldn't realy bat an eyelid.Bad cgi, bad greenscreen effects/scenes throughoutThere is a scene with a 'spider lady' we'll call her and it could have been cool... but really bad CGI made her face and hands look terrible. Its the type of cgi i'd have expected very early on in its inception.I think Synder got a discount on slow mo shots.. buy one get 25 free. If there's a hint of action you can bet there's going to be a slow mo scene.I think the only reason this is getting any attention is because Synders name is attached.This is movie is 2hrs 15mins... it doesn't pass quickly.I did wait until the end to finish this off just for fairness... I wish I hadn't..I see zero reason why a part 2 is needed for this uninspiring snorefest.",
    "77": "What in the world did I just watch. Basically a very flat story with a montage of scenes that kind of belong to a story but that story in itself isn't gripping or deep enough for you to even care. Main characters are not in any way likeable, I don't care. Oh sorry, there is one character I did care about... the robot. Yes. The story should have been this -> the robot helps the main character and in doing so becomes a fighter again but to protect the girl who gave him the flowers. Other soldiers arrive and the main character and the robot have to escape. Thus their adventure begins, maybe they bump into another character in a bar fight who then leads them to another and so on. Where is the god damn robot???? Why give him such emotional opening if you just take him away. He is the only character with soul. The girl who gave him flowers could have been killed and he wants vengeance and so on. Ok this films looks very nice. The Creator looked awesome with lesser budget and the story was much better. This movie is very disappointing.",
    "78": "What on earth did I just watch! Can't believe Snyder can make something like this.. seriously people from Hollywood are becoming biggest thieves stealing graphic creatures from other hit movies ..this has hippogriff,spider from Alinta battle angel etc how unoriginal is it, plagiarism too..can't believe there's a second part..if one has so much money to waste atleast they can donate it to worthy causes instead of creating this monstrosity.actors are equally crappy.sad to use great actors like Hunnam, Hopkins and Hounsou in this mess.. seriously going to start watching Italian, Spanish esp Korean movies where story is original and actors are really good talented actors..waste of money and time.",
    "79": "I was lucky to see this film at a crew showing, and let me tell you - do NOT listen to the critics take. This movie has a big budget and it shows. The set, actors, the costumes, the fight sequences- all awesome. The story may feel familiar, as we are living in an age where we ourselves can feel as if we're being crushed by a dystopian overlord. Stranger Things gave nods to everything 80s and no one said boo. Zack Snyder gives nods to space throw backs and it's scoffed?! I encourage watch the movie, enjoy it, and then write a good review. Let's damn these critics - they're not our overlords. We are the ones who decide what's a good movie, and what is tired. I promise you, Rebel Moon is a fantastic ride. It's entertainment, and that's what we're here for, right?",
    "80": "With atrocious editing, nauseating visual effects, questionable dialogue, nothing characters and surprisingly boring action sequences, Rebel Moon is yet another awful edition to Netflix's catalog of mostly terrible originals. Lacking any charm, wonder and imagination it's trying to convey and borrowing so much from vastly superior films like Star Wars and Seven Samurai to the point where it's borderline plagiarism. Yes, I am aware that Seven Samurai was a big influence for Star Wars along with other Kurosawa films but Star Wars did a lot stand out from the crowd and it worked. With Rebel Moon, it's just knocking it off.Written and directed by Zack Snyder, Rebel Moon follows a woman named Kora who is living on a planet that comes under siege by an intergalactic empire and must rally soldiers to her aid to help defend her home and her people. At least that's what I think the plot was since I just finished the movie like 30 minutes ago and I barely remember any of the characters names.This is probably one of the ugliest movies I've seen in some time. Everything from the CGI to the cinematography to the lighting, it all looks like total garbage. There's a scene where it's outside with some soldier characters and they're shooting at this robot and it looks like a fan film you'd find a YouTube made by some college students with a shoestring budget. Not from a 160 million dollar movie. The editing is distractingly bad. There are so many odd cuts that makes it very clear that they had more footage shot but likely cut stuff to keep a PG-13 rating.The characters are about as \"who cares\" as you can get. I can't remember any of their names besides the lead actresses character. There's nothing to any of them and the film doesn't seem to like them either as a lot of them just show up and tag along and that's it. The villain is the most generic villain you can possibly imagine. Introduction with a polite demeanor only to do a 180? Check. Kills someone after promising to let them go if they give information? Check. Evil monologues left and right? Checkarino.There's really nothing else worth mentioning. It's such a forgettable, boring, nothing movie and you gain nothing from watching it. It has nothing to offer and there is no reason for it to exist at all. There's apparently a directors cut of the film that exists and if it ever sees the light of day, I will do what I will with the sequel: I won't watch it.",
    "81": "How can a movie with a large number of action scenes be so boring?As mentioned in other reviews, the movie is so much a Star Wars copy that it is almost criminal....but that is not the real problem. The real problem is:1. The actors, even those who are good actors, are forced into some wooden language, wooden expressions and wooden dialogue. There really is no sense of urgency or expression or fear or anger on anyone's faces. This is the the actor's fault, this is direction and writing.2. Outside of the initial scenes, the rest of the movie looks like it was done on a computer and a green screen stage...at a local high school. The effects were bad. How can a movie from 46 years ago LITERALLY have better effects, better background, better laser scenes and everything else. This was really bad effects and CGI.3. Action? About that. The action is done is slow-motion, which takes the 'action' out of the scene.4. Plot devices. Everybody is exactly where they need to be when they have to. Somehow ships that are about a mile long can 'sneak up' a 100 ft behind people without them knowing. One scene our protagonist is dodging multiple laser shots and the next scene she is captured by a slow robot that I could outrun(and I am middle-aged with knee replacement). Oh, and they make everything dark and moody so you cannot see how bad the action is.Take a pass.....trust me.",
    "82": "I wanted this to be good so badly. Like really badly.Other than the world design and effects, there really isn't much else to salvage from it.In true Snyder style we've got lens flare and slow motion, but this time he's dialled it up over the top.Some of the action scenes are absolutely ruined from way too much diving in and out of slow motion.The biggest disappointment is the writing.The first 70% of the film is absolutely a waste of time and not needed.You don't find out most of the characters actual relevance until the back end of the film.Everything before that is a mixture of utterly pointless painfully boring scenes done for the sole purpose of filler.Looks great, but that's all.",
    "83": "Imagine you're a twelve year old boy, having watched some cool movies for the first time five minutes ago, having your bootleg toys of popular franchises and smashing them together in dirt saying \"and then\" every couple of minutes. Now imagine you get tens, if not hundreds of millions of dollars to make that a movie.Now imagine that being better than this.I thought Sucker Punch was bad. This is somehow worse.Below average acting, uninteresting characters, worldbuilding hastily slapped from who knows how many better franchises, including WH40K, Star Wars, World War II, Kurosawa, probably some anime and much more.Visually I would describe this as \"vulgar\", an ocular insult. And so much slo-mo, it's just silly. It just looks and feels bad, atmosphere is equal to a junkyard.Villains are so bad, heroes are no better. I get Netflix does what Netflix do, making bad expensive movies, that people watch. But this is insane.I want to make something very clear - it might look like a good movie, it is not. You shouldn't watch this and promote this. Ask better for your money.",
    "84": "As an other reviewer wrote, there are wooden language, wooden expressions and wooden dialogue.The first ting I noticed in the movie was the words the actors spoke seemed like they had been written by a teenager... so many pointless words.Then there where the actors speaking the words, they just seemed wierd and emotionless.Then there are the action scenes. There are a lot of them, and they could have been really good. But the editing are just a bunch of normal speed, slow speed clipping to make it look good, and the bad guys just stand still doing nothing while the \"hero\" spends minutes moving around in the open...CGI/Greenscreen galore.. but very well done. So this is perhaps the strongest part of the movie.Waisted and nonsense slowmo sections... there are so many of them... and they are so pointless and gives nothing to the movie. There are movies and directors that know how to use slow motion sequences in a movie, and then there are this movie and director, that did not take that class... it's just a waist of time.In summary, if you are able to ignore all the writing, dialogue, acting/directing issues... its a passable scifi action movie.The movie could have been so much better, because there is a decent enough story underneath.. and they obviously had enough money to do what they wanted...I'm assuming Netflix payed for this. So I'm guessing that there where a big payday for writer/director and no requirements for quality on the delivered product. So they just cut from the budget anyone that could have given the director feedback on the uality issues.",
    "85": "The Zack Snyder fanboy cult is legion. That's fine. Every crowd likes their own kind of music.Objectively this is what Snyder produces: gritty, dark, unhappy, overly serious, tedious stuff. Most of its average, with a few exceptions. But there's always cool stuff to look at. The usual Snyder-verse effects are on full display: long establishing shots, fight scenes using slo-mo and speed shifting, and massive objects being viewed by terrified onlookers. He's kind of a poor man's Villaneuve.The rabid followers can say what they want about \"The Snyder Cut\" Justice League, but the reality is there's no broad market for unrelentingly dismal sludge. Why isn't there a Judge Dredd movie coming out soon? Or another Punisher film? Dark and too serious isn't fun to spend money on. Especially when it's not all that new.I do have to laugh though, at all the media hacks that are pissing and moaning about how derivative this is. And it is. But it mostly feels that way because Snyder wrote a script for a stand alone Star Wars story and was told by Lucasfilm (or maybe it was Disney) \"thanks, but no thanks\".So he went to the streaming giant that loves to produce expensive projects so they can cancel them before they can develop any traction. This is that script brought to life. Or death, as Netflix may have it.It's not nice to hammer on creatives. But I for one am sick and tired of the waif-ish 90 pound girl warrior movies that have been all the rage lately. And while Boutella (Kora, the protagonist in Rebel Moon) was excellent as Jaylah in Star Trek Beyond, I'm over it. Other than Gunpowder Milkshake (which was hilarious) it's all a bunch of BS. I don't care if Maggie Q or Daisy Ridley (both decent actresses btw) are in it or not (they aren't in this, in case you're confused), it's stupid. It was bad enough when Arnold, Sly and Bruce were ignoring the laws of physics in their various franchises, but we're all a little more savvy now and wouldn't buy that stuff from them in today's market either. But maybe I'm wrong, because there are now 4 Expendables movies in existence. God save us from the people who are buying tickets to those.It's free to subscribers next week, so have at it. Can't wait to see those reviews pour in.",
    "86": "Just Got out of a Screening of Rebel Moon: A Child Of Fire. 👩‍🚀 🔥Quick Side Note - It is Surprisingly Never Boring (For Me anyway) even though the Script is way Underdeveloped.Let's Get the Positives out of the Way First -Characters - There's only 3 Good Characters in this Film so Far in my Opinion.🔫 1. Sofia Boutella as Kora - Her Performance and Screen Presence was Strong Enough to lead this Film. I liked her Backstory, it was Interesting. On top of that, She looks good for the Role, Gorgeous Fit Body and Beautiful Face 💕🤠2. Ed Skrein as Atticus Noble - I feel he Nailed his Role as a Menacing Admiral with no Remorse.👱3. Stella Grace Fitzgerald as Princess Issa - She's interesting, more so in what a Pivotal Role she Could Potentially Play in the Future of Motherworld.🎂 Themes - I liked a couple of the Themes in this film.💘1. The Theme of the Motherworld Losing the Spirit of Compassion.👱2. The Theme of Princess Issa being the One To Reignite that Lost Compassion and Drive the Motherworld into a New Hope. A New Future.🎨💐Visuals - Some of the Visuals were Eye Gazing. Tons of Gorgeous Shots. That Opening Shot was Beautiful. The Huge Scale Galactic Landscapes are Stunning to See at times. That Scene when they are Riding the Elevator downwards at the Lightsaber Womans Planet was a Breathtaking Shot. What a Stunning Shot. 😮⌛Slow Motion - Some of the Slow Motion Battles were a Treat to Watch. That First Slow Motion Battle when the Young Girl is Being Captured was Pretty Good. Sofia Boutellas movements and Manoeuvres and her hair swaying around as she attacks each guy in that Scene were Great to See.🎵 Neutral Note - The Score was Ok, it wasn't Bad.That's where the Positives Stop. 🚫Negatives -📜 1. The Script - Who is Checking and Greenlighting these Scripts? Are they Writing and Reading these Scripts Thoroughly? And When they are Writing these Scripts, are they Concentrating Whilst Reading and Writing these Scripts? There's not Enough Meaningful Dialogue between Characters and there's No Development of Almost Anything. Good Lord🙋2a. All these other Characters - Charlie Hunnam, Tarak (Still looks promising to be fair), The Farmer Guy, Djimon Hounsou, Lightsaber Woman, BloodAxe & Bloodaxes' Sister(both looked and sounded promising and then completely wasted), Robot Dude. 🤖🤦🏻 2b. All those characters I just listed were either completely Underwritten or Useless. They might as well of been 2D Cardboard Cutouts.🌆 3. Where's the World-Building? We visit too many damn Places when we could of Explored a Few of the Places(Especially that place that the Lightsaber Woman was from, Some Stunning Shots there) and got to know more about this particular world and what the view is from them about the Imperium Situation. The Story about the Royal Family of the Motherworld, I wanna see more of that, I wanna see the Scale of Imperiums influence Across the Galaxy. Do others See them as Great because of the Love they once conveyed? Or are Others mounting up attacks and Revolts against them just like Bloodaxe?🤷 Overall, Rebel Moon Part 1 was a Great Opportunity to Build, Build, Build, this Fantastic World and have some Very Good Characters and Storytelling, as I said, there are some Great themes here. Let's Hope that Rebel Moon Part 2 Strengthens and Hones these Elements and really Gets things Going.",
    "87": "Like a lot of blockbuster movies of recent times, it lacks any type of new story, any type of dialogue and any type of character development.I cannot fathom why are modern movies so soulless and soo boring. The story of the gang of renegades protecting the village has been done so many time before and better, this is just poor excuse to add some space ships to it.The way director is trying to develop his main character is by her remembering her life through the movie, it's a lazy way of trying to make me care for her, which I didn't, nor did I care for any one else in the movie.. Main villain is parody white evil man, completely incapable of anything but pointless cruelty as all of the other white characters. All white characters are either evil and incompetent or just incompetent.Main hero is minority women of course, who kicks ass even though she looks like the wind might blow her away and anyone good or capable is not white of course.The 'rebels' that look like minor highway robbers rather than a formidable foe to a wast empire.And as the famous saying goes 'pen is mightier than the sword' in this movie a stick is mightier than a massive ship described as world destroyer. I wish I was joking.Typical failed Hollywood movie.",
    "88": "Zack Synder is a filmmaker who is pretty controversial across others (especially on social media) as his works on DC comics have been spoken a lot around. I personally liked his work on \"Legend of the Guardians: The Owls of Ga'Hoole, 300 and Watchman\". But as a whole, I just didn't care or connect with many of his works. I won't say I hate his works cause I do believe he has some talents. Rebel Moon is a new project from Snyder but unfortunately, it really feels like a rejected version of Star Wars that feels derivative and extremely boring.The visual effects, productions and costumes are pretty good as the costumes and productions look colorful. Although there are some bad CGI effects. Snyder direction and the writing feels all over the place as if Snyder was implementing many different concepts and ideas but wasn't really sure how to put it together well and makes it messy. I do appreciate that Snyder is trying something different and following his vision but the narrative feels unspecial and messy that it didn't really grasp my attention. The performances are okay but it's a shame cause many of the cast members are actors I like but unfortunately their performances felt a bit underwhelming and were provided with poor dialogue and uninteresting character arches.For the action and thrills, it's messy. I did find some of the action moments to be interesting but the use of slow-motion and the convoluted style causes the action and thrills to fall apart. The editing, soundtrack, and the pacing is pretty off and the tone feels unbalanced.Clearly Snyder fans are going to enjoy this movie which is great for them but I personally didn't care for this movie.",
    "89": "Greetings from the other side.The visuals in this movie are just awesome, but it's lacking substance. First, I'm sick of the 100 pound women taking on a bunch of 240 pound men and winning. Nobody has ever bought this crap, and it takes you out of the movie. Try letting the women use her brain to out think these bad guys instead.It's hard to judge this movie on it's own because it's basically a women zipping around the galaxy putting together a team to fight the bad guys. We get to know each recruit a little bit as they are approached by the woman.So, this movie is watchable for the special effects, but not much else. It's basically an introduction of all the characters and a basic background of the woman's story. It doesn't offer much by itself. They should have made this a 3.5 or 4 hour movie and included part 2.Anyway, it's still watchable but by itself, it's not very memorable. Part 2 will determine if this movie is good or not.",
    "90": "Giving this an 8/10 ratingZack Snyder's latest film is Akria Kurosawa's 'Seven samurai' Done in space. Following 'Battle Beyond the Stars' and the anime series 'Samurai 7', the story is given the sci fi treatment. This was going to be a Star Wars film, but happened and what is happing at Lucasfilm, it did not work out, so now Netflix have it, in cinemas now, then on TV.Do try and catch it in the cinemas, as it was filmed for it and you will miss plenty if you don't. Sofia Boutella, takes the lead, and is good at it, getting into all sorts of trouble and looks. Djimon Hounsou, Charlie Hunnam, and the great cast mix it up well, floating along the weird and wonderful universe that the film is set in. A great deal of alien creatures, the locations of the different worlds, meeting all these good and bad people, mostly bad, with lots and lots of travelling. But is it any good, yes it is, I can't wait for part two and three.",
    "91": "Hi. My name is FeastMode and I'm a sci-fi junkie. After watching this movie, I'm ecstatic to have witnessed the creation of this beautiful sci-fi world. I'm immediately invested. I love it. I want more. Now.There are a few things you should expect from a Zack Snyder movie:1) Stunning visuals. This entire movie is sci-fi eye candy with high levels of imagination.2) Amazing music. Of course it's by Junkie XL. He has done many of Snyder's other movies.3) Lots of BEASTLY slow-motion shots. Some people complain about him overusing it. Not me. So many of those scenes give me goosebumps, especially with the music playing.I was dreading having to wait a year or longer for the next one. But it's scheduled for April 2024!!!I.Can't.Wait.(1 viewing, 12/21/2023)",
    "92": "My mom first sent me a message today after watching it. She said \"Rebel Moon (With 3 thumbs up).I just finished the movie 10 mins ago and I sent her back the following message.\"That was a damn good straight to Netflix movie\"So imagine my surprise when I come here to read the reviews and just see a bunch haters. I'm wondering if we watched the same movie.It feels like it's getting review bombed for some reason.The main bad dude was great. He's the best bad dude i've seen in a movie in a while. You never sense that he's acting.Over all I liked the movie a lot and hopefully they still create the second movie so we know how the story ends.",
    "93": "As a Zack Snyder fan I can straight out say this movie is above average. It's not Star Wars, but more Flash Gordon (1980) without the cheese in visual style.The plot is pretty simple following the template of Seven Samurai, but suffers from too much world building exposition. They say \"it's much better to show than tell\", but Rebel Moon counter acts that statement. Sometimes a single sentence will do. Look at Star Wars as an example. George Lucas didn't have the money to do tons of flashback sequences and used dialague, which was just as good or even better leaving it up to the audience's imagination. We didn't need a 10 minute sequence for Kora. That time could have been used to develop the other characters, who are sorely lacking in depth.I know that Snyder loves to use slow motion to highlight moments, but he went a bit overboard with some shots. It was used where it really wasn't needed in some stituations.Overall the movie is good, but it's very hard to digest in one viewing. It's like Underworld where it takes 2-3 times to absorb it all. If anything I'm looking forward to the longer R rated version.",
    "94": "Rebel Moon, the latest offering from director Zack Snyder, takes audiences on a visually stunning intergalactic journey that pays homage to classic influences such as Dune, Seven Samurai, iconic game Mass Effect. While undeniably captivating, the film does encounter a few narrative speed bumps, but its overall brilliance is a testament to Snyder's unique vision & style that may not be fully understood by all, leaving audiences with a taste of an epic space saga that promises even greater wonders in the next installment.The film masterfully blends elements from iconic sources, creating a narrative mosaic that feels simultaneously nostalgic & fresh. The echoes of Dune resonate in the grand scale & intricate world-building, providing a captivating backdrop for the unfolding story. Seven Samurai's influence brings a sense of camaraderie & heroism to the forefront, enriching the character dynamics with depth & emotion. Mass Effect's impact is felt in the futuristic & intergalactic elements, creating a universe that sparks the imagination with layers of complexity.Rebel Moon, however, is not without its flaws. Some portions of the story feel rushed, leaving audiences yearning for a more thorough exploration of certain plot points & character arcs. Despite these pacing issues, the film manages to redeem itself through moments of sheer cinematic brilliance. The visual spectacle, combined with intense action sequences, delivers on the promise of an epic space adventure.The criticism directed at Rebel Moon seems somewhat perplexing, especially given the film's ability to seamlessly incorporate influences into a cohesive narrative. Perhaps the detractors fail to fully grasp Zack Snyder's unique filmmaking approach. Snyder has a distinct style that blends visual prowess with thematic depth, it's possible that some critics are not attuned to the nuances of his storytelling.In conclusion, Rebel Moon stands as a testament to Zack Snyder's ability to craft visually striking & emotionally resonant films in his own inherent style. While the narrative pacing may stumble at times, the movie's overall impact is undeniably powerful. Those who appreciate Snyder's distinct cinematic language will find much to love in Rebel Moon, it serves as a reminder that sometimes, criticism may stem from a lack of understanding rather than genuine shortcomings in the film itself.",
    "95": "I have been looking forward this film, watching the trailer I expected a large-scale work of art and a magical, monumental, strange world with quaint creatures, furthermore, a meaningful, coherent mythology.But at the very beginning of the movie I disappointed: a handful nazis attacks a handful irish farmers. These scenes depict a totally Earth-like world, some wears T-shirt, some wears necktie (!), there is no even costums. There is no fantasy, no invention in it. It is no a magical world but a tasteless, boring scene.But there is bigger problem with the the antagonist. Star Wars' Darth Vader was an alien-like, mighty, frightening character, full of mistery, but in Rebel Moon the enemy isn't enough daunting and interesting, it has no strong personality, no face with definite contours. Noble is a miserable clown, his soldiers are small-minded, stupid men with only dumb sexual motivation. You can't feel the power and the threatening presence of the evil, as you did so seeing the Star Destroyers and Death Star in Star Wars. So there is no true, gripping conflict in this film.At the second half of the film Kora is hopping from planet to planet. The problem is that none of this worlds and their people is interesting enough, they are underdeveloped, you don't know anything about them. The characters (Nemesis, Tarak etc.) have no personality (or, only in visual appearence), no background story, no any motivation - why do they fight with Kora? Their presence is only a flash on the screen.There are few interesting landscapes and buildings. Backgrounds are empty, in most of the cases you can see only the gloomy sky or some blurry tower, walls. Colours are greyish, it should be more light on the screen.Only Sofia Boutella is great, she is so charismatic, beautiful like a nymph and agressive like a soldier at the same time. She would have deserved a better film.",
    "96": "What a mess.In its attempt to be an epic story it entirely messes everything up with exaggerated effects and messy and naive storyline.There seems to be no originality in this movie nor anything to make it stand out from others. The script and dialogue are mediocre.The movie seems to be too hyped up, but does not deliver anything but disappointment. Some fight scenes do look impressive, but atr shadowed by the poor and cheeky storyline. There is no background story and everything relies on the poorly executed and confusing story, that makes one wonder why to have wasted more than two hours on this film.I was surprised to see the that the director is Zack Snyder.",
    "97": "So here's the story with this movie, about 10 years ago, Zack Snyder went to Lucasfilm with a pitch for a Seven Samurai style Star Wars movie. Snyder laid out the pitch, Lucasfilm said \"Yeah no thanks\".Then the brain trust out at Netflix said \"Hey, we'll take it\", so they switch some names around and voila, you've got a straight to streaming Zack Snyder's Star Wars movie.The Good: There are some cool visual elements here. Some cool shots and fight sequences exist, but that's about it.The Okay: some of the characters are fun to watch. Sometimes Ray Fisher makes some interesting choices and hey Tony Hopkins shows up as a robot, so that was cool. Sofia Boutella. She looks incredible and proves that she's a legitimate action hero.Everything: screen play is nonsensical and worthless, later in the movie a lot of the green screen and VFX devolve into CGI sludge. At times you kind of can't tell what's taking place.If you're bored and you want to have a couple of beers and watch some whiz-bang for a couple of hours then hey, there you go.",
    "98": "At an independent planet named Veldt, the chief occupation of a village is farming and the grains are sold to the army of Motherland as well as the rebelling group Bloodaxe. When Admiral Noble demands that all the grains to he sold to the Motherland, the offer is turned down by the village chief declines the offer. When it leads to violence and a deadline of 10 months to fulfill the deal, rebellious Kora steps upto form an army of her own to fight back the brutal army of Motherland. How she succeeds in finding the right warriors for her army forms rest of the story.Zack Snyder has come up with not so unique yet gripping story, of the chosen one handpicking powerful warriors to form an army. It's a world terrorized by the Motherland empire and has various life forms. The idea definitely clicks but the execution falters big time. Snyder fails to deliver a single memorable character including the main lead to root for. The screenplay is as basic as one could expect and the style quotient is amped up. There were several cool shots which we typically expect from Snyder and that is all the film delivered. The action scenes remained generic and devoid of highs. There is more to the story, to be narrated in part 2 but as far as part 1 goes, the efforts didn't really set the film apart from similar films that exist.",
    "99": "Think of your own personal project. You dream about it all the time, work hard and pave a path for that single goal and when the final presentation comes where you gotta go through your slides and everything is wrong right from the font size to the slide titles and all the fancy things you put into the slides don't work on the day. That is exactly what happened here.I can list a few things.1. The casting is totally off. The lead actress did not suit for the role nor she is charismatic to pull this off. Her dialogue delivery just made me less interested. She randomly goes to a new world and tells them directly that she wants to fight mother world(What if they are spies?). Hey, her dialogue gets rebels to leave everything behind and fight for her. So who am I to say her delivery is bad?2. The CGI is not really great at many places.3. The action sequences are boring and on screen looked \"TRY HARD\".4. Predictable villains and their villainy. Nothing new here.5. Most of the movie carries a shade of grey. He ruined Super Man and he did in this again. I swear I hate grey and grey shades from now on.6. The primary cause of all this is \"grain\". You have technically far too advanced and those civilisations failed to work out a smart way to produce food? Snyder's creative mind alone can answer these questions.7. Right from costumes, dialogues, hair, lighting, editing and direction are mediocre.Snyder is one of the directors who thinks his imagination and vision is on another level. Watch his interviews. The thing is visionaries already did all these with less budget and more creative output. A man should know when to stop really. If you are going to design your main villain after Nazis for a sci-fi film in 2023, you should really hang up.",
    "100": "Introduction:\nIn the vast expanse of the cinematic universe, few movies have managed to capture the essence of an epic space adventure quite like \"Rebel Moon - Part One: A Child of Fire.\" Directed by the visionary Zack Snyder, this Netflix original movie is a visual feast that takes viewers on a thrilling journey through a galaxy far, far away. From the stunning visual effects to the engaging storyline, this film is a must-watch for any sci-fi fan.The Plot:\nSet in a distant future, \"Rebel Moon - Part One: A Child of Fire\" follows the story of Kora (played by Sofia Boutella), a young woman with a mysterious past who is tasked with gathering a team of warriors to defend her peaceful colony from the tyrannical Regent Balisarius. The plot is a classic tale of good versus evil, but with a fresh twist that keeps the audience engaged throughout the film.The Visuals:\nOne of the most striking aspects of \"Rebel Moon - Part One: A Child of Fire\" is the stunning visual effects. The film is a visual masterpiece, with breathtaking landscapes and intricate details that bring the world to life. The action scenes are also well-choreographed and visually stunning, making for an immersive experience that is sure to leave viewers in awe.The Characters:\nThe characters in \"Rebel Moon - Part One: A Child of Fire\" are well-developed and engaging. Kora is a strong and determined protagonist, and the supporting cast is equally impressive. Each character has their own unique backstory and motivations, making them relatable and adding depth to the story.The Director's Vision:\nDirector Zack Snyder's vision for \"Rebel Moon - Part One: A Child of Fire\" is evident in every aspect of the film. From the stunning visuals to the engaging storyline, it is clear that Snyder put his heart and soul into this project. The result is a film that is both visually stunning and emotionally engaging, a testament to Snyder's talent as a director.Conclusion:\nIn conclusion, \"Rebel Moon - Part One: A Child of Fire\" is a must-watch for any sci-fi fan. The film is a visual masterpiece with an engaging storyline and well-developed characters. Director Zack Snyder's vision is evident in every aspect of the film, making it a truly unforgettable experience. Looking forward to the second part.",
    "101": "Just get him a good script to direct. His movies look good, very good actually, even though he tends to use slow motion one too many times. I was genuinely interested in what a Zack Snyder Star Wars film would look like. Turns out the answer is \"just boring\".It's the definition of style over substance, and as much as I enjoy his style, it's nowhere near enough to keep me interested for 2 and a half hours, let alone 4 (?) movies, I think. I don't care.After the first hour, which I think was pretty decent, I started zoning out big time. Two characters in act 2 had an overly long introduction, from which the main takeaway, if not the only one, was that they were cool. That was the extent of their character development. I am sure they must had some lines in the film, but I remember none of them. Didn't even get their names to be honest, the only thing I know is that one of them is played by Doona Bae and the other can tame creatures. When you are not invested in any of the characters, you are also not invested in anything that is going on.This is for me the worst kind of movie, the boring one. Competently made, takes itself very seriously, not bad enough to laugh at it, just tedious.",
    "102": "Please stop giving money to Zak Snyder.He has proven over and over, that he lacks the necessary creativity and imagination required for a SciFi creator.This movie is blatantly copying so many other movies and directors that it's hard to keep track of it. Theres the anamorphic lenses of Batman, which don't make any sense in this movie. Then there's the great story of the seven Samurai, which for Snyder isn't enough. He had to add star wars, Warhammer 40k. Predator, jj abrams lens flares, john effing carter , and countless more.And what puts the cherry on top is this awful CGI he constantly uses. Almost as if he's funneling my Netflix payments through his own CGI company directly into his own pockets.@Netflix: I am seriously considering cancelling my subscription because of abuse of funds. I am not willing to finance such crap any more.",
    "103": "Some cool visual shots and a bombastic and at times ominous choir-filled score are not enough to give this turkey a single blip of life.Overuse of slow-mo, characters who only get a name long after being introduced - none of which, including the main protagonist, that you actually give a damn about or who have any screen presence - which is more the fault of the writing and direction than the actual performers.The most charismatic of all the characters is the war robot in the 1st act voiced by Anthony Hopkins and called Jimmy, and he doesn't even have a proper face - TBH, I'd have watched a movie about him and the rest of his kind than every single second that followed.I kept turning to my partner and wondering if a child had written the story. It just felt like a bunch of scenes a child might think of as cool, stuck together with spit and bubble gum; a spider monster, a griffin... so much time wasted on throwaway scenes!Ultimately an empty lifeless movie and a huge disappointment.",
    "104": "I saw Rebel Moon on Netflix last night so you don't have to. It's beautiful looking garbage. It's as if someone made a movie entirely out of movie trailers. It's like the director asked AI to create some sci-fi fantasy images and then they found an excuse to get all the required characters into the scene to recreate the AI images.I found myself completely uninvested in any of the characters. I couldn't tell you the name of a single character if you offered me a million dollars. I mean there is no-shirt guy. I like to call him 'Space Spartan from the movie 300\". And ... well, insect spider lady that had mammal boobs for some reason. And... well.. that's it.It is steals, sorry... \"borrows\" from so many other franchises. Star Wars, obviously. And Seven Samurai--but in a way even more obvious than how Star Wars borrowed from Seven Samurai. Even the ship looks derivative of the ship from Firefly--complete with large two story cargo bay where characters hang out and chat.The \"plot\" is that this lady is going around trying to gather Seven Space-Samurai to defend their space-farming village from the very WWII nazi-looking space-empire soldiers. Soldiers that are so comically evil and incapable of following orders that I couldn't suspend my disbelief and kept wondering how anyone could lead these troops. How could they could accomplish anything? I mean, it would be total chaos all the time.Anyhow... I feel dumber for having watched this. I can't believe this was made and it actually makes me want to sell my Netflix stock. What an absolute stinker.2 stars for pretty visuals. -8 stars for everything else that makes a movie great.",
    "105": "Not really a Zach Snyder fan here, but was excited to see what I thought would be an original science fiction film.Oh lord, I want those two hours back.So many \"yeps\":\nEvery rebellion needs a droid.Every rebellion starts on a farming planet.Shootout in a cantina, yep.Call-back to Stormtroopers, yep.Awesome fighting skills by lightweight female characters, somewhat believable due to agility but Sucker Punch trope, yep.Dune tropes, Alien tropes, gee I think I see too many orc-looking characters.Some of the characters hairstyles remind me of Battleship Earth.Even Avatar tropes.Ride that Harry Potter hippogriff, you long-haired hunky guy!I'm too old to waste my time on this cr*p.Charley Hunnam with an Irish accent?Cringe meter maxed out.",
    "106": "Welcome to the rebel moon universe, a carelessly crafted world of patch work, hand stitched together(barely) by none other than the \"Great\" Zach Snyder himself. This movie is heavily influenced by much better media, and yet somehow fails to capture even a modicum of it's influencers brilliance. The main character is dull and uninteresting to watch (not the actress' fault). The side characters just seem to appear as the plot demands, no real reason for why we need them other than to make the film feel seven samurai esque. The dialogue...oh my God the dialogue, who the heck talks like that? Nobody.Now Zach is known for his amazing action scenes, but they were no where to be found here, the frequent use of slow motion, plus the unnecessary need for cool shots really turned this movie's action scenes on it's head, matter of fact i got so bored with some of it that i had to skip, skip again, then hyper skip. (Thank God for that netflix skip button).There is also a twist in this movie that even a child could see coming, it's a wonder how a trained soldier and her lackeys couldn't see it too. All in all, this movie is dreadful and Zach should not be allowed to write his scripts alone or maybe even at all. 3/10.",
    "107": "If the movie wanted me to keep on yelling what, it definitely succeeded..Zack Synder is back with its signature slow mo... too bad the slow mo is kinda meh... most memorable action scene for me was when Sofia moved in a slow mo in her introduction scene. Nothing was going on. It was just her taking one step while bullets going in the background... just what!!?Also the script is bad. I think the problem is that Zack do not treat his characters like human beings... they are just playthings to make cool moments and plot to go forward.Like the shirtless dude who just ride an animal and left the animal there!? I was waiting for a guardians of the galaxy 3 moments (when Quill did a smart deception), but it never came... it just a straight Harry Potter's scene with the Hippogrift. Least the guy is hot.Anyway it is a ridiculous movie but good on him for making things that he likes and paying people for it too. Heard he is a chill dude too so good on him.",
    "108": "To be honest I'm not the biggest Snyder fan so my expectations were very low but Snyder again managed to underperform my literally non existent expectations and delivered a movie that is long winded, not well written, most of the time boring and senseless. The main problem starts with the poor storytelling. From the beginning there is no real character development, the audience gets introduced to a bunch of protagonists, species, worlds and conflicts with some flashy recaps, not understanding what's the overall framework/role of each one and which leads at the end to more unanswered and open questions. The movie also feels like a copy of different previous works by mixing elements from Star Wars, dune, Harry Potter mixed with Conan (LOL) or other movies, trying to create something better. Overall i had really to fight with this one giving it a chance but this was a disappointment on all levels. If you guys still liked it I'm happy for youSo My summary about rebel moon:\nMid moviebad story/storytellingcopy of different elementssome good and some bad visual effectsnot able to build a franchise around thisno need to spend 200mil for a second partif you ain't able to build a good story in 2/3hrs there is no need for a 5h cut version.Maybe this was Snyders last chance to establish as a good director.",
    "109": "I've been looking forward to this film for many months. I'm a big Sci Fi fan and very open-minded to original material, and the lure of world-building on an epic scale and some thoughtful story telling had me hooked as soon as I heard this film (or films) was in the works.Unfortunately it was unrelentingly poor. Almost unwatchable in places. Clunky dialogue only adequately delivered. Distinctly dodgy attempts at British regional accents (for whatever reason that was required I don't know). CGI that appeared to date back to the phantom menace which gave the whole film a video game quality. A story line we've seen many many times before - the 7 samurai, the magnificent 7, the dirty dozen, oceans 11. Goodies that speak in reverential and serious tones (and hence are boring to watch - where's the humour?) and baddies that were so over the top that I almost expected Roger Moore's James 'bond to appear in scenes with them. And why did Antony Hopkins agree to voice a robot, and be the narrator up front? What was he thinking?And above all.....it was actually very slow and boring. 2 hours (there are 15 minutes of credits at the end, and no I couldn't be bothered to check if there was a hidden scene contained) to assemble a team and yet fail miserably to give any of them (with the exception of the main protagonist) any back story whatsoever to make us care about them. I was delighted it stopped 5-10 minutes earlier than I'd feared. And in case anyone cares.....NO it's not \"so bad, it's good\" at all!",
    "110": "This movie puts you to sleep and confuses you from\nthe first 10 minutes.It's baffling how incoherent it is. It's like an AI edited it.How can an exciting sci-fi epic start with some neo-1930's Soviet imagery of farmers, boring dialogue, being told - not shown how good someone is, how scary the enemy is.It's incredible.This is not someone who's never made a movie before. Or has Snyder always been like that, and what we've seen was a result of someone stepping in and fixing everything he'd made? I assume that Netflix gave him free reign this time.I'm serious, what the hell is this mid confusing fever dream?",
    "111": "I don't know why so many low/negative reviews. Yes there are comparisons to Star Wars, Seven Samurai and Magnificent Seven etc but they are also great films. And there are many films that are similar to each other. But Rebel Moon actually had lots of interesting characters with an actual good female lead. At the risk of getting shot down there was alot of aspects I preferred compared to the Star Wars series and given enough time it could be a very interesting new world. Its about time we got a new fresh story rather than another rubbish attempt to continue a Star Wars film or another Marvel film trying to continue a dead franchise or an awful Fast and the Furious film. This was filmed in a great art style although a little CGI heavy. But yet again it would be hard to get this visual art style in true real life sets. As for the comments on over use of slow motion i didn't mind it. It was very similar style to Sucker Punch which also got bad reviews but I also didn't mind that. Although I may have compared it to past films try to go into it not comparing it to other similar movies and try to enjoy it as something new. I enjoyed it and look forward to the universe growing and hope all the negtive reviews don't win leading to it getting cancelled before it can grow like so many good things do.",
    "112": "Rebel Moon is a disappointing film that fails to deliver anything original or exciting to the sci-fi genre. The film is a blatant rip-off of several classic films, such as Seven Samurai, The Magnificent Seven, The Hidden Fortress, and of course, the original Star Wars trilogy. The film lacks any creativity or innovation, and relies on clichés, tropes, and fan service to appeal to the audience. It is poorly written with a predictable plot, shallow characters, and cheesy dialogue. The film tries to be dark and gritty, but ends up being dull and boring.The film's only redeeming qualities are its visual effects, including some stunning landscapes, spaceships, and battles, which are enhanced by Snyder's signature slow-motion and stylized cinematography. However, these aspects are not enough to save the film from its many flaws and, ultimately, Rebel Moon is a forgettable and uninspired film that does not live up to its own potential.Would have been 1 star for being such a staggering disappointment, but extra stars awarded to all the crew for their hard work and skill, especially in light of being given such awful material to work with.",
    "113": "Zack Snyder failed so miserably with this film. I see the vision, I really do, but with binoculars. Rebel Moon could have been so much more, they had gold in their hands, yet they failed to give the audience good material. This film is all over the place. ALL OVER THE PLACE. It can't stand on its own two feet, such a half-baked story with rushed character introductions, that it could not make me care for anything that was happening on screen. I didn't spend enough time with these characters to really understand them and care for them.Now, dear Zack Snyder, cool it with the slow-mo. Yes, I agree they're cool and you like them, I like them too, but only when they're earned and feel satisfying. When you're literally giving me a slow-mo every ten seconds, it's only normal that I'll get sick of it after a while. I laughed a handful of times during this movie, and it wasn't with the movie, more so AT it.But because I don't want to completely bury this film, I'd like to give props to the production design and the people who worked on the visual effects, because they are magnificent (with a few exceptions). This is Netflix's most expensive film ever, and you can tell. There's clearly a ton of work put into Rebel Moon.Sad to see Zack Snyder's attempt at a Star Wars film fail so miserably. I hope the 4 hour long Snyder cut does it justice. Waiting for part 2.One more thing, there was an Irish guy in this movie who's name I forget because of course, and he was annoying af.",
    "114": "Since the beginning i felt that this movie is telling the history of #Israeli and its occupation of #Palestine even before 1948, it's the very same story, as \"COPY-PASTE\", with no intention of creativity.(Zack Snider assumed that his major influence for this movie is \"The Seven Samurai\" (1957) by the great \"Akira Kurosawa\").#ZackSnider is the one of the most incredible bad writers/directors, ever, I can compare him in this category with the late #EdWood.He might be fine with choosing some good effects at the CG monitors, and fight scenes, but otherwise he simply cannot direct his actors, or writing script, or even dialogs, as ALL of his movies.He's good in marketing himself, but all his marketings fails.No wonder WB kicked him out, i think because the CEOs gain back theirs artistic consciousness.Very, extremely, unbelievably BAD MOVIE.",
    "115": "But that's it.I wanted nothing more than to love a brand new sci-fi adventure series of films. This has pretty much zero chance of that happening now.The pacing was horrendous, as was the casting. I hate being overly critical of films in this way, but seriously, I've never seen a cast so unsuited to the story and the environment they were placed.The film progressed at the speed of a freight train smashing through multiple stranded trucks at crossings.It all felt so fake. It was only the visuals that made any of it somewhat believable (except a few odd frames). A sci-fi is never going to succeed if that is the case. Not many films have achieved this.I really wanted to enjoy this, but it ended up being a massive let down. Expected more from Snyder.Not sure I'll even give the next installment a go.",
    "116": "Ive heard this was gonna be good. Seems like a big project from Netflix, while putting two parts of the story, seems like a pretty big investment from Netflixs side.A pretty good and intriguing storyline pretty well put together. A rebel against dictatorship.Soundtrack is really good and really fits the style of the film. The script is very well written. And acting is also very good.Love the atmosphere in the film.I actually get some Star Wars ambience mixed with Avatar vibe.But it has many areas where it fails.The main character does a pretty bad job in giving some authentic acting. And many illogical plot holes.I can really recommend it. Will definitely watch part 2.",
    "117": "I have no idea what i just watched.It was quite possibly the most wish-washy sci-fi plot of all time, and that's saying something considering how bad the recent star wars films have been.This film is an incoherent mess. It started off well in the first 15 minutes, but after that, it didnt go down hill, it went straight down to an abyss.The acting is horrible, the set pieces are predictable, the dialogue is passable.To stick to the age restrictions they not only dont add any blood despite several characters getting stabbed, they also dumb down the plot too.The only redeeming part is that the cgi is pretty. But thats it.Save yourself the time and avoid watching this mess.",
    "118": "When you have a camera in your hand, why do you choose to make a audio book?All they do is talk and talk and talk and talk.Instead of telling us, show us! You have a camera, right?This audio book is not worth the time.Everything need to be explained with words instead of pictures. And when the characters needs to be introduced, they are so with the standard book of filming. \"Films for dummys\". This person is evil, he has to kill someone. These soldiers are evil, they have to be pigs. This girl needs to be the hero, she has to kill the evil soldiers.I actually thought this film was supposed to be ok. But after 1 hour of talking I turned the TV off and went to bed.Tomorrow I will cancel my Netflix account, finally.",
    "119": "I read somewhere (who knows if this is accurate) that this was initially developed as a Star Wars spinoff. If that is the case, while this could have easily fit into that universe, I am glad it was spun off into its own thing, rather than being tethered to another property that comes along with too many expectations of what it should be. Also, I am not interested in seeing \"A New Hope\" recycled for the third (fourth?) time by the powers that be at Disney.The visuals are incredible, something that goes without saying for any Zack Snyder film. Not many directors can build visuals like this guys does. The story is strong and doesn't lag anywhere. The movie easily sets up what could be a broad new movie universe and does a great job of exploring themes of oppression, rebellion, the horrors of war and the reality of wartime economics.The actors are top notch, I could easily watch stand alone films with Ray Fisher, Charlie Hunnam and Ed Skrein's characters in them. If I've seen Sofia Boutella in anything else, I am not aware of it, but she was fantastic as well. The way most of these characters are portrayed, makes me want to see more of them, particularly Ray Fisher and his character.The only thing that I felt was lacking was some of the character development. I understand that it is difficult to introduce a new world full of these interesting characters to an audience within the span of 2 hours, but still, there are some fantastic characters that are introduced here, that we just don't get enough time with. Some motivations could have been fleshed out a bit more.I'm looking forward to the sequel, I enjoyed this one a lot.",
    "120": "\"Rebel Moon: A Child of Fire -Part One\" is a weak science fiction movie, with absolute no feeling and no gripping action that holds you on. Zack Snyder wanted to make a new version of something like Star Wars, but first of all: The story feels completely unoriginal, and secondly, this crap just feels like a fast Netflix copy of an amazing franchise of decades. It's disturbing to watch how people get tricked to watch stuff like that, and how big production continues endless s**t! Let's talk about the action sequences. It felt like a video game, the fighting motions of the fighters looked like gaming character movements. Completely basic acting, outside the battles too. Character expressions was showed on a mediocre level, and the main hero of the film, Kora, was trying so hard to be dramatic, but it just looked pathetic on the screen. The rest of the characters that were introduced were forgettable and sometimes I forgot about them in the next scene. The story had two main villains, even though they focused more on the second (That by the way looked a little bit like Thomas Shelby) and I'm not so very proud of them. The menace and creepiness didn't feel like a true villain, and they felt quite generic, too. The scenography was the mark of the low-budget quality here. It looked more like a scenography they would use on a theatre, not on a big film like this. The camera filming was quite decent, and I can't argue much about that. The music was fine, too, and was the only thing that saved the film some stars. It was quite dramatic, and fitted the scenes, but unfortunately, it's not enough to save it. By the way, this is just the first part (The second releases April next year) and I'm not so excited. But I hope they can change something to make the continuation better.",
    "121": "Really wanted to see this. There were quite a few sci-fi movies and series coming out recently and as a big sci-fi fan I'm slowly getting saturated with films that are mere clones of popular blockbusters. After reading the reviews and watching for a while I decided to fast forward to see these \"amazing worlds\" people were mentioning here but was disappointed because even fast forward all I could see was people talking most of the time. Also I'm all for diversity because like every sci-fi fan I'm used to a great diversity of characters and am all for making this world so mixed that nobody will be able to ask where you're coming from lol! One thing that bothers me though ( I'm originally German born after the war) that the villains have to look like nazis, ridiculous!Come up with original ideas like Disney's \" a murder at the end of the world\" which just finished and I was waiting eagerly for every Monday for 7 weeks to see the next instalment or \" Monarch\" that handled an old concept of Godzilla but was surprisingly fresh and watchable!I'm seriously considering getting rid of Netflix and just keep Apple, Disney (for now) and Prime!",
    "122": "Love Sci-fi but hate any original ideas? Then you're gonna love the borderline copyright infringement that is Rebel Moon on Netflix...It's almost laughable how many different ideas Zack Snyder has hijacked to create this rather poorly executed pile of low grade CGI rubbishIt shamelessly dips between Star Wars, Dune and even into Warhammer 40k. Then, through what I can only assume was an AI generated joke, we get a painful hybrid of Avatar & Harry PotterIf you watch with both eyes partially closed you will still spot the mad max makeup, nazi costumes and middle earth sceneryNot to mention he manages to fill this two hour fan fiction without creating a single character arc at any point. Honestly, you can create a better character story by skipping up and down channels on freeview and calling yourself a directorYes ok, the Borg Queen with a spider body is a nice effect, although nothings we haven't seen before but, no amount of Firefly Class & Battlefleet Gothic knock off ships could drag this movie out of the black hole left by the reported £130 budgetThe only close thing to a saving grace are the occasional fight sequences which, if not for the horrendous over use of super slow motion, Judge Dread guns and laser swords would almost make a salvageable 15-20 minutes of viewingBut hey, if you get bored, you can always just pretend you're watching literally any other B movie spin off from pretty much any sci-fi universe that takes your fancyI've never written a movie review before, which I hope tells you how abysmal this time theft dross is. I am amazed how someone can take so many incredible ideas and make something almost painful to watchIt's your time though, so if you have over two hours you want to lose and never get back, you know where to look.Utter trash.",
    "123": "First off, I believe there are people that will always hate anything Snyder does. For some reason they will hate watch anything he does just to because. I enjoy his movies for what they are. They are not always perfect. But you will definitely get great cinematography and nice action sequences.Rebel Moon has all of that. The story may be a bit out there. But. It is a fantasy sci-fi story. I am looking forward to the R rated version. I am sure Netflix forced this pg-13 version out quickly so it could be here for the holidays. I am not here to convert anyone to love this movie. Do not care. I loved the characters. The visuals were great looking. At times the cgi is a bit blurry around the edges. But. It's leagues better than most movies that have a higher budget. Anything Disney has put out over the last 5 years or so looks way worse. If you like sci-fi or action. You'll like this movie. It entertains and that's all I want from a movie such as this. Looking forward to the conclusion. Still think that Snyder receives undeserved hate and criticism. His cut of the Justice League was amazing. Wish we at least get the chance to see what he had in store for the conclusion of that universe. For better or worse. This is spoiler free review. So. If you like action sci-fi. I think you will enjoy this movie. Looking forward to the conclusion and the R-rated cut.",
    "124": "This god awful film compelled me to review it.How many more times do we gotta see some ChiComm's power fantasy before it sinks in that this is lazy, tropish, and uninspired?The characters are purposely stupid, aside from our hero armor donning leading lady.The world building is simply slapped together trying to steal elements from pretty much every actually good SciFi film.And don't forget, bad guys are bad...like space nazis...ya know...a novel concept in 2023. The characters, subtext, and symbolism is so hamfisted it's embarrassing. Nuance and subtlety must not exist in this reality.Boo, trash flick, skip it and save yourself 2hrs.",
    "125": "Unlike Rogue One, the script did not have the originality to find a sensible alternative plot.The Japanese original had a bunch of bandits as foes - plausible. Rogue One had sections of a well-organised Resistance. This has a scattering of unlikely individuals, who for some reason get involved in an entirely local matter.I also found a lot of it silly - ploughing using a horse-like animal, in a society with advances spacecraft.And there was a grimy look to a lot of it. Only by making the villains irrationally bad could one feel for the heroic characters, and they were not that heroic.It was not a waste of time. And I fancy I can guess what part two will be about. But I'd not expect it to have much impact.",
    "126": "Was really looking forward to this but its massive disappointing.Watching it is like watchin 6 other movies all wrapped into one.Its just like a paint by numbers movie, nothing feels original and at times feels like he is just taking ideas from other movies.Its like Star Wars was thrown in a mixer with the Magnificent 7.When they had to find the gladiator from the movie Gladiator and found him in a Gladiator Colosseum and he was a Gladiator that was pretty much it for me.Before people had even saw it they were saying they wanted his Snyder Cut, but he needs to be able to release a movie that works immediately.From someone who did Watchmen this is a big let down.",
    "127": "Rebel Moon is overstuffed and underdeveloped. There's too many characters and in its current state there's not enough time to give them meaningful depth so it feels rushed despite clocking in at over 2 hours. However, this is Zack Snyder going full Snyder in a way that is uniquely him so it still has plenty of stylish highs.Clearly inspired by Star Wars and Seven Samurai and so much more. All of these ideas and borrowed visuals create a new world that's genuinely interesting and consistently striking. The second act just has the core cast planet hopping between set pieces which are just so committed to looking cool in a way only Snyder could pull off with this level of seriousness.Sofia Boutella gives the best performance. Being the lead character means she gets the most depth which helps and she nails the general stoicism of her character. Even with the dodgy accent Charlie Hunnam is still able to be a loveable scoundrel and Anthony Hopkins voice work gives the film its most human performance.Everyone else is wasted. It's especially shocking to see how late into the film Djimon Hounsou is introduced and how little he gets after that, he really is just kinda there. Staz Nair, Bae Doona and Ray Fisher all do quite a lot with a little whilst facing the same issue and are hopefully given a lot more in the extended cut and sequel.Once again being his own cinematographer, Zack Snyder creates gorgeous imagery destined to become wallpapers. His action remains really good even in the currently butchered PG-13 state and the slow motion is present without becoming grating. The CG is hit and miss but considering the budget, it's a lot more excusable here than in most of the other big blockbusters released recently.Unusually for a Zack Snyder film, there are no needle drops, unconventional or otherwise, which isn't a huge problem thanks to Tom Holkenborg's score which fills the gaps nicely. It's very reminiscent of their previous collaborations, especially with Holkenborg's trademark percussion heavy flourishes that still haven't gotten old.",
    "128": "OK where do you start with this Sci-Fi bore fest?First of all has Charlie Hunnam ever made a good movie? Everyone this guy stars in are flops or just nothing to write home about. Any movie starring this actor should be warned of the Hunnam curse of your movie bombing from great heights. Is he a bad actor? Not really but he isn't good at picking films as most turn out to be turkeys.The critics were correct for once avout this pile of plop it is very boring in dialogue with terrible slow motion zoom in and out frames making it hard to watch at times.Overall I could write an whole essay about why this movie sucks but I can't be bothered.If you suffer with insomina watch this movie and it will soon send you into a coma.Part 2 will be like part 1 as it is a Zak Snyder movie so yeah go figure.2/10 for some of the CGI and nothing else in truth!",
    "129": "I feel like this deserves a nuanced review but for those who just want the meat of it, here ya go: Star Wars meets Foundation shot in much the same style as 300 with a heavy \"Battlestar Galactica Reboot\" feel. A good watch.I enjoyed the movie. It had a great visual style that pulled me into the movie, from the farms to the mining planet. It felt very real, less fantasy and more scifi.There were moments that pulled you out however. Some of the story was very heavy handed in it's quest to throw you off the scent. Some seemed not well thought out (like shouting at fighter pilots instead of using a communication device or fighting with a sword for ten minutes when there are people standing around behind you with guns watching you.) But to be honest, the most distracting thing for me was the overuse of the slow-motion, moving comic book panel-esque shooting style that made 300 so much fun to watch back then. I'm over it. Over it in the same way I'm over lens flares in J. J. Abrams movies. Sam Raimi rolls his eyes when he sees these.That's the bad.The good is that I genuinely liked the story and the main characters. A few supporting characters as well. You want to root for them. They're mostly likeable with easily understood motivations, for the most part. And while I felt like some of the broad story is just given away with overly obvious clues that leave little to surprise you, it still feels good to be right (a cynical person might think that was the desired result) and see the ways it's made to happen. Like being given a full outline of a story but no ending and then reading the book in all it's detail.What intrigued me most was what I believe is foreshadowing of things to come. I won't indulge any of my theories but I'm looking forward to seeing if I'm right.",
    "130": "\"Rebel Moon: A Child of Fire -Part One\" is a weak science fiction movie, with absolute no feeling and no gripping action that holds you on. Zack Snyder wanted to make a new version of something like Star Wars, but first of all: The story feels completely unoriginal, and secondly, this crap just feels like a fast Netflix copy of an amazing franchise of decades. It's disturbing to watch how people get tricked to watch stuff like that, and how big production continues endless s**t! Let's talk about the action sequences. It felt like a video game, the fighting motions of the fighters looked like gaming character movements. Completely basic acting, outside the battles too. Character expressions was showed on a mediocre level, and the main hero of the film, Kora, was trying so hard to be dramatic, but it just looked pathetic on the screen. The rest of the characters that were introduced were forgettable and sometimes I forgot about them in the next scene. The story had two main villains, even though they focused more on the second (That by the way looked a little bit like Thomas Shelby) and I'm not so very proud of them. The menace and creepiness didn't feel like a true villain, and they felt quite generic, too. The scenography was the mark of the low-budget quality here. It looked more like a scenography they would use on a theatre, not on a big film like this. The camera filming was quite decent, and I can't argue much about that. The music was fine, too, and was the only thing that saved the film some stars. It was quite dramatic, and fitted the scenes, but unfortunately, it's not enough to save it. By the way, this is just the first part (The second releases April next year) and I'm not so excited. But I hope they can change something to make the continuation better.",
    "131": "Really wanted to see this. There were quite a few sci-fi movies and series coming out recently and as a big sci-fi fan I'm slowly getting saturated with films that are mere clones of popular blockbusters. After reading the reviews and watching for a while I decided to fast forward to see these \"amazing worlds\" people were mentioning here but was disappointed because even fast forward all I could see was people talking most of the time. Also I'm all for diversity because like every sci-fi fan I'm used to a great diversity of characters and am all for making this world so mixed that nobody will be able to ask where you're coming from lol! One thing that bothers me though ( I'm originally German born after the war) that the villains have to look like nazis, ridiculous!Come up with original ideas like Disney's \" a murder at the end of the world\" which just finished and I was waiting eagerly for every Monday for 7 weeks to see the next instalment or \" Monarch\" that handled an old concept of Godzilla but was surprisingly fresh and watchable!I'm seriously considering getting rid of Netflix and just keep Apple, Disney (for now) and Prime!",
    "132": "Love Sci-fi but hate any original ideas? Then you're gonna love the borderline copyright infringement that is Rebel Moon on Netflix...It's almost laughable how many different ideas Zack Snyder has hijacked to create this rather poorly executed pile of low grade CGI rubbishIt shamelessly dips between Star Wars, Dune and even into Warhammer 40k. Then, through what I can only assume was an AI generated joke, we get a painful hybrid of Avatar & Harry PotterIf you watch with both eyes partially closed you will still spot the mad max makeup, nazi costumes and middle earth sceneryNot to mention he manages to fill this two hour fan fiction without creating a single character arc at any point. Honestly, you can create a better character story by skipping up and down channels on freeview and calling yourself a directorYes ok, the Borg Queen with a spider body is a nice effect, although nothings we haven't seen before but, no amount of Firefly Class & Battlefleet Gothic knock off ships could drag this movie out of the black hole left by the reported £130 budgetThe only close thing to a saving grace are the occasional fight sequences which, if not for the horrendous over use of super slow motion, Judge Dread guns and laser swords would almost make a salvageable 15-20 minutes of viewingBut hey, if you get bored, you can always just pretend you're watching literally any other B movie spin off from pretty much any sci-fi universe that takes your fancyI've never written a movie review before, which I hope tells you how abysmal this time theft dross is. I am amazed how someone can take so many incredible ideas and make something almost painful to watchIt's your time though, so if you have over two hours you want to lose and never get back, you know where to look.Utter trash.",
    "133": "First off, I believe there are people that will always hate anything Snyder does. For some reason they will hate watch anything he does just to because. I enjoy his movies for what they are. They are not always perfect. But you will definitely get great cinematography and nice action sequences.Rebel Moon has all of that. The story may be a bit out there. But. It is a fantasy sci-fi story. I am looking forward to the R rated version. I am sure Netflix forced this pg-13 version out quickly so it could be here for the holidays. I am not here to convert anyone to love this movie. Do not care. I loved the characters. The visuals were great looking. At times the cgi is a bit blurry around the edges. But. It's leagues better than most movies that have a higher budget. Anything Disney has put out over the last 5 years or so looks way worse. If you like sci-fi or action. You'll like this movie. It entertains and that's all I want from a movie such as this. Looking forward to the conclusion. Still think that Snyder receives undeserved hate and criticism. His cut of the Justice League was amazing. Wish we at least get the chance to see what he had in store for the conclusion of that universe. For better or worse. This is spoiler free review. So. If you like action sci-fi. I think you will enjoy this movie. Looking forward to the conclusion and the R-rated cut.",
    "134": "This god awful film compelled me to review it.How many more times do we gotta see some ChiComm's power fantasy before it sinks in that this is lazy, tropish, and uninspired?The characters are purposely stupid, aside from our hero armor donning leading lady.The world building is simply slapped together trying to steal elements from pretty much every actually good SciFi film.And don't forget, bad guys are bad...like space nazis...ya know...a novel concept in 2023. The characters, subtext, and symbolism is so hamfisted it's embarrassing. Nuance and subtlety must not exist in this reality.Boo, trash flick, skip it and save yourself 2hrs.",
    "135": "Unlike Rogue One, the script did not have the originality to find a sensible alternative plot.The Japanese original had a bunch of bandits as foes - plausible. Rogue One had sections of a well-organised Resistance. This has a scattering of unlikely individuals, who for some reason get involved in an entirely local matter.I also found a lot of it silly - ploughing using a horse-like animal, in a society with advances spacecraft.And there was a grimy look to a lot of it. Only by making the villains irrationally bad could one feel for the heroic characters, and they were not that heroic.It was not a waste of time. And I fancy I can guess what part two will be about. But I'd not expect it to have much impact.",
    "136": "Was really looking forward to this but its massive disappointing.Watching it is like watchin 6 other movies all wrapped into one.Its just like a paint by numbers movie, nothing feels original and at times feels like he is just taking ideas from other movies.Its like Star Wars was thrown in a mixer with the Magnificent 7.When they had to find the gladiator from the movie Gladiator and found him in a Gladiator Colosseum and he was a Gladiator that was pretty much it for me.Before people had even saw it they were saying they wanted his Snyder Cut, but he needs to be able to release a movie that works immediately.From someone who did Watchmen this is a big let down.",
    "137": "Rebel Moon is overstuffed and underdeveloped. There's too many characters and in its current state there's not enough time to give them meaningful depth so it feels rushed despite clocking in at over 2 hours. However, this is Zack Snyder going full Snyder in a way that is uniquely him so it still has plenty of stylish highs.Clearly inspired by Star Wars and Seven Samurai and so much more. All of these ideas and borrowed visuals create a new world that's genuinely interesting and consistently striking. The second act just has the core cast planet hopping between set pieces which are just so committed to looking cool in a way only Snyder could pull off with this level of seriousness.Sofia Boutella gives the best performance. Being the lead character means she gets the most depth which helps and she nails the general stoicism of her character. Even with the dodgy accent Charlie Hunnam is still able to be a loveable scoundrel and Anthony Hopkins voice work gives the film its most human performance.Everyone else is wasted. It's especially shocking to see how late into the film Djimon Hounsou is introduced and how little he gets after that, he really is just kinda there. Staz Nair, Bae Doona and Ray Fisher all do quite a lot with a little whilst facing the same issue and are hopefully given a lot more in the extended cut and sequel.Once again being his own cinematographer, Zack Snyder creates gorgeous imagery destined to become wallpapers. His action remains really good even in the currently butchered PG-13 state and the slow motion is present without becoming grating. The CG is hit and miss but considering the budget, it's a lot more excusable here than in most of the other big blockbusters released recently.Unusually for a Zack Snyder film, there are no needle drops, unconventional or otherwise, which isn't a huge problem thanks to Tom Holkenborg's score which fills the gaps nicely. It's very reminiscent of their previous collaborations, especially with Holkenborg's trademark percussion heavy flourishes that still haven't gotten old.",
    "138": "OK where do you start with this Sci-Fi bore fest?First of all has Charlie Hunnam ever made a good movie? Everyone this guy stars in are flops or just nothing to write home about. Any movie starring this actor should be warned of the Hunnam curse of your movie bombing from great heights. Is he a bad actor? Not really but he isn't good at picking films as most turn out to be turkeys.The critics were correct for once avout this pile of plop it is very boring in dialogue with terrible slow motion zoom in and out frames making it hard to watch at times.Overall I could write an whole essay about why this movie sucks but I can't be bothered.If you suffer with insomina watch this movie and it will soon send you into a coma.Part 2 will be like part 1 as it is a Zak Snyder movie so yeah go figure.2/10 for some of the CGI and nothing else in truth!",
    "139": "I feel like this deserves a nuanced review but for those who just want the meat of it, here ya go: Star Wars meets Foundation shot in much the same style as 300 with a heavy \"Battlestar Galactica Reboot\" feel. A good watch.I enjoyed the movie. It had a great visual style that pulled me into the movie, from the farms to the mining planet. It felt very real, less fantasy and more scifi.There were moments that pulled you out however. Some of the story was very heavy handed in it's quest to throw you off the scent. Some seemed not well thought out (like shouting at fighter pilots instead of using a communication device or fighting with a sword for ten minutes when there are people standing around behind you with guns watching you.) But to be honest, the most distracting thing for me was the overuse of the slow-motion, moving comic book panel-esque shooting style that made 300 so much fun to watch back then. I'm over it. Over it in the same way I'm over lens flares in J. J. Abrams movies. Sam Raimi rolls his eyes when he sees these.That's the bad.The good is that I genuinely liked the story and the main characters. A few supporting characters as well. You want to root for them. They're mostly likeable with easily understood motivations, for the most part. And while I felt like some of the broad story is just given away with overly obvious clues that leave little to surprise you, it still feels good to be right (a cynical person might think that was the desired result) and see the ways it's made to happen. Like being given a full outline of a story but no ending and then reading the book in all it's detail.What intrigued me most was what I believe is foreshadowing of things to come. I won't indulge any of my theories but I'm looking forward to seeing if I'm right.",
    "140": "Space facist's versus Idealist's? That's never been done before?...... So let's start with all the plagiarism? Which is understandable, due to originality being a very rare commodity. Buckbeak from Harry Potter.....he even bowed? Light sabre's from? ....well u all know where? Robot from...take yer pick? Why OH Why was it deemed necessary to waste money on Mr Hopkins? And why have horse's with Halloween masks masquerading as alien creatures? Did you run out of money, or just ideas?Who could possibly have known that the all powerful Regent of the known universe came from the Falls Road in Belfast?And who's idea was it to have Hunnam' follow the same trajectory, with the some of the worst accent work to ever appear in Sci Fi, No forget that, in Movie history ? WTF...... was it Charlie attempting to show off his chop's, or Zach's idea of an insider joke?It looked great, and so it should for $130 mill, but why didn't they spend some of that on a decent script?I will say that it was rarely boring, if just a little predictable, and did roll along at a decent pace.Good cast, Good effects, vacuous script?",
    "141": "First of all, there were some flashes of wonderful in \"Rebel Moon\". The set designs were superior. The plot line was certainly laid out for us ... easy to follow and very easy to root for the good guys and for the bad guys to be vanquished. The movie certainly had its share of good actors who knew how to carry the load. Those are the positives. The negatives were overpowering. The film lacked subtlety, nuance and was heavy-handed to the nth degree. I felt as if I was watching a B-Movie from 1965. Or maybe it was more akin to a sub-standard video game from 2000 that was geared toward adolescent boys. There was over use of slo-mo and overemphasis upon machismo without character development. Sometimes it seemed as if I was watching a bad Western. The musical score was the absolute worst. There was no score when needed and then it overshot its intended effect by utilizing short bursts of soaring vocals and kettle drums which (I assume) was supposed to transport us in a similar manner as we were by the score in \"Gladiator\". The next thing I knew, I was watching Ninjas fighting sexualized, anthropomorphic spider-monsters using demonic light sabers. What-the-actual-heck was that ? ! ? ! There is no director's cut that can save this mess. I wanted to like this film. I REALLY wanted to like it. Calling it a hot mess is being kind.",
    "142": "Fair to say I'm not loving this new era of Zack Snyder's at the moment (producing content for a streaming service) & as both an audience / collective fan base, feel as though we're sadly seeing him go from one problematic extreme (a total lack of creative control; artistic power callously stripped from him - with brazen opportunism by Warner Bros at the time - in the wake of a family tragedy) to the other (no discernible over-sight during the production process whatsoever - resulting in the opposite).Therefore, although not terrible (Part 1 - which this definitely seems like - genuinely isn't. Nevertheless, neither is the movie particularly good either)... I'm frustrated by such a demonstrably outstanding filmmaker settling for the continuous construction of uninspired & tedious mediocrity when I know him to be capable of far, far better.I mean yeah, on the one hand, \"Rebel Moon\" is a vast improvement on \"Army of The Dead\" (though that's not saying much; the bar is in hell after his previous unmitigated disaster that failed to even meet the usual standard set, merely in terms of aesthetic quality), yet that's the only viable endorsement I can reasonably give because once again, it doesn't feel like he's actually challenging himself here.Zack Snyder's basically provided us with his alternative take on \"Star Wars\" & that's exactly what this product is, in the simplest of terms... Zack Snyder's \"Star Wars\" - another copy + paste sci-fi franchise (you could recognise from countless other blockbusters / TV series), unoriginally put to the screen (with no attempt to hide the plagiarism) but with his signature visual style pasted over it - in an unconvincing attempt to assemble some form of uniqueness.In fact, it's disheartening to witness a talented individual reduce their gift to what comes across as a cheap gimmick; lensing other genres through a bespoke, superficial Instagram filter that can be tailored mindlessly to fit each project, refusing to convey anything meaningful via the transference between stories.Even the release of his latest feature feels akin to a desperate, fake imitation of \"Justice League\" (artificially endeavouring to capture that same demand / interest - borne from entirely different circumstances); rather than distributing his original cut (I can't understand why they'd withhold it intentionally now - Netflix is known to fritter away money so the notion they'd prefer a safer investment by first airing a more palatable version is utter nonsense), they're keeping it from us in the hopes of deliberately orchestrating another viral movement on social media, demanding his extended iteration... It's all so corporate & staged.Is this his brand now?",
    "143": "The movie \"the seven samurai\" has duration 90 minutes more than this one and for a reason... to proper introduce/present the characters, build relations, etc, so this movie feels too rushed because there was wasn't enough time to do that. Maybe in an extended cut this will be fixed but for now it's not good at all.The writing of this movie is also not good and there is no chemistry between the characters. The bad guys are just bad without a purpose... The directing of the movie is ok but the classic Snyder slow motion scenes are limited and boring.I like Butella but her acting wasn't persuasive and I don't think that she is a good fit for the role of the main protagonist.I know that's a TV movie but the CGI is average at best and many times looked like it was from an early 00's video game.",
    "144": "Zack Snyder is overrated. $122m budget produced by Netflix and the story feels like it was written by an angry pre-teen.The opening 5 minutes set the tone as they throw copious exposition at the audience backed by an unappealing lead relationship arc which continues for 140 minutes of obnoxiously drab storytelling.VFX looks great when the fish eye camera lens isn't so nauseating that the aggressive jump cuts in slow/fast fight scenes aren't giving you conniptions.Zack Snyder is overrated, 300 was clearly a one hit wonder, with the likes of Sucker Punch & now Rebel Moon showing he's out of his depth.Save your time and watch Godzilla Minus One, which on a $15m budget puts almost everything released by Hollywood in the last 12 months to shame.",
    "145": "Imagine buying a cake, that looks and smells pretty, but the bakery forgot to add sugar.Thats how this felt.All its beauty can not make up for such a boring and predictable story, with unlikable and shallow characters.I havent been a big Snyder fan for years, but i still hope that one day he will open the box and grab the tools that gave us Watchmen.Even if hollywood cant write any more good stories and plots, atleast give us some characters we can relate to and fall in love with.And please stop riding giant birds and battle humanoid spiders just to show off your characters. Had nothing to do with the plot. Dumbest thing I have ever seen.",
    "146": "Zack Snyder has described this movie as the Seven Samurai in space, and this movie proudly shows its influences on its sleeves. Like Lucas before him, Snyder borrows ideas and imagery from the classics of his day, from the magnificent seven to Excalibur and of course, Star Wars, but all done in his own signature bombastic style.The visuals and action scenes are as usual immaculate, and the universe Zack has created looks amazing, with a price tag of 80 million it still manages to look better than movies with three times the budget.The big flaw is that you can tell the movie was cut down for a shorter run time. The hour or so cut content would explore the characters more deeply and elaborate on their stories.Still, the story that did survive is great and serves to whet your appetite and pique your interest. Can't wait for part 2.",
    "147": "From the poor world-building and lack of character backstory, to the ridiculous over-use of slow motion for something as simple as jumping up onto a ledge, over-reliance on cgi and dialogue that makes Star Wars look good by comparison, Rebel Moon is definitely nowhere near the quality I was expecting, given the hype behind it.I'm not sure exactly what Zack Snyder was trying to achieve here, but I think it's a big swing and a miss.Sure, it's visually pretty in a number of spots, but I'm trying really hard to care about any of the characters other than the farmer and the robot.The robot was by far the best character and was only in it for like 5 minutes.Part 2 is on the way, and maybe it can redeem this mess, but I'm already starting to forget what Part 1 is even about. Forgettable.",
    "148": "I cannot fathom why this is being rated so badly. I found it really refreshing to have a Star War esque, movie with a few adult themes rarely seen in main stream science fiction.Characters were all likeable and I can't wait to see where they take this next. As far as a \"setting the scene\" movie goes, it was brilliant! Visually epic, action packed, acting was good, storyline, although embryonic was intriguing.I feel like this has been rated badly just because people have a bee in their bonnets with Zack Synder.I think my only complaint would be that the ending of the movie kinda sneaked up out of nowhere. But, it still ended satisfactorily.All in all, a whole heap better than most of the recent Star Wars movies. I really hope the negative reception on here doesn't jeopardise future movies.",
    "149": "In the realm of science fiction, audiences have come to expect innovation, fresh ideas, and mind-bending concepts that challenge the boundaries of imagination. Unfortunately, the recently released film, Rebel Moon, falls short of these expectations, delivering a disappointing experience that struggles to breathe life into tired and clichéd sci-fi tropes.One of the most disheartening aspects of Rebel Moon is its lack of originality. While a few scattered sci-fi concepts manage to capture the audience's attention, the majority feel like tired reiterations of ideas that have been explored countless times before. The film's attempt to revisit these well-worn themes is not only uninspiring but also leaves the viewer yearning for something more substantial and thought-provoking.The narrative itself fails to offer a refreshing take on the genre. Rather than breaking new ground, it seems content to tread water in a sea of predictability. The storyline unfolds in a manner that feels all too familiar, with plot twists and turns that are telegraphed from a mile away. This lack of narrative innovation robs the film of any sense of excitement or intrigue, leaving the audience with a sense of déjà vu that is hard to shake.A critical flaw lies in the portrayal of the heroes/fighters encountered on this lackluster journey. Despite the potential for compelling character development and engaging story arcs, these figures are poorly executed and fail to elicit any genuine interest from the audience. Whether it's the unimpressive performances or the thinly written characters, there is an undeniable emptiness that pervades the film's roster of heroes. As a viewer, one can't help but feel disconnected and indifferent of their origins, which undermines any emotional investment in the overall narrative.Despite its shortcomings, it's important to acknowledge that Rebel Moon does have moments where it flirts with the potential for greatness. There are glimpses of creativity and inspiration that, unfortunately, never fully materialize into a cohesive and compelling whole. It's these fleeting moments that make the film's overall disappointment all the more palpable, as they serve as a constant reminder of the missed opportunities to elevate the narrative and captivate the audience.In conclusion, Rebel Moon ultimately falls short of its potential, offering a underwhelming and uninspiring journey through the well-trodden terrain of stale sci-fi tropes. While a handful of cool concepts manage to shine through the mediocrity, they are not enough to salvage a film that struggles to break free from the shackles of predictability and narrative fatigue. With its poorly portrayed heroes and fighters, and a narrative that fails to push the boundaries of the genre, Rebel Moon is a forgettable entry in the world of science fiction, leaving audiences longing for the innovation and excitement that the genre is known for."
}