{
    "0": "Profoundly deep, genuinely moving, utterly hilarious, highly imaginative and a visual feast. Haven't laughed this hard, cried this much or thought so deeply about any film in 2022 Much less all in the same viewing. This was indeed everything, everywhere all at once.",
    "1": "If you take drugs for the first time and imagined Jackie Chan was a female Dr. Strange in another universe this would be it. And the synopsis is basically an Asian woman trying to do her taxes. I thought the third act of the movie felt a little stretched out but otherwise I think it's the best movie I've seen all year because I haven't laughed this much in any recent one. From the short time I spent in China, it's also an accurate and hilarious view of Chinese parents 'cause they really do be like that. I can't recommend it enough, it's so chaotic and in the middle of all that managed to be heartfelt too. I thought it was gonna be a Dr Strange wannabe but it's unique on it's own and I'm glad it was released earlier so that people don't compare them. It was just four people (strangers) in the cinema, we were laughing our asses off and it made me sad because everyone deserves to see this. At a time when remakes and reboots are common place it's nice to have something like this, a breath of fresh air.",
    "2": "Everything Everywhere All At Once is even crazier than the trailer would lead one to believe. It's bursting with so many original, weird concepts and ideas that no serious storyteller in their right mind would ever dare to put in their movie. But Daniels did. And it works with spectacularly effective results.These filmmakers choose not only to put every bizarre idea they could think of into their movie, but they ensure that every oddity adds something to the thought-provoking, emotionally resonant themes that pervade the story. So many angles can be explored surrounding this story of emotional connection and the things that distract from it.As Evelyn connects with her alternate selves and alternate relatives, there is both envy of and pity toward them that is explored. It's such a cathartic experience to watch this woman discover what she truly wants from life and loves about her life.All of the beautiful themes and heartwarming character moments are just the tip of the iceberg here, though. This is one of the funniest movies I have ever seen.The Daniels lean into the absurdity of the world that they have created, always reaching for the most outlandish possibilities and never playing it safe. It makes for some truly outstanding visual gags that will never leave my mind., and it makes for the most unique viewing experience I have ever had in my life.This is a masterpiece of originality. There is not, nor will there ever be, a film quite like this one. And I cannot wait to watch it again and again and again.",
    "3": "There's a point here where we are swept up in sensory overload, where so much stuff is thrown at us that we tune it out. I reached a point about two-thirds through this where I couldn't get my mind back in it. Have we reached a point where we have no expectations of a conclusion. When one has someone playing multiple characters in multiple settings, there needs to be something tying it together. The protagonist needs to be someone we identify with who has wishes and hopes that lead us on. She seemed as confused as the storyteller and the husband. I guess I'll read some more about this film and hope with guidance to try to figure it out a bit. Obviously, all these universes and all this actions (way too much battling in my estimation) are leading somewhere. I thought the film had ended about six times. I don't mind being brought back in, but I wish I understood where we just landed. Yes, there is a lot going on and it is violently splashed on the screen. But I ended up exhausted and unsatisfied.",
    "4": "I don't mind weird films. Truly, I don't. But films that are pointlessly bizarre? Yeah, I'm not a fan of those. This is one such movie. I'd give it a pass if I were you.",
    "5": "Michelle Yeoh headlines this head trip into the multi-verse. The first part is slow going as this reality is not suggested in the previews and thus somewhat lulls the audience into expecting something different. But what makes this movie really work is its underlying storyline even as reading subtitles and trying to understand what is going on during the first half of the movie takes a bit of mental endurance. Allowing for that though, this movie bursts at the seams in being everything all at once, sequentially that is, in two-dimensions trying to project a four-dimensional reality and a multitude of parallel universes that all include Michelle Yeoh in some form or fashion. This movie definitely breaks through to a new level of sci fi visual delight and sophistication along with a strong storyline. Like Inception (2010), this is a breakthrough movie setting a higher bar of sci fi movies in the future.",
    "6": "This film almost unanimously received praise from both critics and audience alike. People even exaggeratedly rank it as one of the greatest films ever or the best they've ever seen. Going into this movie, my expectations were really high And I really wanted to be part of the majority who loves this movie. But unfortunately the opposite happened and I didnt like it. While I appreciate that this movie was made on a relatively small budget and managed to get some things right as it had so much potential with its strong female lead, philosophical component and some good action to move it along. But it fell really short. It is long and meandering. Visually confusing, thematically unoriginal. The first half was repetitive, boring and also quite silly. Half of the time I don't know what are they fighting for or what the heck is going on. And what was supposed to be the multiverse just felt like the characters were wearing silly different costumes. It is not until the last act that things of relevance happened. The performance from the cast was great though.",
    "7": "It was my brother who recommended I watch this movie. He said it's crazy, but every time he thought to stop watching it, something else would happen to hold his attention. That wasn't quite my experience although I did stick with it to the end. I was also reminded of an almost identical experience some 20 years or so ago when a friend took me along with him to see a film he was raving about, \"Crouching Tiger Hidden Dragon\" and that missed me by miles too when all that levitational martial-arts stuff started.Well, I couldn't get into \"Crouching...\" and I'm afraid it was the same for the sensory overload that was \"Everything Everywhere All At Once\". Go with the flow, sit back and let it happen is probably the best way to approach it but in the end, it was all too much for me.I sort of get the idea of multiple universes, where different versions of ourselves play out different destinies independent of what's actually happening to us in the here and now. Here though, the worlds are about to disastrously collide due to the emergence of an intergalactic super-criminal and it seems the first line of defence is Michelle Yeoh's unlikely middle-aged laundry owner Evelyn whose only concern when we first meet her is to get an almost unrecognisable Jamie-Lee Curtis's hulking auditor to sign off on the business's annual accounts and so keep her in business. Her dull husband then takes this moment to reveal that he's an alternative version of himself from what he calls the Alphaverse and that they are about to have the fight of their lives to try to thwart the approaching big bad super-villain whose identity I'll hold back from revealing.And that's your condensed plot. There are lots of characters straddling the universes you'd barely noticed earlier who suddenly drop back in and out of what I'll loosely call the narrative. Just when you think you've got a reasonable grip of one plot strand, it completely unravels and takes you in another direction.I certainly saw things I've never seen before or ever will again in a movie, including characters with hot-dog hands, a bagel as the centre of human knowledge, two inanimate rocks sharing a conversation and then there are the spoofs drawn from original features like \"2001\" and \"Ratatouille\" two films I didn't think I'd ever bracket in the same sentence.I also found the several attempts at humour to often be way too crude and vulgar for my taste, especially when you get two of the villains looking to boost their powers by sticking a sharp object up their behinds or another baddie getting knocked about by a set of male genitalia.Good luck to you if you managed to comprehend and actually enjoy this movie, but in the end I'm afraid it overpowered me into resistance. Maybe it was just some giant spoof of all those superhero blockbusters which have obsessed Hollywood for years. I don't know, but despite its successful box-office and the ratings here, I sort of wish that for two hours at least, I'd woken up in an alternative universe where I actually hadn't watched it at all.",
    "8": "Some people seem to really love this movie, and that's fine. I hated it though, I bailed after 30 mins and have no desire to see if it got any less bad.Annoying, hyperactive gibberish. Here's a clue - if you want to hook your audience in, don't spend the first half hour of the movie having your characters bicker with each other and then introduce nausea-inducing camera moves on top of that.Michelle Yeoh is a great actor, and this studio has put out some great movies. But I am totally at a loss as to why everyone is banging on about this irritating mess of a movie. It's the cinematic equivalent of having wasps fired at your eyes for 8 hours.",
    "9": "This might be the most accurately titled film I have ever seen. Afterwards, my wife asked me what it reminded me of. I was stumped. What genre was it? Hard to say. This is a movie that morphs from immigrant drama to sci fi to Kung Fu to comedy to existential art flick and back again. Then it does that loop again, faster and faster and faster, without ever losing the audience. I saw it in a packed theater, everyone laughing and crying and caring. Perhaps most amazingly, this was a pretty simple and effective relationship story through it all. I don't know if I would rather watch it again right now or watch a documentary about how the film took shape. Either way, I'm glad it exists. I lamented multiverse stories after the last MCU film, and I guess I have to take that back now. It is possible to tell wildly imaginative genre bending multiverse stories. You just don't need superheroes to do it (unless you count the Daniels).",
    "10": "I love many of these actors in the many roles I have seen them in, but this quirky, artsy, not very funny, hard-to-follow spectacle was not enjoyable at all for me :-( The artsy writer/director tries to mesh intellectual topics with quirky humor, and it just does not work for me! :-(",
    "11": "Non stop action and laughs the whole way through. Everything Everywhere All At Once is the movie that you need to see if you want a great cinematic experience. In my opinion I think this is as good possible better than No Way Home. I loved the acting in this as well.The way that the directors filmed this movie was also genius. The whole concept of the film was brilliant. Jamie Lee Curtis was also phenomenal as always. This film was just absolutely stunning to watch and to look at. Easily one of the best films of the year so far.",
    "12": "Ok, the movie contains a lot, a lot. It contains impressive action, drama, SF, humor as well as numerous incredible scenes and shots. I give him a big plus for his incredible originality and idea. However, for me personally, the film was a little too much, to put it that way. In the context of the Oscars, it's also incredible to me that the film picked up so many important awards. Is this the best movie of the year?! Reading numerous reviews and comments, it's clear to me that I'm in the minority and that's why I'm surprised by all the hype surrounding the film. For some, this is even one of the best films ever made. Due to these expectations, I have to admit that the film did not impress me at all. It's not a problem for me to admit that it's up to me and that I can't understand the magnitude of the film, which will obviously be a cult classic tomorrow. But I am surprised that such a strange film won over so many people.",
    "13": "Michelle Yeoh owns a failing laundromat with her nebbishy husband Ke Huy Quan, who has just served her with divorce papers. They are being audited by IRS agent Jamie Lee Curtis. Her father, James Hong, threw her out when she married, and is now her wheelchair-bound dependent. Her daughter, Stephanie Hsu, has a girlfriend, which she cannot explain to her father. Then, during a terrible session with Miss Curtis, Quan takes off his glasses and in an authoritative voice tells her that only she can save the multiverse; from this reality defined by all the bad choices ever made, she must tap the abilities of the versions of herself who are more successful than she is; this means every one of them. She is the worst version of herself. Naturally, she is confused, particularly when she discovers that the ultimate evil that threatens all realities is her daughter.It certainly gives Miss Yeoh a chance to stretch her acting muscles and the editing is wonderful. This sort of story is an enjoyable \"wheels of time\" story, and tackles the nihilism at the heart of the subgenre: if every decision you make was decided differently in another universe, what difference does it make?My cousin enjoyed most of it but thought the ending sentimental. I thought the sentimental ending was appropriate. What a pity the industry hasn't made better use of Miss Yeoh!",
    "14": "Did I watch a different movie? The entire beginning was a fast-paced convoluted mess of nonsense, that was also difficult to understand in between the fast subtitles and fast broken English. Sure, the story was unique, but all the attempt at humor was a fail, and thus made the story feel infantile. As for the acting, everyone was pretty much annoying except for Michelle Yeoh, of whom seemed to be the only one working her butt off. It's a very generous 6/10 from me.",
    "15": "I watch and re-watch a lot of movies per year as a hobby (no money involved), and today I have 9988 reviews in IMDb. Last month, I received an email from IMDb listing \"Everything Everywhere All at Once\" as one of the Top-10 movies of 2022. In IMDb, it is informed that this flick is nominated for 10 BAFTA Awards, 240 wins and 351 nominations. I can only understand that this is a heard behavior to the promotion of studio, using \"professional critics\" and press to promote such a garbage. I cannot envision a normal being, without financial interest or being manipulated by critics, to enjoy this crap. It seems to be a bad trip of the writers turned into a movie by insane productors. In the end, this film is 2h 19 min of complete waste of time. My vote is one (awful).Title (Brazil): \"Tudo em Todo Lugar ao Mesmo Tempo\" (\"Everything Everywhere All at Once\")",
    "16": "When I heard the buzz, saw the oscars etc., I expected this to be a great movie.Wrong!!! It was simply a below average foreign movie, complete with subtitles. I managed, with much squirming, watch checking etc., to get through 45 minutes.I guess its possible, the 2nd hour was equal to Shawshank or GWTW, but I doubt it. The acting was decent, but oscar worthy, not imho. I'm 76, and a movie-addict. So this movies rating, reviews were a real head scratcher. There have been foreign movies, I absolutely loved. But this one missed the mark, in so many ways. I will watch the second half, and if a miracle happens I will re-review.For now 3/10.",
    "17": "If you get weirded out just stay through til the end. It's worth it I promise. Thanks everyone who helped this movie be made. In a time when there's so many remakes and more of the same this is a wonderful original movie. Enjoy it.",
    "18": "Wild masterpiece that is a captivating deep adventure with so much all at once! Evelyn tries to file taxes then gets mixed into multiple universes of hundreds of events happening. This movie is metaphorical, realistic, bizarre numerous times, action greatness, family love, romance, comedy, ambiance some of the time, and some thrilling bits; Everything Everywhere All at Once has all the essentials for a magnificent experience! It's kinda like quantum physics adrenaline rush done very well.",
    "19": "This film wasn't for me. Weird for the sake of being weird. What it attempted to do was something that can't be done. Similar to TENANT, it's a concept of the intangibles with the overall theme of love falling flat because there's simply too much going on.Hence the name.It's well acted, well produced with amazing choreography but as a movie its just odd. Original yes, but odd and hard to become attached.",
    "20": "This depiction of multiverses addresses the meaning of life and nihilism, with the protagonist having to be multiple versions of herself. A lot of it goes by so fast that it's hard to process, but it always manages to be funny. Michelle Yeoh does a perfect job in the lead role, with support from Stephanie Hsu, Ke Huy Quan (of \"Indiana Jones and the Temple of Doom\" and \"The Goonies\"), Jamie Lee Curtis, Jenny Slate and Harry Shum Jr. (of \"Glee\").",
    "21": "Having seen countless raving reviews about this movie both on IMDb, and even more so on Twitter, I thought \"damn, I have to go see this ASAP\". I went in expecting something incredible, movie of the year standard, but wow was I disappointed.Literally 75% of the movie is fight scenes, like okay it was cool at the start but 2 hours in and still?? 'Everything Everywhere' is perfect for people with a short attention span because there's always something ridiculous going on. I understood what they were trying to do with the plot but honestly nothing stuck, it just felt shallow.Don't get me wrong it's not a bad film, but it's nowhere near these 10/10 reviews that's being advertised.",
    "22": "Well, where to start? I'm going to try to be fair with my review but quite honestly, it's going to be difficult not to be flippant. The film is currently a Top 250 IMDb picture with an 8.2 rating, and rarely do I stray too far from the generally considered opinion, but this was just a chore to sit through. Not only that, but if you fell asleep for any length of time before it was over it wouldn't have made any difference at all, you wouldn't have missed a beat. In fact, the first time I saw 'The End' pop up on screen, it would have been okay with me.What I can say perhaps in defense of the film is that it truly lives up to its name because it does try to be everything, everywhere, all at once. For me, not a good thing. It was as if you took any number of random ideas and concepts and threw them into a blender to see what came out. For example, green eggs and ham, Topo Gigio, e=mc squared, pineapple pizza, and squirrel nut zippers. See how easy it is? I can't tell you how many times I said to myself, 'Please God, let this be over'.I guess I'd have to give credit to the film makers at least for an ambitious editing job with the picture's all too frequent scene changes and skip jumps from one thing to another. But I can't help but feel that the sentimental ending was supposed to help you forget what you just went through. And oddly enough, I was able to follow the main story line well enough, but it took forever to make its point, which if I had to summarize, would be:Be kind - even if my review isn't.",
    "23": "It's very rare that I give a movie a full score. This is because when I look at my list later, I want full score movies to really mean something. \"Everything Everywhere All at Once\" was such a masterpiece, being both experimental yet grounded, absurdist yet profound. Everything about this film was amazing. The story. The performances. Even the metatextual casting of Michelle Yeoh is fascinating, since Michelle Yeoh is an actress that really has lived a million lives in her own multiverse. This film absolutely floored me.",
    "24": "I dont often give a film 10 stars, but this was superb. It was an intense and bizarre ride, with the strange concepts stretching so far out there at times, it was as though they made more sense. It was visually stunning, the costumes were epic, and the balance of humor and emotion was perfect. LOVED IT. No one else was meant for this role other than Michelle Yeoh. She brought the lead to life in the most beautiful, meaningful, perfect way. This whole movie was mind blowing.",
    "25": "Evelyn Wang (Michelle Yeoh), her husband Waymond Wang (Ke Huy Quan), and her father Gong Gong (James Hong) are meeting IRS agent Deirdre Beaubeirdre (Jamie Lee Curtis) for an audit of their business. She is also struggling with her daughter Joy (Stephanie Hsu) coming out of the closet, a possible divorce, and a disapproving father.This is imagination gone wild. The action is visually exuberant and shockingly comical. The sci-fi concepts are familiar and yet new. At its core, the story is personal and emotional. It's the same filmmaking team which brought us Swiss Army Man. Let's just say that they are unique in their cinematic visions and story ideas. At a certain point, the movie threatens to overload the audience with its imaginative visuals. That's when the story pulls back to the personal. It's definitely something different from the standard Hollywood fare.",
    "26": "Anybody who thinks this film is about multiverses really misses the point. The multiverses are simply metaphors for the more \"successful\" or exciting lives that we sometimes dream that we might have had. To quote the summarising lines \"Here all we get are a few specks of time where any of this actually makes any sense\". The reply is \"Then I will cherish those few specks of time\". So the meaning of life isn't about success or glamour or achievement. As the film says in life \"Nothing matters\" (or nothing really matters - like Freddy said!). So life is about relationships and those few \"specks of time\" when we share with others the magic moments that make the.golden memories that define our lives. Just a few magic specks of time.",
    "27": "At the risk of angering what seems to be the entire movie going populous, I'm just gonna say it - this movie is fine.Funny in places, exciting in places, pretty emotional in places. But can someone please explain why movies these days feel like they need to be so damn long? Seriously, this could have been 100 minutes, easily. It's way too indulgent. Scenes drag on and on and when they're over you're still no further to any semblance of plot clarity than you were 10 minutes earlier. It seems like they shot tonnes of footage and just wanted to include it all, without really embellishing the actual story. If the movie was more succinct and arrived more quickly at the overall point of the narrative, that being her connection with her daughter, I would have liked it a lot more.I just really don't understand why producers and writers are electing their films to be these immense lengths these days when they really don't need to be. No Way Home, Don't Look Up, Licorice Pizza, Drive My Car, all over 2 hours for no good reason.I really felt the length of this movie was to the detriment of the overall narrative and it disallowed me appreciating what the message was meant to be.That being said, the direction and editing was cool, acting was strong and the scene at the end with the daughter really did hit all the right notes. You could have trimmed a lot of fat off of this though and made it far stronger in my opinion.",
    "28": "Evelyn(Michelle Yeoh) a middle age woman who owns a laundry matt with her husband(Ke Huy Quan, The Goonies), and seems to be on the verge of a breakdown cause everything in her life is fallen apart, until her husband has a personality change when he claims to be from another universe, and tells her she is the key to saving the universe, and that is far is I go.Michelle Yeoh is a very talented actress, and here she shows all of her talents at once and does it quite beautifully. Ke Huy Quan is also great, has it starts you begin to think it's Data from The Goonies(1985), but you'll stop thinking that has the movie goes on, cause he shows how versatile he is. It's not just a sci - fi action film, it has a lot of heart to it. Also has great effects also, and not mention a great supporting cast, namely James Hong, Jamie Lee Curtis, and Jenny Slate.",
    "29": "Overall I really enjoyed EEAAO. There is an inexplicable draw that some of us feel towards oblivion and a sense of complete nothingness and this movie is pretty good at getting inside your head and taking you for the ride.While I enjoyed the humour, some of it I felt was way too absurd to even be funny. Those in particular being the sausage fingerverse and the butt plug kung-fu scene. These scenes and their attempts at being funny actually detatched me from the otherwise trippy experience of the movie.So overall an enjoyable and unique experience but this movie will definitely not be to everyones liking.EDIT (Post Oscars):\nAs much as I enjoyed this film, how it won the Best Movie Award at the Oscars is truly baffling.Are you really telling me that a movie featuring a fighting scene where one fighter tries to impale themseves on a butt plug, while another prevents them from doing so is the best movie of the year?They might as well just give the next Best Movie Award to the next Transformers or Fast And The Furious Movie and be done with it. The Oscars are a pathetic joke.",
    "30": "A lousy movie. The underlying themes are the best there are but are used in a way that is nothing short of shameful. Two and a half hours of pure dementia, arrogance and useless effects without any substance. I wonder how this film can be considered as the best of the first half of 2022. A waste of time, health, expectations and enthusiasm. Garbage.",
    "31": "Wow, what a movie. Being able to be so wacky yet so profound is difficult, but this movie is able to to do it all at once(no pun intended)! The main characters exploration of her relationships with her father, husband, and especially her daughter ground the movie, but it's willingness to turn the mundane what if scenarios that we make up in our heads into plot points is truly something special. While it drags on just a tad near the end, this movie is a must watch, and expect it to get some Oscar nods this coming year.",
    "32": "What a piece of junk. This whole thing is an excuse for a silly Kung Fu movie. One of the worst films I've seen, which took two and a half hours to prove it, with some stupid existential claptrap by the writers who must think that they're speaking genius philosophy. This is the kind of movie that certain people (and the Oscars) say is brilliant just to show how hip they are. I don't get the ridiculous sense of humor, the \"hot dog finger\" people, the bagels and worse, the happy face eyeballs. And of course we just had to have a lesbian subplot. Why, what film is complete without it! And the ever-so-apologetic filmmakers just had to remove the highly offensive but funny \"Big Nose\" from the credits. Wimps. This film actually would have worked better as a regular movie about laundromat owners. What a waste of brilliant special effects.",
    "33": "Basically, you go in willing to LISTEN to what is being said and follow along the glorious paths this movie takes you on, or you go in expecting everything to be spoon-fed to you in the way dumbed down scripts to other films now must stick to.You either get it, or you don't. I suggest that if you didn't, you try again, as this is one worth feeling.",
    "34": "Since the release of the trailer, my mother has been expecting Michelle Yeoh to fully demonstrate her capability as an actress while touring the psychedelic multiverse in Everything Everywhere All at Once. Turns out, this film, though garnished with fictional concepts, narrates the reconciliation of a family.Regarding costume design, special effects, and film editing, the movie has accomplished to the summit, which truly depicts the vastness and variations of universes. Rapid montage and transitions present how the protagonist experiences \"everything\", and quickly highlight the few worlds with their whimsical aspects. To understand the surreal illustration, imagine riding a roller coaster down a tunnel of black and white spirals, while having the Wachowski sisters blowing bubbles into your eyeballs. Personally, I really enjoyed the segment when two rocks conversed through literal texts, extremely amusing and creative. Talk about comedy, the film applied Asian stereotypes, understatements of crucial features, unexpected interventions, and erotic implications, which successfully detonated laughter.Embellished under such flamboyant set up, is the self-introspection of a typical middle-aged woman (performed by the amazing actress Michelle Yeoh): immigrant, minority, mother, wife, daughter, lower-middle class. All the disappointment and determination gave Evelyn resilience and optimism, which almost seem unrealistic in the face of taxes, business expansion, festival party, divorce contract, elder's critiques, child's displeasure, as her positive qualities start to fracture. Through living the lives of her better selves, Evelyn is slowly attracted to the bagel theory, that all are worthless in making regretful decisions, and are meant to self-destruct. However, unlike Jobu Tupaki, she has Mr. Wang, a mediocre, coward, and noisy husband, but constantly supporting the crumbling family with no complaint, and oriented to improve their marriage with an unspoken love. Finally, Evelyn realizes the necessity to heartfully accept her daughter, even though if it means to let go. Stephanie Hsu's impressive performance of an omniscient, unrestrained teenager who craves familial affection makes the idea further more convincing.This movie isn't perfect, because the director's immense elaboration of multiverse and cinematic allusions can't prolong thoroughly, creating artistry fatigue and disconnection to the main plot. Moreover, the resolution of conflict is quite cliche, especially in contrast to the innovative exposition.In all, an inventively aesthetic piece of work in recent times.",
    "35": "This was a long and unnecessarily complex film to get you the message that life and people are messy and you should accept them for who they are. I would have preferred a more straightforward story telling and I could have done without all of the body humor...putting things forcibly in one's anus, ball gag humor, hot dog fingers, eating buggers, etc. I didn't even find that type of humor amusing as a child.The only scene I even remotely enjoyed in this film was the straightforward scene towards the end of the film when Evelyn and Waymond are not together and he explains that he knows she thinks he is weak, but he is fighting in a different way, with kindness. That short but sweet moment is in my opinion, the only redeeming aspect of this film.I have heard some reviewers rave about how this was like the best acid trip...I can't comment on that since I have never done acid and I have no intention of ever trying it, especially since as a healthcare worker I know and understand the very real dangers of doing acid. I will say that I do not watch films to experience an acid trip, I watch films to be entertained and preferably with a good story.This story essentially boils down to a struggling small business owner (laundromat), is being audited by the IRS, not having a good relationship with her husband who has decided to ask for a divorce hoping to just get her to talk about their marriage, and she has a struggling gay daughter who she is avoiding telling her father who didn't accept her marital decision about. Suddenly ta-da, she discovers that there are all these other universes that are populated with other versions of her that made different choices...like didn't marry her husband and didn't move to America. Also, she is the only person uniquely qualified to save this multiverse by tapping into skills from other universes versions. And she is saving it from the big bad who turns out to be her daughter who she created....and her \"everything bagel\".I'd say it was ridiculous, but not once did I laugh and I kind of agree with the viewers who said when they saw \"the end\" on the screen for the first time that would have been happy if that was truly the end.I am sorry. I love both Michelle Yeoh AND Jamie Lee Curtis and would really like to support films anchored by strong female characters...but this film isn't one I can get behind. (Although the message, about being kind and accepting...l am 100% behind! If you can choose to do one thing, be kind is my motto.) Along that line, I think it would be kind to recommend a different film with a \"be kind\" message...how about \"It's a Wonderful Life\".",
    "36": "Because it had won best picture, I felt obligated to watch. The start of the movie, the scene in the apartment above the laundromat, was chaotic to the point of making me uneasy and anxious. About 40 minutes in, I literally wondered if viewers were supposed to be high to enjoy it. It didn't evoke any emotions in me, however, at times I did laugh - not with the movie, but at the movie.Once I commit to watching a movie, I see it through to the end, hoping it will improve and I ultimately become invested in its resolution. But you know a movie is total trash when someone in this household says, \"let it play,\" before leaving the room. It was a colossal waste of time.",
    "37": "This is a very dense film, and I mean that in a good way. There is so much going on, but at the core are silliness and profundity. Trying to explain the concept or the plot would be a disservice to potential viewers.But I will say that, for me, it feels like a cross between \"The Matrix\", \"Moulin Rouge\", \"2001: A Space Odyssey\", and a Rorschach test. I suspect other viewers will perceive a diverse array of cinematic influences and be reminded of many other references.One could watch this film many times and still be able to note new details. I marvel at how much work was involved, especially in editing.",
    "38": "Unlimited, perpetual, eternal; fantastic stories you can write in a future journal, don't be limited by your mind, just be honest, fair and kind, break down boundaries, maybe work in laundries, but don't be blind!Fantastically imaginative, original and inspired - just like our own potential that we so often neglect and ignore.",
    "39": "Whoa! This movie blew me away. I haven't seen a film this original in at least the past 5 years, and could possibly be the most original in the past decade. Brilliant film. Michelle Yeoh is phenomenal as is her supporting cast. She is going to be a frontrunner for Best Actress at every awards show for this coming year and she would deserve to win it. I can't quite put into words how well done this movie is, but it is magnificent. Easily won it's way into my top 10 best movies of all time list and top 5 most important movies of all time list. I refuse to put anything about the story in my review as I feel it's a movie that just needs to be experience. I laughed, I cried, I loved, this movie really does have it all. 5 out of 5, just freaking see this film! You will not be disappointed you did!",
    "40": "To be honest I don't know what the hell I just watched. Bland family drama, comedy, action, science fiction, all haphazardly mashed together into a +2 hours senseless new-agey blob.The family drama which runs at the core of the movie feels strangely forced, specially in the third act which drags on forever. Most jokes are genuinely funny at first, but some of them are dragged for way too long and stretched thin and a few others are bordering cringe territory. Spends an unnecessary amount of time explaining the multiverse concept that drives the comedic/action parts. Character development is basically absent.On the bright side, action scenes are well choreographed and imaginative. If you want some wild, absurd, flashy action mixed with cheap tear-jerking, go see this.",
    "41": "This movie was supposed to be the best ever, but it just freaked me out. The movie is all over the place and the depth it could have had is ruined by randomness, absurd humor and pretenciousness. In one of the scenes the characters suddenly have sausages instead of fingers and they make a pretensious referance to A space odyssey where the pre human apes fight with sausage fingers. Maybe that's just humourous and well meant, but I could hardly watch. It's impossible to tell if this movie is a comedy or an action movie or a deep drama and if such confusion is your thing, then maybe you would love it. I could barely stand it.",
    "42": "I can and do appreciate randomness in a comedic way, but this movies was lacking a story which made it just really annoying to watch. If I had to describe the movie: you know that one kid in your class who took taking high as a personality and thought being funny by saying totally arbitrary things, that kid would be less annoying than this movie. Just felt uncomplete and overdid the one concpted. Recently watched Monthy Python and that really shows how random can be funny, idem dito for the shows like adventure time. The weird things are funny, unique and sometimes cleverly found. This was just weird writing to be weird. Most critics and reviewer seem to describe this as genius, for me this was just a waste of my time and struggled with keeping attention. I do believe there are ways to make this movie good, but this just felt so artificially made and lacking. Would recommend everybody to skip this one, except if your somehow in a really quirky mood and you are easily enjoyed by 'random' things. The cinematography and action was actually pretty nice, but that was just a hard pill to swallow with all the \"weirdness\" the movie tried to push through my throat. Especially some scenes were beautiful comprised, kudos to that, but sadly a loss due to entirety of the movie.",
    "43": "I've been looking forward to this movie since so many people and critics, whose opinions I trust think this is such a great piece of art. While I did laugh a few times, and can give it a six out of 10 because the acting is really nice, the story is just...... How do I put this... Too hard to follow... With some of the best parts being meaningless to the overall plot... Which, based on the way that it ended, apparently everything all together, and all at once was meaningless to the story based on the way it ended . If you dig kung fu and fight scenes, or somehow feel a multiverse connection because of superhero movies you have enjoyed, you may not come away from this with as sour a taste as me. But when the most profound scene includes two rocks conversing...",
    "44": "Wow, what a movie. Being able to be so wacky yet so profound is difficult, but this movie is able to to do it all at once(no pun intended)! The main characters exploration of her relationships with her father, husband, and especially her daughter ground the movie, but it's willingness to turn the mundane what if scenarios that we make up in our heads into plot points is truly something special. While it drags on just a tad near the end, this movie is a must watch, and expect it to get some Oscar nods this coming year.",
    "45": "What a piece of junk. This whole thing is an excuse for a silly Kung Fu movie. One of the worst films I've seen, which took two and a half hours to prove it, with some stupid existential claptrap by the writers who must think that they're speaking genius philosophy. This is the kind of movie that certain people (and the Oscars) say is brilliant just to show how hip they are. I don't get the ridiculous sense of humor, the \"hot dog finger\" people, the bagels and worse, the happy face eyeballs. And of course we just had to have a lesbian subplot. Why, what film is complete without it! And the ever-so-apologetic filmmakers just had to remove the highly offensive but funny \"Big Nose\" from the credits. Wimps. This film actually would have worked better as a regular movie about laundromat owners. What a waste of brilliant special effects.",
    "46": "Basically, you go in willing to LISTEN to what is being said and follow along the glorious paths this movie takes you on, or you go in expecting everything to be spoon-fed to you in the way dumbed down scripts to other films now must stick to.You either get it, or you don't. I suggest that if you didn't, you try again, as this is one worth feeling.",
    "47": "Since the release of the trailer, my mother has been expecting Michelle Yeoh to fully demonstrate her capability as an actress while touring the psychedelic multiverse in Everything Everywhere All at Once. Turns out, this film, though garnished with fictional concepts, narrates the reconciliation of a family.Regarding costume design, special effects, and film editing, the movie has accomplished to the summit, which truly depicts the vastness and variations of universes. Rapid montage and transitions present how the protagonist experiences \"everything\", and quickly highlight the few worlds with their whimsical aspects. To understand the surreal illustration, imagine riding a roller coaster down a tunnel of black and white spirals, while having the Wachowski sisters blowing bubbles into your eyeballs. Personally, I really enjoyed the segment when two rocks conversed through literal texts, extremely amusing and creative. Talk about comedy, the film applied Asian stereotypes, understatements of crucial features, unexpected interventions, and erotic implications, which successfully detonated laughter.Embellished under such flamboyant set up, is the self-introspection of a typical middle-aged woman (performed by the amazing actress Michelle Yeoh): immigrant, minority, mother, wife, daughter, lower-middle class. All the disappointment and determination gave Evelyn resilience and optimism, which almost seem unrealistic in the face of taxes, business expansion, festival party, divorce contract, elder's critiques, child's displeasure, as her positive qualities start to fracture. Through living the lives of her better selves, Evelyn is slowly attracted to the bagel theory, that all are worthless in making regretful decisions, and are meant to self-destruct. However, unlike Jobu Tupaki, she has Mr. Wang, a mediocre, coward, and noisy husband, but constantly supporting the crumbling family with no complaint, and oriented to improve their marriage with an unspoken love. Finally, Evelyn realizes the necessity to heartfully accept her daughter, even though if it means to let go. Stephanie Hsu's impressive performance of an omniscient, unrestrained teenager who craves familial affection makes the idea further more convincing.This movie isn't perfect, because the director's immense elaboration of multiverse and cinematic allusions can't prolong thoroughly, creating artistry fatigue and disconnection to the main plot. Moreover, the resolution of conflict is quite cliche, especially in contrast to the innovative exposition.In all, an inventively aesthetic piece of work in recent times.",
    "48": "This was a long and unnecessarily complex film to get you the message that life and people are messy and you should accept them for who they are. I would have preferred a more straightforward story telling and I could have done without all of the body humor...putting things forcibly in one's anus, ball gag humor, hot dog fingers, eating buggers, etc. I didn't even find that type of humor amusing as a child.The only scene I even remotely enjoyed in this film was the straightforward scene towards the end of the film when Evelyn and Waymond are not together and he explains that he knows she thinks he is weak, but he is fighting in a different way, with kindness. That short but sweet moment is in my opinion, the only redeeming aspect of this film.I have heard some reviewers rave about how this was like the best acid trip...I can't comment on that since I have never done acid and I have no intention of ever trying it, especially since as a healthcare worker I know and understand the very real dangers of doing acid. I will say that I do not watch films to experience an acid trip, I watch films to be entertained and preferably with a good story.This story essentially boils down to a struggling small business owner (laundromat), is being audited by the IRS, not having a good relationship with her husband who has decided to ask for a divorce hoping to just get her to talk about their marriage, and she has a struggling gay daughter who she is avoiding telling her father who didn't accept her marital decision about. Suddenly ta-da, she discovers that there are all these other universes that are populated with other versions of her that made different choices...like didn't marry her husband and didn't move to America. Also, she is the only person uniquely qualified to save this multiverse by tapping into skills from other universes versions. And she is saving it from the big bad who turns out to be her daughter who she created....and her \"everything bagel\".I'd say it was ridiculous, but not once did I laugh and I kind of agree with the viewers who said when they saw \"the end\" on the screen for the first time that would have been happy if that was truly the end.I am sorry. I love both Michelle Yeoh AND Jamie Lee Curtis and would really like to support films anchored by strong female characters...but this film isn't one I can get behind. (Although the message, about being kind and accepting...l am 100% behind! If you can choose to do one thing, be kind is my motto.) Along that line, I think it would be kind to recommend a different film with a \"be kind\" message...how about \"It's a Wonderful Life\".",
    "49": "Because it had won best picture, I felt obligated to watch. The start of the movie, the scene in the apartment above the laundromat, was chaotic to the point of making me uneasy and anxious. About 40 minutes in, I literally wondered if viewers were supposed to be high to enjoy it. It didn't evoke any emotions in me, however, at times I did laugh - not with the movie, but at the movie.Once I commit to watching a movie, I see it through to the end, hoping it will improve and I ultimately become invested in its resolution. But you know a movie is total trash when someone in this household says, \"let it play,\" before leaving the room. It was a colossal waste of time.",
    "50": "This is a very dense film, and I mean that in a good way. There is so much going on, but at the core are silliness and profundity. Trying to explain the concept or the plot would be a disservice to potential viewers.But I will say that, for me, it feels like a cross between \"The Matrix\", \"Moulin Rouge\", \"2001: A Space Odyssey\", and a Rorschach test. I suspect other viewers will perceive a diverse array of cinematic influences and be reminded of many other references.One could watch this film many times and still be able to note new details. I marvel at how much work was involved, especially in editing.",
    "51": "Unlimited, perpetual, eternal; fantastic stories you can write in a future journal, don't be limited by your mind, just be honest, fair and kind, break down boundaries, maybe work in laundries, but don't be blind!Fantastically imaginative, original and inspired - just like our own potential that we so often neglect and ignore.",
    "52": "Whoa! This movie blew me away. I haven't seen a film this original in at least the past 5 years, and could possibly be the most original in the past decade. Brilliant film. Michelle Yeoh is phenomenal as is her supporting cast. She is going to be a frontrunner for Best Actress at every awards show for this coming year and she would deserve to win it. I can't quite put into words how well done this movie is, but it is magnificent. Easily won it's way into my top 10 best movies of all time list and top 5 most important movies of all time list. I refuse to put anything about the story in my review as I feel it's a movie that just needs to be experience. I laughed, I cried, I loved, this movie really does have it all. 5 out of 5, just freaking see this film! You will not be disappointed you did!",
    "53": "To be honest I don't know what the hell I just watched. Bland family drama, comedy, action, science fiction, all haphazardly mashed together into a +2 hours senseless new-agey blob.The family drama which runs at the core of the movie feels strangely forced, specially in the third act which drags on forever. Most jokes are genuinely funny at first, but some of them are dragged for way too long and stretched thin and a few others are bordering cringe territory. Spends an unnecessary amount of time explaining the multiverse concept that drives the comedic/action parts. Character development is basically absent.On the bright side, action scenes are well choreographed and imaginative. If you want some wild, absurd, flashy action mixed with cheap tear-jerking, go see this.",
    "54": "This movie was supposed to be the best ever, but it just freaked me out. The movie is all over the place and the depth it could have had is ruined by randomness, absurd humor and pretenciousness. In one of the scenes the characters suddenly have sausages instead of fingers and they make a pretensious referance to A space odyssey where the pre human apes fight with sausage fingers. Maybe that's just humourous and well meant, but I could hardly watch. It's impossible to tell if this movie is a comedy or an action movie or a deep drama and if such confusion is your thing, then maybe you would love it. I could barely stand it.",
    "55": "I can and do appreciate randomness in a comedic way, but this movies was lacking a story which made it just really annoying to watch. If I had to describe the movie: you know that one kid in your class who took taking high as a personality and thought being funny by saying totally arbitrary things, that kid would be less annoying than this movie. Just felt uncomplete and overdid the one concpted. Recently watched Monthy Python and that really shows how random can be funny, idem dito for the shows like adventure time. The weird things are funny, unique and sometimes cleverly found. This was just weird writing to be weird. Most critics and reviewer seem to describe this as genius, for me this was just a waste of my time and struggled with keeping attention. I do believe there are ways to make this movie good, but this just felt so artificially made and lacking. Would recommend everybody to skip this one, except if your somehow in a really quirky mood and you are easily enjoyed by 'random' things. The cinematography and action was actually pretty nice, but that was just a hard pill to swallow with all the \"weirdness\" the movie tried to push through my throat. Especially some scenes were beautiful comprised, kudos to that, but sadly a loss due to entirety of the movie.",
    "56": "I've been looking forward to this movie since so many people and critics, whose opinions I trust think this is such a great piece of art. While I did laugh a few times, and can give it a six out of 10 because the acting is really nice, the story is just...... How do I put this... Too hard to follow... With some of the best parts being meaningless to the overall plot... Which, based on the way that it ended, apparently everything all together, and all at once was meaningless to the story based on the way it ended . If you dig kung fu and fight scenes, or somehow feel a multiverse connection because of superhero movies you have enjoyed, you may not come away from this with as sour a taste as me. But when the most profound scene includes two rocks conversing...",
    "57": "I saw Everything Everywhere All at Once, starring Michelle Yeoh-Shang_Chi and the Legend of the Ten Rings, Crouching Tiger,Hidden Dragon; Stephanie Hsu-The Marvelous Mrs. Maisel_tv, Shang_Chi and the Legend of the Ten Rings; Ke Huy Quan-Encino Man, Indiana Jones and the Temple of Doom and Jamie Lee Curtis-the Halloween movies, True Lies.This is one of the weirdest-but in a good way-movies you will probably ever see. Think of a trippy Matrix and you come close. Michelle and Ke are Chinese immigrants that run a laundromat with their daughter, Stephanie. They go to pay their taxes and Jamie is their IRS agent trying to make heads or tails of their receipts. That's when things go bonkers. Ke tells Michelle that he is from another world and needs her help to defeat a chaos agent that is trying to destroy everything. It takes quite a bit of convincing before Michelle can believe him but when she does, she discovers that she can access her other selves from the multiverse as well as their abilities. This leads to lots of exciting battles and a big helping of comedy. An example of weirdness; On one world, the people have hot dogs as fingers-they have adjusted by learning to use their feet more. By visiting these other universes, Michelle sees different lives that she could have led if she took a different path but basically, it's about relationships with her father, husband and daughter. Oh yeah, Michelle is not the only one that can access other versions of themselves and their abilities. The movie is also divided into 3 parts; Part 1 is Everything, Part 2 is Everywhere and Part 3 is All at Once.It's rated R for violence, language and sexual content-no nudity-and has a running time of 2 hours & 19 minutes.If you are looking for something a little different, this one is for you. I enjoyed it and would buy it on Blu_Ray.",
    "58": "This movie wasn't bad, but it's definitely not over a 7 rating. It has to have a good ending for me to rate it higher. I was hoping for a more complex ending with the story being so original, but it was just meh. Kinda ruins it. Story originality/acting is a 10, but the ending is a 1 for me.It's a bit too long for me as well. Unless I missed a deeper meaning to it I won't be watching again. For me it was a goofy/original film with a simp ending. Some scenes were kinda cringe too, but that's what they were going for.It's a must watch if your a Yeoh fan, she was amazing in this.",
    "59": "This movie wont be for everyone. For all of you, this might be a crazy chaotic mess of things going on. That might not mean you wont like it, just take it for what it is and enjoy. But if you end up being confused by it all... well, don't say I did not warn you! LolBut for those that do know what this movie is about, where they draw their inspiration, you know this movie is awesome!This movie has so much going on that its definitely worth watching more then once. Much like where it comes from, it takes time to unpack it. So expect to revisit this movie again if you plan to watch it the first time.",
    "60": "\"Everything Everywhere All at Once\" is a nearly impossible film to describe. Suffice to say, the plot is very weird and existential...and defies my ability to explain it. In other words, just see the film and have no expectations regarding the story. Suffice to say the story is bizarre and is a combination of drama, comedy and sci-fi/fantasy. Whether you love it or not will really depend on your willingness to watch the film without trying to think about the plot too much. If you think too much, you may find yourself bogged down by details or a desire to make sense of everything...and I highly recommend against this.While I did not love this film enough to imagine it receiving so many Oscars, I must admit that the acting was exceptional. My only complaint is that although Jamie Lee Curtis was fine in the movie, I think Stephanie Hsu (who also was nominated) seemed more deserving of the Best Supporting Actress award. My assumption is that Curtis' was more a career achievement award, like John Wayne's for \"True Grit\".",
    "61": "This movie is quite literally everything. A little romantic, a little endearing, hilarious, absurd, absurd again, brilliant, exciting -- all the things.It's Lucy meets Ligion with a hint of The Matrix and some Shaolin.This movie will blow your mind, and have you shift from laughing to crying from one scene to the next. It's beautiful and remarkable and incredibly memorable.I could not endorse this movie more.98%",
    "62": "You see people say things like \"a once in a lifetime movie\" or \"run, don't walk to the theater!\" and it's easy to dismiss because they seem sensationalized. This was the first movie I have seen in a LONG time where I don't think that's an exaggeration. Sweet, sad, touching, hilarious, crazy, doesn't even begin to describe this one. Wonderful performances and the runtime flew by. Entertaining from beginning to end. I'm trying to avoid saying much, because I'd hate to ruin anything for you. Just go see it.",
    "63": "I wish I could lend my eyes and ears and my mind to the ones who didn't quite grasp this movie so they too could see how every single scene in it is a marvel.One guy in a review below misses the entire point while debating the complexities of a multiverse. How do you explain a movie ike this to someone like that? You can't.",
    "64": "The title of co-directors Daniel Kwon and Scheinert's 'Everything Everywhere All at Once' will aptly clue you in to this head-scratcher you're in store for. Indeed if you may have seen this movie's old long-lost Uncle entitled 'Adventures of Buckeroo Bonzai into the 8th Dimension, you know what kind of zaniness the directors and story-tellers are going for. This is concept movie that kinda wears out for a lack of focus probably purposely. By the last 20 minutes I'd lost interest and was fast-forwarding. I liked seeing 'Short Stuff' back in a co-leading role, and Michelle Yeoh did everything asked of her, but the movie is like weird dream - the ones you don't remember after 3 min waking up.",
    "65": "This one is a meh film, someone's alternate idea of multi-verse sci-fi and \"how do we script things to get Michelle Yeoh doing martial arts again\" ? A long, long way to push a theme about LGBT acceptance. The anal plugs and dildos were just odd and a strange inclusion. Some of the characters were outright annoying such as the daughter and the various minions. The hubby was OK as he smoothly switched personalities. Good old James Hong still with us, always recall him as \"hey that guy...\". Jamie Lee Curtis is fine as the IRS Auditor hamming it up. And Yeoh going through the paces, looks like a bit of a payday for her. All in all certainly not one of the better films of the year.",
    "66": "Maybe I'm missing something obvious but I thought this was a load of rubbish. I read the reviews before watching and say everyone raving about how great it was. What I saw was the bizarre storyline, characters jumping into parallel universes that were just weird. People in other worlds with hotdogs for fingers, talking rocks or someone with a talking racoon on his head gives you an idea how bizarre it is. The cinema was pretty empty anyway but 6 people walked out after about an hour, that again tells you everything. I stayed hoping it would improve and it didn't. Unless you like these Matrix style, alternate universe style films I would't waste your time.",
    "67": "For me, definitely movie of the year so far. I would be surprised if this doesn't get nominated for the Oscar.The story is very complex and hard to explain. In essence, it's a solid take on nihilism with the recently popularized concept of multiverse due to some MCU films. Our main character Evenlyn (played by Michelle Yeoh) tries to save the \"world\" using various abilities that she picked up from different versions of herself in different universes.Technique wise, this movie was flawless. Very trippy visual effects scenes were everywhere that made the movie feel like a long acid trip. Music was also great. Editing also made the film digestible despite telling a complex story, jumping between different universes.However, at its core, \"Everything Everywhere All at Once\" is a portrayal of family drama, with a spice of multiverse. To quote NYT, it's a \"bittersweet domestic drama, a marital comedy, a story of immigrant striving and a hurt-filled ballad of mother-daughter love\". The struggles that they face are actually very common, especially within the Asian immigrant community. The movie actually portrayed Asian immigrants VERY well, partially informed by myself being one. It portrays complex emotions such as Evelyn's regret and nostalgia for the choice she made to leave her home country, in a refreshing manner. I resonated a lot with that and wanting to be a different person with a different life. The clash between different generations in sensitive topics like sexuality was also explored particularly well. What most stood out to me was the portrayal of the mother-daughter relationship. While I am not a daughter myself, their conflict and love were so well portrayed - sort of a love-hate relationship that spans the entire multiverse. Acting for all the characters were phenomenal. Jamie Lee Curtis popped off too.I guess what I got for this beautiful mess of a movie was this. Every decision at every moment is universes colliding. We can do whatever we want within the multiverse but we chose to be at this point in time in this space with the person we love. Because nothing matters and there are infinite universes, we should be loving and accepting one another. This is a take on nihilism that I personally vibe with so I think it moved me more too.All in all, amazing film. Recommended for EVERYONE. At Once.**I regret not writing this review sooner. I've been procrastinating on it. There are a lot of details and quirks that I wish I documented more to write a better review but maybe I will view it a second time if it ever comes out on streaming.",
    "68": "Wow, what an experience. Everything Everywhere All at Once is a genre-defining masterpiece. I haven't been this in awe of a film in a long time. It mixes so many disparate elements together to create a kaleidoscope of profound commentary on the world we live in.The mix of martial arts, absurdism, comedy, and family drama makes this a truly original film. I went from laughing out loud at one moment to having tears in my eyes in the next. The mixing of this is so seamless. The script is razor sharp and everything that happens occurs for a reason that is later explained and leaves you in awe. Michelle Yeoh is outstanding and should get serious awards consideration. This film should be the absolute frontrunner for Best Picture and I really hope it wins.",
    "69": "With all the buzz around this movie I expected something bonkers, creative, refreshening, new. And well, it was nothing of that.First let's start by the most obvious and what apparently people do not understand - this is not a movie about the multiverse and alternate realities. This is a movie about the joy of family and being together. All the alternate realities are just an allegory and I think clearly in the protagonist head, a way to cope with her sad life. It helps her remember that relationships, her husband, her daughter, her father - that's what is important in life and moments of kindness.This is the whole story. A nice message but really not very original.And regarding the \"bonkers\" moments and aspects - there was nothing I had not already seen in another movie.Sorry did not work for me.",
    "70": "What makes this film exciting is not its premise, but its execution. Each scene demonstrates the creativity and silliness of the filmmakers, as well as the talent of the actors to pull off such caricatures. The cherry on top is the beautiful message of the film; it somehow grabs you and doesn't let go.",
    "71": "So, first. It doesn't deserve a rating above 7 (I gave it 6). The story is not great and a bit immature, the characters are 2 dimensional with (ironically) no character development. It's not really a deep film even though the underlying theme is the importance of love and helping each other.Yes, there are special effects, and it type of fits in the genre of super hero action films, but the story makes jokes around taxes, and has strong mother/daughter relationships theme as well as making a comment about accepting lesbianism (despite tradition), and accepting yourself even if you are rubbish at everything. So it covers allot of ethical ground.Given that there are people with hot dogs for fingers, a world with talking rocks (with googley eyes) as well as a bagel that's looked at with religious fervour, you can see why such scenes are reminiscent of Monty Python. However, it's not really a comedy, just flipant light hearted crazyness.Was it fun? Yes, but story wasn't great and to be honest the film is easily missable. Probably Michelle Yeoh's worst film, through no fault of her own. Will you regret watching it? Maybe not if you are not expecting something truly emotional or serious. Of course effects were good.. and I guess that's the point and the level it's pitched at.So, don't watch if you want something mature, but feel free to watch it if you are a teenager looking for something fun/light-hearted. I'd say for kids under 14 there's a bit where daughter is beating someone bloody with huge rubber dildos and plenty of fighting (but not gruesome), so wouldn't recommend for lower than 14.",
    "72": "This movie is on par with \"The Matrix\" for offering a mind-blowing plot with terrific special effects. I won't go into the plot much cause I feel like you need to go into this movie as blind as possible. Don't let the first twenty minutes fool you, it seems like a sappy drama about a down-on-their-luck family at first, but it quickly heats up and will leave you completely stunned.The special effects and the choreography and the acting: all terrific. Michelle Yeoh, Stephanie Hsu, Ke Huy Quan, James Hong, Jamie Lee Curtis. All amazing here.Do yourself a favor and check this one out. It's already received rave reviews among critics and on this site, and I have no doubt that it will receive a lot of gold at awards ceremonies next year.",
    "73": "Essentially an hallucinogenic king fu style action film with a sci- fi subtext that features some funny bits and cool effects that's good for most of the movie despite having a full running length of nearly two and a half hours. Grasshopper, meet Buck Rogers for a mostly creative although ultimately slightly exhausting excursion into a series of interplays among simultaneous time portals where flaccid as well as more substantive marital aids, along with a lot of other stuff, is weaponized, only to be wrapped up within a typically melodramatic family style conclusion, like an Asian Hallmark flick on acid. Of course, the inclusion of minorities and a gay family member no doubt bolstered this film as a winner at the Oscars, and there were probably some other popular trendy cultural variations tossed in at rapid speed that escaped my view. This flick is a visually intriguing and well acted update on the martial arts genre that will likely get its creators audited.",
    "74": "This movie was awful man... I gotta say i just watched it and couldn't even get halfway through it.... none of it makes sense it's boring it attempts to make incredibly stale moments suspenseful by playing crazy music super loud for like 3 seconds for no reason and then it'll just be them looking at one another threw the security cam or from across the room. What an original story about a Failing Laundromat and having a Lesbian daughter . Watching this film might be what it's like if a person was secretly slipped a hit of acid at a party or worse, at just some random point in their life and not told anything about what is about to happen to them.Instead of enjoying the ride, I was aggravated at the lack of a storyline. What happens next is just as broken and detached as what has been happening throughout all the previous scenes. If you get that much out of it then yeah, you're probably halfway there...I think.So if you're hoping for any consistency or something remotely comprehendible, be warned there aren't going to be any guardrails to grab onto here. You might as well accept that you will be consistently confused and possibly as upset as I was by the violence, but seemingly violence without much in the way of any purpose or meaning. Violence for violence sake? I don't know, didn't get it and now...I no longer care.WARNING: Among the bizzarro content (which constitutes the entire film) you'll be thoroughly molested both intellectually and sexually by radical butt plug action on par with the most violent fisting episode ever imaginable. Better think twice before bringing children of any age to view this disgusting.If this sort of thing appeals to you, knock yourself out. I'm a firm believer that there is a movie out there for just about everyone. This one should bring total satisfaction to those who have fully hated all the films I ever saw and could actually enjoy.I hated this movie. The dialog was juvenile, the cinematography sucked, the story was asinine and the acting was so bad.",
    "75": "The rocks were good as was the IRS lady (Jamie Lee Curtis) - needed more of them. Otherwise it's The Matrix mixed with The Three Stooges and Meow Wolf. A nice try but a bit of a mess.",
    "76": "I don't ever write reviews but this one needed one. 10/10 perfect like omg, compared to the trash that has been releasing lately this movie is a movie of the decade.",
    "77": "This movie deserves everything that came to it and everything that's coming too. It's many layers uncover and re-cover its characters arcs along it's full running time. If you're tuned into it, it will weave an ultimate message of \"you don't know what you have till it's gone\" that even at the end leaves you with many questions as to the next chapter of their story.It's a great concept and the visuals, whilst loaded with both CG and clever camera work. Always seem rooted in the universe the movie gradually creates.What is needed to watch this movie is a willing suspension of disbelief. Don't try to hard to understand it. As I think this will end up being the case if you just let it kinda wash over you.The cast are excellent. Perfectly selected and directed and play the movie out to its conclusion without missing a beat.",
    "78": "Sometimes a movie comes along that reminds us why movies exist. They reach us like no other medium.It's not to say other films don't do that but just when you think there is nothing left that can surprise you it happens. The Daniels as they are called have incrediable insight,vision and heart. They esembled just the right team of actors and other craftsmen(and women).The journey is about discovering what matters .The journey is elaborate and surprising but the lessons learned here are the most basic ones of what matters. Kindness especially when we don't understand. Learning to be understanding and not worry about things that don't matter so much. Bridging the generations and the people with think are out enemies or opponets. I laughed out loud and teared up .I was unsure at times but often smiling too. What an amazing expereince to watch. What a gift to share with the world. I am so thankful we have these incrediable artist that share their gifts with us to enrich our lives.",
    "79": "Just because of how it made me feel. I'm not going to belittle it by trying to encapsulate it here. Such a great movie for so many reasons. Just go see it. Get ready to be intrigued, laugh until you can't laugh anymore, cry because of the beauty of it all, and then question existence on a cosmic level. Just get ready!",
    "80": "I'd say just go see this movie with as little information as possible. One of the most creative and insane films I've seen. Emotional and very intelligent.An Instant Masterpiece!",
    "81": "It's hard to criticize this film cause it works as a an insane story, in an insane world, and is obviously appreciated by many people.Strange how it was like a rollercoaster ride but also really boring at the same time, with no real purpose beyond 'be kind', and 'accept people'. Both nice themes but paper-thin to sustain a 2+ hour movie.There's a superficial level of excitement, a key element of the plot is 'do random stuff' and that's okay, but beyond that there's not much more. It just depends on how you like your entertainment.",
    "82": "Im embarrassed for Hollywood. Not criticizing the actors, Im sure they are good- but Im not going to pretend this movie was good. Are people doing this to seem smart? Not working. I compare this movie to a nighmare about a completely unmanageable life without peace. How is this a good movie? What is going on? Most of the reviews are horrible yet it won all the awards. No. Im all about creativity but no way. I could not even watch all the way through. It was like a train wreck meets drowning and a panic attack. Academy, who are you? Please stop; it sort of makes the Academy seem unhinged. I think there are enough lying liars in the world without pretending Horrible movies are good movies. From now on, the nominated movies will be my list of \"do not watch under any circumstances.\" The opposite of everything is true is now the United States.",
    "83": "Holy Moly! Just watched this gem of a movie made by A24, Daniels and the support of Russo brothers. This would be one of those instances where I would like to say best thing I have ever seen in years. I am a big franchise movie fan but this would knock all of it out of the park. It is a low budget movie so of course can't expect like Marvel level CGI or anything but the storytelling and the concepts were the real art about this and yes the acting don't forget that. So, the movie is basically about exploring the multiverse by switching personalities and being everything to protect the end of it from your daughter. Movie is separated into 3 parts, Part 1 being hilarious. I have never laughed as much as I did in this movie and so did everyone else in my theatre. Part 2, is emotional, drama and with epic fights and Part 3 the shortest 5 min with a really satisfying conclusion. The Daniels throw you in a loop, after Part 1 where you think it ends. The movie makes use of simple concepts like maybe wearing shoes on the wrong foot to explore multiverse. Though it might sound weird but it all pans out better than expected. They do follow all the multiversal rules.The movie also explores sexuality in a sense and inter family relationships and how to look at the positives. A lot of great scenes and don't forget this but the rock is one of the best and the plug is even better. Won't reveal the details. Michelle Yeoh is the best at this one. She is just marvelous and I can't get enough. Daniels makes a rather budgeted spectacle and I think the movies story is why RUSSO Brothers invested in this project.All in all, a perfect masterpiece. Yes it is perfect.",
    "84": "What better, more urgent message can a film have these days? What's so uncool about movies with messages anyways? Sometimes we desperately need them. I read a couple of reviews lightly mocking any attempt to find deeper meaning amid all the silliness, as if there wasn't enough already on the surface. What if we stopped equating tiny with insignificant? What if the more minuscule we discovered ourselves to be, the LARGER our world became, and the more SIGNIFICANT we felt? So it's not surprising that Daniels take us on the most inventive, overstuffed, relentless journey only to land us in the simplest, most heartfelt of places. That's the real judo-move here -- an infectious, goofy sweetness that extends even to the (hundreds? Thousands?) of action set pieces. Anyone can dimension-hop and fight the baddies. This combination of heart and spirit is the Daniels own. Also, for anyone who's putting together the next time capsule of human civilization, please consider the scene of Michelle Yeoh and Jaime Lee Curtis dancing with wiener fingers.",
    "85": "Had high hopes for this one but I actually fell asleep eventually. It was too much of everything and just same thing over and over and over and over again. I got so bored. Too much impressions and If someone was to ask me if they should watch this movie I would say no. This movie is far too sprawling and confusing to watch! How it got all the nominations and all the awards is a wonder to me! Yes Jamie Lee Curties did it good playing her part but it doesn't matter cause the plots were too many and it was hard to keep up and enjoy . Stephanie Hsu is not a very good actor and I wish someone else had played her parts. She didn't convince me at all in this role. I'm sorry I'm negative to this movie but what can I say? I absolutely love a good movie but this was not my cup of tea AT ALL.",
    "86": "Nihilism explored in such a perfect, creative, mind-boggling and hilarious way.I walked out of the theater feeling elevated in a way I've never experienced from a movie.I'm not a wordsmith and have never left a movie review, but this movie deserves it. People need to know how amazing it is!To everyone involved in bringing this movie to life:\nThank you.",
    "87": "Is it sci-fi? Barely. Is it comedy? Maybe a little. Is it a drama? Humm... I'm not sure. Is it a romance? ... Maybe not... So what is it? A big confusion disguised as a huge movie. Well overrated. It can be seen a mix of an old format of Chinese and American movies and a general pleased performance of the actors. The story can be resumed in a multiverse were infinite individual possibilities can originate ONE personality that wants to fix and overcome all the others, without any group context that characterises spieces or survival and a second one that antagonise the \"vilan\". When i saw sci -fi so well rated immediately commes into my mind: 2001 space odyssey or Stalker or even Interstellar but in the end i cant call it sci-fi. If you are looking for a nice Saturday afternoon easy film to entertain that's a good choice, for a cinema movie, better not...",
    "88": "I have trouble turning off my brain. Anxieties, worries, mundane to-dos, even positive things, sometimes feel like they're swirling around in a chaotic funnel cloud and I would like nothing more than to sit in physical and mental silence.\"Everything Everywhere All At Once\" felt like the inside of my head. In a world of non-stop, 24/7 news, most of it bad, how is a person like me, who has trouble filtering out things that affect me directly from all of the other things that are just out there happening in general and over which I have no control, supposed to cope?One answer is to decide that nothing matters anyway and give up caring. But that means deciding that my wife doesn't matter. And that my kids don't matter. And that art, and nature, and things that bring joy to my life, don't matter.Another way is to decide that some things, ok maybe most things, don't matter, but that there are things that do, and those are the things that make it all worth it. I get to decide what those things are.The first approach is nihilistic. The second approach is empowering. This film explores both approaches, and I was a sobbing mess at the end.I will say there were times that I was a bit exhausted by this movie. It throws a lot on the screen and at the viewer, and occasionally it can't keep up with its ambitions. But this was mostly a home run.Michell Yeoh does terrific work in this, but the MVP is Ke Huy Quan (Short Round from the \"Indiana Jones\" movies).Grade: A.",
    "89": "\"Be kind, especially when you don't know what's going on.\"If only we could recognize that those who combat us in life do so out of hidden pain, and fight them with kindness. If only we could accept our kids for who they are, and say supportive things from the heart instead of trying to mold them. If only we could be content with the life we have, and set aside the idea of the countless other lives we might have led, had we made different decisions along the way. If only we could see that the flipside to life being meaningless and everything ultimately being sucked into the abyss is the freedom that comes from that, that we can do anything with the time we've got.Like the first word in its title, this film feels like everything. While watching it I thought Stephanie Hsu was everything too, but then again, so was Michelle Yeoh and Jamie Lee Curtis. The homage to Wong Kar-Wai with Ke Huy Quan making his enlightened speech is extraordinary, and the fact that James Hong was still getting it done at age 93 was wonderful. I also loved how both mother and daughter, troubled as they were with their upbringing, each found comfort in a kind and patient partner, and Tallie Medel's character was a nice touch.The film threatens to go off the rails with its madcap multiverse hopping in the first part, but it's all a setup for the second part, which is incredibly powerful. It was impressive that it managed to be so entertaining along the way, with its fast-paced action and the wild ride it takes us on. It's one that rewards a rewatch to, as its full of little details and references. Just a great film, lots of fun, and from the heart.",
    "90": "Most of us who are mindful of the film can agree on one thing, Everything Everywhere All at Once feels like you're walking on an acid trip experience. It's an imaginary film that makes you feel like you had just swallowed a bottle of limitless pills, dopes, drugs or other substances that may similarly affect your consciousness and memories.And this movie deliversssssssssss that! Wow wow wow! Imagine if Dr Strange, Limitless, The Matrix, Click, Rick & Morty, Star Wars, Ratatouille and Manchester By the Sea combined to become a film, Everything Everywhere All at Once is the one! Now you must be wondering, how could Ratatouille and The Matrix complement each other to be in the same movie?  This question should be THE reason you should go support this film now in cinemas!Produced by A24, an independent film company, I was surprised at how they have pulled this off. Half of the film is located at an office, which is understandable considering A24 produces low or semi-budget films. But it's such a wonder how this movie could be so good with only so few places the movie took place for the first hour. What's even better is EEAAO occurred within closed and overcrowded spaces that may slightly trigger people experiencing ADHD, hypersensitivity and claustrophobia, pushing the film into maximum impact.This film is filled with action-packed sequences that will blow you brains out! It's fun, exhilarating, creative, hilarious and never-been-done-before! Adding up with the out-of-the-world concept and unique storyline, every fighting scene seems appropriately done and even if there's just so many styles and tones of scenes coming out from the screen, fitting is the right word to describe them.EEAAO seems like any other movie at the beginning but when all hell breaks loose, the story becomes increasingly complex as it explains the world revolving around the central character, propelling the plot into motion. Meticulously explained, the narrative manages to be exciting and outrageously wild but reasonable within its own multiverse contexts.Michelle Yeoh, our Malaysian actress , is excellent in this, proving that she's fluid in bringing out the best of her multiple character(s). Complicated as it is, she knew what kind of project she's doing and it just shows how dedicated she is at acting. It's not easy to play her role and it's definitely not easy to create multiple personas interconnected by different universes and dimensions, with separate storylines, all destined to have the same fate. This is an Oscar-worthy performance, and whether or not if Yeoh got nominated lies on the decision if the Oscar recognizes speculative fiction as a genre acceptable to compete with other highly-appraisal films.There were many genuinely laugh-out-loud moments throughout, NOT the one where you're forced to laugh just because everyone is laughing to avoid the awkwardness surrounding the audience in the hall, but the one that it's just funny you're having a truly good time. The script and performance help to amplify the comedic moment but the most special thing is that it's aware of its VFX effects and the team knows how to level up/down the intensity and realness of the CGI. How so? The CGI is very good, but there are times that the CGI is made to be purposely bad, like you're watching a short film by a bunch of ambitious varsity students, and it works! It works because everyone in the theater was laughing, it clicks just right with the moments and scenes you're watching. You'll laugh at how bad it is in a good way!If there's one dislike from this film is that it's gonna be a tough watch for some people. Like mentioned earlier, those with ADHD and hypersensitivity may be triggered with the intensity of this film. Also, the storyline is difficult for some to digest due to its complexity of its universe-building. The film is promoted as being light and fun but...EEAAO is weighty, dark, bizarre and surreal, only those who have what it takes can appropriately understand the building block storytelling.Verdict: Mind-bending and mind-blowing, Everything Everywhere All at Once masters its building block storytelling that feels like an acid trip worth experiencing and that experience... can only be felt once in a lifetime. We're only in March but without a doubt, this is already the best film of the year! Sorry, summer blockbuster movies!",
    "91": "It was everything everywhere all at once. Sometimes too many things, too many places at once and you can get lost, but it helps to focus on things.Obviously, the amazing Michelle Yeoh is one thing to focus on. The whole reason I myself came to see this flick in the first place. Much as this movie gives you to absorb it was easy to keep my eyes on the beautiful Yeoh.Oh, and the kid from Indiana Jones and the Temple of Doom is in this flick. He's older odiously but he still sounds like the kid form The Goonies. How lucky he was he got to play Yeoh's baby daddy in this joint.Last and definitely not least it was good to see James Wong in this film. You could tell they most likely made some filming adjustments to assure the 90 something year old actor can do the role but that's what you do when you have legends do your flick.Speaking of legends, almost forgot about Jamie lee Curtis who seem like she was having fun in her role.The fact that this movie is about a multiverse I low key was expecting a multiverse connection between who Yeoh plays in this movie, and her character in Shang shi. That would have been cool.It's interesting that this like the third movie that came out in March that's about the mommy daughter relationship between Asian women. What's even more interesting is how they go in order. Turning Red is about a 13-year-old and Her mom, Umma is about an 18-year-old and her mom and the girl playing Yeoh's daughter looks like she's possibly in her early 20s. Don't know when this became a hot plot in movies, but I will admit I prefer how the story lays out here (but only because I relate more to an Asian woman in her 20s over a middle schooler)The music in this film is great. The movie was filmed in the context that the story is about a laundromat owner in her mid-life dealing with where she came from and where she's going, but the music actually fits perfectly into the ideal of this woman being the key to saving the multiverse and it made for a lot of the entertainment. Just these big orchestra cues that make it sound like I'm watching Dune contradicting, the image of Yeoh being a worn-out blue-collar mom. Spectacular!I say it's good. It's all over the place and it can be a handle to process, but it has a good cast to concentrate on.",
    "92": "Rarely does a movie hit me hard and I go along for the ride. Every moment has a spectacle to it. Even the simplicity of having your taxes done. Often silly, mostly confusing but entirely entertaining. It was great to see Short Round back on the big screen with a very glamoured down Michelle Yeoh as a married couple on the brink of fracturing a family unit.The story is of, Evelyn, a woman who has never really committed to much in life. She has many interest but many where she isn't fully invested in. In this case, her family lives above the laundromat that is failing. They are being audited, but yet she has big dreams to expand her enterprise. Her husband (the fore mentioned Ke Huy Quan) Waymond, is a kindly follower and believer of his wife who seems to focus more on the bad than the good. Pessimist, if we are to be formal. It is the Chinese New Year, and many people are invited to celebrate with this family, including a Grand-Father who is labeled as a man set in his ways and wouldn't understand the same-sex relationship of his grandaughter Joy (Stephanie Hsu). What follows is a grand adventure, first at the IRS building (of all places) and eventually to distant alternate universes to which shows her the way her life may have gone had certain things didn't take place. I absolutely loved the fact that Jamie Lee Curtis plays the uptight auditor, who seems perfectly fine in the core universe to which all revolve around. Evelyn, on the other hand, taps into her other universes to gather the skills needed to fight a fracture in the timelines that sneak into her mundane life.Yes, there is a message here. And...to be honest, it nearly derails the film itself. But it was required to tie in the meaning of everything that is going on. That we are made of experiences of every universe that exists out there (if you believe in metaphysics) and that they road you didn't take, through gained experiences, with some that even was more enticing then the present one, means we would never have known our other lives. Children wouldn't be born, love would be lost, relationships move on. It is the grand question of whether or not if we got a glimpse of that road we didn't take, would it all mean anything. In this case, I say it almost derails because the universes effect one another. And in this story, it even bridges them. Which to some, may feel like a cheat. However, the fact that I even ask this question makes it a vastly interesting story. That is for you to decide.The movie is exciting, vibrant, energetic and feels absolutely unique. It allows the viewer to slowly tie the ends together, and perhaps sometimes gets too far ahead. But doesn't let you lose yourself too much. What it isn't is boring. It is captivating and fresh. And, look, who can hate a scene of people being beaten with rubber phalluses?That said, it is one of the most interesting movies of 2022 and hopefully stays in the minds of awards in the future. Because it deserves a bigger audience. These are the types of fun, philosophical questions buoyed by comedy that we need.I go back to Ke Huy Quan. This guy can do funny and also bring a tug to your heart so easily. It's so hard to imagine him as the little boy from \"Indiana Jones And The Temple Of Doom\" because, here he shows so much range. His natural charm is shown through his love for Evelyn. He seems to be suffering through a fracture himself. He plays many roles here as well. Because, in many universes in life, the theory here may be that we will run into people we are meant to run into regardless of choices. That's a very romanticized view on the universe.Kudos to The Daniels for their talent and joy of cinema. It would not surprise me if they helm a larger film in the future. Perhaps they can re-vamp a comic book franchise into something much more unique.Thank you for this movie.",
    "93": "Firstly I should say I thought the actors did put in some very good performances and I can see why they were nominated although as to whether they deserved to beat some of their competitors is another matter.I have to say I found this film to be tedious and almost unenjoyable to watch. It feels like a film made for the TikTok generation - no overall coherence with nuggets of scenes rammed together. Is this a film I would ever bother watching again - absolutely not.Yes it is different - in much the same way The Artist was (and who talks about that film anymore?) but that doesn't make it good. It aims for a profound message whilst its style is overwhelmingly superficial. It's a film with little artistic merit or dare I say beauty (I am talking about the scenes and cinematography here not the actors) and it definitely did not move me except to pray it was going to finish.In short it barely ticks the boxes of what I'd consider to be essential criteria for a great movie. Maybe this is the first of a new wave of this type of film and I am not getting it but when it had finished I felt pretty much nothing.",
    "94": "Greetings again from the darkness. It's bonkers, I tell ya'! Co-writers and co-directors Daniel Kwan and Daniel Scheinert, known collectively (by their choice) as \"Daniels\", follow up their 'farting corpse movie' SWISS ARMY MAN (2016) with one that is somehow more bizarre, more audacious, and more fun. It's one of the most innovative films I've seen in a while, and although I can point out influences, I've yet to come up with a movie comparison that seems just or fair.Every small business owner can relate to the stress Evelyn Wang (Michelle Yeoh) is under as she attempts to organize her documents in preparation for an IRS audit of the laundromat she owns with her husband Waymond Wang (Ke Huy Quan). As if that's not enough, her father is scheduled to arrive the same day. She knows Gong Gong (James Hong) is disappointed in his daughter for the husband and life she chose. And while being crushed with those two events, Evelyn's strained relationship with her daughter Joy (Stephanie Hsu) continues to fracture as Evelyn wants to keep Joy's girlfriend status with Becky (Tallie Medel) a secret from dear old conservative dad/grandfather.That's just about the end of the \"normal\" part of the story, other than Waymond has had divorce papers prepared, not for the purpose of ending the marriage, but with the hope that the threat might force Evelyn to have a real conversation with him about their relationship. Things start to get weird even before they head to the IRS meeting with an agent played with gusto by Jamie Lee Curtis, but while there, we get our first real taste of the fantastical trip we (and Evelyn) are about to take. Of course, I can't really offer any description of the action that occurs, but nothing is spoiled if I tell you that some characters cross multiple dimensions and universes in an attempt to 'save the world'. While doing this, they mix in some acrobatic martial arts that would make Jackie Chan envious.It's the rare film where the frenetic pace of dialogue keeps pace with breakneck action sequences. A fanny pack, trophies with an unfortunate shape, and blue-tooth type devices all play unusual roles here, and this film challenges everyone from the actors to the directors to the editors to the fight coordinators. You'll likely recognize Evelyn's husband as the grown-up version of the child actor who played Short Round in INDIANA JONES AND THE TEMPLE OF DOOM (1984), and daughter Joy is portrayed by Stephanie Hsu (a contributor to \"The Marvelous Mrs. Maisel\"), who gets to cover just about the widest range of character we've likely ever seen on screen. The estimable James Hong is a riot as Gong Gong. Mr. Hong is now 93 years old with an incredible canon of 450 credits in his 8 decades of work. His presence is quite crucial to the film. It should also be noted that, as we would expect, Jenny Slate shines in her brief role as \"Big Nose\", a regular customer at the laundromat.As terrific as the cast is, this is really a chance for Michelle Yeoh to bring her full arsenal to the role of Evelyn. She's angry, frustrated, scared, courageous, and even adds her comic timing. Ms. Yeoh flashes her CROUCHING TIGER, HIDDEN DRAGON fighting skills, while also brining a regal presence to a film that requires a strong core. It's no mystery that family and love can solve many of the world's issues, and Daniels have delivered a wild ride that defies simple description. It's a long one at 139 minutes, but you'll thank me later for not saying much more than ... it's bonkers!Opens in select markets on March 25 and April 1, 2022 and nationwide on April 8, 2022.",
    "95": "Apparently the IMDb plot synopsis before this movie's trailer came out was \"a woman tries to do her taxes,\" and really, the plot's so creative and goes to so many unpredictable places that I don't think you should know much more than that going in. It is about a woman doing her taxes, technically, but branches off in a variety of ways that make this an action/adventure/absurdist comedy/fantasy/science-fiction/family drama all in one.All the tones and all the genres are balanced perfectly. It's masterfully written and overflowing with creativity. The editing is unbelievable and all the elements work together so well. It has some of the funniest and silliest scenes I've seen in ages that mesh perfectly well with some genuinely touching dramatic moments, and it has characters you really come to care for.The action delivers, too, and there's just the right amount of it. I love how thrillingly strange the film is for a while, then you begin to make sense of it, and then it just keeps expertly piling more and more layers on, and does so over a fast-paced 139 minutes in a way where it never actually falls apart. Also: it has some of the best film references/parodies I've ever seen, for sure.All the acting is fantastic, too, and everyone understood the insane vision the directors were trying to achieve, and played their parts perfectly. Michelle Yeoh is maybe the best she's ever been here, and Stephanie Hsu, Ke Huy Quan, and Jamie Lee Curtis are all great too.Maybe original ideas are becoming harder and harder to come by, but for as long as movies like Everything Everywhere All At Once are coming out, the medium of film will never be truly artistically bankrupt. There have been movies that have tackled some of the ideas here before, but never in a way that's this creative, this funny, and this exciting, and the way it takes its outlandish premise and ties it to real life + real world + relatable emotions is so incredibly clever.I haven't seen every movie of the 2020s of course, but as of writing this, this is my favourite movie of the 2020s so far. I hope it performs extremely well at the box office and gets awards recognition, because it deserves it.Believe the hype.Go in knowing as little as possible.See this movie.",
    "96": "Leaving the movie theatre, I can barely comprehend the thoughts swirling around in my head right now. From the intriguing trailer, you wouldn't even begin to fathom the existential depths this movie submerges you under. Only to bring you back to the surface gasping for air just when things are at their bleakest. The directorial choices are the sign of geniuses at work, the acting and cinematography and editing really show that mastery plus effort leaves the roof smashed off the place Everything Everywhere All At Once is perfection in all these regards.You know it's special when you leave the movie feeling like it was made just for you. Daniels accomplished just that with this work of art coming to me right exactly when I needed it. The themes of family, fulfillment, love, and everything in between hit resoundingly close to home. I'm so glad I got to experience this even if it doesn't win any Oscars which it absolutely ought to. If critics don't carry this little picture on all their best of lists I don't know what to do. The picture itself, Michelle Yeoh in Actress, Stephanie Hsu in Supporting Actress, Ke Huy Quan in Supporting Actor, Original Screenplay, Directing, Editing, Costumes, Visual Effects, Score., Sound, Academy please consider Everything Everywhere All At Once. I know it's a challenge given the absurdity of some of the plot beats of the film but when you boil it down it's a very heartwarming and affecting piece of cinema.",
    "97": "Michelle Yeoh and the rest of the cast and crew KNOCK this mind-bending, mile-a-minute, multi-universe film right out of the entirety of space and time, and take our minds, funny bones and our hearts along for the ride!!! In short, this film is ingenuously, honestly, chaotically, beautifully, disgustingly (in parts), quietly, reflectively, frantically, open-heartedly, MAGNIFICENT.I giggled, laughed, snickered, cried (in both senses) and mostly, FELT.It is one of the best films of our time, and I say this truly and with my heart on my sleeve: 1). If you have not seen it, don't waste another minute without seeing it. It is more than a film - it is an EXPERIENCE. 2). If you are someone who has seen it but were not quite transported through the exquisite subtleties or the outright power of this film, do YOURSELF a favor (I mean that) and watch it again - this time maybe with subtitles throughout the entire thing so as not to miss one iota of its utter brilliance. OH, AND THIS DEFINITELY SHOULD HAVE ALSO TAKEN HOME THE OSCAR for BEST ORIGINAL SONG: \"Son Lux - This is A Life\". Just beautiful!",
    "98": "2022 is not even halfway over, but I saw Everything, Everywhere last night, and I simply cannot imagine it not being the best film of 2022.To say I was stunned is an understatement. I am 37 years old and have been a movie buff since I was a child. Movies are my passion - classic cinema, international cinema, domestic cinema. I see at least 30+ movies in theaters every year from all counties and compile a top 10 list of my favorite films.I can count on both hands the number of times I have sat in a movie theater slackjawed and stunned, unable to move as credits rolled on a film. I can count on one hand the number of times this has occurred to not only me but the audience with whom I've watched a movie. I have also only seen a few movies where the audience erupted in applause during the credits - rapturous, earnest, sustained cheering.Last night's screening of Everything, Everywhere falls into the latter category. As credits rolled, no one moved in a sold-out IMAX theater. We all sat and stared at the screen in awe before eventually cheering and clapping.This is a special movie, a miracle of a film, the type of lightning-in-a-bottle motion picture that comes along once in a blue moon to blow your mind and annihilate your heart with its boundless, bursting soul, energy, spirit, and creativity.In all my movie-watching years, I have never seen anything like it. The closest comparison I can muster is Eternal Sunshine of the Spotless Mind. There are many similarities between both films' unhinged, creative expression as well as their ultimate message of persistence and living life in spite of seemingly insurmountable odds and the inevitably that all things, both good and bad, will eventually come to a crashing end when the curtains on our lives close.Michelle Yeoh is remarkable and delivers a knockout performance that will surely garner plenty of awards attention. It's hard to imagine many actresses who could have so effortlessly kept step with such a demanding role, but she coasts through drama, comedy, action, and sci-fi with a verve and energy that left me breathless. It's the fiercest performance I've seen from one of the best actresses of our time and one of the best performances I've seen in years.As for the movie itself, really the less you know going in, the better. I saw the trailer two or three times prior to watching the film, and it did little to spoil the experience. I really do recommend going in blind, though.I don't rate many movies a 10/10. I also rarely leave theaters feeling the way I felt last night: dizzy on the possibilities of cinema and lost in thought over all I had just experienced. Even as I write this, I cannot wait to see the movie again with new people so they can experience just how special this is.Everything, Everywhere dazzles with its creative vision, but it marries the bizarre and magical with the mundane and the ordinary to make a statement about human potential and how often we let our daydreams - what could have been, should have been, will or won't be - roadblock who we are. The movie obliterates the veil of ordinary to reveal the extraordinary, but it never loses itself within its relentless, wacky, metaphysical vision.Quite the contrary, really. When the dust settles by the end of the film, you feel like you have been taken somewhere new - to a place only the best films can take us - and are reminded that even though we might not matter in the grand scheme of the universe, there are kind things we can do - to one another and ourselves - to make the pain and joy of being human mean...something.And at the end of the day, maybe that's everything.",
    "99": "I FINALLY sat down to finish watching this movie. I had started it when it first came out to stream and turned it off about 20 minutes in, I found it so boring.But, last night I decided to sit down and finish watching it to see if it lived up to all of the hype and Oscar accolades...to me, it didn't.Don't get me wrong, I do feel Mechelle Yeoh did a great job with this very complicated role, so perhaps she deserved it...but the rest of them, ehhhhhh maybe, maybe not so much.This movie TOTALLY lost my husband, he just couldn't keep up with the different story-lines in different dimensions, and the fast-pace of jumping around from dimension to dimension often game me the \"what in the world is going on\" feeling. I get it....everything all at once, but sometimes way too much.This movie, for me, didn't make sense at all until the last 20 minutes or so when, at that point finally, the writers basically spoon-fed the viewer the meaning of the movie, because (in my own personal opinion) even they knew people wouldn't get it on their own.As for Jamie Lee Curtis, I also think she deserved her Oscar for this one. Hers was also a pretty complicated character in oh so many ways and a huge departure from many roles she has played.So was this an Oscar worthy movie....eeeehhhh, not so much. Were there good performances? Yes. Was this an original movie? Yes, I can appreciate that too.Was it over-hyped? Most definitely.",
    "100": "Everything Everywhere All at Once (2022) is a movie my wife and I saw in theatres last night. The storyline follows an Asian family that owns a struggling laundromat and is under the eye of the IRS. Meanwhile, the family is also struggling as the daughter wants nothing to do with them and the parents are considering a divorce. Further complicating matters the mother has been selected to save the galaxy against the ultimate evil that may destroy all existence as the family knows it...This movie is codirected by Dan Kwan (Swiss Army Man) and Daniel Scheinert (The Death of Dick Long) and stars Michelle Yeoh (Crouching Tiger Hidden Dragon), Ke Huy Quan (Goonies), Stephanie Hsu (The Marvelous Mrs. Maisel), Jamie Lee Curtis (Halloween) and James Hong (Big Trouble in Little China).I loved everything about this movie. The cast was perfectly selected and everyone delivered their characters to perfection. The family dynamic is very well written and evolves well throughout the picture. The science fiction elements are clever but the fight scenes and choreography are even better. The depth of this movie is impressive and how all the intricacies evolve and come together is unbelievable.This is my early pick for best picture for 2022. This is an absolute must see that I would strongly recommend and score a 9/10.",
    "101": "This might seem like a weird thing to start off with but, the editing in this movie was really well done. For a movie like this, the editing needs to be clean in order to properly follow the story and the editing team succeeded in this task. The use of parallel editing in this movie was cleverly done and worked flawlessly with the story especially when a match cut was also used. The story for this movie as well is a unique one that makes you think one thing but then becomes something else. The main story for this movie just seems like any other action/sci-fi movie with there being a chosen one who's the only one that can save the universe but underneath that is a deeper story. The deeper story is really what hooks the audience for this wild and wacky ride of a movie as it's one everybody can relate to. What I really liked about this story though was how it easily mashed everything together from the comedy to the more serious moments and the action scenes. Another thing about the writing for this movie is how something will be mentioned and just seem like a throwaway thing but then come back in some way. This is a testament to the writers and directors of this movie Dan Kwan and Daniel Scheinert. This movie is a weird and wacky ride and the directing duo understood that and dived headfirst into it which is what makes this movie a unique and memorable one. What also helps in that department is the acting in this movie and man did everybody deliver for this movie. Everybody in this movie had to juggle between being serious and comedic and nailed it. Michelle Yeoh was the stand-out performance for me and I just want to know how she was able to stay in character during some of the scenes in this movie. The final thing I want to talk about with this movie is the lighting in this movie and how well it was used. The lighting in this movie, along with the screen ratio, helps the audience figure out which universe it is. In the end, Everything Everywhere All at Once is a wild and wacky ride that has a meaningful message along with it that you need to see.",
    "102": "A very ambiguous one. If we take any other aspect of it, it can be really good. The acting is great, the cinematography is cool, the editing is a masterpiece, the music is really good - but it was all put together in a very weird way.Crazy stories are fun when everything is in the right order, when nothing is exaggerated, but you can't say that about this movie. It's like the creators took LSD or some funny shrooms and started tripping while someone else wrote down everything they said while they were tripping. It's sick. It's like that bagel with everything stuffed in it, both tasty and nasty. And it doesn't taste any good.You can't unite the disparate in the hope that it can somehow make something good. No, it can't. I can understand an Oscar for Best Actress and Best Film Editing, but the rest of the statues should have gone to other people. I can't get this mindless awarding. And I'll never watch it again.P. S. And no, it's not science fiction, even if they use smartphones and computers. Pure fantasy with delusional elements :)",
    "103": "An instant classic, on par with the first Matrix film, EEAAO is a genre-bending masterpiece, equally parts funny, intense and emotional.The basic plot follows Evelyn, a middle aged Chinese woman who develops the ability to share the skills and memories of alternate versions of herself across the multiverse in order to save it.It is FAR deeper than that, and I wish I could go all spoilers, but I saw it early so I'll say this much, it is far more accessible than Swiss Army Man (which is still a great movie in my eyes) and I think many people will find much value in this film.I will say that the audience I watched the movie with was the most excited and active audience I've watched a movie with since Spider-Man No Way Home. A completely original film with no nostalgia bait, getting several cheers, laughs and applauses. Not to mention the few times I got close to crying.10/10 a must see.",
    "104": "Evelyn Wang and her husband Waymond run a laundry. Times are tough and they're in trouble with the Internal Revenue Service. There's also some niggle with their daughter and her father is a constant source of belittlement and scorn. Now Waymond wants a divorce. Could things have turned out differently for Evelyn, maybe in a parallel universe?The plot summary for this movie intrigued me immensely: the idea of exploring how things might work out if you'd plotted a different course or, more broadly, the idea of parallel realities. The actual product, however, is far less engaging or coherent.The lack of engagement begins immediately. The Wangs' everyday life is a manic, unfocussed existence and just following this for the first 20 minutes or so was fairly annoying. It doesn't get any better once the multiverse concept is introduced, this just being an excuse for random detours and well-choreographed but meaningless action scenes.It's like a typical pretentious concept-driven sci fi/fantasy movie: paper over the lack of plot with a concept and developments that are so radical and in-your-face that viewers are fooled into thinking there's something clever there, when there isn't. Then, to make it seem even more important, have the movie go for 140 minutes when 100 minutes would have been sufficient.Every now and again there is a profound moment but due to the preceding scenes being all empty random action there's no context and the impact is diluted.Disappointing.",
    "105": "It was disappointing that my wife chose to stop watching it after 20 minutes, because the film was really good. It wasn't perfect, but it was executed well and the final return to the actual meaningful present gives one the feeling that everything everywhere at once can be OK. Not great, but also not bad.At its core, the film tells you to not give up, that if nothing matters, then everything does. It is a movie for depressed reluctant cynics, which is what I probably am. It is fantasy, too, but only to make points that are relevant to real life. I guess it could have went really easily towards a Quantum Leap or Sliders kind of story, but \"the Daniels\" kept it fresh and tight and the acting was great.I wonder if they started with \"We need an actor that can do everything and anything!\", so naturally they got Michelle Yeoh, then they made the story Chinese so it fit. I am sure in some universe that story is true :)Bottom line: Most films have some qualities that makes them special, but very few are so considerate as this one. It's obvious that the authors gave it a lot of thought and love, which is rare. I guess that's also a message of the movie.",
    "106": "I have not seen the Nicolas Cage movie yet - has not started in Germany. I think it has a June or July release date at the moment. But if one can talk of the Massive Talent Nicolas Cage posseses (rightfully so by the way), you can not forget about Michelle Yeoh. That woman is just incredible - anyone who has seen her 80s and 90s Martial arts movies from Hong Kong can attest to that. And hearing her behind the scenes stories a few weeks ago, made certain things even more incredible.But I digress. It is not just her - we have the kid from the Indiana Jones movie. A sort of comeback thing, than Jamie Lee Curtis and so many other people involved. And of course you have the filmmakers who came up with the whole thing. Add to that a bit of Marvel flavor - at least in the producing chairs - with Joe Russo ... and you have a real pool of amazing talent working together here.There are scenes here, that you might find woke, but it also has a lot of scenes that you might find disgusting. But as with Swiss Army Man behind the story, behind things that may be disgusting, there is so much heart. Yes seeing someone rip a (dirty of course) gum off a table and chew it was not something that made me feel good inside ... but those scenes work, because the movie itself works.The frantic pace is just out of this world. No pun intended - especially considering how many worlds there might be. It is not entirely out of the realm of possibilities right? Who knows what me - or all the other me's are doing at the moment? Surely not all writing a review of a movie - but also hopefully not caring about the inconsistencies the movie has. If you break certain things down, they do not make much sense. But this is heart over mind - do not overthink it - let the movie and the experience take you on a journey and you will not regret it. It has some violent scenes and some other disturbing content (lesbian characters not being high on that list), but all that is packed neatly and in a way that works like a charm ... highly recommended.",
    "107": "Everything Everywhere All at Once is stunning. It's a corky spectacle, but remains deeply vulnerable. The narrative follows Evelyn, whose business and personal relationships are failing. Plus, Evelyn is unexpectedly tasked with saving the entire multiverse as her personal life bursts. This story might sound familiar, but it develops into an unparalleled blend of comedy, action, adventure, and drama. Each role is compelling, the conflict is relatable, the arcs are earned, and the plot devices are utilized to their fullest. Furthermore, the entire cast displays a wide range of skills: switching characters, blending tones, and striking beats in a symphony of emotions.Meanwhile, Everything Everywhere All at Once is masterfully crafted. Motion, lighting, colors, framing, and focus make every shot engaging and meaningful. The sound symbolically conveys psychology through silence, volume, and echoes. The multifaceted effects contribute to the ambitious atmosphere. Similarly, the production design is boundless, yet united by a lighthearted vision. Lastly, the editing is a powerhouse, jumping between several timelines, yet synergizing perfectly. Overall, Everything Everywhere All at Once is marvelous because it fuses so much into a cohesive experience. In other hands, it would be a mess, but Everything Everywhere All at Once works beautifully.Writing: 9/10\nDirection: 10/10\nCinematography: 10/10\nActing: 9/10\nEditing: 10/10\nSound: 10/10\nScore/Soundtrack: 8/10\nProduction Design: 10/10\nCasting: 7/10\nEffects: 10/10Overall Score: 9.3/10.",
    "108": "People are saying this is the most creative masterpiece ever, but I disagree. I think people are so used to garbage films of today that they don't remember what true creativity is. Most of the film is just random stuff like hotdog fingers and raccoon ratatouille, that's not creativity, that's just random stuff happening that only ordinary people would think is creative. Creativity is something truly new and outside of the box, like a sensation that nobody has ever felt before.Second, the film's message and theme is very millennial (god millennials are the worst generation). The jist of it is how to live even though life has no meaning. It's an obvious, childish conundrum that most people get past when they're teenagers. But of course millennials are stuck in the past and don't know what a purpose-driven life is.Finally, and I haven't heard anyone mention this, but the film is pitched to you as an epic sci-fi adventure but it actually feels very low budget. Most of the settings are ordinary places (like an office, laundromat, etc) and the weapons, even the futuristic multiverse-jumping gear, are just mundane cheap objects. It felt like those episodes of Community where they played paintball. The movie feels really cheap and thus the multiverse stuff feels like it's fake.That being said, it's not a bad movie. It's just okay. It is certainly brave, unique, but it's really not creative, it's just random stuff happening, and the overall message is a dead end conundrum only for millennials to struggle with.",
    "109": "Starting with what I did enjoy about this movie.1. The setting of this movie was indeed a more accurate representation of an Asian American household. The family dynamics sounds about right. I like that Asians are getting more spotlight.2. The concept/theme of this movie is rather novel and therefore interesting. Although I think it could have been played out much more sophisticatedly.3. The parent-child relationship is well portrayed. The perceived lack of validation from parents felt by the child, the poorly communicated love of the parent, the process of gaining awareness and emotional growth for both the parent and child is inspiring.Things I didn't like\n1. It is a very bizarre movie, you could even say chaotic. It's as if they tried to combine every single meaningless detail together and gave up filtering out what's actually worth or necessary to the main plot. Tried too hard to make it funny/original/emotional/relatable that it ends up being neither of those things very well.2. The movie is also unnecessarily long.Those two points combined makes this movie just a long, confusing, and sometimes boring mess. The novelty makes it watchable/bearable, but to me, it's nothing more than that.",
    "110": "An Asian woman in a middle age crisis suddenly is informed that there is a MULTIVERSE and she is the only who can save from total distraction.From there; everything is absolute madness, violence and many humorous situations for a trip of almost two and half hour.No, is not SPIDERMAN and even the SCI-FI suddenly becomes more of a metaphor. It is never boring (perhaps a little too long) but everything that happens becomes absolutely logic by the end.Michelle Yeoh is excellent and I hope she at least get a nomination. Jamie Lee Curtis also very good as always. The rest of the cast is on the same level.It is not worth to explain more; but you have to see it to believe it.",
    "111": "What a smooth synergy of sci-fi, action, comedy and some of the best editing I've seen in a long time. The psychological and story-telling elements are reminiscent of Terry Gilliam, but with a much bigger budget, and over-the-top comedic action reminiscent of Jackie Chan and Deadpool.But to me it's the Oscar-worthy editing that really shines, so shiny that I'm dazzled enough to overlook what I'd consider the movies flaws: namely some pacing issues and the inability to give the film some real heart. (Let's be honest: sexual-orientation issues are passe at this juncture, and just come off as low-hanging fruit.) But the whole experience seeing this in a theater filled with riotous laughter was truly memorable.My honest wish: that the fake ending was the real ending, followed by a \"To Be Continued.\" I would have genuinely preferred this film to have been a two- or three-parter.",
    "112": "\"Everything, Everywhere, All at Once\" is a rollercoaster of glitter, color and chaotic multi-verse hopping nonsense. Beneath it all is a stretched story about a dysfunctional Asian family trying to muddle their way through life as they negotiate their relationships, heart-breaks and bitter disappointments.While visually impressive, with a kinetic pacing and clever editing, I found it hard to be invested emotionally in the story. The absurdist slapstick humor is sporadically funny -hotdog-fingered apes reenacting the stick scene from 2001: A Space Odyssey made me snort- but more often it's just crude and stupid (yes, butt-plug fight scene, I'm looking at you). When it slips from Gen-Z 'Rick & Morty' style gags to tender family moments that are supposed to make us cry, these scenes don't really hold up. It's hard to feel moved by a mother embracing her wayward daughter when you've just watched a guy sumo squat on a dildo and dropkick someone through a door.The script pokes at existential questions, but isn't really clever enough to come at them in a meaningful way; In fact, I don't think it's really interested in doing so. Much of the dialog is just exposition for the wacky dimension-hopping world rules, which you quickly realize don't make any sense. The sequences where characters are switching in and out of their parallel selves become so frantic, it's often hard to tell which version of a character you're looking at and what their motivation is. The writers can of course always keep leaning on the main point of the film that 'life doesn't make sense, so this doesn't need to either'. The ultimate effect on me was that, rather like our main character Evelyn, I just felt exhausted by it and rather lost.I have to give a film kudos when it dares to try something new. There were some spectacular moments and genuine laughs, but it wasn't the masterpiece I'd hoped for.",
    "113": "This is typically the sort of movie I'd spend days thinking about and then come to the conclusion it's absolutely brilliant. Despite having all the right ingredients, that didn't quite happen this time around.The average viewer is going to struggle getting through the first half because it's slow, confusing and has a lot of subtitles to get through. Which is a shame because the magic in the movie is definitely in the 2nd half.Ultimately it's a high concept movie that can be explained quite simply but not without spoilers. However the basic premise in the movie sees the main character Evelyn, a run of the mill middle aged family woman, interact with the multiverse to save every universe.Whilst it is visually stunning and one of the most creative movies you'll have seen in a while, I feel it falls somewhere between serious philosophical sci-fi and in part daft comedy and doesn't quite blend them well enough. There are two food based elements of the story which could have been something different and it would have A) made more sense and B) made a more satisfying story.This is definitely the kind of movie that can split the crowd, with the average viewer unlikely to give it much of a go. So the current iMDB rating of 8 at the time of writing this review did surprise me, but fair play.Great visuals, quality acting, awesome ideas but something is missing for me.",
    "114": "What did happen to that kid from Indiana Jones & the Temple of Doom and The Goonies?This movie will give you the answer!Life is more than death and taxes for Evelyn Wang (Michelle Yeoh.) She is a bored middle aged Chinese immigrant housewife stuck in a rut in a launderette somewhere in America.Her meek husband Waymond (Ke Huy Quan) wants more to life and is getting ready for a divorce. Their daughter Joy (Stephanie Hsu) wants her lesbian girlfriend to be accepted as part of the family.Everyone wants approval from Evelyn's father Gong Gong (James Hong.) The crusty tax inspector Deirdre (Jamie Lee Curtis) is gunning for Evelyn because of her expenses claims.Suddenly another variant of Waymond appears and introduces Evelyn to the concept of the multiverse. Where she can gain some powers and skills. All so she can stop some the impending destruction of the multiverses from a weird bagel.Everything Everywhere All at Once is basically another take on Dr Strange 2. It's overstuffed with freaky ideas that really leads to a multiverse of madness.It has energy, philosophical ideas and pathos. Due to all the chaos some of the concepts end up in a cul de sac. It was overlong and maybe the appropriate endpoint would had been the two rocks in an alien planet.Great performance from Yeoh, there is a version of her that is a famous film star that Everlyn is envious of. She holds the movie together and once again displays that she is more than a far eastern martial arts star.",
    "115": "Hold on tight. This is a wild ride! I knew nothing about this film. I hadn't heard of it, didn't know it was in production, nothing, until yesterday, when I saw this tweet from Neil Gaiman -\"...See it in a cinema if you can. See it knowing nothin if you can. Best, most wonderful film I've seen in ages... Thank you Michelle Yeoh for existing.\" Purely on that advice, I went to see it, as he suggested, \"See it knowing nothing if you can.\" READ NO FURTHER if you want to take his advice. I don't know if there was a single department of this production that didn't excel. The writing was clever, unexpected, witty, deep, poignant, insane... the editing must have been an Herculean task and it is executed absolutely amazingly. The premises that are morphed together totally eclipse any singular focus on its own. Michelle Yeoh performance is indescribably brilliant. The supporting cast deliver with brilliance of their own. You will laugh out loud, cringe, gasp, cry, examine your life and be awestruck. I'll just stop, now, because I could go on ad nauseam. I give this film an enthusiastic 10 (superlative) out of 10 {no genre will be a sufficient label}",
    "116": "I knew coming into this adventure, this film was going to be something unique and different. Created by the filmmaking duo aptly called \"Daniels,\" I was prepared for a cacophony of visuals that would melt my brain and force me to register images at an alarming rate. Unlike their previous venture where Daniels attempted to make a film comprising of tropes they loathed, they most likely were seeking to make one of the most philosophically dense movies on record. Needless to say....they pulled it off.Like cramming a couple of semesters of beginning philosophy and psychology into one script, we get a pretty stark picture of what is happening in the life of our protagonist, Evelyn Wang. Her business is struggling, she is becoming distant from her daughter while embracing the poorer qualities of her father, her marriage is on the rocks and all of the mundane faux realities like taxes and business are colliding; becoming far too important in her life. There is a lot of internalized guilt on her part, and she is trying to utilize poor coping methods to deal with it. And then of course, she finds out she might be the most important person in the universe(s) even though it is blatantly clear she is the worst version of herself in all realities.I won't get into the sci-fi mumbo jumbo of the film, but basically an all powerful being is looking to destroy the very fabric of space and time. We talk about multiverse theories and cause and effect theories while also meshing them with abandonment, guilt and insufficiency syndromes by Evelyn's character. As she struggles to figure out her place in all of this, she is being pulled in multiple directions by multiverse jumping men posing as her husband and father, while her daughter is essentially the representation of destruction. This is where things get heavy.Is humility really possible if you can literally be anywhere at once? Is nihilism even possible with this kind of power in tow? How important is the meshing of tradition and progression to a person from an unique culture assimilating into a new one? Are women truly the destructors of reality as so many \"enlightened\" misogynists like to stupidly put it? Does an Everything Bagel really have everything? And why has Ke Huy Quan been off the map for so long? I mean he was great in his role, seamlessly switching between the overly nice Waymond Wang to his Alpha Universe version that can turn a fanny pack into a weapon of mass destruction.There were a lot of things I didn't expect from this film and I hope some people remember it for the unique vision it had. Framing a story about the universe in danger while a mother and daughter come to terms with their differences makes for a fun coming of age story that does not reek of the usual step-by-step tropes. It was also great to see people like Michelle Yeoh and James Hong get some great roles for once. Kudos to the film makers on that one.Go watch this film. It does drag a little in the middle but once you get into the final act you will definitely want to get the Blu-Ray because there are literally dozens of little detailed moments that will require a very slow run through. And in my book, that is a good thing.",
    "117": "Charlie Kaufman once wrote \"Everything is more complicated than you think. You only see a tenth of what is true. There are a million little strings attached to every choice you make; you can destroy your life every time you choose. But maybe you won't know for twenty years. And you'll never ever trace it to its source. And you only get one chance to play it out\". I can start with nothing better to talk about an immense new movie, the Daniels' \"Everything everywhere all at once\".This hyperreal piece of art comes to us quietly sampling something that crosses our path only every decade or so to remind us that there is still more to explore in our collective cultural consciousness and that we are yet to discover a fraction of what a truly good script can do; How images can transform a script to something better, deeper, and more effective; How a harmonious marriage of script and picture can explore emotional depths that are commonly visited yet rarely understood. \"Everything everywhere all at once\" is only the second movie project of its writers/directors. Their first was a subject of small talks at drunk parties and \"the weirdest I have seen\" conversations, the story of a desperate loner who was saved by a dead body that mainly flatulates then comes alive to ask existential questions about the meaning of life, \"Swiss Army Man\". That project might have been too eccentric and much ahead of its time for the common taste, but it was a true eye-opener. Now, after 6 years since that ambitious project and the experience it distilled, comes this utterly more marvelous achievement.\"Everything everywhere all at once\" is impossible to describe and synopsizing it is unjust as it is a true and rare symbiosis of script and picture, each highlighting the other, making each and the whole something more than words can explain. But perhaps to describe it best -and you must see it yourself to try and state your own- it's a surreal psychedelic journey through the eyes of a financially struggling immigrant nuclear family with their crumbling owned business and their cyclical hopeless life and what bent it of their dying hopes, missed opportunities, decaying bounds, and their valiant efforts to maybe bring some love and tradition and purpose back to it. This essence of the story is challenged by the simple concept of \"what if\" through a theme of a multiverse with characters sliding through the different possible versions of themselves to try and find meaning through the overwhelming nonsense of their lives.There are many aspects that make this movie a bombastic one. The screenplay introduces a simple premise but then quickly, continuously, and relentlessly evolves into absurd levels that are unpredictable and, frankly, unprecedented throughout the whole runtime, effectively challenging your sense of what is \"enough\". The story is an adventure of cosmic proportions of characters and characters' versions of themselves that then is juxtaposed with its intimate origins. And so, this gargantuan design is just an external manifestation of the emotional depths of a dialogue between a mother, a father, a daughter, a grandfather, and a tax auditor in the span of 6 hours of one day of their tiny lives. It's childish and hilarious and creepy. It is a meticulous machine that keeps discovering unimaginable dimensions to portray an intense emotional and philosophical battle between purpose and nihilism, and then purpose through nihilism. The script actively prevents itself from committing to a moral conclusion. It juggles continuously -as life is and any grasp on it- between the hopeful and the hopeless and is only bound by accepting the inevitability of chaos while rejecting the perceived destiny of loneliness.This immense script wouldn't have made this piece without the visuals. Here, the actual pictures do not only serve as a representation of the script but also feel that they have their own identity. The visuals are utterly and out worldly surreal, like a Salvador Dal or a David lynch or a stargate sequence of Kubrick's Space Odyssey. They are beautifully influenced by the exciting and fun Chinese martial arts Jackie Chan movies, the action/mystery of \"The Matrix\", the eerie imagery of Charlie Kaufman's \"Eternal sunshine of the spotless mind\", \"Synecdoche New York\", and \"Adaptation\", and Wong Kar-Wai's sexy romantic spectacle \"In the mood for love\".Script and picture being their own separate entities in this movie needed a masterful editor, and here too it excels. This cinematic piece could have been easily a disorienting mess of random events and visual madness, but what the editing actually achieves is a story that is easily followed and understood with characters that are poignant, close, and intimate, creating relatability that captivates and elates. The acting is flawless, specifically on the parts of Michelle Yeoh and Ke Huy Quan, who both complete and finesse. The cinema that comes from all these passionately crafted ingredients creates what can be described as a particle accelerator that elaborately assaults the senses, with passion, from every angle, generating a hilarious, creepy, and immensely emotional journey that will undoubtedly leave you to tears on many occasions, and then latch on to you with a fantastic and inspiring after taste.The Daniels wrote and directed \"Everything everywhere all at once\" to make it look like a marvel blockbuster but with the spirit and the feel of an art-house independent picture, effectively thriving through the fierce competition that is threatening creativity in cinema. They -either willingly with the audacity of an artist, or instinctively through the passion of a child explorer- ditched the three-act structure of a script and then went above and beyond with a bizarre and mind-blowing cinematic exploration of the depths of meaning and love. It is contemporary yet traditional, enormous yet intimate, focused yet living up to its title; It is truly Everything first, everywhere second, then all together all at once. This picture is an absolute triumph, a true masterpiece, one of the best movies in the last 20 years, and one of the most beautiful things I personally have ever seen. Be sure not to miss it.",
    "118": "\"Everything Everywhere All At Once\" is a sci-fi action comedy film written and directed by Dan Kwan and Daniel Scheinert, a.k.a. \"Daniels\". Starring Michelle Yeoh in the lead role, it is a truly bizarre, fast-paced mind trip that revels in every minute of its originality.For many years, Evelyn Wang (Michelle Yeoh) has run a family laundromat with her husband Waymond (Ke Huy Quan). Things aren't going too smoothly for Evelyn due to many amounting problems - the IRS is in the process of auditing the laundromat, Waymond is considering divorcing her, Evelyn's father Gong Gong (James Hong) has recently arrived from China, and Evelyn's daughter Joy (Stephanie Hsu) is struggling to convince her mother to accept her girlfriend Becky (Tallie Medel). One day, Waymond's personality suddenly changes right in front of Evelyn and he reveals himself to be from an \"Alpha\" parallel universe. This Alpha version of Waymond informs Evelyn about the existence of different multiverses due to the abundance of choices people make all the time, and provides her with a device that allows her explore many different realities and borrow special powers from different variants of herself.It seems that thanks to the Marvel Cinematic Universe, the idea of multiverses and alternate realities have become rather popular with audiences lately, and for that I couldn't be happier. I've always enjoyed fiction that deals with hypothetical scenarios in which we see how differently things may have turned out had one small little thing happened instead of what we actually ended up with. In \"Everything Everywhere All At Once\", we are treated to a surreal, over-the-top exploration of multiple possible timelines in one of the most uniquely strange films I've seen in a long time.This film takes the very concept of exploring the multiverse and flips it on its head, quite literally sometimes and often with humorous results. I was surprised how many times I spontaneously laughed out loud at certain parts just out of sheer absurdity, but it never felt like I was doing so at the film's expense. We see so many different twists and turns throughout that it's hard for me to definitively categorise what they are truly about. One scene may involve a reality where people have hotdogs for fingers and the other might feature literal rocks with googly eyes as the variants of our main characters. Yet, strangely, this film has created a world where all of these things could plausibly exist. It would have been easy for the film to be simply weird for the sake of it, but there's a certain cadence to all this weirdness that makes it so appealing to watch in the long run.The two Daniels (Dan Kwan and Daniel Scheinert) have clearly given close attention-to-detail to every scene of this film. Most of the time we are shown several blink-and-you-miss-it moments alluding to what particular version of Evelyn may be like in a certain reality or which of her obscure memories may be the trigger towards gaining that one's power. I can't discuss these in too much detail here, not just because I am reluctant to give away spoilers but also because even as I write this I'm still trying to fully comprehend what I have watched. Due to all the intricately hidden things that will likely go over people's heads, this is the type of movie that will require multiple viewings. However, I believe this is a good thing since it will help it attain the cult status it rightfully deserves. Not many movies released these days have the courage to go all out with this much passion and charm, especially one distributed by an independent company like A24.There's more good news - the action is fantastic as well. The fight choreography is so well done you'd be hard pressed finding better hand-to-hand combat outside of a Jackie Chan film (funnily enough, Chan was actually the original choice for the lead before the filmmakers decided to make her a woman). Even better is that the shaky-cam elements are kept to minimum, which makes it easier for us to see who is fighting whom. The high quality of the action scenes in this film can likely be attributed to the involvement of the Russo brothers, Anthony and Joe, who serve as co-producers. Their creative fingerprints have been left on this film as that same style of MCU action and fun is definitely present here. Any fan of the MCU will be aware of the Russo brothers' important contribution to the series in that they knew how to correctly balance character development with solid action sequences to go along with it.If there's any person who can truly hold this crazy but wonderful film together, it's Michelle Yeoh in the main role as Evelyn. Just watching the way Evelyn goes from a frustrated family woman struggling to make ends meet to a full blown action hero in the same movie is quite a staggering accomplishment. Yeoh never misses a beat battling her way through adversaries from unfamiliar realities while borrowing powers from her variant counterparts. I think it's safe to say this is the best performance she's ever given in a film, even more so than in \"Crouching Tiger, Hidden Dragon\". Additionally, we also see the surprising return of Ke Huy Quan to the big screen as Evelyn's husband Waymond. For those who don't know, Quan played Short Round in \"Indiana Jones and the Temple of Doom\" and Data in \"The Goonies\" when he was a child. It's nice to see that Quan's acting talent hasn't waned as an adult and his inclusion in the film's cast should make for an amusing, albeit minor nostalgia trip for fans of 80s movies.With the endless possibilities a multiverse can present, \"Everything Everywhere All At Once\" has successfully established itself as one of the most unique films of the 2020s. It's rare for such an ambitious, risk taking venture to have made so many different elements work so harmoniously but every now and then a film like this comes along and shatters all our expectations. This is the type of film you could watch over and over and still find something new to talk about each time. Because of that, I foresee the film achieving cult status in a matter of years, especially among fans of time travel and surrealist cinema. However, this can only occur if enough people end up seeing it in the first place so if all of what I described sounds exciting to you, what are you waiting for?I rate it a solid 9/10.",
    "119": "Everything Everywhere All at Once is stunning. It's a corky spectacle, but remains deeply vulnerable. The narrative follows Evelyn, whose business and personal relationships are failing. Plus, Evelyn is unexpectedly tasked with saving the entire multiverse as her personal life bursts. This story might sound familiar, but it develops into an unparalleled blend of comedy, action, adventure, and drama. Each role is compelling, the conflict is relatable, the arcs are earned, and the plot devices are utilized to their fullest. Furthermore, the entire cast displays a wide range of skills: switching characters, blending tones, and striking beats in a symphony of emotions.Meanwhile, Everything Everywhere All at Once is masterfully crafted. Motion, lighting, colors, framing, and focus make every shot engaging and meaningful. The sound symbolically conveys psychology through silence, volume, and echoes. The multifaceted effects contribute to the ambitious atmosphere. Similarly, the production design is boundless, yet united by a lighthearted vision. Lastly, the editing is a powerhouse, jumping between several timelines, yet synergizing perfectly. Overall, Everything Everywhere All at Once is marvelous because it fuses so much into a cohesive experience. In other hands, it would be a mess, but Everything Everywhere All at Once works beautifully.Writing: 9/10\nDirection: 10/10\nCinematography: 10/10\nActing: 9/10\nEditing: 10/10\nSound: 10/10\nScore/Soundtrack: 8/10\nProduction Design: 10/10\nCasting: 7/10\nEffects: 10/10Overall Score: 9.3/10.",
    "120": "People are saying this is the most creative masterpiece ever, but I disagree. I think people are so used to garbage films of today that they don't remember what true creativity is. Most of the film is just random stuff like hotdog fingers and raccoon ratatouille, that's not creativity, that's just random stuff happening that only ordinary people would think is creative. Creativity is something truly new and outside of the box, like a sensation that nobody has ever felt before.Second, the film's message and theme is very millennial (god millennials are the worst generation). The jist of it is how to live even though life has no meaning. It's an obvious, childish conundrum that most people get past when they're teenagers. But of course millennials are stuck in the past and don't know what a purpose-driven life is.Finally, and I haven't heard anyone mention this, but the film is pitched to you as an epic sci-fi adventure but it actually feels very low budget. Most of the settings are ordinary places (like an office, laundromat, etc) and the weapons, even the futuristic multiverse-jumping gear, are just mundane cheap objects. It felt like those episodes of Community where they played paintball. The movie feels really cheap and thus the multiverse stuff feels like it's fake.That being said, it's not a bad movie. It's just okay. It is certainly brave, unique, but it's really not creative, it's just random stuff happening, and the overall message is a dead end conundrum only for millennials to struggle with.",
    "121": "Starting with what I did enjoy about this movie.1. The setting of this movie was indeed a more accurate representation of an Asian American household. The family dynamics sounds about right. I like that Asians are getting more spotlight.2. The concept/theme of this movie is rather novel and therefore interesting. Although I think it could have been played out much more sophisticatedly.3. The parent-child relationship is well portrayed. The perceived lack of validation from parents felt by the child, the poorly communicated love of the parent, the process of gaining awareness and emotional growth for both the parent and child is inspiring.Things I didn't like\n1. It is a very bizarre movie, you could even say chaotic. It's as if they tried to combine every single meaningless detail together and gave up filtering out what's actually worth or necessary to the main plot. Tried too hard to make it funny/original/emotional/relatable that it ends up being neither of those things very well.2. The movie is also unnecessarily long.Those two points combined makes this movie just a long, confusing, and sometimes boring mess. The novelty makes it watchable/bearable, but to me, it's nothing more than that.",
    "122": "An Asian woman in a middle age crisis suddenly is informed that there is a MULTIVERSE and she is the only who can save from total distraction.From there; everything is absolute madness, violence and many humorous situations for a trip of almost two and half hour.No, is not SPIDERMAN and even the SCI-FI suddenly becomes more of a metaphor. It is never boring (perhaps a little too long) but everything that happens becomes absolutely logic by the end.Michelle Yeoh is excellent and I hope she at least get a nomination. Jamie Lee Curtis also very good as always. The rest of the cast is on the same level.It is not worth to explain more; but you have to see it to believe it.",
    "123": "What a smooth synergy of sci-fi, action, comedy and some of the best editing I've seen in a long time. The psychological and story-telling elements are reminiscent of Terry Gilliam, but with a much bigger budget, and over-the-top comedic action reminiscent of Jackie Chan and Deadpool.But to me it's the Oscar-worthy editing that really shines, so shiny that I'm dazzled enough to overlook what I'd consider the movies flaws: namely some pacing issues and the inability to give the film some real heart. (Let's be honest: sexual-orientation issues are passe at this juncture, and just come off as low-hanging fruit.) But the whole experience seeing this in a theater filled with riotous laughter was truly memorable.My honest wish: that the fake ending was the real ending, followed by a \"To Be Continued.\" I would have genuinely preferred this film to have been a two- or three-parter.",
    "124": "\"Everything, Everywhere, All at Once\" is a rollercoaster of glitter, color and chaotic multi-verse hopping nonsense. Beneath it all is a stretched story about a dysfunctional Asian family trying to muddle their way through life as they negotiate their relationships, heart-breaks and bitter disappointments.While visually impressive, with a kinetic pacing and clever editing, I found it hard to be invested emotionally in the story. The absurdist slapstick humor is sporadically funny -hotdog-fingered apes reenacting the stick scene from 2001: A Space Odyssey made me snort- but more often it's just crude and stupid (yes, butt-plug fight scene, I'm looking at you). When it slips from Gen-Z 'Rick & Morty' style gags to tender family moments that are supposed to make us cry, these scenes don't really hold up. It's hard to feel moved by a mother embracing her wayward daughter when you've just watched a guy sumo squat on a dildo and dropkick someone through a door.The script pokes at existential questions, but isn't really clever enough to come at them in a meaningful way; In fact, I don't think it's really interested in doing so. Much of the dialog is just exposition for the wacky dimension-hopping world rules, which you quickly realize don't make any sense. The sequences where characters are switching in and out of their parallel selves become so frantic, it's often hard to tell which version of a character you're looking at and what their motivation is. The writers can of course always keep leaning on the main point of the film that 'life doesn't make sense, so this doesn't need to either'. The ultimate effect on me was that, rather like our main character Evelyn, I just felt exhausted by it and rather lost.I have to give a film kudos when it dares to try something new. There were some spectacular moments and genuine laughs, but it wasn't the masterpiece I'd hoped for.",
    "125": "This is typically the sort of movie I'd spend days thinking about and then come to the conclusion it's absolutely brilliant. Despite having all the right ingredients, that didn't quite happen this time around.The average viewer is going to struggle getting through the first half because it's slow, confusing and has a lot of subtitles to get through. Which is a shame because the magic in the movie is definitely in the 2nd half.Ultimately it's a high concept movie that can be explained quite simply but not without spoilers. However the basic premise in the movie sees the main character Evelyn, a run of the mill middle aged family woman, interact with the multiverse to save every universe.Whilst it is visually stunning and one of the most creative movies you'll have seen in a while, I feel it falls somewhere between serious philosophical sci-fi and in part daft comedy and doesn't quite blend them well enough. There are two food based elements of the story which could have been something different and it would have A) made more sense and B) made a more satisfying story.This is definitely the kind of movie that can split the crowd, with the average viewer unlikely to give it much of a go. So the current iMDB rating of 8 at the time of writing this review did surprise me, but fair play.Great visuals, quality acting, awesome ideas but something is missing for me.",
    "126": "What did happen to that kid from Indiana Jones & the Temple of Doom and The Goonies?This movie will give you the answer!Life is more than death and taxes for Evelyn Wang (Michelle Yeoh.) She is a bored middle aged Chinese immigrant housewife stuck in a rut in a launderette somewhere in America.Her meek husband Waymond (Ke Huy Quan) wants more to life and is getting ready for a divorce. Their daughter Joy (Stephanie Hsu) wants her lesbian girlfriend to be accepted as part of the family.Everyone wants approval from Evelyn's father Gong Gong (James Hong.) The crusty tax inspector Deirdre (Jamie Lee Curtis) is gunning for Evelyn because of her expenses claims.Suddenly another variant of Waymond appears and introduces Evelyn to the concept of the multiverse. Where she can gain some powers and skills. All so she can stop some the impending destruction of the multiverses from a weird bagel.Everything Everywhere All at Once is basically another take on Dr Strange 2. It's overstuffed with freaky ideas that really leads to a multiverse of madness.It has energy, philosophical ideas and pathos. Due to all the chaos some of the concepts end up in a cul de sac. It was overlong and maybe the appropriate endpoint would had been the two rocks in an alien planet.Great performance from Yeoh, there is a version of her that is a famous film star that Everlyn is envious of. She holds the movie together and once again displays that she is more than a far eastern martial arts star.",
    "127": "Hold on tight. This is a wild ride! I knew nothing about this film. I hadn't heard of it, didn't know it was in production, nothing, until yesterday, when I saw this tweet from Neil Gaiman -\"...See it in a cinema if you can. See it knowing nothin if you can. Best, most wonderful film I've seen in ages... Thank you Michelle Yeoh for existing.\" Purely on that advice, I went to see it, as he suggested, \"See it knowing nothing if you can.\" READ NO FURTHER if you want to take his advice. I don't know if there was a single department of this production that didn't excel. The writing was clever, unexpected, witty, deep, poignant, insane... the editing must have been an Herculean task and it is executed absolutely amazingly. The premises that are morphed together totally eclipse any singular focus on its own. Michelle Yeoh performance is indescribably brilliant. The supporting cast deliver with brilliance of their own. You will laugh out loud, cringe, gasp, cry, examine your life and be awestruck. I'll just stop, now, because I could go on ad nauseam. I give this film an enthusiastic 10 (superlative) out of 10 {no genre will be a sufficient label}",
    "128": "I knew coming into this adventure, this film was going to be something unique and different. Created by the filmmaking duo aptly called \"Daniels,\" I was prepared for a cacophony of visuals that would melt my brain and force me to register images at an alarming rate. Unlike their previous venture where Daniels attempted to make a film comprising of tropes they loathed, they most likely were seeking to make one of the most philosophically dense movies on record. Needless to say....they pulled it off.Like cramming a couple of semesters of beginning philosophy and psychology into one script, we get a pretty stark picture of what is happening in the life of our protagonist, Evelyn Wang. Her business is struggling, she is becoming distant from her daughter while embracing the poorer qualities of her father, her marriage is on the rocks and all of the mundane faux realities like taxes and business are colliding; becoming far too important in her life. There is a lot of internalized guilt on her part, and she is trying to utilize poor coping methods to deal with it. And then of course, she finds out she might be the most important person in the universe(s) even though it is blatantly clear she is the worst version of herself in all realities.I won't get into the sci-fi mumbo jumbo of the film, but basically an all powerful being is looking to destroy the very fabric of space and time. We talk about multiverse theories and cause and effect theories while also meshing them with abandonment, guilt and insufficiency syndromes by Evelyn's character. As she struggles to figure out her place in all of this, she is being pulled in multiple directions by multiverse jumping men posing as her husband and father, while her daughter is essentially the representation of destruction. This is where things get heavy.Is humility really possible if you can literally be anywhere at once? Is nihilism even possible with this kind of power in tow? How important is the meshing of tradition and progression to a person from an unique culture assimilating into a new one? Are women truly the destructors of reality as so many \"enlightened\" misogynists like to stupidly put it? Does an Everything Bagel really have everything? And why has Ke Huy Quan been off the map for so long? I mean he was great in his role, seamlessly switching between the overly nice Waymond Wang to his Alpha Universe version that can turn a fanny pack into a weapon of mass destruction.There were a lot of things I didn't expect from this film and I hope some people remember it for the unique vision it had. Framing a story about the universe in danger while a mother and daughter come to terms with their differences makes for a fun coming of age story that does not reek of the usual step-by-step tropes. It was also great to see people like Michelle Yeoh and James Hong get some great roles for once. Kudos to the film makers on that one.Go watch this film. It does drag a little in the middle but once you get into the final act you will definitely want to get the Blu-Ray because there are literally dozens of little detailed moments that will require a very slow run through. And in my book, that is a good thing.",
    "129": "Charlie Kaufman once wrote \"Everything is more complicated than you think. You only see a tenth of what is true. There are a million little strings attached to every choice you make; you can destroy your life every time you choose. But maybe you won't know for twenty years. And you'll never ever trace it to its source. And you only get one chance to play it out\". I can start with nothing better to talk about an immense new movie, the Daniels' \"Everything everywhere all at once\".This hyperreal piece of art comes to us quietly sampling something that crosses our path only every decade or so to remind us that there is still more to explore in our collective cultural consciousness and that we are yet to discover a fraction of what a truly good script can do; How images can transform a script to something better, deeper, and more effective; How a harmonious marriage of script and picture can explore emotional depths that are commonly visited yet rarely understood. \"Everything everywhere all at once\" is only the second movie project of its writers/directors. Their first was a subject of small talks at drunk parties and \"the weirdest I have seen\" conversations, the story of a desperate loner who was saved by a dead body that mainly flatulates then comes alive to ask existential questions about the meaning of life, \"Swiss Army Man\". That project might have been too eccentric and much ahead of its time for the common taste, but it was a true eye-opener. Now, after 6 years since that ambitious project and the experience it distilled, comes this utterly more marvelous achievement.\"Everything everywhere all at once\" is impossible to describe and synopsizing it is unjust as it is a true and rare symbiosis of script and picture, each highlighting the other, making each and the whole something more than words can explain. But perhaps to describe it best -and you must see it yourself to try and state your own- it's a surreal psychedelic journey through the eyes of a financially struggling immigrant nuclear family with their crumbling owned business and their cyclical hopeless life and what bent it of their dying hopes, missed opportunities, decaying bounds, and their valiant efforts to maybe bring some love and tradition and purpose back to it. This essence of the story is challenged by the simple concept of \"what if\" through a theme of a multiverse with characters sliding through the different possible versions of themselves to try and find meaning through the overwhelming nonsense of their lives.There are many aspects that make this movie a bombastic one. The screenplay introduces a simple premise but then quickly, continuously, and relentlessly evolves into absurd levels that are unpredictable and, frankly, unprecedented throughout the whole runtime, effectively challenging your sense of what is \"enough\". The story is an adventure of cosmic proportions of characters and characters' versions of themselves that then is juxtaposed with its intimate origins. And so, this gargantuan design is just an external manifestation of the emotional depths of a dialogue between a mother, a father, a daughter, a grandfather, and a tax auditor in the span of 6 hours of one day of their tiny lives. It's childish and hilarious and creepy. It is a meticulous machine that keeps discovering unimaginable dimensions to portray an intense emotional and philosophical battle between purpose and nihilism, and then purpose through nihilism. The script actively prevents itself from committing to a moral conclusion. It juggles continuously -as life is and any grasp on it- between the hopeful and the hopeless and is only bound by accepting the inevitability of chaos while rejecting the perceived destiny of loneliness.This immense script wouldn't have made this piece without the visuals. Here, the actual pictures do not only serve as a representation of the script but also feel that they have their own identity. The visuals are utterly and out worldly surreal, like a Salvador Dal or a David lynch or a stargate sequence of Kubrick's Space Odyssey. They are beautifully influenced by the exciting and fun Chinese martial arts Jackie Chan movies, the action/mystery of \"The Matrix\", the eerie imagery of Charlie Kaufman's \"Eternal sunshine of the spotless mind\", \"Synecdoche New York\", and \"Adaptation\", and Wong Kar-Wai's sexy romantic spectacle \"In the mood for love\".Script and picture being their own separate entities in this movie needed a masterful editor, and here too it excels. This cinematic piece could have been easily a disorienting mess of random events and visual madness, but what the editing actually achieves is a story that is easily followed and understood with characters that are poignant, close, and intimate, creating relatability that captivates and elates. The acting is flawless, specifically on the parts of Michelle Yeoh and Ke Huy Quan, who both complete and finesse. The cinema that comes from all these passionately crafted ingredients creates what can be described as a particle accelerator that elaborately assaults the senses, with passion, from every angle, generating a hilarious, creepy, and immensely emotional journey that will undoubtedly leave you to tears on many occasions, and then latch on to you with a fantastic and inspiring after taste.The Daniels wrote and directed \"Everything everywhere all at once\" to make it look like a marvel blockbuster but with the spirit and the feel of an art-house independent picture, effectively thriving through the fierce competition that is threatening creativity in cinema. They -either willingly with the audacity of an artist, or instinctively through the passion of a child explorer- ditched the three-act structure of a script and then went above and beyond with a bizarre and mind-blowing cinematic exploration of the depths of meaning and love. It is contemporary yet traditional, enormous yet intimate, focused yet living up to its title; It is truly Everything first, everywhere second, then all together all at once. This picture is an absolute triumph, a true masterpiece, one of the best movies in the last 20 years, and one of the most beautiful things I personally have ever seen. Be sure not to miss it.",
    "130": "\"Everything Everywhere All At Once\" is a sci-fi action comedy film written and directed by Dan Kwan and Daniel Scheinert, a.k.a. \"Daniels\". Starring Michelle Yeoh in the lead role, it is a truly bizarre, fast-paced mind trip that revels in every minute of its originality.For many years, Evelyn Wang (Michelle Yeoh) has run a family laundromat with her husband Waymond (Ke Huy Quan). Things aren't going too smoothly for Evelyn due to many amounting problems - the IRS is in the process of auditing the laundromat, Waymond is considering divorcing her, Evelyn's father Gong Gong (James Hong) has recently arrived from China, and Evelyn's daughter Joy (Stephanie Hsu) is struggling to convince her mother to accept her girlfriend Becky (Tallie Medel). One day, Waymond's personality suddenly changes right in front of Evelyn and he reveals himself to be from an \"Alpha\" parallel universe. This Alpha version of Waymond informs Evelyn about the existence of different multiverses due to the abundance of choices people make all the time, and provides her with a device that allows her explore many different realities and borrow special powers from different variants of herself.It seems that thanks to the Marvel Cinematic Universe, the idea of multiverses and alternate realities have become rather popular with audiences lately, and for that I couldn't be happier. I've always enjoyed fiction that deals with hypothetical scenarios in which we see how differently things may have turned out had one small little thing happened instead of what we actually ended up with. In \"Everything Everywhere All At Once\", we are treated to a surreal, over-the-top exploration of multiple possible timelines in one of the most uniquely strange films I've seen in a long time.This film takes the very concept of exploring the multiverse and flips it on its head, quite literally sometimes and often with humorous results. I was surprised how many times I spontaneously laughed out loud at certain parts just out of sheer absurdity, but it never felt like I was doing so at the film's expense. We see so many different twists and turns throughout that it's hard for me to definitively categorise what they are truly about. One scene may involve a reality where people have hotdogs for fingers and the other might feature literal rocks with googly eyes as the variants of our main characters. Yet, strangely, this film has created a world where all of these things could plausibly exist. It would have been easy for the film to be simply weird for the sake of it, but there's a certain cadence to all this weirdness that makes it so appealing to watch in the long run.The two Daniels (Dan Kwan and Daniel Scheinert) have clearly given close attention-to-detail to every scene of this film. Most of the time we are shown several blink-and-you-miss-it moments alluding to what particular version of Evelyn may be like in a certain reality or which of her obscure memories may be the trigger towards gaining that one's power. I can't discuss these in too much detail here, not just because I am reluctant to give away spoilers but also because even as I write this I'm still trying to fully comprehend what I have watched. Due to all the intricately hidden things that will likely go over people's heads, this is the type of movie that will require multiple viewings. However, I believe this is a good thing since it will help it attain the cult status it rightfully deserves. Not many movies released these days have the courage to go all out with this much passion and charm, especially one distributed by an independent company like A24.There's more good news - the action is fantastic as well. The fight choreography is so well done you'd be hard pressed finding better hand-to-hand combat outside of a Jackie Chan film (funnily enough, Chan was actually the original choice for the lead before the filmmakers decided to make her a woman). Even better is that the shaky-cam elements are kept to minimum, which makes it easier for us to see who is fighting whom. The high quality of the action scenes in this film can likely be attributed to the involvement of the Russo brothers, Anthony and Joe, who serve as co-producers. Their creative fingerprints have been left on this film as that same style of MCU action and fun is definitely present here. Any fan of the MCU will be aware of the Russo brothers' important contribution to the series in that they knew how to correctly balance character development with solid action sequences to go along with it.If there's any person who can truly hold this crazy but wonderful film together, it's Michelle Yeoh in the main role as Evelyn. Just watching the way Evelyn goes from a frustrated family woman struggling to make ends meet to a full blown action hero in the same movie is quite a staggering accomplishment. Yeoh never misses a beat battling her way through adversaries from unfamiliar realities while borrowing powers from her variant counterparts. I think it's safe to say this is the best performance she's ever given in a film, even more so than in \"Crouching Tiger, Hidden Dragon\". Additionally, we also see the surprising return of Ke Huy Quan to the big screen as Evelyn's husband Waymond. For those who don't know, Quan played Short Round in \"Indiana Jones and the Temple of Doom\" and Data in \"The Goonies\" when he was a child. It's nice to see that Quan's acting talent hasn't waned as an adult and his inclusion in the film's cast should make for an amusing, albeit minor nostalgia trip for fans of 80s movies.With the endless possibilities a multiverse can present, \"Everything Everywhere All At Once\" has successfully established itself as one of the most unique films of the 2020s. It's rare for such an ambitious, risk taking venture to have made so many different elements work so harmoniously but every now and then a film like this comes along and shatters all our expectations. This is the type of film you could watch over and over and still find something new to talk about each time. Because of that, I foresee the film achieving cult status in a matter of years, especially among fans of time travel and surrealist cinema. However, this can only occur if enough people end up seeing it in the first place so if all of what I described sounds exciting to you, what are you waiting for?I rate it a solid 9/10.",
    "131": "The genre is hard to define. Think Kill Bill meets Inception, but silly. It attempts to meld comedy, mind-bending sci-fi, and action into one, which it does to an extent, but fails to make it more than a sum of its parts. It was a great idea with an arguably poor execution.A slow-burning first half turns into a fast, colourful, adventure sailing through the multiverse. It's a visually impressive piece that pounds the senses and ends with a wave of feel-good fun. Everything Everywhere All at Once oozes originality and creates a new mind-bending world in which to immerse yourself.Yet, originality alone cannot carry this film. The jokes did not always land. The script was so simplistic it sometimes felt like it was directed towards children - something belied by the unnecessarily sexual nature of many scenes. Possibly the worst issue is the many plot holes. In a modern world where anything is possible, the choice of martial arts as the main medium of warfare is unexplained.To use an analogy from the film, Everything Everywhere All at Once is like a clay pot that holds your attention in the moment, but is so full of cracks that it fragments the moment you start to reflect any deeper.",
    "132": "This movie gets tons of hype. I wonder why. I bet know why. That doesn't make it good. The film is just a mess.A complete mess.The storyline is idiotic and boring. The direction is completely and totally disjointed. It's nearly impossible to follow or even understand what's supposed to be going on.I was bored out of my mind.I'd say this -- don't support this garbage by renting or buying a ticket. If you HAVE to see it because you want to be duped by all the hype, wait until a friend has it and go to their home to view it. Or get it free at the library. That's what I did and I'm glad I didnt spend twenty bucks to support abject garbage llike this.",
    "133": "Here is a kaleidoscopic ride through the multiplicity of an individual's possibilities that will amuse and astound you with what a life can be. Try to find a more imaginative film out there today or in recent memory. You won't.Everything Everywhere All at Once depicts a Chinese immigrant, Evelyn (Michelle Yeoh), empowered to travel multiverses to confront the many selves she could have been in order to save the world and more importantly her family. Like Lars Van Trier's Melancholia, this fantasy is an answer for what to do about clinical depression: Face your many demons and vanquish them with the sheer power of love.Everything is more impressionistic than narrative, offering exotic takes on our culture like satirizing the animation Ratatouille by placing a raccoon on the head of a chef and calling it Raccacoonie (Jason Hamer) or having Jamie Lee Curtis play Dierdre Beaubeirdra, an out-of-control IRS agent storming the Wang family's struggling laundry. Directors Dan Kwan and Daniel Scheinert, labeled as \"Daniels,\" have taken their Swiss Army Man to a manic level even that quirky film couldn't imagine.In comments on the world as we perceive it, Everything references the popular theme of rediscovering family, so prevalent in super hero movies and elsewhere. Yeoh as Evelyn is a perfect heroine because her current self, which she considers a failure, becomes an active psychic traveler cum martial arts dynamo experiencing the lives she could have led. The branching choices she can make at any moment propel her into different outcomes. It's what we oft have thought about the many possibilities we have within our grasp every moment of our lives.Easy to see the themes bounce out, like becoming all you can be and loving family, such as her daughter, Joy (Stephanie Hsu), whom she strives to save from the negative forces of the world. Similarly, she struggles with her husband, Waymond (Ke Huy Quan), to serve him divorce papers while every step of the multiverse he travels proves to be dangerous and loving.In the chaos each day brings, destruction around each corner, madness omnipresent, the film manages to lard its scene with kindness sneaking through each frame. Gone is the tyranny of the pandemic; here is the chance for salvation through charity that accepts our weaknesses for the sake of love.Here is The Matrix reimagined for those still reeling from the perceived mania of the Trump era. Buttplugs and an alpha version of Evelyn's boring husband are two of the many running gags that challenge us to think of our personal multiverses as not just daily apocalypses but containing everything to help us through to the best universe of all-a loving one.Everything Everywhere All at Once is everything cinema should be: stunning, challenging, witty, amusing, and true to life in its infinite forms.In theaters, thank goodness, because of the brilliant images and mind-capturing sound.",
    "134": "The first recommendation when watching EVERYTHING EVERYWHERE ALL AT ONCE is to not try to figure out what is going on in this movie during the first 1/2 hour to 45 minutes. This will drive you mad. Just sit back and enjoy the mind-bending experience you are having.After that point, either it will click in your brain...or it won't. If it does - great! If not...continue to sit back and enjoy the mind-bending experience you are having.For...EVERYTHING EVERYWHERE ALL AT ONCE is a trippy head-trip of a film that is certainly unique - but it also has something going for it that all good films do - characters that you will care about in a story that will touch your heart.Written and Directed by Dan Kwan and Daniel Scheinert (SWISS ARMY MAN), EVERYTHING...tells the tale of unhappily married couple Evelyn Wang (Michelle Yeoh) and Waymond Wang (Ke Huy Quan), her father Gong Gong (the great James Hong) and their daughter, Joy (Stephanie Hsu). When interdimensional travel interrupts their mundane life, things get much, much more than mundane.Yes, folks, you read that right INTERDIMENSIONAL TRAVEL - and this is not a Marvel movie! Evelyn and family start jumping to parallel dimensions, experiencing everything, everywhere...all at once (hence, the name of the film).This is a smart, unique and visually interesting film and credit for this must go to Wang and Scheinert. They have come up with something unusual. However, they don't just do \"unusual for unusual sake\" they wrap this film up - and connect the dots - in a satisfying way in the end. Oh...and they also build in some incredibly impressive fight scenes along the way. To not hype them too much, but these are the best fight scenes that have been on film in quite some time - certainly the most interesting and unique since the JOHN WICK films.The duo, smartly, enlisted the aid of the underappreciated - but very talented - Michelle Yeoh (CRAZY RICH ASIANS) as the protagonist of this piece. It is a wise choice for she must go from mousey housewife to kick-butt SuperHero (and everywhere in between) throughout the course of this film and her Martial Arts background comes in very, very handy. It is a bravura performance by Yeoh and it would be TERRIFIC if her name is called come awards season next year (yes, it is that good of a performance).She is ably assisted by Hong (a veteran character actor with more than 450 credits to his name), Hsu (known for her role as Mei in THE MARVELOUS MRS. MAISEL) and, especially Quan (the kid \"Short Round\" who assists the hero in INDIANA JONES AND THE TEMPLE OF DOOM) - it was good to see Quan back on the big screen.The filmmakers also sprinkle some very strong character actors/actresses in the mix here. Both Jenny Slate (Mona-Lisa Saperstein in PARKS & REC) and Harry Shum, Jr. (GLEE, CRAZY RICH ASIANS) are fun in small roles as is the aforementioned James Hong as Gong Gong (the Grandfather).But...the person who ALMOST steals this film from Ms. Yeoh is the incomparable Jamie Lee Curtis as the somewhat overweight and out of shape IRS Agent who plays a pivotal role in Evelyn's life across the Dimensions. It is a fun role for Curtis who is not afraid to look physically bad. Again, I would LOVE IT if she got some love come awards time next year (she won't, but maybe in some other parallel Universe she would).Not for everyone - the multi-dimensional travel is going to give some folks a headache as they try to figure things out - but if you surrender yourself to the wildness that is going on, and embrace the spirit and the heart of this film, you will be rewarded with a very rich film going experience.Letter Grade: A-8 Stars out of 10 (might move up to 9 on a rewatch) and you can take that to the Bank(ofMarquis)",
    "135": "This is a movie you must experience for yourself to fully grasp exactly what it is. I absolutely loved it, and yet I find myself unable to write a coherent review... because the movie is absolutely crazy, as well as being cinematic perfection. It's one of the greatest films I have ever seen, or rather, experienced! Instead of writing a full review, I feel this movie is best described in points, because I don't want to say too much about anything, I just want this to convince anyone reading this to go out and see it as soon as they can (in theatres with an audience)! It's the most original and creative piece of filmmaking I have witnessed in probably the last 5 years, I just can't believe what the directorial duo Daniels was able to pull off here! So without further ado, here are my thoughts on \"Everything Everywhere All At Once\":* The film is flawless and true cinematic perfection in my eyes!* An assault on the senses; the visuals and sound design are insane!* Extremely impressive from a technical standpoint.* Editing is a huge standout and was incredibly done, the edit alone took us on a ride! They used match cuts so creatively too!* Cinematography was stunning, I especially loved the creative use of lighting!* Sound design was absolutely crazy, it had so much going on and complimented the visuals perfectly!* Every genre of film in one!* I've never seen anything like it, it's ambitious, crazy, bonkers, insane, creative, hilariously funny, heartfelt, clever, wild, awesome, the best, odd, wacky, touching, chaotic but in a well-written way, stylized, brilliant, and most of all, masterful!* None of this movie should work, and yet due to the Daniels' excellent and clever direction, it somehow does (and yet I still don't know how they were able to pull it off)\n* There is no way Multiverse of Madness will be half as crazy as this movie, this is the best multiverse film we will probably ever see\n* The writing so cleverly establishes the multiverse rules and keeps it flowing in a way that allows you to feel like you understand what's going on despite how complex it gets. It perfectly guides you through the story without spoon-feeding it to you, making sure the chaotic multiverse makes sense.* Also loved the thematic exploration in the story, and that they didn't let the novelty and entertainment value of the multiverse stuff take away from the story, it just complemented it instead. It's some genius writing, especially when heading into the second half of the film where the emotional/thematic core really starts to open up and shine!* Action is phenomenal and intense. It's some of the best I've seen in the last few years, it's so wild! It's very stylized and impressive, the Daniels know how to direct action so well. They get great coverage that shows off the choreography and every hit, and perfect timing for cuts.* The film is so funny, has some witty dialogue, insane gags that I never saw coming, and some hilarious comedic payoffs - one of the funniest movies I've seen in a while, it had both me and the audience howling with laughter!* Michelle Yeoh's performance is astonishing! She's just awesome as the lead; she's so badass in her action scenes, so funny, and yet still gives such an emotional, heartfelt performance\n* I also loved Ke Quan as her husband, he was so loveable and had some of the funniest moments. So great to see him acting again, have really missed him since his days in \"Indiana Jones\" and \"The Goonies\".* Stephanie Hsu was phenomenal as the daughter, and a huge part of why the 2nd half of the film works as well as it does!* Jamie Lee Curtis had me laughing so hard, she was hilarious here, I've never seen her do anything like this!This film does things you would never expect to see, and I loved it for that! I was enamoured by this film, it's truly a glorious piece of filmmaking. It's one of the coolest films of the last decade and I cannot stop thinking about it. I really want to see it again too, it's so much to take in on first viewing! Daniels truly knocked it out of the park on all levels; as a comedy, action film, familial drama, sci-fi film, something that's thought provoking and emotionally potent, technically impressive and so imaginative. It's just a masterpiece; cinematic perfection. It left me with a feeling of pure joy, I really hope everyone gets a chance to experience this film. You have to see it in a theatre with an audience... it's an insane experience! I just loved it, highly recommend! The film's title really says it all; it's \"Everything Everywhere All At Once\"!",
    "136": "Finding it difficult to think of the words to use to review this movie.Acting 9/10Top notch performances from everyone involved. Yeoh in particular is magnificent. Great to see 'Shorty' make a major flick comebackPlot 5/10People seem to think it's hugely original but if you think about it, it's got loads ripped off from The Matrix. Some funny parts and an interesting concept but too slow, mainly due to the huge over use of slow motion effectsEntertainment 5/10Some entertaining parts with nice choreography and fight scenes but it felt way too long and started to drag near the endCinematography 10/10Some truly beautiful scenes and very well madeCharacters 6/10Lead and her husband are great. Her dad is great too. Daughter rather annoying.Effects 10/10Superb. Top notch, especially during a time of some diabolical CGI being used in media.Dialogue 7/10Great mix of the two languages. Some truly mental dialogue at times.Longevity 3/10I won't be watching it again. I feel like it won't be a long lasting classic that people talk about in the future.Music 2/10Actually pretty poor. Quite annoying and frustrating at times. Hurt my brain.Flow/Pace 3/10Far too slow and really dragged towards the end. Too much slow motion used.Overall average 6/10.",
    "137": "I was positively surprised with the first 30 minutes as I had not watched the trailer and was not expecting anything special. Well, it was special and I enjoyed it even though I felt like stuck in a nightmare watching the scenes and jokes repeating again and again. What sounded like a genius plot at first, quickly becomes an everlasting dad joke as the story unfolds.Ironically, the story lacks of dimensions. It felt like we are served a nice chocolate mousse as a starter and then the main course is also a chocolate mousse and surprise surprise the dessert is also a chocolate mousse. You still eat it because you like it but it does not taste the same at some point.One important disclaimer comes from the fact that I did not watch EEAAO in the theater, which I heard is a game changer. However, I do not believe that sound or visual effects could improve the flatness of the jokes.",
    "138": "Everything Everywhere All At Once is the best movie I've seen so far this year and it'll be hard to top, it blew me away in every way possible, this is one of the most original stories and plots I've ever seen in my life, with some of the most creative stylistic decisions I've ever seen, this movie will be hard to top.This film has an unbelievable cast, Michelle Yeoh KILLED it as Evelyn, but Ke Huy Quan was absolutely phenomenal, and it was unbelievable how long he hasn't acted and how well he pulled it off, this is one of the funniest movies I've seen in years, with fantastic action sequences and an epic ending.Everything Everywhere All At Once is a beautiful, hilarious, heartbreaking movie with one of the most interesting parent and child dynamics ever, they threw everything at the screen, and this is the best A24 film since MidsommarAnd, it's the first movie in 2022 to get an A+",
    "139": "When it comes to independent films, namely the studio A24, I'm always eager to watch. As much as I do love going to see blockbusters on opening weekend, it's really all about how good a story is for me when it comes down to it. Everything Everywhere All at Once is one of A24's latest releases now playing in theatres and I haven't seen a film this weird and also thought-provoking in all the best ways, in a very long time. It's been almost a week since I've seen it and I'm just now wrapping my head around what I watched. When I first heard about this film I was excited, but I didn't expect how deep it would be under the surface.To put it as simply as possible, Everything Everywhere All at Once is about Evelyn Wang (Michelle Yeoh), a woman who is struggling to keep her business going. As she's being audited an opportunity presents itself. Since she's in just a bind, she goes along with it, but it unleashes an endless number of realities. Being able to see many different versions of herself, her husband, her daughter, and many others, she basically discovers what her life could've been like, for better or worse. On top of that, abilities are garnered by her, due to the studying and linking of her other, smarter selves. The way this film gets to its climax was both wacky and emotional for me.This is the first review I've written in a while where I don't feel the need to complain about a single thing and also don't want to get into too many details and ruin it for anyone. I will say that it's absolutely not for everyone, simply due to the sheer weirdness of it all. This will more than likely turn off some viewers. Yes, it's incredibly weird and off-putting at times, but if you really think about the visuals on-screen, the meaning behind it all and where it leads just brought me to tears. Speaking of the visuals, for a smaller budgeted film, I was blown away by how this film was made and looked overall.In the end, Everything Everywhere All at Once earns one of the biggest recommendations from me in quite some time, but I also want to warn those who aren't a fan of weird cinema. It's bonkers in all the best ways. I loved the direction by both Dan Kwan and Daniel Scheinert, but I wasn't surprised by that because I loved their previous film, Swiss Army Man, which is arguably even weirder. From the technical achievements to the moving dialogue, to the straight-up cheer-worthy strangeness that it has to offer, I walked out of this film overjoyed. Everything Everywhere All at Once deserves to be recognized for awards all year long and I hope it continues to get the attention it very much deserves.",
    "140": "I had succesfully avoided any trailers or spoilers prior to seeing this film. All that I knew was that my favorite film critics were calling it excellent and weird. While both of these are true, I want to offer what may be a common praise but I have yet to see because I am reviewing blindly: this film handles absurdism in the most realistic way I have ever seen. Taken out of context, numerous scenes from this movie would be the most ridiculous thing you have seen on the big screen. But every single one of the bits and jokes and plot devices works within the context of the film, which is so beautiful. I don't know that I count this as spoiler so I feal comfortable saying, there is a bit where two objects are talking to one another that is so absurd, but it serves to eventually be the most poignant symbolism in the entire runtime.Of note, Stephanie Hsu is an absolute standout. I am scrolling through her film history now to add things to my watchlist because she was so phenomonal. I assume she had a blast with the role given the context of the character, as did the design team. Everything Everywhere All at Once is a film you won't soon forget, and you should see soon so that you can be in the conversation if it is ever brought up, inevitably, for years to come.",
    "141": "I enjoyed this movie for what it was. Pros: decent acting, great action sequences, good cinematography, great imagery.Cons: Loads of cliches, sophomoric humor, sloppy writing, overly baked, unoriginal.It's definitely par for the course in an age of short attention span and low expectations. A high pace tempo and colorful style to keep the masses dopamine flowing.I'm not surprised it's rated so high, considering how Hollywood force feeds movies like \"Glass Onion\" and Marvel down our throats. But at the same time, this movie was enjoyable enough to get something out of it, Pure energy. This is not a mind blowing movie and not nearly as intelligent as the mainstream believes it to be.6/10.",
    "142": "I will agree with lots of poor reviews here by the audience. As much as I would like to love this film, it did not do something different for me. The concept of the film, the reasoning behind the plot is quite similar to the movie \"tenet.\" And the reason is \"nothing at all.\"The movie runs us through the problems of the main character and how different choices made by her could have meant a \"better life\" than the one she already has. But the main reasoning for all of the action and plot was confined down to her daughter's issues with her. It'd have been interesting if the main character was the villain in the alternate universe, where she snapped and gotten all vengeful of the universe/s as she crumbled down the years of emotional and mental torture.Also don't even get me started on the bagel. It was an annoying detail in the film, i don't know if I need to have an artistic mind to actually appreciate that concept but I truly do not.It's a good action movie but not a great sci-fi movie. Which is why 7 is for the action, acting and overall attractive scenes. You just have to turn your brain off in order to enjoy it without thinking about it in the back of your mind. The movie is infact not worth the hype, watching it or not watching it wouldn't make a difference in how you understand the concepts of science or the possibility of alternate realities.",
    "143": "First let me start by saying that the acting is great, seriously, but it stops right there. The film on the other hand is the product of someone's random thoughts, badly edited, way over stretched scenes and ideas which repeat throughout the film over and over at random intervals. I have no problem with slow movies at all. I've seen \"Moon\", \"2001\", and many other \"slow\" movies, and I loved most of them. I love art in general, I love staring at great paintings, admiring sculptures, and reading a good book. This is not only a slow movie, but also one where every single idea is massaged over and over, and then massaged again, and when you think it is done being massaged, the director or editor massages it a few more times until you are so fed up with that idea and scene that you feel like leaving the theater. The movie is about love, care, and relationships, but other than that there is nothing deep or complex about the story. Alternate reality is not a new concept, yet the writer chooses to add too much complexity where it isn't needed, it makes the movie difficult to follow, especially due to the alternate reality / multiverses of the story.While in the theater I heard many people laugh at some of the dumbest jokes, then I realized OK, this movie is targeted to an audience who enjoys these types of punch line jokes.All in all I found this movie a complete disaster, hence the one start rating.",
    "144": "8.3/10This isn't much of a review, but it's a small tidbit on the filmThis film is absolutely true to its name. It's pure chaos with so much going on. I don't think I have a big enough brain to explain what I watched. The cinematography, score, story, and acting were all just spectacular.The meaning of the story was ultimately the thing that made me most pleased with the film. We all have stuff going on in our lives and though we may be distracted by them. If we be true to ourselves and those we care about we can come out on top.Overall, if you can get past reading subtitles this is a film I would recommend checking out. It's pure chaos, but it tells a compelling story.Thank you for taking the time to read this very short, and not entirely helpful review, but I hope someone gets something out of it. Until next time.... Enjoy the show!",
    "145": "Everything Everywhere All at Once is a film like no other that effortlessly switches between painfully funny comedy, impressive action and heartfelt drama. A truly original film that covers so many genres and ideas without ever losing sight of the extremely emotional core at the centre of its truly ambitious narrative.Michelle Yeoh has never been better with an incredible lead performance that utilises all of her talents. Ke Huy Quan makes a triumphant return with a performance and character that's endlessly loveable. Stephanie Hsu is also impressive, skillfully switching between antagonist and emotional core.The direction by Dan Kwan and Daniel Scheinert is phenomenal, always visually striking, endlessly inventive and the fight scenes are impressively shot, exciting and impactful. The visual effects are ridiculously impressive, especially considering the lower budget.The pacing is extremely strong, gaining momentum early on and never losing it. The music by Son Lux is fantastic, swapping genres along with film perfectly whilst also keeping the core style and voice when necessary.",
    "146": "\"All in Everywhere at the Same Time\" is a well-acted, well-directed film with very good sound editing and mixing, however, I don't like its marvel-like humor, its criticism seems hollow, its slapstick style is unconvincing and its editing is tiring, the good editing of the film is lost when you use it to excess, and that happens with all the good aspects, after an hour and a half, everything stops working and at a certain point I just disconnected from the work, I thought about everything , except for the movie there in front of me, I don't understand how hype it is and the theaters are so full, it's the same audience that stays in queues for hours to see \"ant-man\" or any canned food of that kind, and at the end \"All in All Place at the Same Time\" is a gourmet canned food with good ideas that gradually self-destruct, leaving a giant shell of scraps behind. I like the universe created and I like the performances, but all this doesn't hold back the great tangle of \"nothing\" that we have here, in which even its great differential, the \"humor\" is weak, its Oscar competitor, \"Inisherin's Banshees\" it is a film with a humor that is also present but of an infinitely superior quality and tune. Note 7/10.",
    "147": "This movie is insane. It has multiple universes, an IRS audit, oddball comedy, insane action sequences featuring buttplug statues and dildos to name a few, a main character who is a middle aged low-wage immigrant worker, her husband who is scared of her and wants to divorce her (at least in the main universe). And none of those are really the main storyline. The main storyline is a troubled mother and daughter struggling to connect due to a variety of factors. And it's later revealed that this issue stretched across multiple universes and realities to which it manifests itself in an absolutely bonkers way. The movie sometimes puzzles over what reality....is....man...you know. And how small we are, whatever we are.Overall I felt the pace and moment where the 2nd act meats the 3rd act was the weakest part. I felt like it the pacing near the last 45 minutes seemed too slow as well. I also think it might have been improved if one or two of the alternative universes had been cut to keep the story more digestible.But overall I had a fun time. I want to reassure people that I'm not someone who always loves crazy, artsy, sci-fi movies. I despised, the Matrix movies, Tenet and The Green Knight movies for instance. And all of those films have similarities to this one. However, this movie has moments which I found very funny. It doesn't treat the sci-fi concepts too seriously when they're clearly ridiculous. And it does take the family dynamic between the characters seriously. And that to me makes this movie worth watching and recommending. It's probably more fun to see while on drugs. I'm sure it has as a lot of interesting Easter eggs to spot on additional viewings as well. The acting and cinematography are great. The script is good given how many issues it could have had for how ambitious the scale is for this story. Overall, it's a film I would recommend. Just prepare yourself for insanity beforehand, and you'll only be rather surprised by what you see. Luckily it's also engaging and emotionally relatable rather than just odd for the sake of being odd.",
    "148": "The movie starts (20-30 minutes) \"fine\", quite annoying with MCU type quips and jokes that almost destroy the exposition destined to explain the main character and her circumstances (and a bit the secondary characters), but good enough to get us interested in the premise.After that though, it quickly becomes non-stop nonsense, movie references, and repetetive action sequences full of \"quirky\" \"jokes\"/\"gags\" that were only embarrasing, if anything.The plot and characters are so simple, we (me and my cousin) guessed what the movie was going to say and how it was going to end after15 minutes. Also the tonal disnonance between raunchy humor and \"old school\" sentimentality was jarring.In the end, even Disney movies were/are more sophisticated in their way to tell this type of \"feel good\" stories.",
    "149": "I suppose, I am too old, at my 47 , for this film. Imaginative, energetic, honestly crazy and chaotic, a script created by a sort of too lonely teen, isolated in his room and writing all the thoughts delivered by imagination, fake and childish, a mix of fantaisies, truisms and cliches, it has, for me, a basic virtue - it was the trampoline, for three actors who I appreciate, to have the Oscar prize, against their silly roles in this pure awfull film.It is a huge puzzle, with familiar influences or references, with a bizarre story, translating some slices from near reality and viewers dreams , but having, obvious, as target, the young - young people, technologized, feeling , in intense manner, the term cool .Sure, some compensations but for me , a middle age Romanian, an experiment, the relation parents - children or burocracy, Jamie Lee Curtis becoming Michael Myers , the presence of venerable James Hong working only as a sort of...spices in this case.So, something saves it ?I suppose, all sins, mistakes, eccentricities are compensated by beautiful eulogy of family, just touching . And by image and the hard try of a large, tenatious team, to show their absolutely crazy perspective about life, mixing obvious truths and large slices of fairy tales themes.So, a film for very - very young audience."
}