{
    "0": "Writer Richard Curtis reimagines his 1991 BBC television movie Bernard and the Genie. It is as unimaginative as the title Genie.Overworked and underappreciated Bernard (Paapa Essiedu) misses his daughter's birthday. His heartless boss Oliver Flaxman (Alan Cumming) asks him to work late at the last minute.Not only does he miss her birthday, he does not even get the present she wants. It is the final straw for his wife. She leaves Bernard.A distraught Bernard rubs an old jewellery box and out pops genie Flora (Melissa McCarthy) who can grant Bernard an unlimited number of wishes.He uses Flora to get his family back together. While Flora holed up in that box for 2000 years takes in the modern world. It consists of pizza and Tom Cruise movies.While Bernard and the Genie was full of low key charm and took potshots at commercialism. (Bernard was played by Alan Cumming.)Genie struggles with an actual plot, humour and charm. The premise of the movie and the wishes are wasted.You would be better off tracking down the television movie that had Lenny Henry as the Genie.",
    "1": "Written by that prolific writer of usually hit film and TV productions Richard Curtis, this must be his idea of a Christmas stocking filler?That is, it is light and airy and not to be taken too seriously, either plot wise or as a movie production. Its adequate, amusing, touching, and even laugh out loud funny in parts. Melissa McCarthy is its saving grace, delivering her lines with wit and charm, and emotion as only she can. The 3 actors comprising the family do not really gel together, the mum and daughter were not very well cast IMO. I think RC made the father lead watch a bunch of Stephen Merchant performances, and told him \"act like that\".But it all held together well enough to enjoy as a pre Xmas movie taster, before you unwrap the real presents, such as Elf, National lampoon, A wonderful Life...or whichever are your go to Seasonal favourites.",
    "2": "I thought this film was terrific. It was funny and fun, plus the soundtrack was excellent. I thought the film was well cast, too. It's not Hallmarkish at all. Melissa McCarthy has been in a couple of stinkers, but this is not one of them. Don't expect a deep or profound message. This is just about a guy (excellent actor, Paapa Essiedu) who realizes that he has put his family on the back burner and he tries his best to remedy that. I'm not sure where all the hate for this movie is coming from. It was written by Richard Curtis (Love Actually and Notting Hill) so seriously, how could it be bad? Ignore the hate and watch for yourself.",
    "3": "I get that the husband is a workaholic loser and so the wife needs some 'space' away from him. Enter Melissa Genie granting him 'unlimited' wishes. Wrong! So nonsensical since he now has the power to pretty much change the world i.e. Create a trillioni dollar foundations for every disease known to man! Maybe win some huge state lotteries and donate the cash??? He has a couple of final wishes, maybe use them for family health crisis, kid's education, money to guarantee the families financial future (especially since he is newly unemployed). Nope forget any such things all of us might well do. Why insure your kids education and family's health and security when you can use final wises to get a restaurant table and then to order a peanut butter sandwich when it is not on the menu? Worst writing ever! None of this is any sort of spoiler to the main story, wife/husband/kid and we all know how that will end in all the nice family comedies.",
    "4": "Everyone who left a 10/10 review is lying. If I had an 1 hour and 33 minutes to live, I would watch this movie again because it would feel like an eternity.The main character is the real villain of this movie. He has no redeeming qualities whatsoever. He's selfish, greedy, and ridiculously stupid. Ironically, the genie thanks him for not being any of these at the end of the film.This film felt like the writers and the director had no idea which direction they wanted to go in. They kept throwing in random scenes of the genie being sad with no context as to why. Not once does she bring up how lonely she is or how trapped she is. They randomly threw the Mona Lisa painting in the film, which mad absolutely no sense. It just seemed they wanted to throw a scene in there that would somewhat relate to the original movie. I don't think the director even knew why he had that scene in there. He may have been high. Who knows.The saddest part of this whole movie is that Melissa McCarthy couldn't even carry this movie. I'm pretty sure the only reason she was in this film is because the producers used all their money to have her star in it which is why there are so many unknown actors in this film.TLDR; This movie was awful. I wanted to punch the main character in the face the entire time. Wishes wasted at the end for a peanut butter sandwich (NOT EVEN JELLY WITH IT). My blind cat had to leave halfway through because she couldn't bear to watch anymore of this. Don't waste your time. Watch elf instead.",
    "5": "So man whose life is falling apart rubs an old jewellery box and out pops Melissa McCarthy as a genie after being locked up for 2000 years - talking in modern day American slang. That's the first inconsistency in their appalling written and scripted 'story' - I use that term very loosely.There's some vague backstory about being trapped in the box by an evil wizard but then she can give unlimited wishes so never explains why or how she's back in the box again? 🙄 there's a couple of funny moments about her learning the modern world - but too be honest the overlap with the Xmas theme was a huge miss. This movie wouid hve been better as a genie in the modern world, the end. Ditch the Xmas part oh and unlimited wishes is dumb. Shouid hve made it 10 and then he wishes her free from the box with his last wish. Much simpler and better story than this mess. At least it's not made by her husband... wow he makes terrible moves.",
    "6": "Genie is a Peacock movie and our first Christmas movie of 2023 counting down to the end of the year. The film tells the fairy tale story of Bernard (Nardo) Follows who is played by Paapa Essiedu. Nardo losses his job and his family because of his workaholic demanding boss played by Alan Cumming. Alan's character was very similar to Scrooge from Charles Dickens novel. Nardo down on his luck opens an old box and out pops a genie who is played by Melissa McCarthy, she also helped produce this movie. Unlike most genies this one had multiple wishes and she helps Nardo find his ways. I felt I was watching a Hallmark made for tv movie but with corny laughable jokes. This was a good family oriented movie but I wouldn't watch it again.",
    "7": "The writers of this film showcase a stunning lack of creativity, offering a narrative where the antagonist's wishes are painfully mundane and devoid of any depth. The movie's virtually non-existent storyline and the bafflingly high rating contribute to a cinematic experience that can only be described as a testament to the writers' incompetence. The concluding wish to erase everything and revert to a mundane routine further underscores the utter lack of skill in crafting a compelling narrative. It's a regrettable display of storytelling that leaves much to be desired, emphasizing just how subpar the writers are in delivering an engaging cinematic experience.",
    "8": "Don't watch this trash, there are a lot of great movies and shows out there. This is not one of them. In the filmd It's A Wonderful Life, there is a line that goes \"Everytime a bell rings, an angel gets it's wings.\" Well in this case, Everytime someone watches this terrible excuse for a movie an angel loses its wings. There are no redeemable parts, there is no comedy. Melissa McCarthy just plays the same tired character as she's does with everything she is in. She probably filmed her parts over a weekend, took the paycheck and off she went to film the next trashfest. Don't waste your time or hard earned money on this mess.",
    "9": "If you are looking for a new Christmas story that will make you smile and feel good all over, this is the one to look for. As always, Melissa McCarthy steals the show as an irrepressible, fun loving, yet slightly jaded by human nature, genie in a bottle... make that jewelry box. Her latest wisher is a loving man whose only fault is that he is a workaholic who can't see the forest for the trees until it is too late. On the very brink of losing everything he cherishes most his discovery of the genie could be his saving grace. Of course, this is a fantasy so not everything needs to make logical sense. The film is so much fun to watch that it doesn't matter one bit. Just sit back and enjoy the fun. Happy Holidays everyone.",
    "10": "Possible Spoilers - Just to be on the safe side. Where to begin? An unbelievable premise, shallow characters, flat dialog and the general \"I just can do whatever I want syndrome\". I usually like Melissa McCarthy, but this movie is a complete waste of her comedic talents. To think that Bernard had the container that held the genie in his house for who knows how long and never once bothered to even clean it smacks of lazy writing and is just the beginning of a series of improbabilities compounded by boat load of impossibilities. Don't waste your time watching this sorry excuse for a \"Feed Good Christmas Movie\".",
    "11": "Saw this advertised on Sky and I enjoy anything that is done by Richard Curtis - Four Weddings and a Funeral and Love Actually.Not a big fan of Melissa McCarthy but she really plays the part of the genie really well and if it wasn't for her, I think the movie would have fallen flat much earlier in the movie.Paapa who plays Bernard plays his part very well but I felt it was spoilt by his wife where they seriously lack chemistry. There were obviously issues in the relationship for some time and not just over two occasions that he missed due to trying to make sure they all have a roof over their head and mouths to feed.I have come to notice one thing with Richard's past success with movies and it is keeping it British. British humour doesn't work well with Americans and vice versa.Bring in British actors and I guarantee you, it would have been a much better film we could all relate to.Towards the end it felt very rush and didn't particular enjoy it. Throughout the film it was trying to make Bernard change for the better, put his priorities in place etc but yet the end all he needed to do was go back in time and replay the same scenario again but being there much earlier, wasting his wishes on a restaurant and over a menu choice.Would have been better, if Bernard and the wife either got back together or got divorce but making Bernard a better person all round and if the wife couldn't see that then he would have been better off without her.Starts strong but a very flat finish.",
    "12": "I love Melissa but this was awful to watch. Every scene that didn't include her was a torture. The couple and kid were horrible actors and the chemistry was just fake. I don't think I would have made it to the end if not for Melissa. She was brilliant and I loved her sense of humor.Unfortunately the script was below mediocrity. This is a story about a hardworking man who couldn't send time with his family on his daughters birthday, because he was working? This must be the most unappreciative wife ever. Also the severity of the matter didn't warrant her moving over to her mom's and then separating. And which mother in law would encourage her daughter to leave her husband because of work? Honestly, this story was real bad.So now, you have unlimited wishes and all you could do is buy gifts for your wife and kid, redecorate your house, get a new car, and steal the Mona Lisa? Are you for real? Oh and help out a few children. Talk about lazy writing....Do better next time.",
    "13": "If you watched this movie expecting anything other than a delightful, LIGHT, family comedy, that's on you. It's a great holiday movie and everyone in it is believable enough...FOR A MOVIE ABOUT A GENIE. Get a grip on these comments, revert back to your pre-internet days before you criticized every.single.thing. This is a great movie. Turn off your anger and enjoy something for once. McCarthy is great. The main character is sweet, you will laugh, you will cry (if your heart is not two sizes too small), and you will think about how your wishes all revolve around money, while those in this movie do not...",
    "14": "Genie is a great addition to your holiday movie favorites. It's got all the elements you would like in a holiday film. Melissa Mccarthy is such a great genie. Never in a million years would I have pictured her as a genie, but she is fabulous. Having been in her container for approximately 2000 years, she is mesmerized by the modern world. Her reactions to things we take for granted, such as a film or music throughout the house, was very entertaining and endearing. Paapa Essidu plays the owner of the genie. He does a great job. He is equally likable. In a holiday film, your main characters should be likable. This film does what it sets out to do, lighten and brighten the holiday season.",
    "15": "This movie has an impressive cast of actors. If nothing else, it was fun to see who would pop up in which roles. The story is fairly predictable and offers very little surprises, but isn't that kind of the point? This is a good in-the-background, silly holiday movie. It won't keep your attention, but it certainly makes for a fun atmospheric movie to have on. I loved seeing the actress from The Golden Age in modern clothes! She's gorgeous either way. I'm not familiar with the main actor, but he has a good amount of charm and warmth that I'll look up where else I can watch him. The movie did the classic \"how in the world do they afford that New York apartment???\" but it's not a documentary so I think we can roll with it. Again, don't go in with super high expectations and I think you can find parts of this movie that are enjoyable. Happy Holiday!!!",
    "16": "It doesn't get to the 'so bad it's good' level. It's just plain bad.The story is predictable and pretty lame. Over worked father who loves his family but has horrible boss who is unreasonable. So wife leaves him. Even though she loves him and he loves her and they both love the kid.Genie pops up and grants unlimited wishes. Cue stupid wishes and unintended wishes. Introduce random family characters who are all just vile humans. It's hard to believe this nice man has come from same family as these horrible people.Inevitable happy ending for the family and the Genie. You could guarantee that Bernard will\nLet her go free eventually. He is such a nice man.Horrible movie. Waste of time.",
    "17": "This movie was sadly underwhelming. Not so much that Melissa McCarthy had to carry this but more of the storyline that was weaker than a Zimbabwean dollar. I couldn't get over the facts and how at the end of those facts the wife separates from her husband AND he acts like he doesn't have anything to say but okay: a couple living in a HUGE dwelling in NYC with a young child and the child doesn't attend a private school; a Black wife married to a Black husband with a lucrative job that requires him to work at unscheduled hours but that job definitely contributes to them affording an upper-crust lifestyle; a husband who hasn't done anything to warrant a separation; a well-off mother-in-law who provides NO speaking counsel to her daughter in the midst of this separation. He's a good dad and husband.It all reads as a non-white person writing a cute, but lame, story with no attention to cultural dynamics from non-white people. I would believe genies (djinns) existed before I took this plot line seriously. I wasn't entertained.",
    "18": "The rest of the cast were awful. I found the wife extremely unpleasant. I don't know whether she worked but he must have to earn a small fortune to afford an apartment like that in New York and yet she begrudges him having to work long hours. The kid apparently takes after the mother and is unpleasant. So he gets unlimited wishes and wishes for stupid unnecessary wishes. Who wouldn't wish for world peace and lots of money and excellent health and an end to homelessness. Only watched because Richard Curtis has written some brilliant stuff in England and I like Melissa McCarthy. Not sure I could recommend it.",
    "19": "Instead of using the wish responsibility and reasonably; The family have to move to a rundown neighborhood where the parents constantly fight because lack of money and the little girl now a teen uses drugs and sex to escape her harsh miserable life and soon became pregnant by some random boy from high school which will increase the finance burden on the family. However, the selfish, nagging wife is having an affair and decides to divorce her husband. Then the stupid, idiot husband who should have wish to have multi-billion dollars and a fully owned house or condo, drank himself to death. The End.This movie was so stupid and I have a headache.",
    "20": "I just love these reviewers that give movies like this a 1 or a 2 and say it's \"unbelievable\". Would they also give a Tom and Jerry cartoon a one because Jerry hits Tom over the head with a frying pan, and \"Oh my gosh!! The cat didn't die! That's so ridiculous!!\" C'mon folks, this movie is like a big cartoon, with human characters. You pretty much know where this movie is going by watching the preview. But so what. It's still loads of fun, and rated PG so you can watch it with your kids. Sorry all you serious film buffs. No naked women, no sex, no swear words, just a whole lot of fun and \"fish out of water\" type jokes. Melissa is a fun title character, and Paapa Essiedu is the perfect \"straight man\". Have yourself a nice, clean enjoyable evening watching this one.",
    "21": "It is one of the worst, most boring and shallow movies I've ever seen.Unconvincing, bored, forgettable acting work, terrible writing.I gave 2 starts only for the effort and I feel generous for the moment. Honestly, it should not receive any, to be completely real about this grey, nonsensical garbage. The moment we finished watching it, I immediately removed the entire folder containing this D-category boredom, just to make sure I never come across again. Ever.I would be terribly curious about the total budget spent on this project, I don't think it was a lot. They probably hired a writer from Fiverr, a few unremarkable B-category actors, and they asked Melissa to act her most boring way she can. And she delivered it all! It's so unremarkable and boring, I'm yawning already just writing about the movie.",
    "22": "This movie made me extremely happy. First of all I think it might be my favorite with Melissa McCarthy. It was just amazing. She was so perfect for this role and I love the way the story was told and I love the fact that it was funny it was heartfelt it was unique in a sense of being true to oneself as you'll see. I think that the ratings on this movie are way too low. It made me very happy and I'm going to watch it in fact again that's why I'm giving it a 10. I think in this day and age it's a safe good movie for everybody I think I fell in love with the main character in this movie very humbling very realistic. You can't help but fall in love with him it's just a sweet movie and ends up in really such a sweet place! I could say more, but I've said enough please watch it enjoy it. I think it's a wonderful little movie, and I think more people should give it a chance.",
    "23": "It seems nobody talked about this, but I've been having the question during the entire movie as soon as I saw the almighty genie: is it possible for a guy who has to work so hard to raise his family not asking for a fortune from the genie?Yes, asking money can be cheesy and money won't always do good things. But it's definitely reasonable and pretty much every ordinary people's wish, isn't it? To not asking for it makes the main actor looks off, the writer look lazy, and the entire movie feels wrong at the very first beginning, even just as a silly holiday movie. To make it worse, all the wishes asked are not surprising or fun. The only moment that I laughed was for the wish \"go to the hell\". It's especially ironical that the numbers the genie left for the main character was considered to be lottery numbers. It is the only time the movie talks about money, and it feels nearly stupid. Unfortunately, Melissa's good performance is not enough to save this movie.",
    "24": "A typical genie Christmas movie. You can predict the majority of this plot. Man is to wrapped up in his work with a boss who exploits him. He misses his daughters birthday and the movie starts. Wife and daughter leave to her moms and leaves Bernard alone. The antique he tried to gift his daughter was actually the genies box enter Melissa McCarthy. With unlimited wishes he tries to make things right with his family again. It does get crazy with police, fire, and Tom Cruise movies. Like most movies, this one does have a happy ending where the family is back together. By the end you also find out what happened to Flora so there are no loose ends.",
    "25": "I was looking hard for a new movie I could watch with my family. I found this on peacock and was impressed that it was only rated PG which was a selling point. Not many live action films that aren't preachy Disneys exist as PGs.I was pleasantly surprised that the comedy was on point and I thought the casting was great between the main characters. I had a few good laughs with my wife and daughters. The film was just entertaining without the slightest form of activists messages. I really appreciated a good fun family film with no agenda.The Genie was portrayed uniquely and she was hilarious.I gave the film a ten not because it's the greatest Christmas comedy of all time, but because purely entertaining family films don't come along very often.",
    "26": "Melissa McCarthy was a perfect choice for the genie and while there is little new about the story, it was done in a very enjoyable way to make everyone feel good. Enjoyable was her finding out how things had changed in the over 2000 years since she was put into the box by the evil sorcerer. Bernard works too hard for a terrible boss, and as he is about to go to his daughter's 8th birthday celebration, his boss grabs him to show a presentation to a client, so by the time that is over, the birthday is over, and this causes a split with his wife, as it was not the first time something like this happened. As he sits and ponders what will likely happen, he picks up this antique box he has, starts to polish the top, and along comes the genie. Melissa McCarthy was ideal to play the genie, and really makes the movie. It is simply a fun movie to view. I can see this becoming a movie replayed during the Holidays. And when it comes to wishes, just remember that everyone regrets wishing for a camel.",
    "27": "This was a fun movie. It isn't Oscar contending, but who cares? I watch movies to be entertained and sometimes that comes in the form of movies like Genie and not always in movies like Titanic. Melissa McCarthy is so cute and likeable in this. She is always fun to watch. I also liked Paapa Essiedu in this. He was equally as likeable and did his job well here. The wife wasn't worth all the effort he put into getting her back (she came off as petty, selfish and irrational) but it mattered to Bernard and that drove the movie.Sometimes I just want a quick, easy watch that doesn't require too much from the viewer other than to be entertained and this movie did that very well. I think more people would do well to just enjoy these types of movies for what they are and not always try to be armchair movie critics by pulling out their thesauruses and work hard to try and impress us with their hoity critiques of fun little movies like this one because here's a spoiler alert for them... you don't.",
    "28": "The four top stars bring the funny, the heart and the soul, but add Marc Maron, Luis Guzman and Alan Cummings in fabulous supporting roles and the whole movie gets an upgrade from the regular holiday movie. I particularly could have seen more of Maron and Guzman's characters. The genie 'rule changes' are welcome for this movie, and some of the answers to the wishes are particularly hilarious. One word of advice - don't get too bogged down in certain timing elements, particularly with the beginning and the end of the movie. Remember - you're watching a movie about a genie, so all of your logic doesn't really apply. Definitely a movie I will look for again next Christmas.",
    "29": "Written by Richard Curtis (based on his \"Bernard And The Genie\" from 1991) fun Christmas comedy \"Genie\" is naturally terrific. Overworked Pappa Esseidu (great) misses his daughter's 7th b'day bash, so wife Denée Benton leaves him (bit harsh)... then a'hole boss Alan Cumming (the original's lead btw) fires him... making it a fine time for genie Melissa McCarthy (in top form) to come grant him unlimited wishes. Cue bright, festive daftness in beautifully lit New York as Esseidu & McCarthy try (via ups & downs) to win Benton back. Sam Boyd directs his 2nd movie with requisite charm & warmth, delivering a thoroughly enjoyable film for the whole family.",
    "30": "I actually thought it was a pretty good movie, it was well written, quite funny which I expected because Melissa McCarthy. It's a nice family type movie; I found it very rare these days at movies like this come around because a lot of movies these days are trying to be politically correct through the likes and desires of other people and their personal beliefs. I think it's really good that a movie like this comes around that you can laugh with the family and get a good lesson out of the whole entire thing. It teaches how important family really is compared to the life that a lot of us have been chosen to live which causes us to put our family on the back burner. I actually like this movie, it was pretty good.",
    "31": "This film is decent but has some odd plot elements that make it somewhat less than it otherwise could have been.The cast is likable, Melissa McCarthy has undeniable talent and charisma.The plot itself, the script, it's just...ho-hum. I mean, it kind of feels like they let an AI write it, it's just sort of bland?For example, the weird choice to have the protagonist jailed for stealing the Mona Lisa was very silly and took me out of it.Minor complaint, but why in films about wishing are the characters always altruistic individuals who do nothing overly greedy? For example, it would've been more convincing that the lead learned important life lessons if he wasn't already incredibly wealthy, even not fixed up that NYC Apartment would be 50k per month, it was huge!\"I'm slightly less wealthy...oh such growth!\"Film was a bit heavy on CGI, I'm not even sure it actually was filmed \"in\" NYC, all looked like a lot of green screen tech to me.So sure, pretty okay holiday themed low stakes AI written CGI-glossed wish fantasy film. But Melissa McCarthy makes watching this worth-it-ish.",
    "32": "What an enchanting performance by both leads in the new genie Christmas movie brings a delightful blend of humor and heart to the festive season. The film weaves a magical tale with a modern twist, leaving audiences of all ages captivated by its charm. McCarthy's comedic brilliance shines through, adding a touch of whimsy to the holiday spirit. The storyline is a breath of fresh air, cleverly balancing humor, warmth, and a sprinkle of Christmas magic. The visuals are stunning, creating a vibrant and immersive world that enhances the overall cinematic experience. With its witty script, endearing characters, and feel-good vibes, this genie Christmas movie is a joyful addition to the holiday film lineup, spreading smiles and festive cheer.Also great to see a Christmas movie with a Black lead!",
    "33": "It was just a really badly written story with famous actors. It wasn't meaningful and I didn't really like it. I guess none of the acting seems believable as it's just unrealistic in how they make people react to the genie's magic which is a huge turnoff. It just felt like there was really not much clever script writing and they think that a famous actress is enough to make a movie great. I like the actress's other movies but this is probably the first movie that she did, that was really bad. It started off okay but at the end, the whole movie just felt like a huge waste of time and that nothing about it was heartfelt or funny or uplifted me. I am just disappointed with the movie and giving it 3 stars for terrible and unimaginative script writing. I guess it's just not for me as I was hoping for epic and be wowed, but this movie was just a bore and anticlimactic for me.",
    "34": "The plot is horrid. Melissa McCarthy is hilarious and the only reason I'm giving this any stars.First of all, Bernard is British but his family visits and none of them are. Secondly, his boss fires him for asking for a few weeks off? Third, his wife leaves him over the holidays for missing his daughter's birthday? Finally, he gets a genie and just wants his jerk of a wife back? Just ridiculousness. But, Melissa is Melissa and the only reason I kept watching. She is hilarious! I don't regret watching since she was in it, but both nothing else about the movie feels like any effort was put into this lazy screenplay.",
    "35": "Bernard (Paapa Essiedu) can not balance his family and work to the satisfaction of his wife (Denée Benton) and daughter (Jordyn McIntosh). His daughter mimics her mom and claims dad is an inconsiderate b@stard. They decide to leave him and go to her family for the holidays. Working for an auction house, Bernard has obtained an antique jewelry box. While cleaning it off for the first time in 2000 years. A genie (Melissa McCarthy) appears. Bernard wishes he could get back with his family which is not that easy as genies do not alter feelings or time.The film had some good scenes and too many that were awkward and didn't work. The whole separation thing was a bit overdone without the proper context. In my family, if your birthday fell close to Christmas, it was celebrated on Christmas. Melissa McCarthy did her normal self. The rest of the cast was not convincing. Paapa Essiedu sucked in his role. Thank you Luis Guzmán for saving a scene.Guide: No swearing, sex, or nudity.",
    "36": "My daughter and I just finished watching Genie after eating our Thanksgiving dinner. This is a great movie to begin the Christmas movie watching season! Melissa was great, as always! Her character was hilarious. This was my first time seeing the lead character, but he was believable and relatable. I was rooting for him and his family. Eve, Jordyn McIntosh, was simply adorable in this movie! I am a huge fan of hers and have seen all of her work. She is definitely a star in the making!I will add this movie to my Christmas movie watch list. I'll also watch it again with my three nieces when they come to visit! If you're looking for a feel good family movie, this is the one to choose!!",
    "37": "At one point the doorman tells the daughter, \"glad you are back, your dad is boring when you are gone.\". And that's the problem, for me,.....this movie is boring. . The protagonist is beyond boring and there is no chemistry between him and McCarthy. I know McCarty might need a straight person to make her shine (although she has no problem shining on her own), but I feel this guy doesn't hold his own.... Why did they pick him? A British guy, why? Other than McCarthy and the doorman no one else in this movie shines either. Everyone is forgettable. 2023 xmas offerings: Family Swap, Candy Cane Lane, Santa Clauses, have all been boring, predictable, but Check out The xmas animation from DC, Merry Little Batman was a great surpise.",
    "38": "Ignore the people complaining about this being \"unrealistic.\" It's fantasy fiction. We don't care what you'd do with your wishes in the real world. This doesn't take place in the \"real world.\"Melissa McCarthy as hilarious as ever. Marc Maron is an excellent addition to the ensemble. They even managed to squeeze Luis in here. Excellent casting all around.This movie is not at all serious. Nobody is dying of cancer. No one's children have been taken hostage. There's no street racing or explosions. It's a feel good comedy centered around the holiday season. Lots of funny jokes. Many adorable moments. Absolutely recommend to anyone that's looking for some light hearted laughs.",
    "39": "While not destined to be a Christmas classic, I'm sure someone will remember this movie years from now, and try to remember its title. :)\nIt starts off pretty slow, slowly inviting the viewer to turn it off, but stick with it if you want some laughs. The main message of it is it's the little things in life that are most important, like pizza and peanut butter sandwiches. (Yes, who really cares about world peace and a cure for cancer?) Plus, nothing is more important than family and spending time with the ones you love. I bet people back in the day, though, didn't quickly send back the camel to Wishland.",
    "40": "I don't know what all these scrooges are talking about, this movie was a perfect, fun, & light Christmas movie! I laughed a bit, teared up & enjoyed it from start to finish. Melissa McCarthy was her usual funny self & though I wish the main character wished for a boat load of money.. all he wanted was his family for Christmas... aaawwwe. It was adorable & it will definitely be added to my Christmas movie rotation!Get your Christmas snacks & start your movie marathon & start with this one! Christmas movies are supposed to be fun, light & come with a little lesson, so Genie is perfect.123456 .. minimum character limit met. WATCH THE MOVIE.",
    "41": "The original film is funny and absolutely amazing a must watch small budget film-please see it on YouTube. The remake is a neutered anodyne remake that \"features\" melissa Mccarthy who makes every film that she is in worse. Please watch the original not the crap American remake. The original features Alan Cummings, Lenny Henry and Rowan Atkinson and has made me laugh so many times in the first 20 minutes. The morL of this story is that American remakes are almost certainly going to be worse than the original. On a side not papa essidou is really good in the film so Hollywood please please cast him again.",
    "42": "This is a cute movie, Melissa McCarthy shines as always, and the story is very sweet. I enjoyed the newer take on the genie lore, but if you go into this thinking they reinvented the wheel youllbe disappointed. It is funny, sweet, and a feel-good movie. If you're looking for something like that, then this is your movie. I enjoyed how they had the main protagonist, I felt his character was interesting and smart, and I liked that he didn't follow the usual tropes that go into these kinds of movies. Get your pizza from John's on Bleeker Street and settle in and just enjoy the movie, don't break it apart, just enjoy it for what it is: a feel-good Christmas story about family.",
    "43": "Melissa McCarthy does not always deliver, but she is at her best here in a well-written, ultimately 'feel good' movie with fine supporting players - particularly. Paapa Essiedu whom I was previously unfamiliar with. He reacts well to McCarthy's schtick.The other films that I liked McCarthy in were The Heat with Sandra Bullock (who also played the straight foil), and Can You Ever Forgive Me?, which was a drama.I gave this film a 9, as I found it always entertaining, funny, and unpredictable. I tried to guess where it might end up based upon the usual storylines, and was pleasantly surprised.",
    "44": "As someone else wrote: Melissa McCarthy has 'had some stinkers'. I can vouch that she's definitely had them in both movies and TV shows that I've seen but in my opinion when she shines (Bridesmaids) she shines! So at first I was not sure which way this was going to go.... I paused to look it up and read that it is a remake of a British movie that had Alan Cumming (who appears in this version as well!) and Rowan Atkinson in it. I thought if it was good enough for a remake I would try to stick with it. Once the beautiful shots of NYC at Christmas time were on my screen and I 'settled into' Melissa's take on being a Genie, (basically Melissa being Melissa), I relaxed and went with it. It could have been better, but I'll just say it had good music, was a fun concept and the main characters did grow on me. Is it a Christmas masterpiece? No. But I did tear up.. I've watched a few Hallmark Christmas movies this year and um, although some of those are 'decent-ish' this is many many cuts above for sure! I think I'll likely watch this again at some point so that's a positive.",
    "45": "I would describe this movie as cute or charming, but not exactly funny.It's a well made movie, but like so many comedy's, it tries hard to be funny, so it comes off as contrived and predictable.If you think about it there are a lot of movies that fall into this category where you watch them once, you enjoy them as you watch them, but soon after, you forget them and never watch them again.The only complaint I have about the movie is the young daughter of the lead character calls her father a \"selfish bastard\" a couple of times. I felt this was highly inappropriate for a movie that I assume families are supposed to watch during the Christmas season.",
    "46": "... from the moment the genie appears, it goes downhill fast. The only redeeming feature was the husband and his boss. After sitting through this abomination, I grabbed the BBC original with Lenny Henry as the genie, which is what I should have done in the first place! Hollywood just can't do comedy, as their version of the art is just lost. It always seems that Hollywoods version of humour involves being louder and shouting \"I'm being funny\" and then waiting for the canned laughter. I have to admit that cummings was good as the boss with no ethics, which was originally played by Rowan Atkinson, AKA the Black Adder. If you can, get the original, I much better use of your time.",
    "47": "Genie is at first a light hearted fun movie but also manages to a convey deeper meaning about family, friendship, selflessness, and personal sacrifice. Melissa McCarthy delivers her usual hilarious comedic performance. Denée Benton's and Paapa Essiedu's performances impeccably portray their characters' love story. But this is not a romcom. The key relationship in this movie is the friendship and trust that develops between McCarthy and Essiedu. In the end the viewer should be reflecting on what is really important in life as shown by Essiedu's actions throughout the movie. This will be added to the yearly Christmas movie lineup.",
    "48": "This movie was a genuine, heartfelt, funny, feel good movie. Melissa McCarthy is hilarious, in her role.... I cried a few times.What way to kick off this Christmas season... with laughter and tears!! I just wish the movie could have been a lot longer, and some characters could have been developed a bit more. For instance maybe we could have seen the evolution of Paapa Essiedu, Denée Benton's early relationship before marriage up to when they conceived Jordyn McIntosh.Nonetheless, my family and I thoroughly enjoyed this new Christmas movie that we are adding to our holiday movie season arsenal!!",
    "49": "Genuinely such a cute movie! I will watch and love pretty much any movie with Melissa McCarthy in it. The movie was actually pretty hilarious but also super sweet! I also think it sends out a pretty important message as well and the movie is kid friendly! Definitely a new favorite Christmas movie of mine and will probably end up watching it a few more times. My mom and daughter loved this movie and we cracked up at quite a few parts during the movie but I won't spoil anything in this review. I definitely think this movie is a 100/10 and actually kind of hope they end up making a part 2! I'm sure it won't happen but I have my fingers crossed for it!",
    "50": "This was a really unexpected treat. As a man with kids we always search for good stuff that kids can enjoy and won't be a total bore for us either. And wow this was a good one. It was well made. Beautiful scenes with amazing cityscapes and designs. Kudos to the art directors. And then the acting was phenomenal as well. Very relatable people. And Melissa McCarthy really delivered. She had so many good laughs in this. I found myself thinking this might have been her most consistent movie yet. And I like her but have found some of her work to be like 3/4 of a great movie, but this was good right to the last moment. Bravo to this whole production. We will watch this for years like we do with Elf and Christmas Vacation. Thank you!",
    "51": "Bernard is a goofball workaholic who is unappreciated by his miserly boss. He's too much of a mouse to quit and doesn't prioritize his family, leading to a bad result.Flora is a genie who somehow has been in a box for 2,000 years when Bernard shines it up. And chaos ensues.We always enjoy Melissa McCarthy. But, this movie is just so silly. And they left holes, many holes in the script. It's nice that the workaholic learns the error of his ways, but how didn't he wish for his own successful business at some point, and what happened to the mystery note toward the end? They left that completely dangling.I enjoyed the other actors a lot. Just wish they'd all had more to work with.",
    "52": "I don't understand the nasty reviews on this. Its a holiday movie and people are judging it like they expected it to be some masterpiece that flopped, huh? It's a cute holiday movie for families and KIDS for gosh's sake. Melissa McCarthy was hilarious and the character Bernard was heartwarming, he just wanted his family back.And now I have to ramble on because this review has to be a million words long for what reason I do not know. Not every movie is going to be Oscar worthy. Doesn't mean it should get ripped to shreds by internet trolls. I Think we need to accept movies for what they are intended to be. Okay I've hit the word quota, bye.",
    "53": "This is a really cute Christmas movie. If watching sappy Christmas movies at this time of year works for you, this is it. I'm sorry the critics are so pessimistic and feel the need to show you their superiority in film snobbery. No, this isn't being reviewed for an academy award. This is a heartwarming Christmas movie that gives us exactly what we're looking for at this time of year. A cute holiday movie with a happy ending. Melissa McCarthy is who we want her to be. Funny and entertaining. It's a feel-good family story with a happy ending that puts you in the Christmas spirit after watching it. C'mon, critic trolls. Do better.",
    "54": "This movie isn't going to solve the world's problems but it was great for 90 minutes of holiday entertainment. Perfect fun for children and a couple life lessons are thrown in for good measure. Don't look for anything deep here including character development - it's all just fun.Who doesn't love NYC at Christmas time, a fairy tale Genie who can help you with anything, a bad guy with ann incredible acting resume and a happy ending.I don't know what the naysayers were looking for when they panned this movie , but I say take a chance on this one. Melissa McCarthy is her usual silly self and you can't go wrong with Alan Cummings.",
    "55": "A charming film full of Christmas spirit and laugh-out-loud moments. It's always a bit hard to tell if a Melissa McCarthy flick will be excellent or dull, but this one's a winner.It's funny, lighthearted, heartwarming, and oozes charm, and she dazzles in the way that only she can. Definitely my favourite Christmas movie of 2023.The plot is silly and fun in all the right ways, with just the right amount of sappiness to make you tear up. It's a bit different to your average rom com, in all the right ways.I do wish the marriage had more spark, but it's a small part of the overall movie and the other parts more than make up for it. A lovely ride! I wish more Christmas flicks were like it.",
    "56": "This film had great potential. Yes, it had a typical situation of the workaholic in the holidays and forgetting the daughter's birthday and that was that was an appropriate set up. Finding the genie in the box wasn't cliché, it turned out just right. But then Melissa McCarthy comes onto the screen, doing basically an impersonation of Melissa McCarthy. For Jenn, that's been in a box for two years she shouldn't speak the unaccented way she speaks or use current informal language. The movies only an hour and a half long, and that extra half hour could've been used to make some really good action, showing her blending in to the current culture. Nice stuff about Jesus, which is rare in a Christmas movie, but that also could've gone further. All in all a disappointment that could've been a great movie.",
    "57": "Genie is a delightful dose of cuteness that effortlessly tugs at the heartstrings. This simple yet charming movie introduces a lovable cast of characters whose adorable antics make it a perfect feel-good watch. The humor is light-hearted, and the characters' interactions are filled with warmth. It's the kind of movie that provides a welcome escape, leaving you with a sense of contentment.Heartwarming movie that celebrates the joy of all things cute. Whether you're a fan of Christmas films or just in need of a pick-me-up, this charming flick is a delightful way to spend some time in the company of irresistibly adorable characters.",
    "58": "I know people think this movie is too sweet, but honestly the world needed something like this. I mean a couple reasons why but are we not allowed to have sweet things in the world especially considering how hard every day is. I appreciate the people still want to make movies like this. This is a movie you can watch with your family or by yourself and have a good laugh and maybe think about what's important to you. Also, can we just say it's nice to see a happy black family that has real love for one another and quite frankly, and this might be a spoiler but none of the black characters die, which is a great thing. More of this please!",
    "59": "This movie is great and as always, Melissa is hilarious. The only problem I have with it is the plot holes. First off, the genie said he gets 3 wishes after she is free but then he actually makes 4 wishes (for her to go, for him to go back in time, for the table to be available and for the daughter to get what she ordered). Then, the genie is free, how does she get to travel in time TWICE and ends up with the doorman?Also, what about money? I LOVE the selfless theme of the movie and how he makes all these wishes for other people but he just has to quit his job so how is he getting to have a life without sacrificing family time? The other part I didn't like was that the former boss got a \"revenge\" when he wished for the donation that ruined him but then once he went back in time, the boss gets to live life normally so we lose that sweet revenge moment.",
    "60": "It was the perfect Christmas movie. Melissa McCarthy is the perfect co star and she shines alongside main character Paapa Essiedu. It's the absolute best Christmas in New York movie. It's not even trying to be overly Christmas focused either. The holiday aspect sort of fades into the background making the movie incredibly atmospheric without being cloying.What I really appreciated is how much Paapa's character is centered in the story. He doesn't have to do any caretaking of Melissa McCarthy's genie, but he still shows how much compassion he has for her in the end.Cheering for Bernard is so easy because the writing isn't bogged down with inane choices and justifications. It's truly a wonderful movie and is an instant favorite.",
    "61": "Movie Genie is a Heartwarming new age Christmas movie, which are so hard to come by nowadays. The ending was sweet and lovely. Interesting enough it's not a typical genie movie. The story is simple and relatable to adults where we go by life focused on our careers and we don't have much time on our hands to spend time with family. This movie narrates it very well.Melissa always adds a nice touch in movies by giving it her personality. Movies are not necessarily meant to be judged strictly. I'm tired of Hallmark romantic Holiday movies, and this is not that. Comedy, family, romance all mushed to one. I think that this movie is Worth the watch! It is perfect family holiday movie or simply, a feel good movie to watch on your own.",
    "62": "I gave 4 stars because I like the cast outside of this movie. This was just thrown together or edited poorly. I wanted it to be a cute, sweet little movie and it just missed. With this cast it should have been special. There is no character development which is unfortunate because there was an opportunity to fall in love with each character. The storyline is supposed to have a dad that is selfish and a workaholic. Instead, it came across that the dad was the sweetest most loving guy and his wife was upset for no reason. If you go into this movie not expecting much or expecting a hallmark type show it can be enjoyable.",
    "63": "Melissa McCarthy rarely disappoints... And with fellow cast members such as Alan Cumming, Luis Guzman and many more by her side, she has done it again!!! A refreshing storyline that steps outside the lineup of yearly cookie cutter holiday movies that we watch year in and year out where we quite honestly know what is going to happen before we even hit play (and yes I still watch every single one of them). The addition of true comedy, that could only be delivered by a comedic legend like McCarthy, sprinkled with the perfect amount of magic, made this a movie that was enjoyed by our entire family (ranging in age from three years old to near 60 years old)!!! If you are looking for a great new movie to watch with your entire family this holiday season (or anytime of year) give \"Genie\" a try... We hope that you love it as much as we did!!!",
    "64": "I'm really surprised at some of the reviews for Genie. As soon as I saw it was written by Richard Curtis I knew it would be good and I wasn't disappointed! I laughed and I cried, the acting was great and I was left with that feel good Christmas feeling. It was magical and we all could do with some magic in our lives. I would recommend this film to anyone, and already have. Looking forward to watching it again with my grandsons. There are two occasions when the little girl has obviously overheard her mother calling her dad a swear word but apart from that, the language is fine. It's full of Christmas cheer and has some valuable lessons.",
    "65": "This movie isn't Oscar bait nor is it trying to be. It's just a fun family movie and I think it accomplished that really well. It was fun, even if Bernards wish choices weren't the ones you'd make it was a good movie that I would definitely watch again.The movie was funny, had some drama, and was a low stakes, easy to watch movie to get you into the holiday spirit. I really enjoy Melissa McCarthy, she's fun to watch and makes you feel like you know her as a really good old friend. I recommend this movie to people who just want to have a good time with family and have a laugh, it's silly, and worth a watch.",
    "66": "My wife and I enjoy a good easy viewing Christmas comedy over the festive season. We looked forward to seeing this but had to as usual go through another modern era supposed comedy movie have jokes made about Jesus and then another blasphemous scene depicting Melissa McCarthy as the Genie in the Last supper.These are unnecessary scenes. If you want to mock the Birth of Jesus that's on you to answer for and I pray you see the truth soon before it's too late.But don't put this in a movie for anyone to see, especially a family comedy. The word Christmas literally has the name of Christ in it. So maybe do proper research on the meaning of Christmas before you mock.It ruined the movie for us and I'm sure many many more will agree.",
    "67": "This movie won't win any awards for creative screenwriting, but these reviewers bashing it with 1 or 2 stars are missing the point. It never takes itself too seriously, even at the sappy ending. Melissa McCarthey was born to entertain, and the main character Bernard is someone who is easy to root for. Don't go in with too high expectations and you can enjoy a cute blend of many classic movie tropes (e.g. It's a Wonderful Life, Aladdin, Groundhog Day, A Christmas Carol, Enchanted are just a few that came to mind when watching). Genie will never be listed among these all-time great movies, but it does draw on just enough of the positive messages from these films to make it worth watching. I enjoyed this movie!",
    "68": "Melissa McCarthy has had some roles that make me cringe a bit but this movie was perfection for her! I laughed, I cried, I loved the moment that \"Nardo\" spoke about the reason that Christmas came about and then explained how it's been commercialized. The movie then goes into what the true spirit of Christmas is and it is reminiscent of \"It's a Wonderful Life.\" I have to say, I put this movie in my top 5 Christmas movies! It had laughs, love, thoughtfulness, flirtation and I personally feel, enjoyment for the whole family! I hope everyone takes the time to view this movie. It's extremely heartfelt and we all need this at Christmas!",
    "69": "I'm not sure what these \"very professional\" movie reviewers thought they were going to see, but I wish they would relax and enjoy a very sweet, simple, cute movie for the holidays. Oscar worthy? No, but I doubt that's what anyone was going for. Fun holiday movie? Yes! Enjoy the little things and don't get so wrapped up in award-winning performances and just appreciate this for what it is. This is a delightful movie without politics, cursing, nudity, blood, or gore. Just a care-free fun ride you can enjoy with your entire family. I really wish people would chill out and stop being so pretentious!",
    "70": "A nice, uplifting, and enjoyable movie to watch on a cold winter's day. Melissa McCarthy is wonderful, as always, and doesn't overplay it here. Paapa Essiedu was tastefully understated as Bernard. Loved the NYC setting. The rest of the supporting cast was also excellent, including Denee Benton (whom I love in \"The Gilded Age\") as Bernard's wife; Alan Cumming as Bernard's horrible boss; and Marc Marion as Lenny, the doorman.There are some humorous moments for sure, but those are tastefully done within the story. The story is somewhat predictable, but does not take away from the enjoyable journey. (One silly side story could have been left out, but that's a small quibble.)All in all, a nice light-hearted movie for the holidays.",
    "71": "Is this film going to win Oscars? No,but it does what it says on the tin. It's a feel good family Christmas movie. The acting is OK and although the script isn't always brilliant it is fine and has it's moments. Melissa Mcarthy is good in this and she does make the movie that bit above average. The story flows mostly and you do end up hoping things work out (whilst knowing they 99% likely will). So don't expect a perfect film and just enjoy it as is. It isn't the best holiday movie ever but if you're decorating your tree then this on in the background you'll enjoy this perhaps more than you think.",
    "72": "Well I won't be getting that time back any time soon! This is one of the dullest Christmas films I've watched in years. In fact I would go as far to say it is the dullest Christmas film I have ever watched!This film lacks in each and every area. The comedy\nand plot are so weak. The characters are humour less, boring and cringey. The story is incredibly bland and dull. The film seems like it has been hashed together without any thought process. There are many fine actors in this film but they are limited by the plot and shine they do not\nPlease do not waste your time watching this badly written, boring Christmas film.",
    "73": "I didn't read any reviews before I watched it. I stumbled across it on a streaming platform and thought it was worth a try.I love the contrast between Paapa (The Lazarus Project, I May Destroy You) and Melissa's energies. I enjoyed the plot. I liked the comedy. I thought it was a good film.I came on here to see what others thought and I am shocked it scored so low. It's not ground breaking, he doesn't choose to solve world hunger and it's a bit smoltzy. However it's a lovely feel good film that is easy to watch and doesn't take up much of your energy to engage.Take it at face value, settle down with your family an some snacks and just chill out.",
    "74": "As somebody who has grown up watching the original 'Bernard and the Genie' since its release on BBC tv in 1991 EVERY year at Christmas with my family... When I heard about this remake my excitement levels were literally off the scale. Could this be anywhere as good as the original?!?Unfortunately, the original (even though made years ago and now quite outdated in many aspects - which you can watch on YouTube and you very much should) smashes this film into oblivion.I don't like to compare... but:Bernard and the Genie: Bernard (Alan Cumming) befriends the genie (Lenny Henry) and is a relatable, likable and warm character who you can't help but love! Their friendship is fun, enjoyable and believable.Genie: This Bernard is unfortunately someone who comes across as quite selfish, not particularly likable and he doesn't create a bond with Melissa M in the way the original creates a fantastic Christmassy friendship.The scene where he's getting funny about what she's picking to wear actually makes me cringe. Let the woman wear whatever she wants... I don't understand what the writers were trying to achieve with some of the scenes really. I think they've kind of made him a bit of a selfish, entitled idiot (sorry Bernard).Why have they set this remake in the USA?Why have they made Alan Cumming have a bizarre accent?Why is everyone sooo bad at making wishes?The only real questions answered for me during this film were when I initially said to myself \"why aren't Lenny Henry and Rowan Atkinson appearing in this?\"... I now understand.Bernard and the Genie has the ability to make me laugh out loud and cry with sadness even after watching it multiple times each year. It makes me feel christmassy and happy.Genie, just fell flat for me. I'll probably rewatch it to try and force some kind of tolerance for the characters and film just because I love the original so much.I just WISH this film was better... See what I did there 😉Watch the original, please! You will enjoy it, do not base any assumptions on this remake.",
    "75": "\"Genie\" (2023) is an attempt at a fairy-tale comedy that, unfortunately, misses the mark on nearly every level. The plot, which revolves around a workaholic man seeking the aid of a magical genie to win back his family before Christmas, sounds charming in theory. However, in practice, it's as if the script was written by a committee of people who have never experienced joy or human emotions. The humor is so forced and predictable that you can almost hear the strained creaking of the joke machine as it churns out one tired gag after another. The genie, meant to be the highlight of the film, comes off more like a budget Halloween costume than a mystical being, further hampering any chance of magic or wonder.The performances are as lackluster as the plot. The lead, who shall remain nameless to spare his future career prospects, delivers his lines with the enthusiasm of someone reading a microwave manual. His quest to win back his family is about as heartwarming as a corporate tax return. The supporting cast doesn't fare much better, with performances ranging from \"I'm just here for the paycheck\" to \"I thought this was a rehearsal.\" The chemistry between the characters is non-existent, making their emotional journeys as believable as a two-dollar bill.To add insult to injury, the film's attempt at a heartwarming Christmas message is as subtle as a sledgehammer. The 'family first' moral is hammered home with such clumsy, heavy-handedness that you half expect the characters to turn to the camera and give a public service announcement. The special effects, which could have been the film's saving grace, are reminiscent of a mid-2000s video game cutscene - and not in a charming, retro way. In conclusion, \"Genie\" is a film that, much like its magical protagonist, should have stayed in the bottle. If you're looking for a festive family comedy, you're better off watching literally anything else.",
    "76": "IN A NUTSHELL:\nWhat would YOU do with unlimited wishes? In this fun-filled genie movie, a workaholic father meets a magical genie who tries to help him win back his family before Christmas.The film was directed by Sam Boyd. Writing credits go to Richard Curtis.THINGS I LIKED:\nI've been a big Melissa McCarthy fan since the beginning. I know she's had some past movies that were stinkers but this one is not one of them. She has plenty of oddball, goofy moments, but I really love that her genie character didn't become an over-the-top cartoon, but instead, a real woman.Paapa Essiedu does a great job as an earnest straight-man to the genie's comedic chaos. I had never seen him in anything before, although he has actually been in a lot of successful productions in recent years such as The Lazarus Project and Black Mirror.Other cast members include Denee Benton, Marc Maron, Luis Guzman, Alan Cumming, and young Jordyn McIntosh. Everyone did a great job.I love it when movies show clips from other movies. In this one, it shows a clip of Tom Cruise in Mission Impossible.WWTCD = What would Tom Cruise do? Love it. The genie becomes obsessed with Tom Cruise. Yeah, girl. We all are.Great soundtrack.Lots of humor, both spoken and visual.Tons of Christmas decorations that will get you in the mood for the holiday season.Super sweet ending.The story is extremely formulaic, but I don't care. It still felt good and is a reminder about what's truly important in life.THINGS I DIDN'T LIKE:\nA Tom Cruise cameo would have made the movie perfect.The flying carpet special effects were underwhelming and not as magical as they could have been.There are too many annoying inconsistencies in the fish-out-of-water story. I know...genie movies are fantasy, so things don't have to make sense. Still.TIPS FOR PARENTS:\nSome profanity. Some of it comes out of the mouth of a little girl. Of course, that's supposed to be funny, but I always hate that.People get arrested.Some verbal fights.To see my full review, go to my YouTube channel called Movie Review Mom!",
    "77": "Melissa works for her paycheck while the rest of the cast is beyond terrible.Whoooo signed off on the actors of Bernard and Julie?! Why?!This proves that the best actor doesn't always get the job. Flat. Flat. Beyond flat.I'm all for supporting less than \"star\" names but these two dragged every scene down. What a shame.Production value is good. Cinematography is solid. Music fits.I can only fault casting as well as the director.The heartfelt ending made it worth the watch- that'll I'll also thank Melissa for.Give new, unknown actors jobs- please- based on talent.We want that. We support that.",
    "78": "This is a Peacock Original movie, the Executive Producer is Melissa McCarthy. Fittingly she also is the star of the movie, playing the Genie named Flora. With that as background we should all be surprised if it turned out to be an excellent movie. It is also a remake of \"Bernard and the Genie\" from 1992, which has Alan Cumming as the Genie. He is in this movie as the uncaring boss.Having just watched it I can say authoritatively \"Genie is NOT an excellent movie.\" But the real question, \"Is it entertaining\", and my wife and I were mostly entertained. It is the kind of movie that, if you never see it, you are fine.It starts with Paapa Essiedu as Bernard, a family man with the inability to properly balance work life and family life. Like missing his young daughter's birthday party because his boss asks him to stay late. At home alone, after mom and daughter go visit grandma, he picks up an old, bejeweled box and rubs it. That is how he meets Flora.Most of the movie covers somewhat unimaginative instances where Bernard uses Flora's magic to grant wishes. But in the end he decides that wealth and fancy wishes were less important than mending relationships. Many won't like the end when he fails to wish for riches untold but that is in essence the message of the movie. Who you are and how you treat others is more important than wealth.",
    "79": "Whoever cast this movie killed it for me.The wife is just downright nasty. The guy works so she can sit on the couch and pout. I was annoyed after hearing her speak her first lines.The daughter is terrible.And he's just not watchable.So with the three main family characters so miscast this film was onto a loser from the very startI'm about thirty minutes in and about to switch it off.Melissa McCarthy is doing okay but it's just cringy.I was so looking forward to the release of this and it's a total stinker of a Christmas film.I'm actually rooting for him to kick the wife and daughter into touch and go on a bender to Vegas for Christmas. Now that would have been a better film.",
    "80": "Well who knew..\nto get the love of a woman all you need is to lavish lots o treats on her. A real moral of the holiday season. Or even life. If you have lots of stuff you can acquire affection. Horrible Christmas morality tale. Even the kid gets corralled in to the merchantile message.I know Messila McCarthy has a terrible agent (well I don't know this but she has been in some real stinkers) is hopeless in this. The Scottish bloke Alan Cummings looks like he's not been paid enough for him to give us even one of comedy tricks. Now Dickie Curtis wrote this. He's the current holder of British Rom Com franchise, he's taking his *shtick* over the pond in an attempt to broaden the business model.It doesn't work.In the interest of serious journalism I willed away or ensured 24 minutes. It's still a mystery how this is so awful\nAvoid. If it's a Christmas movie you're looking for. It's A Wonderful Life is available.",
    "81": "In the days leading up to Christmas, auction house worker Bernard Bottle (Paapa Essiedu) sees his life fall apart as he misses his daughter Eve's (Jordyn McIntosh) birthday after working late which causes his wife Julie to have them take a break during the holiday. With Bernard also fired by his boss Oliver Flaxman (Alan Cumming) Bernard seems poised to have a depressing Christmas, but his chance encounter with an antique box unleashes Flora (Melissa McCarthy), a 2,000-year-old Celtic tribesman who's been cursed to be a genie. Now given the opportunity for unlimited wishes, Bernard sets out trying to win his family back while also showing Flora the wonders of the modern world.Genie is a 2023 Christmas comedy written by prolific British writer Richard Curtis and is a remake of Curtis' own 1991 BBC TV film Bernard and the Genie that featured Alan Cumming and Lenny Henry in the original roles. The film debuts on Peacock in time for the Holiday season as Peacock continues to cultivate their content library and while I was skeptical, Curtis shows that he can do enough new with the premise to make it justify itself which is helped along by the solid chemistry of Melissa Mcarthy and Paapa Essiedu.As the film is a remake of a 1991 TV move that barely clocked over an hour in length, Curtis reframes the material to have a more focused narrative with the story engine being Bernard winning his wife and child back following the inciting incident of being forced to work too late. This formula is nothing new as it's been part and parcel to many formula comedies from the 90s that built themselves around the \"workaholic dad\" trope, but as far as it's incorporation of the trope it feels like Curtis is taking a more nuanced approach to it than many of its forebearers. While Genie does revisit many of the setpieces of the 1991 TV film, Curtis does also include some new spins on the material including a very funny scene involving Bernard's family and the wishes they make. Paapa Essiedu and Melissa McCarthy have terrific chemistry as Bernard and Flora and this is probably some of McCarthy's finest comedic work I've seen from her in some time and she feels more like a character and less like an over the top archetype as has been a recurring issue with her characters. Admitting some things are maybe a little downgraded from the original such as Alan Cumming's rather thankless role as Flaxman who's meant to be an analogue to Rowan Atkinson's Pinkworth from the original, and while Flaxman is used to get the story moving he never creates a memorable creep on the same level Atkinson did in the original because that part is considerably scaled back.I honestly really enjoyed Genie. It doesn't break too far from the mold of this kind of high concept comedy formula but with solid chemistry from its leads and some genuinely sharp writing from Richard Curtis, Genie provided a welcome bit of light hearted Christmas fare that got me in a festive mood.",
    "82": "A man inadvertently summons a genie, oh and it happens to be December.In this setup usually the protagonist's major flaw is an unhealthy obsession with work and money. Here it is pure stupidity - he really is as dumb as a bag of spanners.Normally genies have a devious side as wishes are dangerous, limited, corrupting and often at the expense of others.Not here: just wish for what you want and don't worry about it - if someone's day is ruined by your wish forget about it - everything is peachy.The only obstacle our protagonist has is his inability to wield this power in any meaningful way.Luckily his wife is a real plank of wood too.This is designed to be a light, fun, easy watch.And it manages this to an extent - but the extent you have to switch your brain off might lead to cerebral damage.The jokes are lame and inconsistent - the genie knows what a sweater is but not a pizza.It you are a big fan of McCarthy you will like this, and to have on whilst you are doing something else it is fine. But this feels very much like a cash-grab film of the 2020's - there is no story, no Christmas message, all the right boxes are ticked and it has a flashy Tiktok like trailer.Once is all said and done the end goal of the main character is easy to achieve - you don't need a genie to get yourself fired.",
    "83": "Awful from start to finish. Why did a good actor like Paapa put his name to this.The plot is horrendous, it's cheaply made and utterly cringe worthy in many parts.Don't waste an 1 hour and 33 minutes of your life. Ironically I love Christmas movies but this one stinks.Im just going to keep rambling about how terrible the movie is. Alan Cummings is terrible in it. Melissa McCarthy didn't even get a chortle out of meRichard Curtis has managed to squeeze a stinker out with this one. It has none of the charm of his previous movies.Why oh why even bother to make something this horrible. Sky please stop making movie this awful, somebody please jam the cork back in this genie bottle.",
    "84": "I like a few characters she has played but she has had her 15 minutes, unless she starts doing better material. The jokes are groaners and she has this type-cast persona.Cast\nProduction\nRelease\nReception\nReferences\nExternal links\nGenie 2023 filmAdd languages\nArticle\nTalk\nRead\nEdit\nView historyTools\nFrom Wikipedia, the free encyclopedia\nGenieRelease poster\nDirected by Sam Boyd\nWritten by Richard Curtis\nBased on Bernard and the Genie\nby Richard Curtis\nProduced by\nTim Bevan\nEric Fellner\nRiva Marker\nRichard Curtis\nStarring\nMelissa McCarthy\nPaapa Essiedu\nDenée Benton\nMarc Maron\nJordyn McIntosh\nLuis Guzmán\nAlan Cumming\nCinematography John Guleserian\nEdited by Heather Persons\nMusic by Dan Romer\nProduction\ncompanies\nUniversal Pictures\nWorking Title Films\nDistributed by Peacock\nRelease date\nNovember 22, 2023\nRunning time 93 minutes\nCountry United States\nLanguage English\nGenie is a 2023 American Christmas fantasy comedy film directed by Sam Boyd and written by Richard Curtis. It is a remake of the 1991 British television film Bernard and the Genie, also written by Curtis. The film stars Melissa McCarthy, Paapa Essiedu, Denée Benton, Marc Maron, Jordyn McIntosh, Luis Guzmán and Alan Cumming. It was released on Peacock on November 22, 2023.Cast\nMelissa McCarthy as Flora\nPaapa Essiedu as Bernard\nDenée Benton as Julie, Bernard's wife\nJordyn McIntosh as Eve, Bernard and Julie's 7-year-old daughter\nAlan Cumming as Flaxman, Bernard's boss\nMarc Maron as Lenny, Bernard's doorman\nTate Ellington as Johnny\nLaChanze as Grandma Patty\nEllen Cleghorne as Bernard's mother\nOberon Adjepong as Bernard's father\nEgo Nwodim as Dianna\nJohn Reynolds as Marvin\nNyasha Hatendi as Pete\nEmanuele Secci as Henry Hackford\nLuis Guzmán as Perez, a detective investigating the mysterious disappearance of the Mona Lisa\nRalph Brown as Sorcerer\nProduction\nIn December 2022, it was reported that Universal Pictures and Working Title hired Melissa McCarthy to star the film written by Richard Curtis, which is a remake of his 1991 BBC television film Bernard and the Genie. In January 2023, Paapa Essiedu joined to star opposite McCarthy. Alan Cumming, who plays Bernard's boss, portrayed Bernard in the television film.Directed by Sam Boyd, principal photography took place in New York City in March 2023Release\nGenie was released on Peacock on November 22, 2023.Reception\nOn the review aggregator website Rotten Tomatoes, 30% of 10 critics' reviews are positive, with an average rating of 5.6/10.Owen Gleiberman of Variety wrote \" It's certainly a wholesome Christmas cookie of a movie, so if that's your thing by all means make it a holiday streaming snack. But it's my wish that Melissa McCarthy would get the great comedy she deserves\". The Hollywood Reporter's Frank Scheck wrote, \"To be fair, the film directed by Sam Boyd has its amusing moments, thanks to Curtis' well-honed comic instincts. Essiedu nicely underplays as Bernard, going more for emotion than cheap laughs, and McCarthy is such a warm, engaging presence that you'll search your home for any old-looking bottle that might contain a similarly helpful genie\".",
    "85": "Genie is a remake of the 1991 TV movie Bernard and the Genie. This remake is directed by Sam Boyd. After the film In a Relationship, this is only the second film he has directed.Bernard Bottle (Paapa Essiedu) is busy with his work and relationship commitments, making it difficult for him to combine the two. When his job and relationship are at stake, this pressure only increases.Then, while dusting off an old jewelry box, he accidentally frees a magical spirit named Flora (Melissa McCarty). This genie offers him infinite magical wishes to help him with his problems.This movie is an entertaining one, for fans of Melissa McCarty and her own brand of comedy. Furthermore, the film contains some self-mockery and meta humor, where these are more overshadowed by Melissa McCarty's humor.Because the protagonist is given an infinite number of wishes, the film lacks any real tension or story. All problems can often be solved with simple wish magic. If the film had had clearer lines there would have been more suspense possibilities. Now they let Melissa McCarty take more inspiration, which unfortunately is not always as successful for every actor. It can be seen that she had fun playing this role, but the writer could have given her more directions.The visual effects appear a bit less believable, because the CGI and green screen are often clearly visible.",
    "86": "Everyone who left a 10/10 review is lying and probably has been paid by the company.This is a bad remake, of Bernard and the Genie, 1991.Alan Cumming in the 90s was the main actor and now he plays the role of Rowan Atkinson as the gallery owner. Not only he plays the role but actually acts exactly like Rowan Atkinson did in the 90s movie with zero creativity, even the mannerisms are exactly like the same ones.The main lines of the story, up to 50 minutes (I quit at this point) are basically the same as the lines in 199, seams that the writers (was there any?) just wanted to do some quick easy moneyMelissa McCarthy tries hard with her acting, but can't do much with the lines she has been given. The major change of this version vs the 90s is that the genie is now a woman and the main character is married, he was single in the 1991 movie and his gf left him for his best friend.If you just want to watch mediocre comedy watch the movie from the 90s, at least it is original, and it only takes 1h of your life. Everyone should boycott poor remakes that don't even acknowledge they are plagiarizing the original material.",
    "87": "I just found out that this was a remake, never heard of the original, but I doubt I'm going to love it as much as I do this one.This movie is everything that's good about Christmas movies. ( Just one minor detail, but it happens in most of them. The fake snow!.... But I rather have fake snow on the floor than crappy CGI).I love Melissa McCarthy, I guess because it seems like she is always improvising in a way that acting is believable and not a repetition of something rehearsed.For one moment I was afraid it would take the known route of the I dream of Jeannie typical screwball comedy, I which every wish would turn into a disaster. But this was not the case. It was delightfully funny and heartwarming as you might expect from a Christmas movie.Marry Christmas and blessings to you reading this.",
    "88": "The message in festive movies is often muddled, with the reason for the season often being realized through a department store detour. However, the relationship between Christmas and capitalism can be forgiven with the right performances, a joyful script, and a generous dousing of cheer. Genie, a film set in New York, combines these elements with a script by Richard Curtis, charismatic rising star Paapa Essiedu, and Melissa McCarthy, delivering a humorous and heartwarming portrayal of the holiday season. Genie is a film that tries to distract viewers from its consumerist core, with its centuries-old genie not recognizing pizza but familiar with credit cards and Times Square's advertising boards. However, the film lacks the charm to fully gloss over its core, with its jokes borrowing from Elf's \"alien let loose in the city\" brand of humour and its premise being less than satisfactory. The opening act hastily stumbling through events leading to Flora's mismatched double act. McCarthy's comedy is largely based on her high energy and reactions, with moments of happiness when she and Essiedu are left to do their own thing. However, if the script was better and the film had a more ambitious goal, it could have been a more enjoyable and sentimental holiday film. Overall, McCarthy's humor and energy make the film enjoyable to watch. Genie is a film with a strong lead cast, Paapa Essiedu and Melissa McCarthy, who showcase their dramatic skills. The film also features a standout sequence with Flora's fish-out-of-water antics and stressful family meals at Christmas time. Curtis uses genie clichés and a running joke about Tom Cruise, making it a fun and entertaining film. While it may not have strong feelings for everyone, Genie is a slight but sweet festive watch that may be just what you need from a Christmas movie. \"Genie,\" a new film directed by Sam Boyd, stars Melissa McCarthy as Flora, a genie who is unleashed by an overworked dad to massage an old jewel box he tried to pass off as a birthday present for his daughter. The film's plot turns are wide and suggest shrugging contempt, with holiday themes feeling arbitrary and tacked on. The story is about a man who learns the true meaning of punctuality, a departure from traditional wish-granting genie stories. The holiday themes feel arbitrary and tacked on, suggesting the script was rescued from Curtis's bottom drawer and spruced up with Christmas fairy dust.",
    "89": "This remake of 'Bernard and the Genie (1991)' drops the ball in pretty much every area, failing to tell a compelling story - never mind make you laugh. This meagre effort has all the hallmarks of a Hallmark movie, right down to the barely-there-but-still-somehow overwhelming Christmas setting, and it feels so divorced from any kind of reality that it falls totally flat. It's rare for the central drama of a piece not to make sense - or, at least, be rendered so ineffectively that it's wholly unbelievable - but that's definitely the case here, as the characters often act in ways no human ever would and their relationships are so strange that they simply can't pass for being real. The characters think the most normal things in the world are strange and disturbing, their actions rarely line up with what we're told are their flaws, their development is either missing or entirely rushed and they seem to want things that we've never seen any evidence of them desiring. It's all just really weird. Every single one of its many plot strands falls flat. It does the bare minimum everywhere it can, and it simply isn't enough. Every potentially interesting idea is fumbled, haphazardly smushed into a schmaltzy hodgepodge of lazy genre conventions and totally non-existent \"comedy\". To make matters worse, it then elects to completely undercut whatever sliver of development it has delivered with a final movement that proceeds straight from a total non-sequitur (a seemingly obligatory \"these wishes are backfiring now\" sequence that fades away as quickly as it appears) to an unsatisfying quick-fix finish that proves no-one learnt their lesson and even kind of implies they didn't need to. In fact, it also renders the rest of the movie pretty pointless, which is especially annoying given we've just had to sit through it. It's sort of fine in a \"I don't care about this\" kind of way, but it can't be considered an actually decent movie because it just fails in every key area. I often found myself wishing it was over, but sadly there was no genie to save me from 'Genie (2023)'.",
    "90": "A good Christmas comedy, with added fantasy.'Genie' is, admittedly, not a massively Christmassy film, it's more so set at Xmas rather than directly about the festive holiday. It still offers positive vibes in that regard, though. The story is told and paced well, I thought it'd be more generic than it is - it's not anything necessarily unique, but watchable it is. It has hints of 'Aladdin', obvs, and 'Bruce Almighty'.Melissa McCarthy is well chosen for the titular role, I found her to be entertaining throughout. This is the first time I've seen Paapa Essiedu act and I'd saw his performance in this is solid, he gives enough. Luis Guzmán is the best of the rest, even via a relatively small showing.Interesting that this is a remake of a 1991 television flick, which also had Richard Curtis behind the scenes and Alan Cumming onscreen; as Bernard in fact, so quite cool to see him return in this in a different role. I'll have to give that original a watch some day.",
    "91": "When Melissa McCarthy is part of the cast, one can anticipate humor, and when it comes to infusing any character with comedic elements, she possesses the remarkable ability to do so.The movie's title elucidates everything one needs to know about its tone and narrative direction. However, it falls prey to being excessively dry, lacking innovation, and leaning heavily on Melissa McCarthy alone, which proves insufficient. The remaining cast members seem inconsequential, as their presence or absence hardly makes a significant impact.Even films from the 90s boast superior visual effects compared to what this movie offers in 2023. There were ample opportunities for improvement in various aspects.It's a one-time watch, only if absolutely necessary; skipping it won't make a discernible difference.",
    "92": "It's a PG-rated movie about a goofy genie and a dad who learns a life lesson, so the bar may be low for families looking for a bit of Hallmark-esque escapism this holiday season. Stars Melissa McCarthy as a female genie named Flora. She helps Bernard, a harried husband and fast lane father who feels trapped between his imposing boss and spending time with his family. Bernard comes home one night to find he's missed his daughter's birthday. Bernard's wife tells him that she and his daughter are going to her mother's house to see if he can sort out his priorities. However, can magic wishes replace his loving presence in the lives of his wife and child?Streaming on Peacock, Universal Pictures' GENIE is a fun, family-centered Christmas comedy. It has a well-written story, appealing performances and nice cinematography. GENIE has a strong moral worldview with overt positive references to Jesus Christ, even though it places these elements side by side with the usual Santa Claus story. Also, the movie upholds a positive view of the family and the importance of fathers. This is rare and refreshing. GENIE has no foul language, but there are a few light off-color jokes and innuendoes. So, MOVIEGUIDE® advises special caution for pre-teen children and young teenagers.*lot of reviews are bad and negative for this movie but I thought it was cute and slightly funny. Melissa McCarthy showed up and showed out IMO.",
    "93": "Well, this is pretty simple - even though terribly dated, the original TV film (Bernard and the Genie, 1991) is infinitely better - funnier, sharper, less plot holes, less pointless scenes, better comic acting; on the list goes.Melissa McCarthy has become a bit tiresome. She was fantastic in 'Can You Ever Forgive Me?', and hilarious in 'Identity Thief' - but seems to have been playing the same basic character for quite a few years now. As the woeful 'Thuinder Force' showed, McCarthy isn't a sure-fire box office draw anymore.Paapa Essiedu is clearly a talent, but there was something off with this performance. It could be the script, it could be Sam Boyd's direction - but he starts most of his sentences with 'Er' or 'Um', as if he's trying to be uber-natural, and that this is a documentary. Sadly, he fails, and looks as though he's forgotten his lines, or that the script includes those little pecadillos and he's reading verbatim off the page. Either way, it was a struggle to watch at times, especially when you add in the unconvincing family dynamic, Swiss-cheese storyline and stilted dialogue, which was up and down like Tower Bridge.While we're on dialogue - are we not allowed to say the word 'homeless' anymore? 'Unhoused' was the preferred terminology in the latter stages of the picture. Such PC language is creeping into film and TV steadily, and it's not heartening or pleasing for the majority - it's patronising, distracting and completely unnecessary.I just don't know what Richard Curtis was thinking. He's only had a handful of decent films since his late-90s heydey; it's almost as if he doesn't really commit himself to the stories. A good example is 'Yesterday' (2019) - a fantastic concept, but has even more plot holes than 'Genie'. That film had so much promise, but was ultimately a let-down. To me, it felt like there was so much more story to tell in 'Yesterday', but that Curtis had to keep within the paint-by-numbers filmaking rule of 'YOUR FILM MUST BE 120 MINUTES OR LESS!' 'Genie' runs at around 90 minutes, as if Working Title wanted to make it short enough that it wouldn't lose the audience. I suppose that worked; I carried on watching in the hope it would get better, and by the time I decided for sure that it was a dud, the credits were not far off. Unfortunately, I had already sat through the convoluted and frankly appalling 'Three wishes after I've gone and here's a bit of paper with a clue' scenes - an amateurish attempt at tying it all up neatly, at which it failed. It was a hot mess - an apt way to sum up this really bad film. I feel for the director; it doesn't seem as though he was given much to work with.Perhaps it's time to hand over the rom-com, feel-good reins to someone who will see a project through and make an unmissable movie, just as Curtis' films were back in the day.",
    "94": "My mum insisted to watch this, came in not expecting it to be good and wasn't disappointed. Tone and story wise it couldn't be more generic for a Christmas movie. That being said I kinda like some of the mythos it adds to being a genie and I think certain aspects of the story are clever and well written. The comedy definitely doesn't seem to be aimed at my audience, I didn't find it remotely funny. The cgi and acting is also pretty poor but to be fair I'm not sure that really matters for this type of movie... Melissa McCarthy is amazing in this movie, while I didn't overly find her funny she still really not only sells the idea but also sells the character and acts extremely well. Like considering what this movie is and everything else there's some moments where she does like phenomenal acting, which only makes all the actors somehow look even worse than they already did but credit to her for trying so hard in a pretty mediocre movie. I'm sure there are a lot of people who do find this movie funny and I think the idea is interesting for this to be a good movie to some people, it's just really not for me. The ending also felt very rushed and pretty unsatisfying.",
    "95": "Such a shame as it could've had great potential. The storyline is great, but the cast are shockingly terrible actors.His siblings fake English accents are as bad as the acting overall in this movie. It's so bad!The main guy, his daughter and the doorman aren't as bad as the rest but his wife, mother in law, parents and siblings are absolutely chronic.Melissa McCarthy, thank god, saves this movie. Without her in it, it would be a complete flop. Thankfully she's hilarious as always.The movie itself is a great idea and could've been brilliant with the right cast. There are many funny moments, for sure, but they're all Melissa McCarthy.What on earth were they thinking with this cast? Seriously.",
    "96": "Melissa McCarthy has become a vacuum of fun. Lacking humor and timing is generally a taste thing, to another person that may not be a case. But her total inept delivery and complete lack of awareness actually causes for something beyond - sadness.It makes me sad that someone with such a terrible record per film output is taking away a job from a good actor. It makes me sad knowing that money is being wasted on projects featuring her when her salary alone could have produced Godzilla Minus One. It makes me sad to think that she still has the pull despite being in at least 5 of the worst comedy films in the last decade. Who likes her? She's Roseanne without the charm.The film? Eh, the film was probably fine if the bloated Death Incarnate of Comedy wasn't crowding the screen, screeching loud to ensure possible good jokes go to the River Styx instead. Overacting does not replace lesser talent. Use your inside voice please. Please Hollywood, stop hiring her. She's a special kind of awful."
}