{
    "0": "Candy Cane Lane is on the less offensive side of Christmas movie releases but suffers from being far too long at an energy draining two hours. Just when it starts wrapping up another 30 minutes come from nowhere.Eddie Murphy carries the movie and helps to push it over the line. It is a step up from his previous Amazon Original, Coming 2 America. Jillian Bell is annoying as always but fits in better in this zany christmas movie.It may not be everyone's cup of tea but Candy Cane Lane passes the time and is at least better than the 50 Hallmark exclusive movies which are soon coming down the pike.",
    "1": "Candy Cane Lane delivers a festive punch with its spirited competition for the title of the best-decorated house, adding a touch of homey charm to the holiday tale. The unexpected twist involving a mischievous elf banishment brings a hint of symbolism, though I might be delving too deep into it. Nevertheless, the Christmas magic is palpable, complete with 'Parents Just Don't Understand' vibes, vibrant colors, and whimsical decor.While the humor occasionally falls short in delivery, with jokes teetering on the edge of laughter, the movie brings forth chuckles and witty lines like \"You elf'in kidding me.\" Admittedly, it felt like a subtle ad campaign for Jeep, El Segundo's Candy Cane Lane, and USC-Fight on, I suppose. Despite the cheesy and slightly cringy Christmas love, it's a worthwhile watch during the holiday season. I'd give it a festive 2.5/5 stars - because, after all, 'tis the season for a bit of Christmas movie magic!",
    "2": "I'm surprised to see the 5.3 rating especially on the day 1 release, this movie is magnificent! I love most anything with Eddie Murphy some isn't as good but most projects are great. Candy Cane Lane is a unique wonderful holiday film a nice way to prepare for the spirit of everything even if its cheesy I love it quite a bit although I should say I have autism I enjoy different things than most. Very much reminds me of a Matthew Broderick and Danny Devito film called Deck the Halls that's a fun one that's very similar one without as much special effects. I admire Eddie he's done a lot of offbeat ones and iconic projects, I'm sure he's great to be around.",
    "3": "The trailer was somehwat cute, and fun. I have liked Eddie Murphy in many projects over the years, including Coming 2 America. (after watiching it again, I saw some more fun elements). This project is a disappointment. I really tried to make it through, but had to fast forward to the dismal, predictable ending. Hey, I know that holiday movies have happy conclusions, so that was not the main challenge. The main challeges included- poor script, miscast actors, terrible cgi and Eddie Murphy himself. I like Traci Ellen Ross, however, she is wasted here. Maybe she should have been the lead istead. No, it is simply a poor project idea, with poor execution, start to finish. Skip it.",
    "4": "Why the low ratings? This is such a fun family holiday movie. Don't sleep on the adorable end credit scene. This was such an original movie-not like the cookie cutter predictable ones we are all used to. Eddie Murphy is a delight and tracee Ellis Ross is wonderful. I thought it was entertaining and enjoyable. If you want a comedic, colorful Christmas movie, you'll enjoy this. I also enjoyed the representation and inclusion aspect of the movie as well. All around, really lovely family movie. Definitely worth the watch. Much better than family switch on Netflix-woof! Happy holidays, everyone! And a happy new year.",
    "5": "I have been a long time fan of Eddie Murphy and although I haven't always found him as funny as I hoped, his roles have always been charming enough to satiate my expectations.I started this movie with bridled expectations. The camera work and lighting in this movie is really nice, the effects were also quite well done, and I enjoyed some of the music, though I did notice that some of the music sounded like generic loops from Garage Band were used.Where this movie fell apart was the story and delivery. The story felt forced, where it needed more fleshing out and new characters seemed to drop from the sky and clash with the story instead of interweaving.The characters were also annoying, with some just being outright vulgar and some screaming their lines as if screaming somehow validated their dialogue.Eddie Murphy and his family seemed disconnected from each other, as if there had been a miscast of the actors. Their dialogue was shallow and the most disappointing thing was that it wasn't delivered with convincing tone and body language.The movie had all the trappings of all of the common commercialized Christmas movies that are being released now days, case in point there were two prominent cans of brand-name paint on display in one of the first scenes of the movie.This will not be a movie that I add to my yearly watch list by no means.",
    "6": "Who is tracee Lee who plays Eddie Murphys wife? Can't even act, in fact all the characters in this film need to go back to acting school. Trying way too hard to please. I had high expectations but its a real letdown xmas film, maybe because of the there's no Xmas feel to it, I wouldn't say it's boring but I had several conversations with hubby whilst watching this because it had yawn moments. I love Eddie Murphy films but this was a real let down please don't do anymore with tracee Lee. The best parts were watching the Xmas houses light up. Please please can we have simple Xmas movies with simple actors not trying too hard to try and be funny when they're not.",
    "7": "This was a complete waste of time. I can't believe Eddie Murphy took this gig. Didn't he read the script first? Bad jokes and over-acting by a third rate supporting cast, and Murphy honestly seemed to not care. Either that, or there was only so much he could do with his pathetic lines. He seemed to be phoning it in. I really like him, and hope he gets something better to work with.Special effects were awkward. Lines ended nowhere with a thud. Also, a very objectionable anti-Christian joke.I was wondering whether this movie was written by a relative or something. There had to be some reason to put this poor excuse for entertainment on Prime.",
    "8": "We might like to see Eddie Murphy do adult comedy, but this was surprisingly funny and very entertaining. The humor is a mix of adult and young adult and it's actually pretty nice to see Eddie Murphy do something than R rated comedy. Tracee Ellis Ross also compliments his character very well, she hits with the humor right on time and is used very well and not just a (background) wife. The figurines are hilarious as well! Whenever they hit the screen, I at least smiled and chuckled, the CGI was perfect too! Loved every bit of the premise as well. Could Jillian Bell do better as a villian? Yes. Could they have gotten a better actress for that? Maybe. She doesn't take away from the movie but ties it up in the end for what it was. Enjoy this holiday special, i did and you will!",
    "9": "I was really excited for this film, but was very disappointed. The pacing is very slow and the characters are challenging to care about. I think the creators couldn't decide on the genre, which also makes it difficult to get on board with. Starts as a family movie, then we meet the conflict (the competing neighbors) who we don't like, then we like, then we don't like again, then out of absolutely nowhere there's a magical component, but it's an odd off-putting, almost negative magic. It's so unfortunate that we have great actors and really well done cinematography and an absolutely terrible script.",
    "10": "Its the time of year where we watch good Christmas movies and bad ones. Hallmark cringe and silly musicals. Christmas action and Christmas animated. You don't always know what you're gonna get. Overall I really enjoyed the direction if this movie and as always really enjoyed Eddie Murphy. But that's kind of where the positives end for me.Most of the humor is extremely forced and doesn't work. They do succeed a few times but I found myself just begging for everyone to shut up. The cast is just plain annoying to listen to and everything is way over dramatized. I understand, this is a Christmas genre. And sometimes it works. Just not with this one.There was a solid little twist at the end that was satisfying and of course the arrival of Santa Clause was pretty awesome I have to admit. Sadly the overall movie just feels bloated and bogged down and you could cut a lot out to improve it.This is worth a single watch and then will likely be forgotten. Go watch Spirited with Ryan Reynolds. Similar genre but better overall experience.",
    "11": "The story itself was kind of original but there was forced humor and a lot of cheesy moments. The thing that irritated me was that in this day and age when everybody wants to scream about cultural, we got a black Santa... The story of Santa comes from white culture, stop trying to take everything as your own. They had some very good actors but the story just fell flat and had some eye roll moments for sure. Not quite a waste of time but was a little long and had some strange character building that just felt forced. I think Nick Offerman is a terrific actor but the accent just didn't work for me. Also weren't they all from different time periods, so his char is stuck in modern day without much knowledge of anything let alone money or a place to stay or a way to get a career going, details matter.",
    "12": "If you like Eddie Murphy, don't waste your and his time. You won't see the real Eddie Murphy. Not because of him but because of the horrible script and direction of this wasteful and boring movie. Other actors and actresses are also big part of the camera (they were not supposed to steal at the camera for 65 times). So, watch any other good Christmas movie but didn't waste your time watching this. They picked the wrong kids, also. Eddie Murthy's wife was not so happy acting. Most boring Christmas movie ever. From 1 to 10, I would have given 0 , but the minimum is 1. So, this is a one star. ---",
    "13": "Small kids might like this between 3 and 7. Other than that very cheesy. Murphy must have needed the money. Overall story line is just corny and stupid. The miniature talking figurines are just silly and not very well done. The cast is a decent combination. All relatively good actors it's just too bad their talents weren't displayed in a decent imagined plot. The elf is depicted by almost a devil themed character and a sacrilegious remark was openly said. Story jumps all over the place between the plot and a normal family. One of those movies made for Prime that failed miserably. Just not a Christmas movie that gives a fuzzy feeling. Just one that makes you realize I just wasted 2 hours.",
    "14": "\"Candy Cane Lane\" is a Christmas-themed comedy starring Eddie Murphy and Tracee Ellis Ross. The movie is directed by Reginald Hudlin (\"Boomerang\", \"House Party\", \"The Black Godfather\"). Murphy and Ross play a married couple, the Carvers, whose house in the Los Angeles suburbs is a perennial candidate for their block's Christmas decorations contest. Chris (Murphy) in particular is a Christmas obsessionist, so much so that his children (and, coincidentally, his wife) all have Christmas-themed names and the family's garage is overflowing with Christmas memorabilia throughout the year. As the story begins, Chris is a sales manager freshly laid off just in time for the holiday (an exchange with a supervisor references Chris' alleged oldness by the fact that he uses a rolodex). Wife Carol is looking at a promotion at a distribution services factory. In the midst of the very mixed career news for mom and dad, Chris buys a gaudy, flamboyant lawn-decoration Christmas tree a from a pop-up store run by a chatty manager (an alternately perky and menacing Jillian Bell). Unbeknownst to Chris, Pepper the manager is actually a rogue elf (fired by Santa for being a martinet about the naughty list) who likes to sell enchanted Christmas decorations to unsuspecting desperate people, which enacts a curse: if the hapless victim cannot collect enough golden rings by a deadline, they will turn into a living glass miniature, forever! Like, bummer!Needless to say, plenty of Christmas shenanigans ensue, all based around The Twelve Days of Christmas song. So, can Chris, Carol, Joy, Nick and Holly round up all the rings, dodge the Christmas dangers, and live to save the holiday (and maybe win the neighborhood decorations contest)?You'll have to watch to find out! Some other supporting players include some sketch comedy alumni (Chris Redd, Robin Thede, David Alan Grier, Nick Offerman) who get to offer an assortment of quips and jabs during the proceedings.\"Candy Cane Lane\" is a perfectly acceptable family-friendly Christmastime film. Murphy and Ross do well as the leads, with a nice rapport between them. Murphy seems to generally rein in his improv instincts and generally sticks to the script by Kelly Younger. In fact, any number of instances where a character is about to curse there's an interjection involving a holiday song, which seems to be a deliberate in-joke about the characters Murphy was known for playing early in his career. Ross, by now a longtime television comedic actress, does well in what could have been a thankless and colorless role. There's plenty of good soundtrack music choices, and the special effects are excellent. Several sequences will find younger kids really entertained.Check it out, and have fun!",
    "15": "Being a serious Christmas fan meant I was very excited to check this movie out. Unfortunately it didn't deliver. There is absolutely no need for a festive, silly Christmas film to be 2 hours long. Eventually I was just struggling to keep my eyes on the screen. Every time I thought it was over, it just kept going. Eventually I just got lost and didn't really know what was going on.There were some laughs along the way which I did enjoy and to be honest I think that was the only reason I persevered with it and saw it to the end.Fantastic cast but a busy, drawn out storyline. I wont watch it again.",
    "16": "This movie is so bad that halfway through I just could not watch it any more. It is the equivalent to pouring acid into my eyes like eyedrops. I can not recommend this movie under any circumstances. Watching paint dry is more entertaining than this. The characters in this film are so basic its sad and it has the weirdest plot ever. This movie is a disgrace to christmas and movies everywhere. This movie is just about collecting rings and the little christmas dolls are so weird. I Would not under any circumstances watch this. Stay far away from this film. No matter how board you may be DO NOT WATCH THIS TERRIBLE MOVIE.",
    "17": "Popped this on with the kids this morning hoping for an easy watch Christmas film. Don't bother, was honestly so bored after 10minutes the kids were asking to turn it off.Terrible acting, scenes that are way too long and slow paced that we all just lost interest. The first bits of dialogue with Eddie Murphy seemed forced and cheap comedy, Eddie seems completely disinterested.Film just screams lazy, awful writing, boring pace, no one seems interested.I mean the film opens with awful CGI of two people sandboarding I knew it was going to be a great film.Stick to the classics at Christmas, avoid this garbage.",
    "18": "As a family we love Christmas films, but when was the last decent Christmas movie made? It's just so dull. In fact it was worse than dull, we actually felt robbed of our time. In the end thankfully my daughter asked if we had to watch the last 15 mins and we all agreed not to. Think we are going to stick to firm favourites like Elf, Home Alone and It's a Wonderful Life. So there are no spoilers in this review except the content of the film. Woeful. A film about a Christmas lights competition but with no humour, no feel good factor, no joy, no anything on a positive note. Yes I'm rambling but don't watch this film.",
    "19": "I always see a Christmas movie is a go-to because it is usually have an easy, magical and have strong storyline and message. But this movie is not only far from those, I don't even get what they're trying to deliver here. The plot is all over the place. The movie confuse me in the first 30 mins and even when I tried to move forward towards the end, I still don't get it what they're trying to say and what this movie is about. The characters were not engaging to each other, they're overly excited and angry over things that are unnecessary, and the movie was executed poorly. Christmas movies usually make me happy, this made me angry and frustrated. Esp when they mocked religion in it. The only good thing about it is the Christmas decorations. If you look forward for a good time watching a movie for a Christmas, it's really a wrong choice to choose this movie.",
    "20": "I wish it was better. The movie has a great look and a great leading cast with Eddie Murphy and Julian Bell. Unfortunately only Julian Bell was funny. I only laughed during her scenes.I think the issue was the story. It wasn't very good and it was boring. I really didn't care what the problem was or what Eddie Murphy was trying to accomplish. The live coverage of Candy Cane lane made no sense and the reporters were terrible actors. The news coverage came out of no where. The movie was a mix of a bunch of bad parts and recycled stories. If it's going to recycle a story it needs to be as good as the original or better. I don't ever want to see this movie again.",
    "21": "I thought this is movie was going to be about Eddie Murphy making a wish for every day to be Christmas and that the whole town would look like the North Pole and the toys magically come alive etc. Etc. Because deep-down he's afraid of change and Christmas gave him that sense of stability but as the old saying goes: \"Be careful what you wish\"... I guess a combination of Tim Allen's Santa Clause and Bill Murray's Groundhog Day, but NO.This movie was about Eddie Murphy who got laid off and the neighborhood has an annual Christmas light competition but this time there's a $100,000 prize. So guess what his wish is going to be? Not the $100,000 but to win the competition which to be honest, I didn't see him really make a wish because all he did was visit a magical store and bought this Christmas tree then sign the receipt which might he sold his soul, but how could he sell his soul if there was a monetary exchange? But whatever, it was BO-RING!",
    "22": "A beautifully average Christmas movie with heart and compassion, but laced with too incomprehensible plots, too crowded of a cast, supporting cast and mumbo jumbo chickens and cows. Even Eddie Murphy is not himself here, seems lost, at times disinterested and grumpy in his heart, not showing his awesome funny smile and comedic capabilities (though the film screenplay nearly doesn't help with those either). Believe it or not, Jillian Bell (Pepper) had the best acting out there.The visuals are beautiful and at times stunning, but visuals get destroyed when the script and to some levels the acting + the score are not on par. That's not a goofy police procedural where you can walk gray-colored in brightly colored comedy photography and filming. Nevertheless, that's exactly what happened, uncompelling characters as a whole with so so acting (-50%) blended with a (+15%) score in a colorful filming environment (+75%) and the result is around 38% at best.That's what the director Reginald Hudlin needs to take into account in her next comedy project!Screenplay/storyline/plots: 5Development: 7.5Realism: 5.5Entertainment: 5.5Acting: 6Filming/photography/cinematography: 8VFX / CGI: 7.5Music/score/sound: 6Depth: 6Logic: 5Flow: 5.5Comedy/family/fantasy: 5.5Ending: 5.",
    "23": "How many Christmas cliches can you fit into a 2hr movie ? Turns out hundreds ! Take a real funny man (Eddie Murphy) , make him not funny , put him with lots of other mildly amusing actors , get them all to wear Christmas things and say Christmas stuff , take the plot of Deck the Halls but swap lights for decorations and hey presto you get a mediocre Christmas movie !Add in an incredibly annoying soundtrack and you can alienate even more of your audience.There's nothing new here , but it'll keep your kids vaguely entertained for a couple of hours . Alternatively chuck it on in the background for Christmas ambiance while cooking or something. It's not a bad film but it's not a good film , it's certainly not going to be a Christmas classic either!",
    "24": "I thought this was going to be a\" roll your eyes\" Eddie Murphy movie. I was pleasantly surprised.The special effects are different and interesting. The ornaments that were alive were quite fascinating. Even to the point of having luminescent skinsI thought the mother was point on, not the regular, pretty, ideal woman, but someone I could relate to. A little over the top, but not believable. I loved the family interaction, more delightful than I thought it would be.Dare I say the 12 Days of Christmas coming alive made me laugh and the bad elf-what a hoot. A great interpretation of the character.",
    "25": "This has all the concepts to be a great Christmas movie but it seems to suffer from poor editing, bad acting and some terrible casting choices. Some scenes are not needed and some scenes are so stretched out you cant help but think \"Oh get on with it\". These scenes slow the whole movies flow & keep taking you out of the story. So many times in this movie I was actually bored. Some of the acting is the worst I have seen in a long time, worse than some straight to TV movies. In conclusion a decent idea & story ruined by too many boring talking scenes that someone felt needed to be left in the movie. & some awful casting choices. Best avoid this one & enjoy another Christmas movie instead.",
    "26": "If you watched this mess and enjoyed it, seek psychological help immediately! Eddie gave up entertainment years ago. If your expecting some of the 80s 90s Murphy to finally re-emerge you will be sadly disappointed. I was hopeful, but alas I was fooled again. I think this nonsense decorated as a Christmas movie was written, directed and produced by an demented elf that spiked their eggnog with psychedelic mushrooms. Murphys fee must have drained the budget for talent , because only a skilled actor could pull off reading that garbage script and give it an jingle of life. In short, time is precious, don't waste it on this crap.",
    "27": "You'd think with how this starts it would be another 'Deck the Halls' type movie of neighbour vs neighbour. But it swiftly transcends into a world with 'magic' and talking figurines and offputting CGI birds. No real explanation about the 'magic' either. And no real sense of 'wonder' from it either tbh..The birds alone really took me out of the movie.Not to mention the third act where they have to find 40 rings (not 5) is really disjointed. I mean, the whole movie is disjointed really.. but in the third act they show us (as the audience) getting maybe 7-8 rings, and somehow they just get them.Had a few chuckles but the disjointed script really threw me.",
    "28": "It was good to see Eddie Murphy on form but badly let down by awful script and poor direction. All the cast gave it their best and there were a couple of good one liners but the whole thing felt was muddled and felt as if they were making it up as they went along. The best that could be said about it is that it - at last - a family of colour is centre stage in a Christmas movie and not just ancillary to the main plot and the wife's job is as equally important to the family as the husbands. Sadly they seem to have imagined throwing a ton of CGI at it would be enough to cover up the holes in the plot. Torturous to watch.",
    "29": "I was gonna give it a good ratting because it seemed like it would be a good old magical big Christmas movie but nothing about it felt like it was such. It was extremely annoying. Children under 5 might enjoy it but not for older audiences. We anticipated it very much but ended up very disappointed. The overall message was off course good but that's not you pay to watch a movie. It's just filled with loads of random nonsense scenes happening too fast. It could have been made way better even with a weak storyline it has. Acting performances were, passive weak and tv quality. Overall a very annoying quick made televisjon quality Christmas movie without Christmas feel.",
    "30": "I have to admit, I watched the trailer and was not sure I would like it. But I did! It was very creative and original. Eddie Murphy was on point with his usual family mode of humor. I love how he can pull off adult comedy and family friendly comedy so easily. All the actors who played his children were quite good, especially the son, that young man can dance! This was a unique tale, a full 2 hour magical fantasy of family fun. I love how they cleverly covered up the occasional f bomb that was about to drop. A lot of great comedy actor cameos. I really was pleasantly surprised. Pip, played by Nick Offerman, well he's one of my fav actors. David Alan Grier and Chris Redd were hilarious. I will def watch this again.",
    "31": "Eddie Murphy is an enormously talented and funny guy but he just seems to be really bad a picking movies that show his talented and funny side and with Candy Cane Lane , this is not exception.. he is neither funny or entertaining in this incredibly dull and overly long turd of a movie .Thing is ,it's hard to see whose fault this is. It quickly becomes apparent early in the movie that it's directed badly and doesnt have any spark. It doesn't draw you in in anyway and do you quickly become interest in any of the characters in the film\nSo wish we could see more of the coming to America, bowfinger Murphy.",
    "32": "It wasn't that funny, it had a story that didn't flow and there were lines that were quite offensive and dismissive. Truly disappointed - didn't get us in the Christmas mood at all.The child actors were great however. Well done in this awful movie. Won't be rushing out to watch it again.It was quite long for a movie that didn't really do much. There wasn't enough explanation of why the elf character was doing what she was doing.What an utter waste of time. The movie was offensively dismissive of faith and had a shallowness of plot, characters, wachabiltiy.Not the Christmas classic I'd hoped for. Awful awful awful.",
    "33": "I don't believe every movie has to preach, however this movie didn't have to outwardly deny that Christmas is a religious holiday. The line was delivered as if to intentionally make a mockery of the religious reasons for the season. They could've just left that out but since they did not, it has lost its charm. We will not be watching the rest of the movie. I was looking forward to Eddie Murphy bringing the fun, however I was left sadly disappointed. Christmas is a time of family and fun, but I just don't think it was necessary to include anti-Christian references. Also, the script was slow and seemed to have unnecessary fillers.",
    "34": "They felt the need to take the full name of the reason for Christmas season in vain. I'm not sure why I expected anything different, but it's definitely not something I would want to watch. I was hoping for something more family oriented, like Haunted mansion.The characters and story up to that point were interesting, and I loved that the daughter wanted to go to Notre Dame (go Irish!), but that was really the best part of the story up to that point. When Murphy gets to the magical elf shop, the story was already taking a downward turn with the elf's abrasive and annoying personality, but when she cursed Christ's name, I turned it off. So not necessary, but clearly, I'm not the target audience for this film.",
    "35": "This is a Christmas fantasy, so do not expect much in the way of a logical, sensible plot or story line, right? Well, no. Even a fantasy should have a worthwhile, and even vaguely logical story to it. What we have here is a cut and paste series of loosely connected set scenes, seemingly lacking in imagination, or any real effort to make a coherent narrative. A forced, weak dialogue does nothing to bolster the non plot. Delivering it with excess volume and strident intonations, along with over exaggerated facial contortions and arm waving, does not improve it at all.But, it is well produced and colourful, with a half effective soundtrack, so as a pre Xmasy festive warm up, it might keep your attention for more than the 45 minutes that this viewer lasted?",
    "36": "Candy Cane Lane is a 2023 festive fantasy comedy starring Eddie Murphy,Tracee Ellis Ross,Jillian Bell,Madison Thomas,Thaddeus J Mixson and Genneya Walton. From the director of Boomerang(also starring Eddie Murphy),the movie follows a family man named Chris Carver(Murphy) who just got laid off at work,while his wife Carol(Ross) got promoted at her warehouse. When Chris finds out that there is a competition for the best decorative house for Christmas,with the winning price worth 1,000 dollars,he decides to pull off something that was never done before.He finds a mysterious store owned by Pepper(Bell) who sells him a Christmas Tree with the theme of 12 days of Christmas. When Chris sets up the tree at home,he realises that the tree comes to life and needs to retrieve all the items from the 12 days of Christmas or else he and his family will turn into porcelain dolls as part of Pepper's revenge. Will Chris and his family get the items before it's too late?.Overall I enjoyed this film since Eddie Murphy is in it and I was always a fan of his since I was a kid. If you love Deck The Halls and Goosebumps(2015) then you'll like it. Better than You People(which also had Eddie Murphy in it).",
    "37": "Listen, you don't have to be religious to appreciate the fact that this movie is so disrespectful towards what many people celebrate in the Christmas season, Jesus being born! In the first 15 minutes it sets the tone that this is gonna be another garbage Christmas movie that misses the importance of the holiday all together. Go watch other Christmas movies that aren't trash like this Prime movie. There are wholesome and good family movies on other streaming services that are more worth your time. This movie is a huge disappointment and I really hope Amazon Prime learns from this and makes movies that people are actually going to enjoy and remember what makes this season great.",
    "38": "This movie could have been amazing. We liked the story, itself. But didn't like some of the people in it.Absolutely NO Talent, should NOT have been in a Eddie Murphy Christmas movie.No talent actors: Made this movie very difficult to watch.Jillian Bell, Danielle Pinnock, DC Young Fly.Truly do believe that this could have been a great Christmas Movie. Going to keep an eye on Thaddeus Mixon, Madison Thomas, Genneya Walton. It will be good to see them in more movies and watch them expand their talent. They already have a great start, hopefully they can get more roles to work on being another blockbuster movie star.",
    "39": "We watched this last night. My husband found it far more entertaining than I did, hence 4 stars and not lower. There was a scene that I just found really offensive. I don't understand the need these days to be against Christianity all together. There is a scene where the elf asks Murphy what Christmas means. He says all this feel good stuff. Totally fine, I don't expect everyone to include Christ in Christmas, and I don't think it's hollywoods job to evangelize, but did he have to add, \"oh, unless you want to go the religious route\" with the elf responding Jesus Christ no. I know that Christians can be our own worst enemies, but this anti-Christian culture is offensive. If you expect me to respect your chosen lifestyles, why can you not have respect for ours? Why the need to intentionally disrespect an entire group? Isn't that what caused inequality?Aside from that, I found the movie really dumb, but like I said, my husband enjoyed it quite a bit more than I did. I would have shut it off if not for him. I also don't understand this new way of filming to make everyone look like they have perfect skin. It's like a TikTok filter was applied to this movie.",
    "40": "I personally thought this was a decent Christmas movie, wasn't the best Christmas movie but it was still enjoyable to watch. Eddie Murphy wasn't his usual over the top funny but I understand it's a PG rated family type movie. I thought D. C young fly was funny as the news reporter lol, Jillian Bell did a good job as pepper, the little statue people were funny. The whole plot of the movie was entertaining finding the gold rings. This movie did have its funny moments, boring moments and entertaining moments. I would say it's entertaining enough for a one time watch atleast. Maybe young kids would enjoy it much more.",
    "41": "In fun Christmas fantasy comedy \"Candy Cane Lane\" Eddie Murphy so wants to impress wife Tracee Ellis Ross & kids by beating neighbours like Ken Marino to be named the best Crimbo decorated home on El Segundo's famed titular street - but his drive leads him to the festive store of bad elf Jillian Bell (fired by Santa David Alan Greir) who fools him into a challenge (involving animatronic geese, French hens, etc) that could turn him into a talking ornament like Nick Offerman (with DREADFUL 'British' accent). Writer Kelly Younger & director Reginald Hudlin keep it light, bright, silly but polished - and being set & filmed in The Gundo (hell yeah!)... it couldn't NOT be good!",
    "42": "Candy Cane Lane opens with a Light Fight. A nice upper middle-class neighborhood has an annual competition for the most elaborate, and probably most expensive Christmas display. Then a large prize is offered and previously friendly neighbors lose all sense of perspective.What a funny Eddie Murphy film that might have been if it had just stayed that course! Imagine families shelling out more and more for increaingly gaudy decorations. Animated figures go awry with laughable, perhaps even vulgar outcomes. Faulty pyrotechnics cause fires. As judgement day approaches, neighbors are caught trying to sabotage each others' displays. Fights break out, Cops and lawyers are called.That film, based in reality instead of Christmas magic gone bad, would have been far more entertaining, and certainly more humerous, than this one.",
    "43": "Not only did enjoy this film I thought that it was very hilarious and ridiculously awesome and a very great holiday family film . Lf you wanted a film that makes you feel good and make you smile and wonderful happy than you will love enjoy and appreciate this film. I ALSO think that the overall message of this film is perfect Christmas is not what you have it about who you spend it with! . also I think that a very wonderful and true statement! AND there is story twist I did not see coming and there some surprises in this film I highly recommend his film the cast was good to very happy ending!!",
    "44": "A wonderful, creative, imaginative production from the one and only Eddie Murphy completely out of the old tired box. Was it snowing in southern California? Nahhh. But you might have expected it. Eddie Murphy hits it out of the box with this one.Even the animation was beyond compare. Be sure to take the time to watch this and help the family find all the necessary items to save Eddie Murphy's character Chris. Chris's kids rally around, the family comes together and everyone ends up having their wish come true.I'm going to put this one in the Christmas movie rotation. You can't go wrong. Pop some corn and be prepared to enjoy.",
    "45": "Was expecting a lot more, with Eddie Murphy onboard you expect laughs, yet they never arrive. After watching reruns every Christmas of Christmas classics was hoping for a new and fresh treat. Sadly, this is not it. The acting was mediocre at best, you stay tuned waiting for something exciting or funny to happen but it never comes. And the coup de grâce was the bloopers reel at the end which was as unfunny as the movie before it. Why bother with a bloopers reel that isn't funny or entertaining, it just added to the disappointment. One of these movies you could watch once but wont be champing at the bit to watch it again when it is replayed next Christmas.",
    "46": "I have never wrote a review for a movie before but I just had to for this movie. Don't waste your time on this. This was a very disappointing movie. It wasn't funny, I find it far too \"modern\" in the jokes. Eddie murphy also was not funny at all. The movie didn't feel natural because it was way too long. Two hours for a comedy christmas movie is too much. As a christmas fan the movie didn't gave me the christmas vibes I expected. I expected the movie to be as good as the movie Godmothered but it didn't deliver. I will go back to watching the same old classic christmas movies again and again since those are 100x better than the christmas movies made recently.",
    "47": "I was enjoying the movie until a scene where the character Pepper makes an almost negative impact comment about Christmas and Jesus. The movie would have been enjoyable to the end had they not included that scene. It just felt wrong. I watched the whole movie because it is adorable and does contain feel-good nostalgia. I will not allow my children to watch it because kids already struggle with conflict trying to cope with natural instinct and whatever \"social-norms\" means. It's a shame though, Eddie Murphy did not fail to bring his years of talent to the forefront. A good movie that could have been great, for our family anyhow.",
    "48": "Watched it because I actually like nearly every Eddie Murphy movie. Also, I'm a real December fan. Boy, what a disappointment.But it's just not there, no Christmas feeling, the acting feels not real. The story is, weak and weird and the CGI seems not to fit in. Also the animals defending with shooting eggs, realy? And the insane stupid plot twist about the taco's but also about the extra rings.It all feels like a wrapup of scenes that were laying around and someone tried to giftwrap it. Unfortunately they failed horrible.I would not rewatch this movie, neither do I recommend this to anyone.",
    "49": "It's a reasonable idea for a film, it starts fine, cast is ok, and Eddie Murphy is not to annoying. But then something happens around the hour mark and it just seems everyone gave up.With someone who cares they could have completed the story, not just gone for cliché after cliché. So we are left with what feels like a film that could and should have completed the story in another 45-60 minutes, wrapped up in ten minutes.Did they run out of money, did the strikes cut it short, what happened?It's so hard to have an original Christmas film, they have all been done over and over. So it's how you take elements from a few to give it a new feel and twist, what stelary d out with hope had me making my Xmas wish for it to end.",
    "50": "Is it a Christmas classic? Probably not, but it is funny and entertaining. The special effects are pretty cool and a new, unique twist. I don't love Jillian Bell as the villain, but she is tolerable. People are blasting this movie, but I enjoyed it. It is nice to have an option for something new! I am so tired of the same old four Christmas movies over and over! If I have to suffer through ELF one more time, I am going to scream! No, this is not the best Eddie Murphy movie ever, but give it a chance. This may be one of those \"Once a year\" kind of movies. If I had one major compliant, it is the use of Jesus Christ as an expletive. Both of the main character actors have said they had hoped that would have been cut from the movie, but sadly, it was not.",
    "51": "I clicked on this without reading any synopsis or watching any trailers. I picked it based on seeing Eddie Murphy's pic with a Christmas background. Now, I must say that I enjoy watching Eddie Murphy doing the adult stuff but I really enjoy him doing the light hearted pg movie family movies as well . Tracey Ellis Ross was great as the wife. I thought that the acting from everyone was good. I expected it to be cheesy in the first few minutes of starting it. Candy Cane Lane threw a bit of adult humor, and I think it's a fair amount throughout the movie. All in all I found it very enjoyable and entertaining.",
    "52": "I felt that the producers didn't want to step on anybody's toes, why? I have no idea. Eddie Murphy (Chris Carver) seemed like he was restrained, it looked like he was struggling to do a PG rated movie. There are glimpses of him through the movie though, and it does make the movie better.At 1 hour 57 minutes, Candy Cane Lane, didn't seem that long. Having said that, it also felt that some scenes could have been left out and spent too much time on them. I wonder how much, better, footage was left on the cutting room floor. There was enough in this movie to keep me watching it, just.It's a shame, this was my first 2023 Christmas movie to start off the season, it managed to rate just above average. I would recommend it though.",
    "53": "I truly enjoyed this movie! The characters were acted by great talented actors! Second chances, spirit, melodies, Christmas Carols, decorations, and presents! Love all the sets and good messages! May become one of my favorites!!Wine in a box, and tacos with take out drinks for Christmas breakfast; what could be more satisfying!! And of course SANTA!!Even Dinah Ross' daughter!! This movie is a happy huge success! Reginald!! You did it! Of course I love the out takes at the end! Keep watching with the credits... then you won't miss those cute moments! New Christmas season songs, too! This is needed! And I love the 12 Days of Christmas! I even heard Home Alone music in a minor key!! Smart!I just may name my next two frenchies Pepper and Mint! Pepper should have her own movie! Just saying!Happy Endings to you all! Merry Christmas!!!",
    "54": "Super surprised to see the low rating but also not shocked. The low reviews are from clearly very miserable people. I mean honestly, you can't trust a review on a film like this from someone who doesn't even know who Diana Ross' daughter is.Well here is our take. My family and I enjoyed this film. Took stars off because they said a$& a few too many times for my liking for it to be a kids/family movie but other than that it was funny for both us adults and our 3 & 6 year old kids for our family movie night. The cast were all great and funny. I really appreciated the diversity. My oldest daughter felt like this was an extension of Haunted Mansion which we also loved with Eddie Murphy so if you like his family movies, this is really no different. You'll enjoy this one too!",
    "55": "My 5yo daughter and I just finished the movie and we absolutely loved it. It's a cute, fun, funny movie with great actors. These are reviews must be from people who wanted to hate it (or were offended by a black Santa). . The plot has all the components of a great movie. It was fun, playful and had moments of adult humor and kid humor. My daughter and I were thoroughly entertained and I immediately texted my friends to let them know that they should check the movie out. I always love seeing Eddie Murphy in a movie and adding in Tracee Ellis Ross was a nice touch. 10/10 recommend of you're looking for a new cute Christmas movie to watch with your kids or by yourself!",
    "56": "There are so many funny little jokes tucked in here that you're not going to catch if you're not listening. From the greatest sportsman of all time being Michael B. Jordan (He's an actor if you aren't familiar) to Santa Claus showing up black. And, yes, DieHard IS a Christmas movie. Murphy is funny as always, and looks great for being in his 60s. The little girl is adorable and was well cast.The only scene that was FAR too long and uninteresting is Nick in the music room. Get to the gag already. There are a lot of sight gags, slapstick style. The main story line is predictable, but done in an enjoyable family-friendly way. It's not going to be one that we watch every year, but it was wholly enjoyable.",
    "57": "Bad acting......silly story......screaming people....nothing about this was good and I just kept watching and I kept waiting for it to get better but unfortunately it went the other way. Don't waste your time watching this the way I wasted mine! This would never be on my list of favorite Christmas movies! Everyone seemed to be just wanting to finish making this dumb movie so they could collect their pay (???????) and go home. Please, Eddie Murphy, don't subject yourself to making a lemon like this ever again, you are too good an actor to belittle yourself this way. And that's all I have to say about this.",
    "58": "I normally overlook things that might be offensive to my beliefs but in a family Christmas Movie it just went too far with one line -it was enough for us to shut the movie off.When they were discussing what Christmas is all about they were talking about money and gifts and then said unless you want to go the religious route and the woman replied \"J. C. (Lords name), no!\" It was just rude and sacrilegious- and that is literally what Christmas is about so why use His name in that way? As a joke? Not cool at all.I really wish they had left that part out but it was just not ok. Hopefully others will complain also.",
    "59": "Was this a masterpiece...no. Was this entertaining....yes. Loved the animation of the little people, Chris Redd was great! The theme of the movie is not original. I wish Hollywood would not rehash the same themes over in Christmas movies. However, this was a nice take on a familiar theme. The chemistry and timing between Eddie Murphy and Tracee Ellis Ross was actually pretty good, definitely could see them doing another movie together. Loved most of the characters, not so much though of Pepper, as she was a bit over the top silly-obnoxious. Would like to have seen someone else in that role? The two announcers were funny, good banter between the two. Danielle Pinnock did a great job, hope to see her in more comedic films with more screen time, or lead character. Overall, it was fun, would watch it again.",
    "60": "If you have anything better to do, watch something else. I like E. M's movies, but this is really childish, ok it's for Christmas, but it's childish in a dumb way. Super simple plot someone came up with while sitting on the toilet, zero depth characters, also actors not fitting their roles, like E. M.s wife, doesn't fit the character, they should have chosen someone else..\nGarbage.I say in the beginning maybe was decent but then it turned into a nothing movie. I gave it 3 start because I wanted to like it. Then in the end, after the credits, Santa becomes evil. I guess supposed to be funny. Also it wants to be too many things and it does nothing right in the end.",
    "61": "We really loved this Christmas movie as a now family favorite. We are adding it to our yearly traditional Christmas season lineup. It was hilarious and full of action. The movie was filled with times of laughing, crying, love and excitement. There were times when we had to pause, rewind and catch the punch lines that left you busting with laughter. Thank you to all who created and had a part in this movie making it such a warm, funny family movie to enjoy together. We watched it more than twice and enjoyed the quick wit and puns. Excellent casting and great acting. Thank you so much for a great time. Gems like this are truly a joy and delightful to watch.",
    "62": "This is no Christmas Classic, BUT it was enjoyable. The story has some plot holes, but so do Marvel movies, classic films, and other mass-appeal blockbusters. It could have done with some streamlining, but I found myself laughing throughout. It didn't feel like 2-hours to me, but I let myself sink into movies, and they really need to drag to feel long.The special effects were decent, particularly the little figurines. The acting was fine, the leads had chemistry (contrary to what I've seen some people write), and the kids were NOT annoying/cloying/precocious, which is a HUGE plus for any movie, but particularly for one taking place at Xmas.I can think of many worse ways to spend some downtime in front if the TV.",
    "63": "I didn't see any trailers but tuned into the movie on the strength of Eddie Murphy's participation in the lead role as family man Chris Carver. The movie isn't as funny as some of Murphy's better-known vehicles, but it does get frenetic after Chris makes a deal with Elf Pepper (Jillian Bell) for a stupendous Christmas tree to decorate his yard, based on 'The Twelve Days of Christmas'. Pepper had a bone to pick with Santa Claus, but even so, the character came across as caustic. As did the hosts from Prism TV, I found them to be annoying. Saddled by a contract he signed with Pepper, the stakes escalate when Chris's requirement to retrieve the five golden rings of the song suddenly escalates to forty because the song looped while being played. Faced with a desperate countdown lest he be turned into a ceramic version of himself, Chris and the rest of his family pull out all the stops, even as Pepper rigs a time clock to prevent his success. I liked the way Santa (David Alan Grier) went to bat for the Carvers, advising them on how to come up with the final two rings - very clever and a warm, family friendly resolution to what could have been a crisis. There's no doubt this is one of the most colorful Christmas movies you'll come across this season, though it appears to be geared more to the younger set. Which is OK, if it gets them off their cell phones and laptops.",
    "64": "It has been a while since I've seen a Christmas movie like this. Well written, well acted, good direction, good special effects, and just overall very very enjoyable. It is a bit old fashioned and corny at times but aren't most good Christmas movies like that? It's only 2 hours long so it's not that long. And it's got good action and meaning and some twists and a good Christmas message behind it.Check it out everybody and give it a chance. Make some hot chocolate, roast some marshmallows, pop some popcorn, whatever it is you like to do. Just sit down and enjoy it with your family. You won't regret it.Merry Christmas!",
    "65": "I LOVED this!! It's a perfect Holiday Miracle type movie!! Lessons are learned; family relationships are healed; it's humorous and fun!SPOILERS - The one thing I WOULD change about this film is at the 20:35 mark when \"Pepper\" is asked about the \"religious angle\" of Christmas, and she says \"Jesus Christ! No!\" That bit of hurtful sarcasm could have been left out. \"Pepper\" is shortly thereafter revealed to be the antagonist of the story. \"Santa\" and the other characters are helpful and positive. The main family learns to listen to and support each other, and to work together to save Christmas!!",
    "66": "Candy Cane Lane is not the next Christmas Vacation. It's not A Christmas Story, or Elf, or any of the other long time classic Xmas movies. But it could be. CCL has enough charm, silliness, and holiday cheer to possibly land it on \"best of\" lists as years pass. Eddie Murphy, in most of his late career films it seems, has this sort of \"throttled\" Eddieness that reveals glimpses of his earlier brilliance, but never goes full tilt. He's funny in this movie, but never over the top nor tries to steal a scene. The rest of the family are excellent, and although with any of these movies one needs to suspend disbelief a bit, the characters never seem ridiculous. The elf \"Pepper\" is somewhat annoying but she's a great actor, and the animated characters are all excellent. This movie has wit, great pacing, a solid family story, and although it will annoying the Jesus sycophants because of a couple MILD slights about the religious aspect of the holiday, it's still a wonderful family film (with only some tepid adult references here and there). Loved it, and glad Eddie is out there working regularly again :)",
    "67": "The whole idea with having to collect rings from each of the 12 Days of Christmas that have come to life and gone wild. It wasn't like the next Elf or H ome Alone or Grinch etc. But definitely a cute watch with your family or in general. It isn't super funny or anything like you'd expect from Eddy Murphy but there are funny moments. It had a bit of action too.For me I liked trying to guess what thing from the song was coming next and how they'd be represented. I really liked Tracie, the female tv host (she was ridiculous), the animals, The lamp lighter, and Pepper the best.OHH AND THE SETS AND PROPS ON THIS MOVIE WERE SOOOOO WELLLL DONE!! I loved looking at all the beautiful details!",
    "68": "If you sat back and truly enjoy the movie, you'd see it's about family togetherness, love and understanding.This is fantastic family-friendly movie that you don't have to worry about your children and older parents watching it has a little something for everyone.I truly miss family holidays where the neighborhood would come together. Now, we seldom get to sit still and just enjoy good holiday movies like this one.Eddie, Tracey along with the rest of the cast did a wonderful job.I sincerely enjoyed it, however I did feel like some parts were left on the cutting room floor and they should have gotten the rings in order.",
    "69": "In spite of the very low ratings on I MB Di felt that this movie starring. Eddie murphy Was perfect. It had a wonderful supporting cast, very believable characters. Animal offered up the true meaning of the movie. The whole point of the movie which was family. I thought that the 4K ultra HD really brought the movie to life with a lot of amazing Christmas scenes. In basically christmas cheer. I would highly recommend this film , \"Candy Cane Lane\", to all family members of all ages. I thought the supporting cast of Tracy Ellis Ross as Carol Carver Thaddeus J. Nixon as Nick Carver and Janelle, Walton has joy Carver, highly complemented Eddie Murphy.",
    "70": "Candy Cane Lane is another forgettable generic comedy that had so much potential. I was really looking forward to this film because I am a huge fan of Eddie Murphy. This latest film of Eddie's has a very forgettable story with unimpressive visuals. This movie might have had looked good on paper but the final product is just bland. There were a few scenes that I did enjoy but nothing that would make me want to rush back to watch again. Eddie Murphy and his on screen wife Tracee Ellis Ross do have good chemistry and that one's one of the very few highlights. Another Con about this film is the ending seemed so long and boring. I know ultimately this film was made for families/kids but I think they will find this movie uninteresting. Candy Cane Lane gets a failing rating from me with a 5 stars out of 10.",
    "71": "Eddie Murphy and the rest of the cast was great in this movie. The story was a little choppy and the movie over all seemed rushed. Maybe production had less time than anticipated but overall, the movie was fun and had tons of Christmas spirit.The best part of this movie is that it wasn't pushing a social/political agenda. I don't only mean the movie as a whole, but there was not any character that was inserted to meet the status quo of the current social climate. It was a plain Christmas movie that simply put a family through a series of tests to bring them closer together and remind all of us why we celebrate Xmas.",
    "72": "I wasn't to sure about this movie at first, but we were blown away. It fits in with all Christmas Magic stories. My family loved this movie. What a great cast to.It's funny, no violence and the christmas decorations are delightful. I believe this movie should be placed with all the children's stories after all Christmas is all about children, hope, goodwill, families working together and showing love towards each other and others. In other words it's just an excellent feel good family movie. There's nothing to scare anybody and you will find yourselves rooting for the good guys. I can't say enough about this movie.",
    "73": "I thought it was very cute! If you are looking for a deep Christmas movie this is not for you. But if you want to watch something fun with your children then this is a good pick for you and your family. As usual, Eddie Murphy is a delight to watch and so fun in this movie too. I enjoyed the supporting characters in their roles as well. I thought the young lady who played the girl who Eddie Murphy's youngest daughter was just adorable! The premise of the show was not overly complicated for the young children and had just enough comedy to keep the parents from falling asleep beside them. I think you will enjoy this silly and in the spirit Xmas movie!",
    "74": "The family and I absolutely enjoyed this movie. We even watched it twice in the same day. Once that evening with the whole family and then me and the wife watched later that night. There were Laughs the whole time.. wife even shed a tear at the end .... happy tears of course. I do not understand the low ratings.. I guess some people just don't get Christmas. *shrugs* anywho it was a very enjoyable movie. 10 out of 10 recommend. The actors were great, even the children. The story was good and unique.. I know someone compared it to Deck the Halls but I felt it was very different and even better..",
    "75": "Loved it from the technically VFX and CGI side of things, the effects and overall post-production looked great. The story has a lot of potential, although it felt like being borrowed together from other movies. Frankly, I quickly became annoyed with the dialogues and especially the very try-hard jokes which, besides being not funny, well, are often just too mature for kids to have a place in a family movie like that. The script had its moments and does work at times together with the well done (but just unremarkable) soundtrack. Still, it were mainly the effects that kept me watching and those were impressive.",
    "76": "The Carvers are a cute family but the chemistry between Eddie Murphy and Tracie Ellis Ross is not too - the kids are great! Eddie of course is always awesome,David Allen Greer as Santa is great as our the other small people and I didn't think Nick Oberman was that bad as Pip. Pentatonix was great. The Elf was eclectic and believable.The story line is not bad with the neighborhood competition to start the movie and then it unfolds around the bad elf and the magic of Christmas with the 12 days of Christmas in a can.The special effects were great as was the music. The set designs were fabulous and who doesn't love Christmas!",
    "77": "If you are looking for a movie to put you in the Xmas spirit look no further. This is the one for you. A heart warming firm that the whole family can enjoy! Two hours of pure enjoyment. Eddie Murphy knows how to put together a great cast. Nice sound effects & good acting. A good support. DC Young fly is funny & the plot was good. I hope in the near future Eddie does another one of these Xmas movies. Adding Mr. David Allen G. Was a great touch to the movie. Some of the new & upcoming actors I don't know as of yet. But the come thru in this movie shining like new money. So grab your favorite drink & popcorn share with the family. And relax and enjoy the show.",
    "78": "Great cast, great animation, slow to start, but the last 1/3 of the movie is very much fun. It was great to see Eddie Murphy and Tracee Ellis Ross and David Allen Greer plus some new actors who are worth watching as they grow into their art. The movie sets and animation is very top-notch\nIt's good to see Eddie Murphy on screen again. Tracee Ellis Ross is very much entertaining and she shows her acting abilities. We can identify with the family supporting and loving each other through difficulties. The script is a fantasy, so it can be puzzling for us to interpret, but the ending ties the storyline all together. Eddie Murphy still makes us laugh. We watched as a family .",
    "79": "Without reading anything about the plot beforehand, this movie went in an unexpected direction that was fun to watch unfold. It definitely surpasses the average Christmas movie offering, largely due to: likability of the characters, quality acting (cheers, Tracee Ellis Ross), the surprising quirkiness of Jillian Bell's character, the antics of the figurines, good production value, and keeping the cheesiness (which typically overflows in TV X-mas movies) to a level that felt natural in a supportive, fun-loving family.I was not rolling with laughter in the same way I was on seeing Elf or Spirited for the first time, but I was still laughing aloud and rewound several times to watch a scene over again. Overall, it was a feel-good, upbeat holiday treat. I'd definitely watch again!",
    "80": "A fun family movie that had parts for kids and adults. We were laughing and rolling our eyes at the same time. We were wanting a funny, light hearted movie and this delivered just that. We loved that the storyline wasn't as predictable as the usual flicks and the little twists were great. We honestly didn't even notice that it was a longer movie because we were engaged the entire time! The acting was great for this style of movie.If you want a movie that takes itself too seriously, skip it. But if you need a break from the traditional Christmas comedies, then this might be for you. We'd love to see more movies like this.",
    "81": "Two stars are generous for \"Candy Cane Lane,\" a 2023 holiday film that tries to wrap up comedy, fantasy, and a heartwarming message in one package but ends up more tangled than last year's Christmas lights. The plot centers around Chris Carver, a man whose ambition to win the local Christmas decoration competition becomes a desperate quest after losing his job. The film's attempt at whimsy with a mysterious Christmas shop and a Faustian bargain is as predictable as a rerun of \"It's a Wonderful Life,\" but without any of its charm.The movie's pacing is as sluggish as a sleigh ride through molasses, stretched thin over a plot that could easily fit into a 30-minute TV special. This overextension results in scenes that drag on longer than the last minutes of Christmas Eve for an excited child. The subplot involving an evil elf shopkeeper named Pepper is as half-baked as undercooked gingerbread, leaving the audience wondering if the scriptwriters were on a sugar high. The 'big twist' - Chris turning into a glass figurine - is as surprising as finding out Santa isn't real.Pentatonix's constant acapella interludes add to the cacophony rather than the holiday spirit. Their renditions of Christmas classics are as annoying as a loop of \"Jingle Bells\" in a department store, offering nothing but a distraction from the already thin plot. The film's resolution, involving a deus ex machina appearance of Santa Claus and a sudden realization about wedding rings, feels like the filmmakers checked their own list twice and still forgot to include a coherent ending.In summary, \"Candy Cane Lane\" is a mishmash of clichés, poor pacing, and an overreliance on musical gimmicks. It's a reminder that not all holiday films are gifts. Some are just lumps of coal in cinematic form.",
    "82": "My husband wanted to watch because it is a Christmas movie. I wasn't expecting it to be very good. There have been so many \"Christmas\" movies over the past few years that were pretty bad, ones I would never watch again. This was much better than I was expecting. The story was ok, not magical. The main characters were ok, not memorable- but I didn't dislike them. I enjoyed the first hour much more than the last. Agree with one of the other reviewers, it was too long. A little too much silliness with some of the situations. It's certainly not up there with \"It's a Winderful Life\" \"Miracle on 34th Street\" or \" A Christmas Story\". As I wrote these titles, it dawned on me what those movies all have in common and what this movie lacks - Heart & real emotion. Biggest plus was no foul language. I'm not a prude but I get so tired of hearing cuss words used every third word for no reason.",
    "83": "Not your average Christmas movie! This movie was nothing what I expected it to be. It was actually better than what I thought and I am glad I gave this one a chance. My kids did not enjoy it to much, but me and my better half did. Never really liked Eddie Murphe as an actor but he was tolerable in this film. I enjoyed the family moments he had and how it seemed like your every day average family going through the struggle. The scenes were great to look at. The lighting, scene edits, and effects were all on point. The music kept us intrigued. The acting was not the best but they did their jobs. Overall this was an unexpectedly great film.",
    "84": "This movie is nuts and I really enjoyed it. Eddie Murphy's a dad who wants to win his neighborhood decorating contest for the cash (which is a bit ironic because they're doing just fine despite recent job events). He makes a deal with a \"fallen\" elf (under a freeway) and suddenly the 12 days of Christmas sort of attack the family and street. There are so many funny, clever moments in this movie that I'm certainly going to watch again. There's a fine line between silly and stupid. Eddie Murphy has definitely found himself in the stupid category before (Dr. Doolittle, The Nutty Professor). Candy Cane Lane is silly and delightful, without being stupid. The casting for this movie was really great Tracee Ellis Ross is just right and the kids and news anchors were perfect. Finally Jillian Bell, our misguided elf, is just the right amount of weird.",
    "85": "A fun family Christmas movie is delivered. Eddie Murphy in a family film? Not usually my cup of tea, but this film had charm, a fun story, & heart. Eddie's character Chris competes in a neighborhood Christmas decoration competition. But this year, the local cable company is offering a huge cash prize. Simultaneously, Chris is laid off. He needs to win that competition so he goes to what turns out to be a magical Christmas decoration shop to make sure he wins. The all heck breaks loose. Lots of Christmas good feelings and good family values and fun are on display. It takes a weird turn but worth the time.",
    "86": "I saw this at an early screening and it was fun being with an audience in the theater. Too bad they aren't releasing this in theaters for a time because I think it would have been successful. I enjoyed the cast. I thought Eddie was back in fine form. The story was unique and fresh. I laughed out loud several times as did others in the audience. I thought it was interesting switching up some of the Christmas folklore to black Santa and other things. The special effects were good. I could see this being a new staple in the Christmas movie playlist each year. Very glad I saw it and I recommend it for adults and kids.",
    "87": "Eddie Murphy shines in this, like he shines in all things. It is pg, so there are lots of laughs for the kids but lots of adult humor as well. I was impressed with the originality of the plot.There are animated characters and effects that are well done. The settings are all pretty charming and one can't help but to hate the villain from the onset, long before she is \"revealed\" to be a villain.In the last couple years I've watched a lot of terrible family Christmas movies and this one was refreshing. Did not expect Amazon to make a good movie to be honest but was pleasantly surprised. Would definitely watch it again with childrens.",
    "88": "This is a 2023 Christmas must watch! I'm not a big Eddie Murphy fan and still thoroughly enjoyed this movie! It's a funny, quirky, witty, holiday filled movie. (Gary's my favorite, you'll see). It's a mixture of holiday fantasy, romanticism, comedy, family, and real life scenarios. Im really surprised this movie has been rated so low....buuuuut grab a glass of wine (if you're 21 or older, of course) and pop a bucket or two of popcorn and gather all your kids for this movie and live for a moment. It's not perfect, but it's happy... and most importantly full of laughter. This movie was a solid 8 for sure!",
    "89": "Candy Cane Lane was on my \"to watch\" list for a week now. I'm not really in the holiday spirit but I decided to give it a try. It far exceeded my expectations. It was a well-written and produced movie that reminds me of the movies that were made when I was growing up: actually for families!! The figurines were hilarious, Pentatonix was awesome; just the entire creativity of the movie. I loved how the birds and band transformed after the rings were taken. Everyone was cast perfectly. I don't know why the ratings are so low but I can guess why. Such a shame. Watch this movie with your family! It is a GREAT time! I plan on watching it again!",
    "90": "I thought it might be really bad, but I was hooked from the start. Eddie Murphy can really carry a movie. The effects were cool, the storyline was believable, and two full hours flew by before I knew it. I thought Santa might show up at the end of the movie and save the day, but that certainly didn't happen. The effects were fresh, and all the actors were really good. This movie should have gone to the theaters, way better than most non-theatrical releases. They got me at least a dozen times with a legitimate laugh. But, I can't believe Eddie Murphy didn't do his trademark laugh. There was a perfect place for it too, near the beginning. It must have been filmed then cut out, to keep viewers from being pulled out of the movie. I just made my own impression of his groaning laugh.",
    "91": "It was nice to watch a fun family Christmas movie with a unique plot. There are some cute, literal laugh out loud moments as well as some universal life lessons. There are a few bits that are a bit lame, but come on, it is a cheesy Christmas movie and even the great Christmas comedies have those. I enjoyed the unique plot and we all agreed we'd watch it again in coming years. My only strong object is to the blasphemy of Jesus Christ's name which kind of played off as a punchline to a joke question. We could have done without that. We also enjoyed the music and the cast had good chemistry together.",
    "92": "The use of the word \"a$$\" several times throughout this Christmas movie is appalling. Now, if you can handle that, this movie is average at best.Let's start with the length of the movie. It's exactly 2 hours long, but it feels much longer. Just when you think you're at the end of the movie, a new storyline twist occurs.Here's what I enjoyed. The overall storyline of a father taking Christmas too far is great. Think Clark Griswold, but add a decorating contest within the neighborhood. I felt like I could relate to the characters, especially the father. However, the whole evil elf and rings thing just ruins the movie.",
    "93": "This is an exciting new Christmas movie for the family to enjoy. The casting was great and the music was dynamic. I was engaged the entire time with the plot twists that kept popping up.Most people will either love or hate this movie. If you watch it expecting the old Eddie Murphy, you're going to hate it. Again, this is more of a family movie for the holidays, so he's going to be family friendly. Danielle Pinnick was amazing as always. She's so fun and full of energy and I just love watching her.After the movie, I ran to search for the soundtrack. The song at the end will be on repeat in my home this Christmas season.",
    "94": "At first i thought it was looking like a rip off of the film Deck the Halls staring Broderick and De vito, but it wasn't.Instead you're treated to a lovely story line, The film contains some laugh out loud scenes that has you gripped from start to finish.I am not a fan of Jillian Bell got to be one of the worst, most annoying actresses who seems to be in every new movie. Although i dont like her acting she actually plays a role in this film which is bearable to watch.Eddie Murphy back to some of his best work and the chemistry with his youngest daughter in this film is fantastic, awesome work from the young actress and Eddie.The miniature glass people is something I've never seen before and i think all the scenes with them in are really good.With it being new it doesn't carry the nostalgic thrill of say a home alone or elf or grinch, but for me i will watch this film every christmas.",
    "95": "This film is absolutely spectacular, so much so I had a tear in my eye from Minuit one. Eddie Murphy's performance is one for the ages, simply a true legend and a master of his craft. I wasn't really in the mood for Christmas this year as my pet opossum 'will Ferrell in elf' has just past, however after watching this sublime work of art I can't wait to give my children a lump of Cole for Christmas.If there was one gripe I had with this film it would be that it wasn't long enough.A true Christmas treat for all the family and one I will continue to rewatch again and again!Eddie Murphy dies in the end.",
    "96": "It is a mixte of a traditional and original story, mixing the dark sides of Christmas (competition with a touch of magic),...involving a nasty, tricky and fun y elf...The 2h are not too long when we are inside the story. Very original for a Christmas movie. It's fun, has suspense, and gives good vibes for this Christmas season. We watched it many times because of that. Ross as the wife of Eddy Murphy is hilarious, her facial expressions, the chemistry between both actors brings the fun. An absolute joy to watch for regular people like me and my children. It helps to do a break from the daily life and enter in the holly season.",
    "97": "Honestly not one of Eddie Murphy's stinkers, not as good as I thought but was still kinda good. Some characters, such as the lady newscaster, the reporter, and the carolers were annoying, and felt a little fast pasted, but that's my only problems. The story was intriguing, some joke were good, and the main characters weren't annoying. Candy cane lane is a good holiday movie with a \"so bad it's good\" feeling, it has its ups and downs but is still a good one. At least it isn't Shrek the third, I can tell you that. Or the 2003 haunted mansion movie, which for me wasn't bad, but isn't the best. 7/10.",
    "98": "I wish the ending had him getting a new job and then actually winning the $100,000 not just in tacos. I enjoyed Eddie and Traci as husband and wife. It showed the real dynamic with neighbors, and the rings were hilarious to capture. My son whom is three years old, loved it, my husband fell asleep which watching.It could have ended sooner, however I liked all the people being launched from being Small.Have a black\nSanta made my heart happy as well.It had a few moments that weren't kid friendly, but overall great family movie.I wanted to animals etc to seem\nMore real and less AI.Eddie Murphy honestly does no harm in our eyes.",
    "99": "An original story, great casting and fun movie overall! Will it win an Oscar? No. But this is definitely a fun way to spend 2hrs and it's one of the better Christmas movies I've seen recently. Very well done! I thought the effects and CG were actually really well done too - obviously make believe but still popped in 4K Dolby Vision. I thought they could've made a bit better use of the surround channels, especially during climatic scenes, but it was subtle. I originally had lower expectations based on some of the other reviews I've seen, and was pleasantly surprised. Must've been some grinches watching.",
    "100": "I have grown watching Eddie Murphy and a massive Christmas fan so how could this go wrong! It does majorly. The elf pepper could have had a more relatable actress to make it more dark, she simply didn't fulfill that character. The purpose of Kit was the annoying bit with her nephew, they weren't needed in the story with just one anchor and his sarcasm that could have been funnier instead of annoying, grating and poor acting. Nick Offerman could have been the competing neighbour instead of a small 'literary' part. I love the main cast and the story does grow after watching many times but it will not be a 'go to' Christmas movie I'm afraid although I have tried my best watching and seeing different perspectives. Please don't make a sequel.",
    "101": "Great family movie to watch at night with the fireplace burning, lots of eggnog or cocoa and popcorn! My grandkids got a kick out of it, especially when the family had to grab all of the rings. The Christmas decorations on each house were absolutely lovely. The entire cast did an awesome job and it was so great seeing David Alan Grier as Santa... what a good surprise. I kinda wish he had a bigger role. But overall, my family enjoyed this movie and we plan to watch it again! We highly recommend giving this movie try. Your kids will love the adventures, the family time together and characters in the movie. Thanks!",
    "102": "This was a pleasant and funny surprise. I didn't even notice the length of the movie as there were great laugh out loud moments and the pace was right on time. It was very witty and cute. The chemistry between Eddie Murphy and Tracee Ellis Ross was magical. They worked well together. Watch through to the very end as there are some bloopers. The graphics for the \"ornaments\" were really good. The modern takes on classic holiday imagery makes for a new twist...like Santa's sleigh for example. Great for all ages and I am definitely adding this to my must watch Christmas movies...you know like Die Hard! 🤣🤣",
    "103": "I had high hopes for this movie because of Tracie and Eddie. But sadly it misses the mark. I liked the idea of using the 12 days of Christmas as a running theme but in the end the movie just didn't work. The supporting characters were way over the top and quickly became annoying. The main protagonist just didn't have what it took to be a true Christmas villain a la Burgermeister in \"Santa Claus is Comjng to Town\" or the 3 ghosts in \"Scrooged\". Eddie said he hoped this would be a fun Christmas classic that could be watched year after year. I have a feeling this will be the only year most people will watch this movie. I know for me I wouldn't watch it again.",
    "104": "Not the best Christmas movie but I quite enjoyed it.Eddie Murphy is very much in Dr Doolittle mode here, so don't expect any 'R' rated Eddie Murphy Gold and the film really needed more of an antagonist as the 2 rivals in this movie (Eddies' neighbour and a shop owner) never really pack much of a punch. This drains the film of a lot of potential humour, a better villain would have given Eddie more to work with (thinking the stand up comedy scene from Nutty Professor where he destroys Dave Chappelle).On the plus side though, special effects are good, did make me smile a few times and it ends happily ever after. Plus the kid actors are all good, which really helps.Unfortunately, probably won't be a classic like Elf or the Grinch but it is likable enough. Small kids should like it.Would be a 5/10 but gets 6/10 for having Eddie in it. Could have easily been a 7 or higher with a better villain though.",
    "105": "I don't care who you are - this is a great Christmas movie. There's a lot going on, but it's funny, warm, and entertaining. Thats what a funny Christmas movie should be! We all loved it and made us smile. The acting was great and humor was everywhere. Lighthearted with some funny adult humor to boot. Easy to follow and entertaining. Not sure what the \"1 star\" people want, but I'm pretty sure they are hard to please in other aspects of their lives so, for the rest of us who don't need to talk to the manager when our burger isn't medium-well, - this was exactly what we needed on family Christmas movie night!",
    "106": "Eddie Murphy has done it again. You are drawn into a real life fantasy. Acting is good with great special affects. I watched it with my family which is on the mature side and we all enjoyed it. Very well made movie. It was almost in the Shrek vain but had its own direction. Only thing was at the end it seemed a little anticlimactic, but thoroughly enjoyed the movie from start to finish. Each character had there own little querks as you would expect from a Christmas movie. Glad we watched it. First day of December really got us in the Christmas groove. Looking forward to Eddy Murphy's next movie.",
    "107": "After reading some of the reviews on here I was expecting little to nothing of this movie but having watched it, I'd say a lot of the reviews are on the harsh side. Is it the best Christmas movie ever? Definitely not...but it is good, clean, festive family fun and there's nothing wrong with that in my opinion. It's a good story concept and whilst it's a little long I think it's actually quite enjoyable. I don't even mind a faux English accent (and I'm English!) it's actually quite endearing in a Dick Van Dyke kind of way. So give it a chance if you're after a Christmas movie to sit down with the kids and enjoy.",
    "108": "Candy Cane Lane was a super fun movie to watch - always had me excited for what'll happen next. I liked Pepper and how she wanted to ruin everything for Chris. I like how this movie brought together carols such as \"12 Days of Christmas\" and turned it into a whole mission for the family. The live animals really added to the movie. This film was not only fun but it was magical and really well-made. It's not every Christmas where we get some adventure to watch! It's not a sappy romance movie either.I'm actually SHOCKED so many people didn't like this film. It was a joy to watch and I hope many more watchers have a blast watching this!!Merry Christmas everyone and I hope you all have a good time.",
    "109": "Aside from being much longer than needed, this movie hits no real notes at any point. It guns for the cheesy cheap Christmas stereotypes and misses on all of the important classic themes of the holiday.Hollywood at its finest (worst) for 2023. I often wonder how movies this bad get made so frequently in our day in age. I am no film major but i have to imagine that film schools across the country drastically altered curriculum, standards, and professionalism at some point in the mid-late 2000s, because the we're seeing the biproduct of those students in the industry.Dont watch this and just put on a true holiday classic - trust me.",
    "110": "This movie was amazing. I don't think they could've done a better job honestly. I can't wait to rewatch it in a few days it's definitely different from any original Christmas movie you've ever seen before. I think they should make a second movie honestly it was that good I love how the movie ended. I mean who wouldn't love a happy ending in a Christmas movie. Everything just played out so well. Although I would like a sequel to show what happens to peppermint. I honestly wish I could give this movie 100/100 because it deserves it and can we talk about how Eddie still looks good I mean it doesn't look like he's aged a day lol.",
    "111": "Even though I've been an adult for some time I still sustain a Saturday morning cartoon type ritual. I tend to have the house to myself because my husband goes to work. So it's less embarrassing. I make a point of watching something fun and foolish. I did not expect to be so pleasantly surprised by this film. I really do think it could become a Christmas classic and I don't count many movies among those. The writing is smart and the humor works on two levels, so adults can enjoy it. I also appreciated the fact that the humor never veered into the overly scatological which I find quite cheap. I'll probably come out of the closet with this one (as I have right here) and share it with my family.",
    "112": "This was so enjoyable and entertaining for us! The music was quite enchanting and memorable! The storyline is *brilliant* and funny, as is the cast of our new Christmas fav! My son asked to watch it again the very next night, so my whole family did! Even catching things we didn't the first time. Love it. The characters are endearing and some of them are especially hilarious. The casting director nailed it. It was also inspiring, and the message about Christmas came through loud and clear for us. Eddie Murphy did a fantastic job, hopefully he will continue making Christmas movies!! We're ready for Candy Cane Lane 2!!!",
    "113": "Wow... So Eddie Murphy delivers his second Amazon Movie and his first Christmas themed movie and as a huge Fan of his I can say I'm absolutely disappointed.The movie starts of promising and seems to build up to original ideas, but only goes downhill as soon as the story starts to evolve. Sadly it's a absolute mess and they tried to cram so much into the movie that it's hard to keep track sometimes. The movie lacks depth and characters fight just to reconcile 1 minute later. The movie jumps from scene to scene and every moment of depth conflict or drama is resolved within a max of 3 minutes. There's not one scene that really made me laugh and the movie is so exhausting at times that i really struggled not to turn it off. I don't know what Eddie was thinking but this feels soulless and you can see it on the actors faces and their energy. Everyone seems bored, the dialogue's are hideous and nothing clicks... this is really disappointing and falls in the category of the Eddie Murphy movies that will be forgotten sooner than later.",
    "114": "Oh dear, oh dear. Largely a perfect example of how NOT to make a Christmas movie!Effectively a diatribe on the wonder & magic of the Christmas spirit. No fun, no levity, and little delight to make it worthwhile viewing in any way.Fortunately a few elements make it as least likeable in parts. There are a few excellent one-liner jokes - so funny they actually made me laugh out loud. I like to think these particular scriptlines may be the result of the Saturday Night Live influence on the movie. So, kudos to the writing team for these winning quips. But other than that, the movie is a waste of 2 hours of the viewer's life.Such a pity. There are some past Christmas movies that really hit the mark, made by a variety of film stars over the decades. These all have their place in Hollywood history. So, for the great Eddie Murphy to bother to make one of his own, after decades of being in Hollywood, this film really should have been well put together. But it wasn't. If it had been edited and fine-tuned till it worked, the movie might have - well - worked!So, shame to see this opportunity so badly wasted.The premise is hardly new to film. Here in the UK a similar plot of neighbours competing over Christmas lights - and the moral of overdoing the in-fighting - was done to perfection by Robson Green & Mark Benton back in the Noughties. That was 'Christmas Lights' (2004). And numerous other offerings have done the same tale well enough in other countries and other decades.This film just ruins the plot concept. Everything in the movie is overdone: it's frenetic, unevenly paced, out of control, and predictably (and badly) scripted. Like many poorly made films it is either edited to too brief a runtime, or as in this case rambles on endlessly. The children are the usual stereotypes, ditto the wife, and the same with the neighbours. Not to mention Murphy's character as the dad & husband. There is no originality in the film where it is needed, and too much invention - to a chaotic level - just where it isn't required. And the longer the film goes on, the more convoluted it gets.There are parts that shouldn't have been put in, eg an anti-Christian 'joke' that goes widely off-mark. The barbed remark is frankly offensive to Christmas itself . . . The film is, after all, supposed to be a Christmas movie, and although Christmas covers far more than one thing for many people - family celebrations, the season before the warmth of spring, partying & togetherness, the end of the calendar year, pagan festivities of old, and a variety of other purposes - it also of course covers Christianity. I consider that 'joke' insulting to the very purpose of Christmas: both the Christ-related part and the more encompassing general spirit of kindness. It is gross . . . And unfunny.The film doesn't appear to have any clear purpose: it doesn't know what it wants to say, or how to say it. And there is too much of everything. Although the animation characters of the '12 Days' is new and clever, it seems not to fit in with the rest of the film. (Though in fact the rest of the film doesn't seem to fit into the rest of the film . . . !) The set of live-miniatures of Christmas Village characters - more animation - are amusing, but again do not seem to segue into the rest of the story. And one set of animation characters in this film would have sufficed.Then there is more confusion added to the mix: competing presenters of seasonal TV, teen troubles, an evil elf, current bosses to impress, 10 lords a-leaping turning up at school sports day, and yet more . . . All this needs to be digested by the viewer. Not to mention the task the family have to complete, of finding the gold rings before the clock chimes on Christmas Eve . . . Then 'Santa Claus' suddenly turns up, swooping in on a sleigh! Oh dear. Just because you CAN say or do something in a film, doesn't mean you should. Less is normally a case of more . . .There are a few excellent moments: when Murphy's character is appalled to see Valentine's Day goods on sale at the market at the same time as Christmas goodies. And a lovely disagreement amongst the Dickensian 'figurines' about the old argument as to whether 'Die Hard' is a Christmas movie. Lovely!But there are not enough laughs throughout the movie . . . And not enough cohesion in the storyline to even work out what this film is all about. Clarity is all-important in most film plots, but we don't see it here. Halfway through the film I still couldn't work out what exactly I was watching . . . (Harrumph!)No, for a good Christmas movie I shall continue to watch from the roster of great Hollywood & UK seasonal films. One of my favourite Christmas movies simply has to be Frank Capra's 'It's a Wonderful Life'. It covers the 'ups' & 'downs' parts of Christmas to perfection, and is as relevant today as it was decades ago.And for a good Murphy movie, I will delve back into his past greatness. There is plenty there to choose from. Need I mention, for example, the superlative 'Trading Places' . . .",
    "115": "I'm surprised some reviewers thought this movie was vulgar. I thought it was the first movie I've seen in a long time, directed towards children, that did not have crude remarks and events. (Adam Sandler obviously had nothing to do with making it.) Yes, it does have some obscene words and a few inuendos, but nothing like most movies these days.The movie's main strength lies in the relationships between the very likable family members. Two of the three kids are teenagers wanting to do their own thing, while the parents, especially Dad, think they know what's best for them. Thankfully, there are no gender issues or other politically correct stuff stuffed into this film. A pleasant surprise for an Amazon movie!The kids are normal, the parents are normal, family life is normal, until it is not. There's lots of amusing lines and events in the film, but the humor is not that consistant. That's the biggest fault of the story. The evil elf is also neither funny nor scary most of the time. She is mostly irritating. The Christmas breakfast was an anticlimatic ending, too, and we really could have done without the \"lady mallard\".In fact, that poor duck, as well as having all the birds in the film as villians, made me take off a couple stars. The Santa in the movie was one of the fun parts, but the funniest line involving him was not in the film itself. When the credits run, watch out for scenes not in the story, the funniest one being what Eddie Murphy says to the Santa.",
    "116": "I tried once then twice than 3 times to make it through this train wreck of a movie. It was just plain bad. Although it wasn't great, I preferred Coming 2 America.The parents Eddie Murphy and Tracee Ellis Ross were fine . The rest of the cast were ok, the standout was Madison Thomas.Now the worst was by far Jillian Bell. The fake accent and the acting was just plain awful. Nothing to see here...just move along.Well, that's the problem. She was so mind numbingly bad, I just couldn't get past her. Absolutely charmless.All Christmas movies have a humbug like George Bailey's Mr Potter. But this character is, well I just don't know what.",
    "117": "Eddie Murphy wanted to make a film that would be a timeless classic which he felt that family's would watch every Christmas. Well, he did that with Beverly Hills Cop. Not this horrid waste of time.Lots of racist jokes. ..... In a Christmas movie\nSome Religious insults to both Christians and Jews.Yep - I'm not kidding. And not off-the-cuff references, but actual flat out ridicule. How does a Christmas movie make fun of Jesus??Two stars because I liked the idea, but then after 5 minutes it tanked.... Fast. Otherwise I would have gone with one star.My advice is pretty straight forward - Avoid this crap.",
    "118": "It's an OK holiday film. Far too long. Pretty funny, but not funny enough - and only as amusing as it is because of the cast.But Nick Offerman should be ashamed of himself for that abomination of an English accent. The worst example committed to celluloid since Dick Van Dyke in Mary Poppins. Americans won't care but for me, as soon as his character became more involved in the narrative - I had to bail. Just woeful. There is an abundance of excellent British comedy talent based in Los Angeles. Maybe utilise them rather than letting an A-lister with limited range 'have a go'? Cos he's not gonna land any of the British roles he's obviously fantasising about, and presumably why he lobbied for this role.Also, WHY is it set in Southern California?! My guess is that wasn't the original location in the script because it just doesn't work for a holiday movie. Like, at all. Clearly Murphy wanted to make another Christmas film - but didn't want to leave Los Angeles. So this is what we're dealt. It just doesn't work.Would have been a 5 for me for some decent comedy moments if it weren't for Offerman and the sunshine. Waste of time.Summary: Nick Offerman's English accent is an abomination. Clearly Eddie didn't want to make a Christmas movie somewhere cold. Doesn't work.",
    "119": "I am being generous at 4 stars because the film is mildly entertaining, but it just doesn't work. I have no idea what they were trying to achieve. I feel this is a common issue in christmas films of late - too many ideas! They seem to have forgotton that a lot of the successful films of the past have simple linear story lines. Home Alone for example.Carol (his wife) is kooky, which I am normally quite happy with, but it just doesn't gel, there is no chemistry with the family at all. The shop owner is cheesy but not in a good way. The sports / song / failing maths section is just plain weird. Huge houses, huge cars, consumerism central, leaves it feeling bloated and lacking christmas spirit.One of the most painful things for me is the \"british\" accent of Pip. It'd excruciating and travels around the whole UK, one moment in Devon, another up North, goodness knows why Amazon felt the need to cast an American for this role when there are a tonne of talented Brits out there who could have done the voice over.Don't waste your time when there are so many excellent christmas films out there. New is not always best!",
    "120": "Ugh, not again. This movie-or this kind of movie-had so much potential. We NEED good Christmas movies. And Eddie Murphy has always been dependable as a decent actor who's funny. Sadly, this mess was unsavable. And worse, it was offensive on several levels.This was a \"black\" movie. Nothing wrong with that as long as you understand that every non black person will be a silly, foolish character. When the white neighbor offers a hug to the wife, she says, \"No, I'm good.\" That's just offensive. She was also dismissive of the white math teacher for no good reason. This is dangerous, folks, as we are trying to move AWAY from racism...not promote it.And lastly, that terrible line about \"Jesus Christ, no\" was unnecessary and extremely offensive.Give this horrible movie a pass. Not recommended for anyone.",
    "121": "Wow, where to begin. Even though I am a long time Eddie Murphy fan, sadly not even he could carry this movie. The story was long, boring & lacking in any character or storyline development to draw the audience in to connect with the characters. The interaction between actors felt forced with no emotional development with an emphasis more on satisfying identity politics than on choosing the best actor for the role. The dialogue felt forced, lazy & was often loud, vulgar & superficial. There was also a point in the movie that was outright bigoted towards Christians demonstrating Hollywood's disdain towards those with religious beliefs. Sadly, the humor was totally absent with not one scene where I found myself laughing out loud. I have no idea what Eddie Murphy was thinking when he took this role. I struggled to make it through to the end finding myself wishing that the movie would just end already. It's as if they just threw this movie together hoping that Eddie Murphy's presence would be enough to win over the audience. Sadly, this is not the case. Hollywood has gotten lazy with total lack of creativity. Don't waste your time on this mess. Better to break out the classics.",
    "122": "I didn't actually mind 'Candy Cane Lane', but I can't exactly say it's a good movie though.Many positives I do not have for this 2023 release, a perfect word for it all really is simply: meh. Eddie Murphy is fine (if nowhere near top form), his onscreen family are alright, the comedy is average, the Xmas vibes are OK, the concept is solid enough. It just doesn't excite. The 2hr run time is damaging, this is a 90 minute story all day long.The bits with the animated miniature characters are this film's best moments, but even then that feature isn't utilised the best - Nick Offerman feels wasted in his role there, likewise with David Alan Grier near the end to be honest. Timothy Simons and Danielle Pinnock as Emerson & Kit are satisfactory in relatively small parts, even if they do feel like a knock-off version of Cotton & Pepper... iykyk.A snappier length and a more energetically told/acted story and I'd have enjoyed this, without that it is sadly quite lacklustre.",
    "123": "Candy Cane Lane is an Amazon Prime movie and our second Christmas movie of 2023 holiday season. The story is about the Carver Family headed by Eddie Murphy and Tracee Ellis Ross who play husband and wife. The family loves the holiday season that they named their children Joy, Nick and Holly who were played by Genneya Walton, Thaddeus J Mixson, and Madison Thomas. Chris Carver is so passionate that he wants to win his neighborhood's annual Christmas decorating contest in El Segundo. He becomes so desperate that he makes a pact with an elf played by Jillian Bell to provide him the goods to win it all. In return if Carver does not return the rings of 12 Days of Christmas by Christmas Eve he would turn into a toy. The curse causes chaos upon the neighborhood which was filmed on the same set as Wisteria Lane. Of course Santa makes a stop to showcase the talents of David Alan Grier along with Ken Marino, Timothy Simons, Robin Thede, Chris Redd and Nick Offerman. The story by Kelly Younger and directed by Reginald Hudin was too chaotic. I felt I was watching a horror film with less than stellar acting but with good special effects. I would stay away from this one, it was not fun to watch.",
    "124": "Definitely a movie aimed at one demographic but that aside it's watchable for anyone, oft times a little tedious but there's nothing offensive about the movie, a few nods here & there to Murphys past potty mouth outings & a little knock to the religious but nothing offensive.Most of the cgi is done really well, loved the character \"pepper\" apart from Murphy she was the best part of the movie.All in all it's watchable & for the most part it's enjoyable but it could've been excellent if not for the lame parts and the lack of imagination with the storyline.Race swapping santa wasn't a problem but it could have been a brilliant part had they put some thought into it, there was one white actor that could've been added to the end scene, Murphys neighbour, to show the audience that santa became white when he looked at him then as soon as santa turned to face Murphy he was black, it would have been a better and funnier ending with the neighbour & Murphy arguing over santas ethnicity.",
    "125": "I wasn't sure what to expect with this movie seeing that Eddie Murphy's comedy tends to be on the crude and vulgar side more often than not, but this movie was pretty clean, content-wise. My husband and I laughed quite a bit. I loved the main couple's conversation of how their marriage viwis meant that they were a team and they always had each other's backs. That is how marriage should be. They're family had normal parent/child drama but there was still the sense of love and respect in the family. The story was unique and I loved the twist at the end. My favorite part was the ornament figurine characters. They were very funny and the CGI animation of these characters was truly just beautiful work! I was truly amazed at how lovely they were and liked the sound they made when the walked. I've never seen CGI portray something as porcelain or ceramic before, and this was really well done. I just loved watching them speak and move. I can't believe I actually saw CGI done that I admired! I usually find it an annoying or just really bad and cheap-looking. So someone should get an award for the work they did here. This movie was very enjoyable. It was a fun watch. I think it will go into my routine of holiday movies.",
    "126": "Eddie Murphy reteams with Imagine Entertainment, the company he made The Nutty Professor movies with. The success of the movies brought him a family audience.Now in his 60s. Murphy is in suburban father mode in Candy Cane Lane. He plays Chris Carver whose grinch like company has fired him before Christmas.Although his wife is hoping to secure a promotion for herself at work. He seizes a chance to win a $100,000 prize for the house with the best festive decoration.Chris makes a pact with a naughty and sly elf called Pepper (Jillian Bell) to help him win. Only now Chris has to track down ornaments linked to the 12 days of Christmas ditty.If he fails the forfeit will be dramatic, something Chris only later becomes aware of. Now with his family's help, they need to track down the ornaments but Pepper never plays fair.Candy Cane Lane is better than the Lifetime/Hallmark schmaltz. It helps that it has a bigger budget, better special effects and a slightly weird story.Unfortunately it is not too funny and it needed Murphy to go wilder and wackier.",
    "127": "It's great to see Eddie Murphy back in film, and surprisingly given the way he started his career, kids comedies are where he excels.Although besides Eddie Murphy and his street rival Ken Murphy the acting is try hard to be funny and NOT funny, mention to Jillian Bell who's not very funny. But extra special (special for bad) mention to the Timothy Simons and Danielle Pinnock the Cable TV hosts who are so badly unfunny, so tryhard and so unoriginal it's painful to watch them everytime on screen. The jokes have been done many times before it's like the bad part of Groundhog day.The film is too long. Looks great but not too many laughs, even a lame Drake music line. And also a lot of pot-shots at the Christians watching and Innuendo jokes, which I laughed at, and would probably go over a kids head, but maybe aren't appropriate?",
    "128": "We tried Candy Cane\nAfter 10 excruciating minutes we turned to FF looking for the comedy\nAfter another 5 minutes we gave up\nDon't botherAxel Foley it ain't\nFunny it ain't\nWhen you absolutely, positively want the best it has to be Bad Santa\nAccept no substitutes.Annoying kids check\nInsufferable parents check\nAwful street check\nGhastly neighbours check\nStupid plot check\nLudicrous script check\nPathetic acting check\nAwful sets check\nTedium in spadesIts USP is the ability to fast forward through the sickly dross to prevent nausea. Murphy &!his wife are like androids and the kids are smarmy prats.Try Rare Exports for a treat if you're over Bad Santa but how could you possibly be?",
    "129": "Candy Cane Lane is exactly what a True Christmas movie is all about! I loved it from beginning to end! It was original, funny, heart-warming and decked my halls with bounds of wonder!The special effects, the storyline, the characters-Sure, there was a weird line with the reports when it came to Santa: Santa can be whatever we picture him to be. Heck, watch Urkel Saves Christmas and you'll know what I mean on how one imagines Santa.Pentatonix (Or how its spelt) guest starring as little figures in the movie!? That is so awesome! I've heard their music even the Christmas album so its pretty rad they got a role in the movie!The most important thing in the movie: THe magic! The magic of Christmas, the importance of family and a classic holiday adventure for kids fo all ages to enjoy! This is what we need back! Good ole Christmas magical adventures like this!?Plus the way they approached the 12 days of christmas. The lords-a-leaping had incredible suits and sick leaping moves, the 3 french hens were actually French hens wearing french outfits even the classic \"Pierre Style\"-and don't get me started on the maid a milking scene-That cow must of had a LOT OF Vitamin D to share to fill a room up.Let's not forget Chris's carving skills-he hand crafted his decorations by hand which is really amazing. Also Carver for a last name? Carver since he carves christmas figures and other stuff? :3 How clever is that-And when ya listen to the names of his kids and wife you'll get the 'Christmas reference' right away. ;)I'd so watch the movie again and again-if they bring it on dvd/bluray, so would buy it! Been a long time since Eddie Murphy was in movies and he's still got that acting magic!",
    "130": "Chris Carver (Eddie Murphy) has always lost the Christmas lighting contest to his neighbor Bruce (Ken Marino). He's married to Carol (Tracee Ellis Ross). His older kids are soon leaving the nest. He gets laid off at work. When a new televised $100k prize Christmas lights contest is taking place on his street, he puts all his efforts into winning. While searching for more decorations with his youngest girl, he finds a pop-up store under the highway run by Pepper (Jillian Bell). They get a magical 12-days-of-Christmas Christmas tree. There is also Santa Claus (David Alan Grier).This is being marketed as Eddie Murphy's first Christmas movie. Does that get you in any way? If it does, then this may appeal to you. It is pretty much what one expects from Eddie's first Christmas movie. He's mellowed into a suburban dad in his old age. He doesn't have the comedic energy of his youth and this movie really needs it. The concept is ok, not that great. It's a lot of fake CGI creatures of minor fun. There are some great comedic talents trying to make this work. It has some moments of fun but no big laughs.",
    "131": "It's ok.The first half is pretty slow and a lot lame. The second half is significantly better (the miniature characters are the highlight of the film), but ends a little flat overall.Eddie... Eddie baby. WTF are you doing?Stop making crud like this. Stop the Klump crud. Stop making this crud. GO BACK to your best.. Coming to America. Trading Places. These are classic, classic gems - some of the best comedy films ever made that will live forever and be watched forever. No-one will be watching this again beyond next year.CCL? Poor...Please go back to your amazing stand-up. Please give us more RAW. Please give us more Beverley Hills Cop (not BHC III obviously). Stop with the family comedy, go back to the adult comedy - it's what you were born for.",
    "132": "I did not see the trailer for this movie and only read what the site IMDB has, other than that I did not know what to expect; after watching the movie, I noticed it had an interesting idea involving certain things that involve Christmas, and if it was done a bit better, I feel like the movie could have been a better than what it was. The movie Candy Cane Lane (2023) has a promising idea, comedy that does not always work, and good enough performances; also, the runtime could have been shortened from a two-hour long runtime to at least around one hour and thirty minutes because of how drawn out it can feel.The main character Chris Carver played by Eddie Murphy was not bad, he gives a good enough performance, and you understand at least some of the reasons why he wants to win a neighborhood house decorating contest; also, once unusual Christmas stuff starts happening after a confrontation with an elf, the stakes on what is going on is raised which makes it interesting. The rest of the Carver family is not bad, and these walking talking porcelain figures are voiced by actors like Nick Offerman who were also not that bad, though they mostly give exposition about a curse on the main character, try to be funny, and help occasionally with the plot.The antagonist is an elf named Pepper played by Jillian Bell, gives a weird over the top performance, and she is the one who puts this weird Christmas curse on Chris Carver; she has a backstory of sorts that says how she left working for Santa Claus, but she was just an over the top antagonist that could have done more. The comedy for the most part does not work, but occasionally there will be something funny that is either a scene in the movie or a line of dialogue; other than that, there is also uses of CGI that is not bad and the whole movie has some kind of Christmas feel that involves the music or the many decorations from the houses or the last third act.Candy Cane Lane (2023) is not a terrible movie, but it has an interesting premise that could have made a better Christmas comedy that could have been funnier and shorter than what we got; this movie did have a good enough performance from Eddie Murphy, an occasional funny scene and line of dialogue, and it some entertaining moments. This is not a terrible movie, but it had potential to be good, and when you watch the movie, you will notice it as well; not a necessary watch, but you can watch it when you have the time.",
    "133": "I love Eddie Murphy and was looking forward to this. This movie started out strong, but then started to drift from there. Great concept poorly executed. The writing really could have used a more experienced hand. You could have cut a good 30% of the dialog out of this and lost nothing. This had a negative impact on the overall pacing of the film which was not great. The acting all around was deft. Eddie his usual self. Nice timing, decent comedy. I believed him. The Son was out of this world good. I really have no complaints with regard to the performances. The writer did resort to a few dumb jokes around race which were completely out of place and a bit of a letdown. Seriously, was there no one around to go over the script and \"dramaturge\" it up? It just dragged on when it could have been so much snappier! Loved the effects around the \"ornaments\" The overall concept was great just could have used tighter writing and better pacing overall. A solid 5 out of 10. One more thing. Nick Offerman, what the hell? He seemed completely mis-cast and phoning it in. I love this guy, but this was just weird he seemed so out of place in this movie. But that's just my humble opinion.",
    "134": "I had high hopes for an Eddie Murphy Christmas film but it started out more like a bad rendition of the huxtables where the people walked in and read their script just moments before being on camera. There's some interesting ideas behind the story and the scenery and videography was good but the acting was really bad by the adults, at least, and when they felt the need to insert a very anti-xristian sentence as if in casual dialogue I turned it off. It just blows my mind that people don't seem to understand what Christmas is all about and even have the audacity to imagine that it's just everyone's holiday regardless of their beliefs. But it just is so perplexing why you'd feel the need to actually bash Xristianity in a holiday movie. I do not recommend this film for families and especially not for children. Up until where I left off, the only humor was adult humor and not very good. The only thing I found funny was when they went shopping and they went quickly through first Walmart then Home Depot and then Target because that little skit was on point. Too bad they ruined the film. Because even with the bad dialogue and bad acting I would have probably sat through this film just to see where it went.",
    "135": "Merry Christmas everyone! Welcome to our appallingly trite and vapidly shallow community of inexplicably wealthy people engaged in a pointless but over-hyped annual Christmas light show.Predictable. Repetitive. Paralyzingly dull. Eddie Murphy was funny once upon a time. Tracee Ellis Ross needs to commited for mental health evaluation based on the make up choices alone. Nick Offerman, Chris Redd, and David Allen Grier are just collecting a paycheck for minimal effort. At less than two hours in length, it inspires the viewer to claw their own eyes out less than half way in.This is an interminable steaming turd of a movie. Avoid at all costs. If you dare, Santa will judge you. 🎅💩😱#LawlessReviews.",
    "136": "It didn't take long for me to realize this movie was not for me, let alone my children.Bad enough so many movies use JC so flippantly but the \"play on words\" for a cheap laugh was nothing less than blasphemy!I had to back that up to be sure I heard what I thought I did and sure enough, I did. But it's hollyweird so should I really be surprised?If anyone else felt how wrong that was, there is a reason for that. Listen to your gut on that one.It could have been good had that been omitted and also nice to have a new Christmas movie to add to the collection but not this one. Besides, it seems a bit like a ripoff of Deck the Halls...less talent though.",
    "137": "Candy Cane Lane, not a bad Christmas movie, I've missed seeing Eddie Murphy in a new movie. This movie had an amazing storyline with well-developed characters. I gave the movie a six though because of how fast paced the movie felt. A lot was going on and should have slowed down a tad bit.The villain in this movie wasn't my favorite, i liked the twist they gave her but I didn't like how they used the character throughout the movie. All could think of when seeing her walk and talk was Jack Sparrow. Not what I think they were going for.Being so fast paced they missed out on opportunities to explore the kids school stories. What happened after the movie to Nick's math grades or which school did Joy end up going to?My Favorite Part: My favorite scene was when Nick was in the music room playing his tuba and doing all this other musical stuff, the milking maid came up and shot him with unnecessary amount of milk. Pretty clever if you ask me.",
    "138": "Eddie murphy spends a great deal of the film reacting to things, something he is very good at. He's a stressed resident of candy cane lane, the street known as the one that goes over the top for the holidays. This year the event has a sponsor and a big cash prize, which he needs to win. Chaos ensues when he makes a deal with a strange person in a weird holiday decoration store under the freeway. One that's bigger on the inside than the outside.Ultimately, the scenes with eddie and his family seem forced, and i was well into the movie before i realized he was supposed to have 3 kids. Only one of them gets any real screen time. . It's a bit jarring, since they are the center of the film.Honestly, the main reason i even watched the movie was jillian bell. I've been a big fan of hers since \"workaholics\", and she really brings the film to life when she arrives in her role as pepper, an angry, vengeful (and demoted) elf.",
    "139": "Set during the Christmas season, family man Chris Carver (Eddie Murphy) is dealing with the upcoming annual Christmas decoration contest Candy Cane Lane as his daughter Joy (Genneya Walton) contemplates going to college out of state, his musically inclined son Nick (Thaddeus J. Mixon) struggles in math, and must now deal with the fact he's been laid off from his job while keeping it secret as not to ruin Christmas. With the help of his youngest daughter Holly (Madison Thomas), Chris hopes to win Candy Cane Lane as the $100,000 prize will give them the best Christmas ever. During the course of their shopping Chris stops at a Holiday themed pop-up called Kringle's where the proprietor Pepper (Jillian Bell) shows him a decoration based on the song The 12 Days of Christmas which Chris purchases but soon finds out he's made a magical pact that unleashes the entire 12 Days of Christmas upon him and his family and must now locate the Golden Rings to set everything right.Candy Cane Lane is the first in a three picture deal between comedian Eddie Murphy and streamer Amazon following their initial collaboration of Coming 2 America which became a massive draw for the service. Directed by Reginald Hudlin who reunites with Murphy after directing him in Boomerang 30 years ago, and written by Kelly Younger the film strives to be light hearted Holiday viewing and it delivers what it promises even if I felt it played it maybe a tad too safe.While Eddie Murphy has played this kind of family man character before (such as Dr. Dolittle or The Haunted Mansion) he feels a lot more metered in comparison to his prior efforts which I think plays to the film's benefit and keeps the performance from going too over the top. While the character does fall in line with the trope of the \"Dad who needs to learn a lesson about his family\" we've seen in quite a few post 1990 films it does feel like it knows how to do it well in comparison to notable misfires like Christmas with the Kranks or Deck the Halls. At its core the movie follows a similar formula to Jumanji or the 2015 Goosebumps movie with magical creatures escaping into the real world and running amok and for the most part I felt the gags hit more often than they missed. The movie I feel does struggle a bit in maintaining a consistent tone as it does mix slapstick, visual flair, and family melodrama in a manner that doesn't quite coalesce and it does on occasion feel like it's holding back from going a lot further than it wants to especially in regards to Jillian Bell's Pepper character who's almost a Christmas themed Beetlejuice to a degree. The movie also plays very fast and loose with its internal logic especially once we get to the third act where it feels like it's making the rules up as it goes along.Candy Cane Lane is decent holiday viewing and a nostalgic trip for children of the 90s who remember Murphy from The Nutty Professor or Dr. Dolittle and it's helped by the fact that Murphy is actually funny in it (a marked improvement from the misfire You People). I don't think this will be requisite Holiday viewing in the way recent films like Klaus, Christmas Chronicles, or to a degree Violent Night have become, but for undemanding family viewing you can certainly do worse.",
    "140": "The Christmas film in question presents itself as a festive escape, promising warmth, laughter, and the magic of the holiday season. Unfortunately, what unfolds on the screen falls disappointingly short of these expectations. The narrative, rather than weaving a unique and engaging tale, feels like a patchwork of recycled ideas from various other Christmas films.From the opening scenes, it becomes evident that the filmmakers opted for a formulaic approach, stitching together clichéd storylines and characters that lack depth. The protagonist, a cookie-cutter lead character, embarks on a journey that feels all too familiar. It's a narrative you've seen before, perhaps in a different setting or with different faces, but the core elements remain unchanged.One of the film's more questionable decisions is the attempt to modernize Santa Claus by changing his ethnicity. While diversity in storytelling is crucial and can be impactful when done thoughtfully, in this case, it feels like a superficial and tokenistic gesture. The character's ethnicity is introduced without proper exploration or integration into the storyline, rendering it a mere gimmick rather than a meaningful contribution to the narrative.The portrayal of a Black Santa seems more like a checkbox on a diversity checklist than a genuine effort to tell a compelling and inclusive story. Instead of using this opportunity to explore and celebrate diverse holiday traditions, the film falls back on stereotypes and fails to provide the character with the depth and nuance he deserves. It's a missed opportunity to break away from the conventional image of Santa Claus and offer a fresh perspective that could resonate with audiences of all backgrounds.As the film progresses, it becomes increasingly evident that the plot lacks coherence. Scenes seem haphazardly strung together, giving the impression that the filmmakers borrowed bits and pieces from various holiday classics without a clear vision for their own story. The result is a disjointed narrative that fails to captivate the audience or evoke the intended festive spirit.The supporting characters, rather than complementing the lead, feel like they've been plucked from different films and dropped into this one. There's a lack of chemistry and genuine connection between the characters, leaving the audience detached from their struggles and triumphs. It's as if the filmmakers relied on the audience's familiarity with similar characters from other movies, assuming that would be enough to forge a connection.The dialogue, too, contributes to the film's overall mediocrity. It's riddled with predictable lines and lacks the wit and charm that can elevate a Christmas film from forgettable to memorable. The attempts at humor often fall flat, relying on tired tropes and recycled jokes that have long lost their comedic appeal.Perhaps the most significant flaw of the film is the palpable sense of time wasted. Clocking in at two hours, it becomes apparent that this is not a well-spent two hours of cinematic enjoyment. The film's inability to offer anything fresh or innovative makes the duration feel like an eternity, with each passing minute serving as a reminder of the missed opportunities and unfulfilled potential.In conclusion, this Christmas film, with its average plot, uninspired characters, and tokenistic attempts at diversity, fails to deliver on the promise of holiday magic. It's a forgettable addition to the vast catalog of Christmas films, offering little more than a rehash of familiar tropes. If you find yourself in the mood to waste two hours of your life on a lackluster holiday movie, then, and only then, might this film be deemed \"okay.\"",
    "141": "Candy Cane Lane is the perfect Christmas Movie to watch with your family and friends in 2023. Candy Cane Lane is filled with adventures, magic and laughter. It definitely brings the Christmas spirits to life!The story follows a family from El Segundo, California who live on a street called Candy Cane Lane, where every year there is a contest for the best house lit up for Christmas. During this year's contest the competition between all the neighbors is way more intense than in previous years. To win this competition families must have the best and brightest lighting, the biggest Santas, the most colorful elves, the loudest music and the most incredible angels on their front yard. The dad, Chris Carver (Eddie Murphy) finds out about this huge contest on TV and goes crazy. He tries everything to win first place, even making a deal with a lunatic elf, Pepper (Jillian Bell), without even realizing that what he is doing would create a big problem for his family and the whole town.The film is hilarious, has a twist on classic songs, and a family we can all relate to. Mom, Carol Carver (Tracee Ellis Ross), is a super hard-working woman who is trying to get a promotion at work during the busiest time of the year. The oldest daughter, Joy Carver (Genneya Walton), has a dream to go to college and be part of the track team. The middle son, Nick Carver (Thaddeus J. Mixxon), is not a big math student, but has a passion for music and the youngest daughter, Holly Carver (Madison Thomas), loves Christmas as much as her dad. One of my favorite scenes is when Chris and Holly Carver are looking for Christmas decorations and find a store in the middle of nowhere. The special effects in that store are super fun and magical. Another great scene is when the contest starts at Candy Cane Lane and Santa shows up in his sleigh, points his finger at every house on the street, and viewers erupt with excitement as each house brings a Christmas theme to life. You must watch and see the seasonal magic happening at Carver's house. I know you will just love it as much as I did.The film's message is that family comes first and they will always be there for you. It doesn't matter what challenges you are facing, when you have your family by your side, you will always figure out a way to find solutions.I give Candy Cane Lane 5 out of 5 stars and recommend it for ages 5 to 18, plus adults. It is available on Prime Video beginning December 1, 2023. By Keila V., KIDS FIRST!",
    "142": "Honestly, family fun at its best. We loved it!Great movie to watch with the kids from start to finish, Eddie Murphy yeh boi!Nicely plays on Christmas traditions and the 12 days of Christmas song. Quality special effects and its great to see the Mum character have genuine laughs.Lots of good moments throughout and a stylish and well made film.My son really enjoyed how they had a family adventure where everyone had to contribute.My daughter loved the fantasy elements and how all the different characters came to life!It's annoying when people are overly critical about what is a genuinely entertaining film at the best time of year!",
    "143": "I am going to give this 8/10 because it is Christmas and this is the best full on Christmas family movie since Arthur Christmas came out.Eddie Murphy dials it down from recent efforts where he tries too hard, with great success. His wife and children hit the mark with eye catching showings all round and there is a splendidly over the top villainous elf lady.The style switches from difficult time to neighbourly competition to Jumanji style high jinks, all of it with fun.So what is the overall message? Don't be a jerk, family should stick together, Christmas is a time for togetherness and reconciliation. No surprises and all the better for it!Go enjoy yourself, don't overthink it, it's Christmas!",
    "144": "This is worst Christmas movie I have ever watched. The plot line is so bad and there's some really daft and corny scenes.I would have stopped watching at a few points in the movie if it wasn't for me hoping for it to get better.Then it completely spoilt it by bringing in a black Santa.... Just to fill quota and try and make it politically correct which actually made it incorrect.This is not a film I would recommend and I don't think many people will re watch the film .The only decent thing about the film was Eddie Murphy. His acting is really good but his standards of films leaves alot to be desired.",
    "145": "Humor can be a matter of taste, but a good comedy can make its living on energy, timing, and writing; All three boxes were checked in Candy Cane Lane. For good measure, you can add a superlative quality in that all of the comedy seemed natural. For pretty much every character in this movie, none of the actors came across as forced, odd, or over-the-top, nor were any of them \"dead-weight\" while at the same time appealing to all ages.Were there a few times where the pace slowed down? Sure. Could the movie have been edited down to cut out some filler? Probably. For the parts where I felt slightly 'bored' though, I recognize they were moments I'm sure the younger viewers were enjoying, mainly the few 'action' sequences. But for the kid in me, I was satisfied with the simple, imaginative moments connected to family bonds, the fun of the holidays, and relateable humor.Nothing in Candy Cane Lane felt too unoriginal (as a holiday movie, it has its commonplaces which for me just add a tinge of nostalgia) and that's mainly a testament to the writing and acting. The jokes landed for me, the story was developed well, and it felt unique in enough ways. Our family spent a lot of the movie (especially early!) laughing - that is, after all, one of the best metrics for this type of content.",
    "146": "I have to give great Kudos to Prime for the effort here, it is not easy to come up with stories for Christmas movies that we have not seen yet.Candy Cane Lane has a lot of the cliches and premise we have seen so many times before, the basic Christmas movie bag of tricks if you prefer.But then a highly original storyline is woven right into the shananigans and to be honest I enjoyed it, isnt it crazy how Eddie Murphy look almost the exact same as he did back in the 90ties?The title is also highly inyeresting to me, it completely throw you off on what this is about and at the same time keeps a Christmas theme in the mix.Definetely one of this years most original Holiday movies.",
    "147": "... you'd get Candy Cane Lane.They've thrown everything but the kitchen sink at this - lavish effects, Eddie Murphy, cute kids, mawkish sentiment, a clunky life lesson, riotous large scale set pieces, 'crazy' situations, sanitised winking-at-you adult humour.Basically every festive trope imaginable, plus a bulging cast of characters, each of whom seems committee-designed to appeal to a different audience demographic. There's even a top-hatted Nick Offerman running away with the Dick Van Dyke Award for the most embarrassingly dreadful cockney accent since Don 'Basher' Cheadle in Ocean's 12.In their desperation to conjure up something magical, unfortunately they've missed a crucial ingredient: warmth. The bits intended to provoke emotion fall completely flat, the narrative arc is a big old mess and it outstays its welcome by a good 30 minutes.It's fine to while away a couple of hours with the kids, but overall it feels like they've wasted the opportunity to make it what it should have been - a really fun family film with some longevity to it; something you might want to add to your rotation of beloved Christmas movies. Sadly I can say with certainty it won't be on mine.",
    "148": "Sick of the old Christmas movies, there has to be something fresh, and there is with this one.It's different in that, the storyline isn't created off the back of another idea. It's unique. Many people may say \"It was quirky, it was cheesy\", but what do you expect from a Christmas movie?It's good to see Eddie Murphy doing his family movies again, and he delivers a good display in this new Christmas movie.Sadly, it's not a Christmas movie that you will remember in a few years time, it's not one you will keep putting on every Christmas, but it's a good one for a one off, and I am sure will be enjoyable for all the family.The movie talks about family life, and the importance of the family during Christmas.Watch it and you won't be disappointed. But again, it's a \"One off Christmas movie\". Not something you will keep watching over and over.",
    "149": "I don't get all the bad comments... It's a Christmas movie, what did they expect?Is it funny? Enough!Is it adventurous? Enough!Have we used to see Eddie Murphy in funnier situations? Yes!Is it full of Christmas decorations and spirit??? YESSS!Of course it's my personal opinion but I totally appreciate movies like this, simple, funny and appropriate for children. Reminds me of the old times when movies were sweet and innocent, before all the full action adrenaline stuff!Kudos for the PENTATONIX participation!So put your matching Christmas pj's, grab your popcorn and watch it all together.Ps it adds to 364, you will know what I mean when you watch it!"
}