{
    "0": "Having read the first few Harry Potter books before 2001 and hearing about the hype for the first movie, I was excited. I heard there was going to be an all-British cast (which makes sense, right?) and we'd get to see a live version of one of the defining novels of our generation. From what I remember I went with my family and a family friend to see the movie the day after Christmas and was pleasantly amazed. After the movie was over, I watched the credits and discovered some familiar names (the late Alan Rickman, Sister Act's Maggie Smith, James Bond 007's Robbie Coltrane, and Star Wars' Warwick Davis); others not so familiar (the kids, some of whom had their debut). But it was a good movie and was a party of colors and sights for all to see. This is easily my favorite of all the Harry Potter films. The catalyst of the movie series!",
    "1": "Like a lot of others, I refused to watch this film when it was originally released, thinking it was going to be another movie for kids, loosely taken from the source. Was I ever wrong? J.K. Rowling's novel was brilliantly taken from book to screen. The acting, directing and especially the special effects were tremendously awesome. Director Chris Columbus did a superb job with the direction, I was surprised he didn't get an Academy Award nomination. The acting was too, excellent, especially from the experienced actors like Alan Rickman playing Severus Snape. Truly one of his best performances.A great adaptation of a very popular book, a fine example of cinema.",
    "2": "in 2001, in the film Harry Potter and the Sorcerer's Stone, began one of the best sagas of all time, based on the book of the same name by JK Rowling, the film hit full in the cast, all actors are great in their characters, Daniel Radcliffe this impeccable as Harry Potter, the resemblance is too large, Rupert Grint this great as Ron Weasley, Emma excellent Watson as Hermione Granger, Robbie Coltrane as Hagrid, Richard Harris as Dumbledore (which unfortunately from the third movie substituted series, having deceased), Maggie Smith, Alan Rickman great as Snape, Ian Hart, Tom Felton, and etc, all goods, the special effects are great, the picture is great, especially the castles, the soundtrack is very good, and full of great moments, as the final, obvious that the movie has errors, the script has some problems, and the film is very long, I think it was longer than it should, and the film is faithful to the book, even with some missing characters, Harry Potter and the Sorcerer's Stone is a very good film, and marks the beginning of the saga of the Wizard in the movies. Note 8.2",
    "3": "When I first saw this movie I was ten years old, the same age the characters where supposed to be. My older cousin and her boyfriend took me to the Mall to watch a movie. Back then I wasn't going very often to the cinema, due to the fact that my parents didn't have time and I wasn't old enough to go alone to any theater. The movie captivated my attention like nothing before and I became so interested in anything that had to do with this movie, and I heard that it was made after a book. I didn't had Internet back then, but I found the first book at a library and convinced my mother to buy it. That's how I became obsessed with reading and writing.I may say, \"Harry Potter\" affected me in a positive way, because after I finished reading all the published books back then, I wanted to read more books and I must thank J.K.Rowling for her genius, if it wasn't for her books, I might have been right now an average seventeen year old, at some party, drinking my brains out. This movie got me to the right path in life.I know, you probably don't care about my story, you readers only want to hear about what I thought of the movie, but I believe my story can influence you if you are a parent and thinking whether or not you should let your children watch this film. My advice is yes and I have presented my reason above.The story is simply magical and \"Hogwarts\" is a genius invention. The movie is done well, almost perfect. It's the closest to the book they can get and it's an amazing experience for any kid.",
    "4": "Over-hyped but still enjoyable \"event\" movie, one of the biggest of 2001 until LORD OF THE RINGS comes out, and a film in which every million of the budget is put up on screen in the special effects. What I found most refreshing about this blockbuster is that the entire cast is made up of British actors and actresses! It makes a change for an expensive blockbuster movie to be thus but there you go, HARRY POTTER is indeed a unique movie. Now I'm not one of those people with lots of time on their hands to read the never-ending Harry Potter books (too busy watching cult movies I'm afraid), but the film has turned out pretty much as I would have expected from the adverts. Although it's overly sentimental (blame it on director Chris Columbus) and aimed at children, adults can still enjoy it for the excellent pacing (rarely does the two-and-a-half hour running time drag) and the plethora of special - and some not so special - effects on view throughout.Highlights include an attack in the school's toilets by a huge, lumbering troll, a life size game of chess in which the pieces come to life to destroy each other, a cloak of invisibility, a man with two faces on opposite sides of his head, and the finale which includes a scene of a man disintegrating into dust as a homage to Hammer's Dracula and is just as impressive. The CGI effects are elaborate and generally flawless, and the only ones I didn't care for were the \"broomstick flying\" shots in the quidditch game which still ended up looking a little too fake for my liking, which is a shame as they're used excessively. Otherwise the effects work is phenomenal and something to be seen.Daniel Radcliffe takes on the rather subdued role of Potter, and is overshadowed by two excellent performances from Rupert Grint as the lovably cheeky Ron and Emma Watson as the bossy Hermione. The supporting cast are generally excellent, with fine turns from Richard Harris as Headmaster Dumbledore, Robbie Coltrane as the giant Hagrid (whose weight bizarrely fluctuates throughout the movie), John Cleese - briefly - as an unsuccessful ghost, Nearly Headless Nick, John Hurt as a wand dealer, Richard Griffiths as Harry's unpleasant uncle, and most of all Alan Rickman with a sinisterly villainous performance of Gothic dread - nobody can be a bad guy like Rickman can. Cameos from the likes of Julie Walters, Fiona Shaw, Zoe Wanamaker, and even Warwick Davis (which surely had to be a step up from LEPRECHAUN 5 or whatever his last film was) as a goblin are endless and a delight.HARRY POTTER AND THE PHILOSOPHER'S STONE may be a kid's film, but there's enough going on here to make it an enjoyable viewing experience for adults who plan to watch the film with their kids as well. Lots of plot, interesting and original characters, refreshingly old-fashioned moral codes, some fine sets which skilfully mix old and new-style worlds, an effective score, special effects which seamlessly blend in with the story and above average acting help to make this a gem of a movie and a cut above the rest.",
    "5": "No, I'm not a big Harry Potter fan and probably never will be but I can appreciate the qualities of the movies. Definitely for a children movie this movie is of course of very high class, with fabulous looking sets, a whole load of well known British actors and an highly experienced crew involved.The movie forms a nice first set up for the future series of Harry Potter movies. Still I'm glad the movies and its characters have matured a lot since this movie. Probably also has to do with the fact that this movie and the second were directed by Chris Columbus who is an experienced children movie director, while the other Harry Potter movies were directed by more 'serious' directors. Yes, it makes this movie a good children's movie to watch but also sort of makes this movie look and feel more outdated than any of the other Harry Potter movies, which also goes at the expense of its re-watchable value.Nevertheless, \"Harry Potter and the Sorcerer's Stone\" remains good quality- and fun film. It knows to create an entire new world of its own with lots of often strange characters in it.The movie is of course a set up and the first establishment of a long running series of movies. This means that the movie consists for a big part out of character introductions. Yes, this results in the fact that there are a bit too many characters in the movie, also since some of them don't even seem to serve a purpose at all for the story but this got resolved in the later movies, by simply leaving out some characters but by introducing many new ones as well. So its sort of problem solving with another problem. Also a bit of a shame that the movie is lacking a real central villain. Professor Snape is treated as a villain, even though we learn by the end of the movie that he's not such a bad guy after all. The real main villain if the movie is of course Voldemort but he gets mostly only mentioned by name and basically doesn't do an awful lot in the movie and only sort of shows up in the very end of the movie. Not the way to treat a villain in my opinion, even though its of course clear from this movie on that he is going to play a much bigger and more important role in the future Harry Potter movies. I however in a case like this feel that they should had putted in a new and different villain besides Voldemort, since this movie is definitely lacking a sense of danger, excitement and action, even though the movie never bores, despite its quite long running time (for a children's movie anyway.).The movie its quality is also surely being uplifted by its presence of well known and respected actors, such as Richard Harris, Maggie Smith, Robbie Coltrane and Alan Rickman among many others. Each of them are giving fine performances but it are mostly Harris and Rickman that catch the eye with their performances. The child actors are also managing fine, although its definitely and luckily true that their acting improved throughout during the later movies.The movie is great looking and knows to create a magic new world, with its set, costumes and make-up. It's not hard to see that this was a costly movie to make. The special effects are also mostly fine, though not really during the game of quidditch, or any other 'flying' sequence for that matter. The movie gets also greatly supported by the musical score from John Williams. Sort of a waste for the series that Williams only scored the music for the first 3 movies.A good and fun enough start of the series, though luckily the movies improved more over the years.7/10http://bobafett1138.blogspot.com/",
    "6": "Not a perfect story, but a lovely introduction into these characters and J. K. Rowling's magical world of wizards. Lots of great bits here, like the sorting hat, invisibility cloak, troll encounter, and quidditch match (even if the rules for this game are absurd). The casting is excellent, including the principal three (Daniel Radcliffe, Emma Watson, and Rupert Grint) and the teachers at Hogwarts (Alan Rickman, Maggie Smith, and Richard Harris). The film was a little too long and had scenes that seemed a little disconnected, leading to a rather brief, anticlimactic ending, but overall there's a reason the franchise was so popular, and this got it off the ground in good form.",
    "7": "It's seem like just yesterday, when the movie about the boy whom lived, was about to come out. People were wondering if the Harry Potter's books by J.K Rowling could easily be translated into the big screen. Harry Potter and the Philosopher's Stone AKA Sorcerer's Stone directed by Chris Columbus, indeed show that it was somewhat possible. The story follows Harry Potter (Daniel Radcliffe)'s first year at Hogwarts School of Wizardry as he discovers his gift and destiny against the dark forces of magic. The movie like the other films are cut into two plots directions. One is about student life at Hogwarts during the school-year, while the other half is about the mystery that Harry Potter must uncovered that year. It works well as a long read novel, but in movie form: its means a long sit through. The movie pacing is so long. It takes forever to get to the main plot of Harry Potter finding the Philosopher Stone. There are is a lot of filler scenes that could be cut away. I dislike how the Philosopher Stone is one-time movie McGuffin. For the best of my knowledge, the Philosopher stone plays no factor after this movie, and never mention again after this film. The third act, mostly comes out of nowhere. The twist toward the end, was pretty predictable, if you readt the books, but pretty interesting. Another thing about the movie is how non-logical the movie is. It really baffled me, how much exposition, it needed. Even an hour in the film, there were a lot of random odd things happening without much explaining. It gets more confusing as long bits of the book, like the Centaur showing in the woods, were shorten in the film. It gets worst for the centaur, as he wouldn't play a factor, in any of the later films, despite, saving Harry Potter from Voldermort. Hermione Granger (Emma Watson) was also cut short. Her riddle solving in the book was cut from the film. Several minor characters have been removed from the film version, as well. Despite those, the movie is really close to the novel. In my opinion, don't bother, trying to understand the logic of all the wizard terms, because it will take you out of the fantasy movie, and give you a headache. Still, there were some really dumb things to nitpick here like why would Professor Dumbledore (Richard Harris), even allow Harry Potter to stay with the Dursley's family when he knows that they're horrible people. Honestly, the Dursleys could had killed Harry Potter with the childhood neglect! What was he thinking? Harry Potter could had commit suicide, or gone crazy like Lord Voldermort! What an idiot! The whole movie is about children being danger all the time. I don't care if they're wizards in training, I'm surprise that the death tolls of students dying isn't as high as it should be. The school staff is questionable at times. A good example of this stupidity, is punishing students whom went out at nights, by sending them out at nights in the dark forest, where they can get attacked by creatures. The most insulting thing in logic is the black/white one-dimensional view of good Vs evil. Honestly, how on earth is the members of Slytherin never got expulsion for all the bullies that it has? You would think, that at less, there would be one good person in Slytherin. Another thing that bugs me is the whole the power of love conquer all. I think, children are a lot smarter than the childish message, the film is trying to pull. The acting in the movie is pretty bland, for the most part. After all, most of the child actors had this film as their first roles. I wouldn't say that Harry Potter's film series, have the most entertaining of dialogues, anyways. The wooden delivery, felt like a read-through. Most of what they're saying are stating the obvious or repeating what happening on screen. It's so annoying. The other actors were master British thespians, who seem to over-act at times. A good example of this is John Hurt & Alan Rickman. It was too hammy for already over the top world. The action scenes were pretty well-done. My favorite had to be the Quidditch match and the whole chess game. I can do, without the whole troll scene. The CGI troll hasn't aged well. Visually, the movie is beautiful to look at. I love the special effects, locations & set, and costume, they did. It really made the Harry Potter world, stand out. The music by John Williams is amazing to listen to. I think director Chris Columbus was indeed the best choice for this first movie, as he got the magically part, right and how to make a family picture. You even see, how much things, he establish that other directors would reused time after time. Still, I really hope for Terry Gilliam like J.K Rowling's first choice to be the direction. The movie has great social commentary themes like the metaphor of racism, ethnic cleansing and why Nazism is bad. You can also see possible influences from other words, that made Harry Potter work. There was a few controversial moments leading up to the film, like religious debates. A few religious groups claim that Harry Potter contain occult or Satanic subtexts that isn't good for children. Another one is the use of the word, sorcerer over the word philosopher in the title. US & British have different meanings to the words, plus marketing though, it would better to call it sorcerer as that word get more appeal. Due to this different, all scenes that mention the philosopher's stone by name had to be reshot, once with the actors saying \"philosopher's\" and once with \"sorcerer's\". Overall: The movie might has its flaws, but majority, a great first watch for any fantasy fan.",
    "8": "To be faced with the challenge of adapting Harry Potter for the Silver screen must have been any director's nightmare- the chance of directing possibly the biggest film of this decade, but also the hardest audience-the millions of fans of the book who know every line and will pick up on every mistake. Being one of the above, I can only say that Christopher Columbus and all of the team working on HP did marvelously. The cast was brilliant (particularly notable are Alan Rickman as Snape, Maggie Smith as McGonagall, and the eerily creepy David Bradley as Argus Filch), the directing wonderful, and the scenery perfect. The only qualm is that it does not track perfectly with the book, but squeezed into 2.5 hours, this can only be expected. Well done all involved!",
    "9": "The right way to start a saga like this one, introducing the characters in a very positive and unique way, telling and showcasing all the riches that the wizard's world is a home of. In only one movie, we've seen amazing creatures, friendly and foes, teachers that are heroes and villains, we've witnessed the wisdom of the legendary professor Dumbldor, the movie made us guess who will be who and on who's side in the chapters to come and above all, we had fun. I will never forget the part where Harry buys all the things he needs to start his wizard journey, the authentic look of the streets, the shops and the bank will be part of the Harry Potter legacy forever.",
    "10": "I watched all Harry Potter movies when I was 7 years old. After five years I watched the movies again at 12 years old and I feel this saga a classic, well, it is a classic. I started reading the first book like one day ago. Which my mom gave to me when I was a little kid. I like Harry Potter a lot and I would watch all the saga again",
    "11": "Harry Potter movies are one of my favorite ones, and I can watch them several times. I watch it every time it's on TV, and there is one channel that shows all the series of this incredible movie every time after the new year. I also want to mention that even my family members like to watch it with me. My grandmother especially likes it. This fact indicates that this movie is interesting not only for children but also for elderly people and it's not weird for me. There are so many things going on in this movie, so many secrets and beautiful scenes. Plus a big thanks for the graphics of the movie, everything is very realistic. For example, the mermaids or the dinosaurs. Moreover, there is a massive animatronic creature in this movie- spider and after watching the movie google about it and found out that Rupert Grint, the actor who plays Ron Weasley, one of the main characters, is afraid of spiders just s much as his character is, and said it was easily the scariest scenes to film. I'm scared of spiders too, and I know how it feels when you see them. Thus, I really appreciate the job that this actor did. In my opinion, despite the fact that he had to play again a guy, who was scaring from spiders, it is again hard to play the role by looking at the creature that gives you goosebumps. Thus, this movie not only good in graphics, but also the cast.",
    "12": "Not being a reader of the Harry Potter books, I came to the first Harry Potter movie with a totally open mind. There seems to be those who love the book but hate the film; those that love both; and even a few who hate both! Having watched Harry Potter And The Sorcerer's Stone, I must confess that I'm not entirely sure what all the fuss is about. This strikes me as solid but unremarkable, totally overlong but fairly diverting fare.Harry Potter (Daniel Radcliffe) is left as a baby at the house of his relatives, the Dursleys. Later we learn that his parents were magicians killed by a dark sorcerer, and he has been hidden away for his own protection until he is older. Eventually the time comes for Harry to discover his destiny. He is tracked down by the friendly giant Hagrid (Robbie Coltrane) and sent to Hogwarts, a special school of Witchcraft and Wizardry for youngsters with magical prowess. Everyone at Hogwarts, the fellow pupils and the teachers – seems to know about Harry's past, even though he himself knows barely any of it. Harry befriends two other first year students – Ron Weasley (Rupert Grint) and Hermione Granger (Emma Watson) – and begins to learn the art of wizardry from various eccentric teachers. Things take a darker turn when the three young magicians begin to suspect that Voldemort, an evil figure from Harry's past, is trying to regain his once-great power and strength by obtaining the Philosopher's Stone, a powerful object hidden somewhere at the school.The film is not particularly well-acted, with the child stars coming across as if they are carrying out a reading rehearsal, and too many star names (Julie Walters, John Hurt, John Cleese, Zoe Wanamaker) hamming it up like mad in cameo roles. At least the main adult roles – taken by the likes of Maggie Smith, Alan Rickman and Richard Harris – are played with a degree of experience and finesse. There are some splendid visuals in parts, though the effects are not so impressive during the much-hyped Quidditch sequence. The most disappointing thing for me is the long and laborious build-up, which leads to a somewhat flat final confrontation (I am reliably informed by those in the know that this film's climax is intentionally brief and aborted, and links to developments in the later films). Overall, Harry Potter and the Sorcerer's Stone is a reasonable watch, but I'm hoping for something more as the series progresses.",
    "13": "When I knew the film was being made, I thought how could they make a film that would be up to the standard of such a perfect book. But they did! Sure they missed bits out but they captured the essence of the book brilliantly. One member of the cast was mis-cast for me but my children disagreed.I even found myself believing they were flying and not wondering \"how are they doing that?\" So 10 out 10 Warner Brothers. Bring on the next one!",
    "14": "This movie captures most aspects of the book perfectly. Being the first in the franchise, it has to do a lot of world building. But the writers and the director of this movie managed to keep things simple and to the point.The cast is also perfect. All the younger actors were good enough and they keep improving with each movie. The older cast was amazing in their roles and help the movie feel more real. The music of John Williams was a masterpiece and added to the magical nature of the story.Even after 2 decades, this movie still feels magical and captures the attention of many young and old audience.",
    "15": "Cool! I'm so sorry because in 21 years of my life, I've only seen a movie as cool as this. Harry potter, in my first impression, I was amazed and curious about how the next series of this film will be. Watching this film evokes a feeling of dark academia that was buried in the past. Even though this film was produced in 2001, but the quality is quite good and even not inferior to films produced now.",
    "16": "I watch this movie again in 2019, because i think it was an amazing movie n i miss the point of the movie when i watch it as a child. I only focusing on the magic thing.\nIts good for a children to watch this movie i think, it tells not only about friendship, but also family, bravery and sincerity.\nWatching this also makes me remember my childhood days, it bring back all memories i cherish the most.\nreally love it",
    "17": "10/10 - an unforgettable start to a fantastic film series and the career of the impeccable Emma Watson (and the other kids)",
    "18": "All the Harry Potter films in this series are pretty good. Some are better than others, but over-all, the seven together is quite a motion picture experience. This one is the first one in the series and is the best one to get started with. This first film is so well produced, that it should satisfy you enough to watch even more of them. This film also works on its own. That is good, in case, you never get a chance to see another one again in your life. Start with the first one I always say. Being the first film also means, I have seen it the most. I saw this film as soon as it landed on DVD, then when I realized there would be a seven or eight film run on the Harry Potter series, i stopped watching them and waited for all of them to be released in a DVD package, which I finally finished in 2017. This film still works great today as it did 20 years ago.8.7 (B+ MyGrade) = 8 IMDB.",
    "19": "A legendary beginning to a legendary franchise. The story of the film is great. Each role fits perfectly with the actor. Has great CGI and visuals. Can't stress this enough... go watch it.",
    "20": "I love the Harry Potter books because of their brilliant writing, exciting and funny moments, compelling characters and the way that I'm hooked as soon as I pick one up. They deserved to be such a phenomenon. The films? Not so much. This starts off the adaptations in OK style, and follows Harry Potter's attempts to stop the evil sorcerer who killed his parents getting a stone which will help him return to power.This, along with the second is directed by Christopher Columbus and the first 2 often seem to be seen as the weakest. In my opinion these 2 aren't the worst, but they're certainly not that great. For some reason, Columbus decides to copy the book page for page but leave out most of its depth, wit and bite. For a Harry Potter fan this may be satisfying, but since the film is also overly syrupy and kid friendly, adults may be irritated by it. This adaptation is a mixed bag overall.The adult cast has more talented British actors than you can shake a stick at and while most of them have relatively small roles, they certainly leave an impression. John Williams' as usual provides a great soundtrack which sadly was used less in later films and while I'm not desperately keen on Chris Columbus' style, he does do a perfectly OK job at directing the film. To a newcomer and someone who hasn't read the book the film would likely seem magical and fascinating as it thankfully includes many details about the HP universe, which is one of the best fictional universes ever created.There are some genuinely frightening moments and it provides good escapism. But there are many problems. It's nowhere near as funny or fascinating as the book, which is odd as it's pretty much as carbon copy of the book although to be fair it omits the right parts of the book. It's also overlong and frequently dull, and things such as the troll, the dragon and the mirror are conveyed poorly to the big screen, although the finale is still good. The child actors are excruciating to watch at times, although they would improve in later films.Overall a wooden and unimaginative adaptation which is cinematically uninteresting and, on my last viewing, a bore to watch. This is the 6th best, and while I used to like it, now I can see it's routine, though competently executed and visually decent, adaptation with little personality. When having to deal with the wooden child actors it's even more irritating.",
    "21": "It was amazing to watch how a huge movie franchise started with this one. It showed a basis for the entire Harry Potter timeline. The visual effects were very great for this film. It was on-point and did not feel amateurish. Unfortunately for me, everything else was a bit stale and unexciting. I was in doubt of whether it really maximized its runtime. There were, in some parts, too many scenes which the characters were doing a lot of dialogues. The production design and costumes were excellent aspects of the film, too. But for me a lot of dark cinematography was utilized, instead of a more lively kind of production.",
    "22": "I have seen this movie numerous times on TV, but I was never able to watch it in it's entirety some reason until today where I managed to watch it all and it did not disappoint. The story is just really intriguing right from the start where you introduced to the character Harry Potter who is just very likeable which makes you root for him against his so called family. The world of Hogwarts is amazing and makes you want to wish it was a real place. The story is easy to follow and it's not predictable which I liked as there are a few twists which just make the movie even more thrilling. I have seen bits of the other movies on TV as well and I hope they are as good if not better as this.",
    "23": "\"Harry Potter and the Sorcerer's Stone\" or sometimes also \"Harry Potter and the Philosopher's Stone\" is the first film from one of the most successful movie franchises in cinema history. The books were written by Joanne K. Rowling and adapted by Steve Kloves (not a name to many), who also directed \"The Fabulous Baker Boys\" earlier in his career. It is about a small boy with hidden powers, who is not particularly liked by his uncle, aunt and cousin. They took care of him after his parents died when he was a baby. So he gets picked up by an unusually looking, rather gruff magician and taken to Hogwarts. Hogwarts is not a normal school. While the bonding with fellow students, the fraternities and sports activities are there as well, everything is just a little bit more magical and different.One thing I really liked about the film was the playful comedy. A lot of it involved Ron Weasley. It is very subtle often, but it is pretty great. Let me use one example. When Potter finds a collection card in one of his sweets, he says he has Albus Dumbledore, the headmaster from Hogwarts. Now I expected something like Weasley saying oh my God he only appears once in a 1,000 times, but he said something like he has him six times already too. And when Dumbledore's card comes alive and quickly vanishes, Weasley says that Albus cannot hang around there all day as he is busy. I found that pretty funny and there is a whole bunch of cute scenes like that, also Weasley's interactions with Hermione for example.Other than that the film really succeeds with his love to detail and all the fantastic ideas in the script, such as the hat picking the group they belong to, the hidden station idea, the scar, the troll (like a fire alarm in a real school), Fluffy, the mirror, the chess game and many more. To me, the first movie was much more about experiencing the wonderful world of Hogwarts than really enjoying the adventure action about the stone. Another highlight are all the very unique characters from the teaching staff. I won't go into further detail here. You know who I mean. There's some minor criticisms, like the ending with the extra points was a bit cheesy, feel-good forced (also with Smith's character looking so uncomfortable, they have to be neutral I thought), the connection between Snape's wound and Fluffy was a bit genius, don't know if kids would make it really so quickly, but they have bright minds so maybe or also Ron's whole self-sacrificing approach during the chess game. I can't really see a little boy act like that. These are only minor flaws though from an otherwise excellent film. This is one to watch for the whole family and I can't say I am surprised this was the most successful box office movie in the United States from 2001, even ahead of the first Lord-of-the-Rings movie. The three child actors here had little (Radcliffe) to none (Watson, Grint) acting-experience in movies when they were were cast here. A decision that changed their lives.The movie scored 3 Oscar nominations for the art direction, costumes and the soundtrack and it is surely deserving. Especially the visual side is incredibly strong and over 13 years later, most films can only dream of coming close to that. All the creatures look so fantastic it is a joy to watch. That one forest creature that saves Harry reminded me during one shot especially of the later film \"Pan's Labyrinth\". Just a random notion. There is some animal included like a majestic and, at the same time, cute cuddly owl and a droll huge dog. The cast includes quite a few known actors: Richard Harris, Maggie Smith, Alan Rickman, John Hurt and many more shall follow in the next films. This movie may be director Chris Columbus' best work so far and that's not taken for granted as he directed 2 \"Home Alone\"-films, Mrs. Doubtfire and also another Harry Potter movie during his long career. I believe this is my favorite Potter film together with the \"Prisoner of Azkaban\". Too close to call. We are just introduced to such a wonderfully creative world here. Highly recommended.",
    "24": "Sorcerer stone is a pretty good film which introduces us with harry potter and his friends. Just like the kids in Hogwarts, audience are also in awe with the magic. But I felt that this lacked a story which is only revealed towards end. But still this is my second most favorite harry potter film after chamber of secrets.",
    "25": "Directed By: Chris ColumbusStarring: Daniel Radcliffe, Emma Watson and Rupert Grint.Overview: A great start to a franchise. Definitely worth a watch.Good: 1. Daniel Radcliffe, Emma Watson and Rupert Grint are great, especially for such a young age. 2. Robbie Coltrane, Richard Harris and Alan Rickman are, of course, great as Hagrid, Dumbledore and Snape respectively. 3. All characters are great. 4.The cinematography was great and had some pretty fine shots. 5. The music is brilliant. 6. The entire universe is so great and brilliantly done. 7. The lighter tone until the later conflict is great.Bad: 1. Professor Quirell is an uninteresting villain and him as an introduction to Voldermort was stupid. 2. It has to spend a lot of time setting up the universe which is understandable but annoying nonetheless. 3. The way some plot points are revealed is stupid. ------- Best Part: The pursuit for the Philosopher's StoneMVP: Richard Harris as Albus Dumbledore8/10",
    "26": "Having just watched HP7A aka Harry Potter and the Deathly Hallows Part 1, my mind flies back - almost magically, one might say - to the film which started it all.My opinion now is not a lot different to what it was then. The book is a delightful experience - it captured my middle-aged imagination on page 1 and never let go for an instance, telling a cracking story well, and having me believe that Harry and his friends were in real jeopardy throughout. The film's main strength is that it captures much of the book very well.It has two weaknesses, however. The first is that it is, perhaps, a little too respectful towards its source material. This slavish desire to reflect on screen every tiny detail from the novel causes two problems. One, the film becomes somewhat clinically overstuffed with so much tiny detail that it almost suffocates the life out of it and, two, it sets a standard for detail so impossibly high that future films fall short (the portraits and staircases in Hogwarts no longer move, ghosts no longer charge around etc.).The second weakness is the three principals. I'm sorry, but I find Daniel Radcliffe pretty wooden throughout the series (subject to some comedy bits in a couple of the later films) and, if he was the best casting choice available, the others couldn't have been very good. Rupert Grint is saddled with a Ron Weasley who does him no favours at all. Not until very late in the series is Ron called upon to be anything than a gormless foil for Harry, a task which Grint accomplishes with ease (and I'm not sure whether this is a good thing or a bad thing). And Emma Watson is just awful. So desperate is she to provide a dynamic performance that her mouth takes on an appallingly hypnotic life of its own. I don't ever recall seeing someone talk with such over-emphatic mouth movements. How curious, then, that future films in the series see Watson develop into being one of the very best things Harry Potter offers the viewer.",
    "27": "Harry Potter and the Sorcerer's Stone is what a book adaptation should be. The only things left out of the movie were very minor. This tells the story of a boy whose parents were killed when he was young and been mistreated by his aunt and uncle. He receives a letter about a school named Hogwarts. There, in his first year with his friends Ron and Hermione, he must stop wrongdoing of a couple teachers. The cast was wonderfully casted. Daniel Radcliffe is fantastic and looks the part of Harry. Everyone else is perfect. As I mentioned above, the adaptation is great. The movie even used the same quotations as the books. The music is memorable. I liked John William's Hedwig Theme. The costumes are good-looking and so is everything else. This movie will leave a magical imprint on your minds and this is only the first film. I rate this magical adventure 10/10.",
    "28": "wow, wow, wow! The Harry Potter movies and books will always have a special place in my heart!! I love them so much and this is the one that started it all! It is so fun, great, and energetic and Daniel Radcliffe is perfect for Harry. Emma Watson and Rupert Grint are great and there is such amazing chemistry between all of them! I love all the movies and books.",
    "29": "Harry Potter is an orphan living with his ignorant uncle and aunt under their stairs. He finds out that he is actually a wizard and there is a secret world out there.This is the first of a series, and it introduces the franchise very well. Some of the style is still a little rough. The CGI isn't top notch, and the sets have some work to do. But those are minor drawbacks in an otherwise superb film.The best part of it must be the great chemistry between the three young leads (Daniel Radcliffe, Emma Watson, Rupert Grint). That is objective number one. With that accomplished, the rest is just icing on the cake. Director Christopher Columbus must be commended for weaving a coherent and compelling story while setting the groundwork for the rest of the franchise. It is tough work, and could easily flounder in less experienced hands.",
    "30": "I know I'm probably the only one that didn't care for this film, but I thought it was plain boring. The adaptation of the book is just OK and the acting is average. Frankly it's a pity to see all the great English actors in this film totally wasted and relegated to play second fiddle. The effects are very well done, but it's such a conventional treatment of the books that I kept checking my watch a few times to see when was it going to be over. It's very curious that hardly any of the young people in the audience didn't laugh at all. This Harry Potter is very heavy handed and it should have emphasized the fun and could have used a few lighter moments.I was greatly disappointed given the hype in the media, which I'm sure has Ms. Rowling, Mr. Columbus and the rest of the people responsible for this mess laughing all the way to the bank!",
    "31": "While I look back on this first entry into the Harry Potter series fondly it is not with out a few problems with adaption from the books. Our trio of main actors are very young and as a result we get plently of chessey acting. Looking back however it is great too see the beginning roots of the characters that we get very attached too through out the series. We get too see them grow as actors. A great cast was put together that stayed more or less the same through out the whole franchise. The effects in the movie are handled well for its time despite Harry not actually using any magic. Even though there are better movies in the series I will always look forward to watching this entry.",
    "32": "Of all the Harry Potter's movies, I guess the ''Harry Potter and the Sorcerer's Stone'' was the more more expected of all. I was one of the thousands of teenagers who wanted to watch this movie so badly and I watched it in the first week it came here in Brazil. After 4 Harry Potter's movies, now I feel comfortable to say that the first movie is the one I liked the least. Maybe because it is the one who has less adventure or danger of all, but I cannot say exactly why. I think it will be very difficult for me, being crazy for Harry Potter's books, to give 10 in any of the H.P.'s movies, since the book is SO MUCH better than any of the films. I mean, MANY great parts are never showed in the movies. But if you are one of those people who never read any Harry Potter book, this film will be of vital importance to watch since it is the first of the series.",
    "33": "First off, I am going to give my modern day thoughts on Harry Potter and the Philosopher's/Sorcerer's Stone since I just now watched it for the first time in about 10½ years. And then, I will tell my story. I will begin with the positives to be nice. To be generous.80% of the special effects and sets worked extremely well with the exception of showing both The Man With No Nose – oops, I'm jumping ahead, I mean: The Man's Name They Only Speak Of Seldomly and ANY flying sequence including that Rubbish, er, I mean Quidditch game. Also, the film was a perfect fantasy for youngVERY YOUNG, that is, kids. Oh, and the score was unbelievably great.Whew. Got that out of the way. Okay, here goes: the movie was too damn long. The movie contained a minuscule amount of plot – or direction and the bulk was just spliced together scenes of a freshman year at a unique school. Quite frankly, it felt like 1,001 ideas and made up names (for useless characters, random spells, odd or clichéd wizardry creatures and places) were basically thrown at us while hero Wesley Crusher, a.k.a. Harry Potter, attempts to figure out what the whole point to this mess is.What started off very nicely in a fantasy and magic-filled-world slowly grinded to a halt so they could show off more fantastic sets and a zillion characters and objects in a school bent on kidnapping kids to learn sorcery. Eventually, it takes about an hour and forty-five minutes or roughly fifteen minutes past what this movie should've been clocked at, to learn what our \"hero\" (??) Harry Potter should accomplish before the credits roll.By that point, I kept repeating two phrases over and over: \"I don't like this movie\" (despite the graphics and the wonder it's showing me) and that this is really made for the five and under crowds. Further, when the movie finally did get past the climax of what Harry & Pals (including his poor idiot ginger chap and know-it-all-bitch with terrible hair) need to accomplishthere are FIVE endings. This movie would never, ever, ever, ever end.Oh, and before the judgments roll in, I *have* read the book. Book one, that is. I found it's all-but exactly, word-for-word as the adaption. And that's not necessarily a good thing. Despite its approximately 300 pages, enormously large print, wide margins and drawings – all of which would make it approximately 3 chapters of any normal Stephen King fare – it's just as plot less as the movie until the end. All the way through both the book and movie, I kept fantasying about other movies/books I could be entertained by that contained a point to the story from beginning to end.Now, that all said, it's not a terrible movie. It's a good intro to what's to come and again, it's PERFECT for very young kids. Is it a movie I will ever revisit, or as now, re-watch in another 11 years? Hell no. Now, that I can finally write a review, I never have to experience Harry's seemingly never-ending freshman year at Hogwart's school.And now here's my take on my original screeningA Long Time Agoin our own galaxy, sort of, I watched Harry Potter Part One – since it's known by two different names, for asinine reasons, I will refer this as \"Part One\" – only due to a babysitting gig I was coaxed into. I had already made up my mind not to see this film, since swords/wizards/fantasy isn't my cup of British TeaBut, since I had seven hours of babysitting two young boys, I thought: why not take up an hour and a half on a movie they'll probably want to see?That was mistake one and two: forgoing my vow and that I mistakenly thought it would be an hour and a half. Mistake number three was that we went on weekend one or two – I can't recall, or I choose not to – so, the theatres and parking lot were still jammed. We barely made our show time after parking and getting snacks.Despite being tortured (SEE ABOVE REVIEW) for the movie's duration, I was pleased I had just used up 5 of the 7 babysitting hours with the journey there, movie and back. As for the boysboy, they LOVED the movie. They LITERALLY sat on the edge of their seats the entire time. (No joke.) Good for them. I'm glad the money I spent on their entertainment and their snacks was well worth it.I, on the other hand, was squirming in my seat the entire time or at least after the first pointless hour. I had NO IDEA that this was over an hour and a half, let alone 2½+ hours – I was so disinterested in seeing this, I had completed no research. NO KID MOVIE SHOULD EVER BE THAT LONG – I originally thought. Not to mention, no kids movie should contain FIVE ENDINGSas stated above: the movie would never, ever end.Again, I remember the boys, one of which is my (now 15-year-old) nephew, loved every single minute and as uncomfortable as I was, I'm sincerely glad they had a good time. In fact, I need to make a point of asking him if he remembers me taking him. He had to be between 4-5 at the timeA year later, I would be dragged into seeing the remake/sequel with my partner and suffice to sayI could write the same damn review all over again.(Editor's Note: I decided to listen to the masses for this Harry POTter phenomena and revisit the series. I've only seen the first two, both once and in first run theatres. Since it's been around a decade since the initial releases, I've started over with #1 and will get to what everyone calls: the better years.)",
    "34": "Literally anyone could write this story. Nothing is original, the effects are mostly bad, the acting is bad, the direction is bad and the music score was written by John Williams 25 years ago (if you get my meaning).This movie isn't funny enough, dark enough or smart enough to be considered interesting. It's very simple and too boring.The studio executives have gone really stupid nowadays; the original and interesting ideas are never promoted, they always seem to go for the safe (meaning stupid) bet.1/10",
    "35": "My sister and I, back when I was ten, wouldn't even go near anything Harry Potter-related, despite its immense popularity at the time; we'd call Harry Potter \"Hairy Pothead\" and laugh at the nerdy glasses he wore on the book and DVD covers. Anyway, recently we decided it was time to see what made Harry Potter fans so raving mad over a little boy with superpowers and a geeky school uniform, and it was a nerdy children's movie but not nearly as bad as we thought! The main character, Harry, is a seemingly average boy living in the U.K. with his aunt, uncle, and spoiled overweight cousin, Dudley (great name choice). When Harry begins discovering strange powers in himself, his aunt and uncle do everything in THEIR power to keep the truth a secret from him, but when Harry finds out he's a wizard and is given an invite to a secluded boarding school for wizards and witches, he eagerly accepts, wanting to be with kids like himself. From there he picks up two misfit friends, meets a snotty rival with way too much gel in his bleached hair, and meets a variety of teachers, including a perverse, hawk-like old guy with emo hair and a hooked nose.So, one thing I noticed is that throughout the eight HP movies, the series quickly changes from a children's movie to a series with a more adult theme, and characters become far more complex than they were likely ever intended to be by the book author. I did enjoy the Harry Potter movies, though the acting wasn't the best, the soundtrack was pretty good, the scenery was fantastic and I liked seeing some of the strange and wonderful creatures made up by the author, man, that lady has serious imagination! Still, Harry Potter certainly doesn't beat The X-Files or Cold Case.",
    "36": "'Harry Potter and the Sorcerer's Stone' is one of the most entertaining films I know. You can look at it and not worry about anything because you know it will all be alright. Very true to the book it reaches the same level. Daniel Radcliffe is the perfect Harry Potter, Emma Watson a great Hermione and Rupert Grint a very funny Ron Weasly. With the famous story, a great direction from 'Home Alone'-director Chris Columbus, a perfect casting and some nice special effects this is the way a movie like this has to be. Be entertained by the world of the wizards.",
    "37": "This was such a brilliantly done film. Well Harry Potter is a brilliantly done franchise in general. But the Sorcerers Stone (or Philosophers Stone) is a well done beginning for this franchise. The character development in this franchise is absolutely fantastic. You get instantly attached to the main and side characters instantly. All the actors did a great job and gave funny and fun performances. The overall feel of this movie is so magical and has such a fun feel. I have never seen a movie World get you so attached more quickly then Harry Potter. Overall this film was awesome and I highly recommend it.",
    "38": "Spoilers herein.For a long time, we have been warned about what will happen when a couple large companies own all the news, publicity, publishing and film channels. Now, we have the results, a film product that is as moribund as Microsoft software. In both the new MS and HP products, we have more than an order of magnitude more spent on promotion than on real innovation or imagination.This is a completely pedestrian effort. The books are fun, but only about as much as scores of prior ones. The rest is hype.About the film, I found no charm and three things that impressed me with their lack of skill.--The most puzzling of these is the score. Though always derivative, Williams has created scores that have become the floor of imagination for vast areas of our minds. He is tepid here, and one can only think is by direction from the Committee.--No puzzle with the camerawork. The blocking and angles have less art and adventure than any major film this year. Compare the perspectives with `Monsters,' which aren't noticeably arty, but which really adds thrills to the experience.--The thing that impressed was the ordinariness of the architecture. Casper could do this well -- Ridley Scott can repeatedly. Why do we get buildings that would be unremarkable even in the real world?",
    "39": "I've read every harry Potter book available and was fascinated with them. The world and characters J.K. Rowling created are marvelous, these are going to be fantasy classics in books. What about the movies?Harry Potter (Daniel Radcliffe) is an orphan raised by his hating Aunt Petunia and Uncle Vernon. Soon Harry starts receiving mysterious letters but is not allowed to read them. the Dursley's are utterly terrified. Soon, Harry is confronted by a man standing eight feet tall named Hagrid (Robbie Coltrane) and is taken away being told he is a famous wizard! Soon Harry meets Goblins and Witches in Diagon Alley and is enrolled at Hogwarts School of Witchcraft and Wizardry. harry meets Ron (Rupert Grint) and Hermoine (Emma Watson) and befriends them. At school Harry learns to levitate objects, transform objects into animals, and fly a broomstick. Harry is confronted with a dark past and learns more of his parents and of the infamous, evil wizard Voldermort. Soon only Harry, Ron, and Hermione are the only hope for the wizardry world against Voldermort.The film is filmed with magical touches: moving and talking painting, a broomstick sport (Quidditch), and a teacher that transforms into a cat. the story is harmless and nothing really is ever mentioned of 'devils' while at school. I remember parents complaining how witchcraft was evil and possessed our children through the evil Harry Potter Stories. The kids act pretty well, Richard Harris keeps the flow of the movie going as the Headmaster of Hogwarts. The castle is beautifully designed and captured through the filming. Chris Columbus does a great job with this film and won't disappoint the fans of the books with only a few minor flaws being present.Harry Potter and the Sorceror's Stone. Starring: Daniel Radcliffe, Rupert Grint, Emmma Watson, Richard Harris, Robbie Coltrane, Maggie Smith, and Alan Rickman.4 1/2 out of 5 Stars.",
    "40": "Initially I was against this series because the kids leave such huge messes at the cinema where I work. Then I decided to rent the first movie and give it a look to see what it is the kids love about it so much. Then it hit me: it's the story of a no talent underdog who overcomes great obstacles with a little help from his friends. And who doesn't like that? Overall, I'd say this is above average. I thought the three kids, Radcliffe (Harry), Grint (Ron), and Watson (Hermione), gave capable performances, oh, as did Felton, who played Draco. Also worthy of mention are Richard Harris, Maggie Smith, Alan Rickman, and Robbie Coltrane. If this film has any failing it may be that they try too hard to remind us of Harry's importance (he IS important, but isn't that obvious from the fact that he's the title character?).So give it a rental. 7/10",
    "41": "Columbus did a fantastic job directing the two Potter movies for use fans since 2001 2002 and producing Potter and the prisoner of Azkaban. But I will always appreciate Chris Columbus directing on Harry Potter and Percy Jackson . I hope he does another Harry Potter movie or Percy Jackson movie cause he has a better imagination like Peter Jackson.",
    "42": "With Professor McGonagall's (Maggie Smith) description of young Harry Potter, I wonder if J.K. Rowling ever realized the world wide phenomenon she would be creating with the series of novels that began with 'The Sorceror's Stone', and the subsequent movie franchise that would make her Britain's wealthiest citizen. Well, it's history now, and for future generations, the saga of Harry Potter will be relived again and again to the wonderment of new fans and followers.For myself, this introduction to the Harry Potter universe was an entertaining one. I'm not a kid and have no interest in reading the books myself, but I find it encouraging that youngsters will spend time reading the novels instead of frittering their hours away on less productive pursuits. I've heard the criticisms about the witchcraft and wizardry that are part of the Potter lore, but these are the kinds of subjects that fascinate the imagination the way all good entertainment does in whatever form. So I say keep reading and enjoying.As for the film itself, I like movies that have a bit of the magical and whimsical in them, along with clever writing and understated humor. Harry (Daniel Radcliffe) and his young friends take us on an exciting journey through the venerable halls of the Hogwarts School, and introduce us to a colorful cast of characters, some who may not be what they seem at first glance. For my part, I'm now well versed in the concept that the wand chooses the wizard, and that evil wizards must drink unicorn blood to keep up their strength. I'm still not clear why the knowledge of Harry's reputation would have preceded him with his contemporaries, but I guess I'll find that out in due time. With the film franchise now complete, I can pace myself at my own leisure without having to wait a year between installments to watch the Harry Potter saga unfold.",
    "43": "\"Harry Potter and the Sorcerer's Stone\" is as magical a film as a fantasy bedtime story or any fantasy that can pop up in any child's head.I have never read any of the books,so I will not compare those books to this film.The film is very imaginative and the visual effects and art direction are wonderful.This is only a short review and I am hoping to post a longer review.All I can say is that this film was alot of fun to watch.",
    "44": "If you don't know your Potter (like me), than you might have a problem with the titles. With other series, it's easier to distinguish, which one is part 1, 2, 3 etc. etc. Even the Naked Gun series which has Parts 2 and half and 33 and a third, you still know the order (not of the Phoenix obviously!) ;o) But enough about my (let's call it) ignorance, for the books (haven't read them guilty as charged) and off to the movie itself. Which is obviously targeted at a young audience. And it delivers on this premise. Plus it has to introduce characters to the world (for those who know them and those who don't). A good job overall, but nothing great in my eyes ...",
    "45": "You know what?  I'm getting sick of reading comments by people who are tearing this movie apart, saying it twists mythology, it is unimaginative, it is done simply for cold cash, etc..  Well, a lot of these people are the same ones who will go see the same action movie over and over again, despite the lack of plot and talent.  Hollywood just does not make good family movies anymore that are not animated, and I think that is very well done. The child actors are wonderful and have great timing for actors of their age.  Just enjoy it!",
    "46": "There were many plot changes to accommodate the adaptation of this literary work to film. But what bothered me more were the obvious comparisons to the 1986 TV movie \"The Worst Witch,\" in which many of the main characters of this work seem to have appeared. Professor Snape and Professor McGonagall are obviously different sides/aspects of Diana Rigg's Hardbroom. Professor Dumbledore, an obvious male version of Miss Cackle. Harry is Mildred, and Ronald Weasley is Maud. Furthermore, Draco Malfoy can be found in the Worst Witch, in the form of Ethel Hallow. Hardbroom gives Mildred nothing but a hard time in potions class, Miss Spellbinder (Madam Hooch to the HP fans) is trying to teach the first years how to fly, and they're all getting ready for a visit from Tim Curry's Grand Wizard (the HP's Minister of Magic). And, while this group of young witches plays \"terror tag\" rather than Quittich, and it is an all girl school instead of going co-ed, the obvious comparisons are still staggering.But ah, well. No one has sued, so what are we to do?Harry Potter is a young survivor of a dark crusade to silence those in opposition to an ancient evil. As a baby in his crib, he was spared by the Grace of his mother's love. Although of \"Wizarding\" blood, the attack on young Harry has left him with certain gifts and abilities he otherwise would not have had. As puberty strikes, so does Hogwarts in the guise of multiple invitations to attend Hogwarts School of Witchcraft and Wizardry. Harry's subsequent shopping trip to Diagon Alley is very entertaining, and rich with detail to which you otherwise would not be privy, concerning the back-story and succeeds in accomplishing character depth and setting the mood for the rest of the story.The direction by Chris Columbus is creatively wonderful. The cinematography is outstanding as great attention has been paid to detail. Details, no matter how small or inconsequential, enrich any creative work, regardless of the medium. I just hate the fact that Columbus (as Exec. Producer of this and subsequent HP films) could not find the time to read ahead through the second book to determine that there was a pumpkin patch, rocky crags, and a second room on Hagrid's hut! How much more beautiful would the PoA have been without having to stomach the sudden changes to accommodate the \"TRUE\" layout of Hogwarts grounds?!) The train ride to Hogwarts introduces the main supporting characters; Ronald Weasley (Rupert Grint) and Hermione Granger (Emma Watson).As the \"first years\" (new students) arrive by boat to Hogwarts Castle, the look of wonder on all their faces is absolutely believable. When I first saw this production, I was a bit full of wonder myself. Hogwarts is beautifully done, every little component of architecture and design was perpetrated with an intense caring, and great eye for detail. The acting by these young thespians is honest and genuine; truly professional performances by all involved. Let me also add here that the casting was top row. They got just the right people for just the right parts. In my opinion, there was not a single character that was mis-cast. (I absolutely detest Tom Felton's character, Draco Malfoy...his acting is brilliant, to elicit such a gut reaction towards his character.) Maggie Smith is a joy as the hard-lined Professor McGonagall. I've always loved watching her demonstrate her talents, and her performance in this production was no exception. Her character is like a roasted marshmallow...hard and tough on the outside, but with a heart that can be soft and sweet on the inside. Her treatment of young Harry demonstrates the love her character felt for his parents, now deceased; murdered in the dark crusade waged by Voldemort, one of the darkest wizards ever produced by the House of Slytherin (one of the four Houses at Hogwarts), and his many followers. Emma Watson positively shines as Hermione Granger. Her performance is quite believable and lends so MUCH to the movie. Her character was one of my favorites from the book, and her personification lives up to my every expectation. She plays the well-(self-) educated neophyte Witchling VERY well. I cannot wait to see where life leads her in the future. Robbie Coltrain's character; however, was my favorite among the teachers. Rubius Hagrid, who says repeatedly, \"I shouldn't have said that,\" has a heart of pure gold, and the demeanor of a true gentle giant. No one could've portrayed Hagrid, like Robbie Coltrain. The scenery and mountain footage shot and shown in abundance is absolutely breath-taking, the direction giving this effort the professional quality for which I had hoped it would possess. The effects were stunningly clever and extremely well perpetrated, brilliantly demonstrating Rowling's extraordinary imagination and creativity, and perpetuating the magic of her original literary work. I was pleased with this movie; though not as pleased as I was in reading the book.Jim Henson's Creature Shop did a marvelous job with the \"monsters\" in this movie. Better than I would have expected from Brian (Jim's son) when you compare his \"Muppets From Space\" to the earlier Muppet films done by his dad. Impressive work on Fluffy and Norbert, Brian. Jolly good show! \"There is no good and evil. There is only power, and those too weak to seek it.\" Voldemort. The ending is both satisfying and heartwarming. I truly enjoyed this movie, its characters and its message: you can succeed, no matter your beginnings or misgivings about yourself. However, while it did not fail utterly in capturing the atmosphere and overall \"feeling\" of the spirit of the first book, it did fall short.This effort earns a large 7.2/10 from...the Fiend :.",
    "47": "When the movie first came out, I was hesitant about seeing it because I was so enamored of the J.K. Rowling book. Therefore, I avoided it at the theater. When I finally bought the DVD I was sorry I hadn't seen it at the theater as I found that the movie was a truly worthy adaptation of the book. Special effects were wonderful and the acting was outstanding, even by the youngsters in the cast. The film managed to capture the fun and magical spirit of the book admirably. I look forward to seeing the sequels if they can maintain this quality. Well worth seeing.",
    "48": "I have been re-viewing the Potter films in order, building up to the last two installments, which I have yet to see. Watching them in order allows me to judge which were, in my humble opinion, are better than others.I found this first film was light-hearted and fun, and there were enough non-digital special effects to make me happy. I love the sets, the wardrobe, and acting. Even the music was good!Kid safe and entertaining enough for adults.",
    "49": "HARRY POTTER & THE SORCERER'S STONE The first film in the blockbuster \"Harry Potter\" franchise has suffered by comparison to all the films that have come out since. With each HARRY POTTER film that is released, the films seem to become more fully stylized. They've also managed to become far more organic than SORCERER'S STONE... which now comes across gimmicky and elementary by comparison.HARRY POTTER & THE SORCERER'S STONE tells the very introductory story of Harry's first year at Hogwarts where he only begins to discover the secrets of his hidden past and the complicated inner-workings of his new home. By nature, this is a more simplistic and superficial story then the recent films (GOBLET OF FIRE & PRISONER OF AZKABAN). It doesn't really delve into the histories of the characters and more so acts as an extended introduction.Though this first film has it's strengths, it's clear it was hurt by the direction of Christopher Columbus. The special effects are impressive still and the story is still compelling, but Columbus' packaging still manages to make things drag at times. While the story could have merited a 2 1/2 hour running time, unfortunately the film Columbus directed does not. The film could have been more tightly constructed and come in under 2 hours... leaving it with a brisker pace.The children's performances' are adequate. As a matter of fact, for me personally, the only aspect of this franchise that has not improved with age so much is the capabilities of the young actors in the central roles. While I have always enjoyed Rupert Grint's performance as Ron Weasley, I have always found Daniel Radcliffe's Harry and Emma Watson's Hermoine to be a little underwhelming. However, at such young ages as the children were while making this film... they do a passable job.The real energy and joy of this first film though comes from the energy and sheer excitement invested into the lesser supporting roles. By gathering the likes of Alan Rickman, Maggie Smith, Richard Harris, Robbie Coltrane, Fionnulla Shaw, and many others... the film has handfuls of fully realized and wildly imaginative supporting players adorning the screen at all times. Their performances along with the action sequences (the final rescue of the Sorcerer's Stone, the Quidditch Match, etc.) are what manage to keep the audience's attention despite the poor direction from Christopher Columbus.Overall, though this film is a slight disappointment considering the phenomenal material it's based on... it's not a complete mess. It's still entertaining (if overlong) and most importantly, it does leave you anxious to find out what more happens to these characters. As a stand-alone film HARRY POTTER & THE SORCERER'S STONE has many flaws... but it successfully grabs it's audience and leaves them wanting more. Thanks to this quality, the film kick-started a film franchise that only improves with age.... B- ...",
    "50": "Lacking any real magic, Harry Potter was a lifeless film, composed of a plotless story and forgettable performances. While watching the Neverending Story last night, a true children's classic, it really hit me how wonderful a movie Harry Potter could have been if only they'd been willing to deviate from the book for a second.I give this long, convoluted mess 1 out of 10.",
    "51": "This Harry Potter movie is my childhood, but also my favorite one, like the heroine so cute",
    "52": "Hurrendous! Daniel Radcliffe absolutely destroys this film. He has no experience and he loves and enjoys himself far too much for anyone else to enjoy the film. The facial expressions, the looks and the lack of acting capability was so tragic it wasn't funny! Emma Watson and Rupert Grint gave decent performances. And Maggie SMith ruled supreme. A few good moments but the lead star dragged the film down so much it was unbearably bad! Sorry a 3. Plot was pathetic and Daniel wrecked it!Some magic and feeling was in the film. And the film was attempted at a low success rate. Better lead role and the points would come rolling in. However I cannot possibly do that. Children and families seemed to like it but I just think parts of the film could have been achieved better.",
    "53": "One of my favorite books, unfortunately the movie doesn't keep up to the standards. Also disheartened by mediocre performance by the main actor, Ron and Hermione are really good though. Did not like the actors caster for Fred and George as really doesn't go with the impression one would get of those two from the book.",
    "54": "Who hasn't fantasized about receiving a letter of acceptance from Hogwarts? The author and the filmmakers are too good, and they have created a whole new world.What attracts me most is the charm and novelty of magic, the magical 9 and 3/4 platform, the wonderful magic school, the lively small partners and so on, all of which make me surprised and surprised.",
    "55": "It's always the best memory of my childhood. I'll always believe that I also received the admission notice from Hogwarts, but the owl lost his way and didn't find my home",
    "56": "The magic world of Harry Potter has brought so much splendor to me as a child. The movie is based on the novel and constructs a magic world. Courage, friendship and family are all very touching.",
    "57": "I've read all the Harry Potter books and really liked them. This movie pales in comparison to the books.  Too much is left out of the movie, especially the ending.  The book shows how all 3 kids overcome the challenges by doing what they are good at. And the movie leaves some of that out.  The kids were awful actors.  They must have cast the cheapest kids they could find.\nDumbledore was what I pictured from the book. I also liked the Gobulin Bank, the mirror, and the hidden alley.  It was pretty much like the book. The special effects were good, but that doesn't make up for the slow pace of the movie.  Time just flew by when reading the book.  The quiddick match wasn't that great in the movie either.\nFINAL VERDICT: If you don't want to be disappointed, then just read the books.  But if you must watch the movie, watch it on tape so you can stop it to take some breaks because you will need some to be able to stay awake during its slow moving pace.",
    "58": "Before I entered the cinema I was a little worried that the book may have been picked up and messed around with by the Hollywood machine and the film pushed out the end, But to my amazement they have kept almost the same. Several little bits were missing, like the absence of the poltergeist which I thought may have been quite fun. But a mystic magical adventure not to be missed!",
    "59": "This is the best harry potter film, it's great. it's so fun and i don't have much to say because i love it!",
    "60": "I was very impressed by Harry Potter and the Sorcerer's Stone. I had read the book a year prior to the film release and was very impressed by how close the film was to the book, only skipping a few things for time. The things the movie skipped on wasn't enough to make the film unworthy to watch.If you haven't seen the film yet, but have read the book, I highly recommend this film. The acting is brilliant, the direction is great and the scenes are so close to what you will remember in the book. Director Chris Columbus really impressed me with this film.I give it a 10/10.Love Always & Blessed Be, Xander Trotter",
    "61": "I'm from 1996, so I grew up with the Harry Potter films, it's been a while since I watched them and these two and a half hours go by very quickly. Wonderful film and very enjoyable to watch, as much as I don't like starring roles, there's no way I can't not love these films (with the exception of the films after Half-Blood Prince). My favorite Harry Potter characters are Snape, Hermione and Luna. I had never watched any of those deleted scenes that were included where I watched it this time and it was a pleasant surprise. Professor Quirrel, who was a type of antagonist in this film, fulfilled his role well. I don't mind the dated special effects. Film Watched on September 9, 2023.",
    "62": "It's a movie made for people who think that magic is cute and fun.  If you're a fantasy fan like I am, and believe in magic (in a fictional sense) then you may very well detest this movie, as I did.  Magic comes easily to little Harry Potter, who has no personality to speak of except that he is occasionally sad that he never met his mum and dad.  Years of abuse and neglect have left not a mark on him, so when he gets invited to Hogwarts Academy of Magic, he has nowhere for his character to go.  There he flies around on his broomstick and gets to be a big hero quite by accident without ever confronting any serious obstacles or anything resembling a plot.  In all this, the film is an excellent adaptation of the book, which also thought that magic is cutesy wootesy.",
    "63": "The day I went to see this movie in the cinema I can remember very well. The film was from 2001 and in those days I was 7, so it was one of the first movie's I saw in cinema. If you are the young you can't remember anything so a movie must make a very good impression on you. If it wants to be good. There was one scene in this first movie that I will never forget. It made such a big impression on me. It was were my love for Harry Potter started. Hogwarts was in a way a safe place for me, and the magic really hit me. And it still does today. This scene that impressed me so much was when the audience could see Hogwarts for the very first time on screen. You just saw this massive castle, in that was so impressive; I actually can't put it into world how enthusiastic I was. The children were sitting in the boats effortlessly and were floating over the water. The castle had something magical and I was sure I would never forget it.I think this shows that Chris Columbus was a very great Director. He really brought the magic over on screen. I still think Chris Columbus was the best choice to make the first two films. His ambition and his effort were incredible. I have a lot of respect for this man on the way I made this film. And at times it wasn't easy. The biggest part of the casting were children of the age of 11 years old. And he always needed to be calm, never he lost his temper or his patience. He kept holding on to his job. And most important he really wanted it to be good, so if Rowling had any critics he really wanted to change it. Those reasons are for me the reason why he was the best man to do the first two films. I had loved to see him doing the whole series.But more about that in my review on Film 3: prisoner of Azkaban. People sometimes forget that when they start making these movies they had to start everything. How does it sound when someone waves his wand ? How does the Hogwarts uniform look like ? How does wands look ? Etc. There were so much questions that needed to be answered, I think Chris dealt with that on an incredible way. He is certainly one of my Childhood heroes.The pressure of the filmmakers was so big especially because of the casting of the characters and the look of the magical world; Hogwarts, Diagon Alley. The fans had certain wishes they really cared about the books and wanted it to be perfect. The filmmakers must have felt this pressure I am almost 100 % sure of that. So David Heyman (producer) and Chris Columbus had to cast the characters and as a fan I couldn't wish for a better casting. I most enjoyed Richard Harris as Albus Dumbledore. He did such an impressive job and it is so sad that he died. He was perfect for the role.That's the same for Alan Rickman as Severus Snape, Emma Watson as Hermione Granger , Daniel Radcliffe as Harry Potter. Actually I can go on and say it about the whole casting, because they were perfect. We, fans, had the best cast, the best directors, producers we could wish for in a franchise. And I really can't be more proud than I am now it is over. On the first film those actors did such an amazing job. And David Heyman and Chris Columbus did such an amazing job for the casting.The storyline is something really important in a film. And I am just not very fond of Steve Kloves. In the first film he surprisingly did a good job and that's why, combined with casting , the first film is one of the best in the series. Sometimes you need to leave your favorite parts of the book and make selection to include only the most important. Steve Kloves did a very good job in the first movie but had of course help of J.K.Rowling. The thing I was a little disappointed about was that some lines that were meant for Ron were said by Hermione. This was because Steve liked the character Hermione. And I think that isn't necessarily at all. Because things characters say can develop characters, or show how characters are. It is very clear that the first movie is a very mysterious film you didn't get the answer immediately. For example when Harry looks at Snape for the first time. On the other hand there is a very good character development not only through the whole series but also in the first movie. Something that belonged in the story was how Prof.Quirrell got in touch with Voldemort ? I mean this is the most important question in the first film and is explained very good in the book. But you didn't hear Voldemort or Quirrell talk about how this happened. How did Voldemort get inside his head ? I rate this film 10/10 just because; as a fan I couldn't wish for a better start of the film series based on those books. I think the movies should never be remade, because Filmmakers will have the right, then to do whatever they want. To change certain things. A lot of remakes went wrong because filmmakers didn't respect the original source of the story. We should respect the effort the directors, the actors and everyone who worked on Harry Potter throughout the series had in this films. I absolutely Believe this story's; the books and this films are Timeless. People of all generations can grow up with this. Although not the same as the original generation. They can grow up with Harry, and watch these films. It was absolutely unforgettable.",
    "64": "Surprisingly good. I haven't read the books, and have no intention of reading them, so didn't know what to expect. Mostly thought this was just for kids or nerds. In some respects, it is, but it turns out it had a decent plot, is well-directed and well acted. Good fun.Unfortunately, the remaining movies didn't come close to the first. Second was OK, but really didn't have the novelty of the first. The first created the template, the following just used it over and over. From the third it was just for kids and nerds, as I initially suspected.",
    "65": "What's wrong with this film? Children, magic, and tone.1. Children. Any film that has children in it is in big trouble. Children on screen tend to be irritating, and this film is no exception.2. Magic. Magic alone is a problem, because magic is essentially deus ex machina. And there is nothing more destructive for a film than deus ex machina. People hate that. If they all use magic, and magic can do anything, then what is the point? How can you even get involved in a scene when you cannot anticipate anything, other than the fact that the hero will eventually come up with some spell to get him out of the jam? Moreover, the film is so obsessed with the magical, that magic becomes tedious. If every room and every object is enchanted, then the whole magic is gone. If everything is magical, nothing is magical. Thus the overuse of magic works against the film.3. The tone. The film starts as a children's adventure, but then introduces inappropriately sinister elements. This is particularly clear in the sequels, and there is a clear progression with each sequel. This is a huge weakness, because a film should never waver on the tone. You cannot expect the audience to shift from a children's film to a dark monster film. Is it for children, or is it for older audiences? The children will be scared by the monsters, the older audiences will be put off by the childishness. I absolutely hate he tonal mess that persists throughout the films.Final verdict: I would avoid this franchise.",
    "66": "Pretty decent movie but I think the book is better",
    "67": "**SPOILERS**Before I briefly state my views, I must confess that I have never read a word of or even picked up a Harry Potter book in all of my life. I had many friends rave and rant about them, and at my work, I often see my co-worker's kids sitting in corners, waiting for their mothers to take them to school, reading the latest chapter in the series enthusiastically. But because I have never read Harry Potter myself, I have no understanding of the series, the characters, or the plotlines outside of the world this movie has created. Therefore, this is a review for viewers like me: They haven't read the books, and they're curious to see what all the hype is about.Well....judging soley from this film, it's not about much, I can tell you.Overall, I would rate this film as either a C- or a D+. Since, if you're still reading this review, you've probably already seen the movie, I shall simply state my opinion without elaborating too much on the happenings of the film. There are a lot of cool ideas presented here....A LOT of cool ideas. In fact, I am not ashamed to state that every idea presented was involving and a work of genius....masterpieces to themselves. For the first hour, I was completely engrossed in the world that this movie had created...indeed, this was a magical movie. From the moving stairs to the floating candles and the interacting paintings, this was the stuff of a master artist. Just the goblins set the film apart....never have I seen a film-creature look so convincing.Unfortunately, after a while, the wonderful pictures get bogged down and dull due to the absense of a storyline. There was no story or plotline to give this film a firm foundation to stand upon....nothing to move these wonderful ideas that I was watching along. As a result, the move becomes a patch-work of cool-looking ideas, but with no backbone or soul behind them. Eventually, since there is no real storyline, the film just gets old and boring, regardless of how neat the pictures are. I wasn't the only one in the theater drawing these conclusions...indeed, about 90% of the audience were all children, and in the final hour, they were all chattering away to each other, ignoring what was going on in the film, and I could see the parents around them glancing at their watches.In the last twenty minutes or so, a plot is finally found, but it's so painfully contrived....so cliched and predictable, that it hurts to watch it (i.e. \"You defeated your enemy with love;\" Harry's team winning all the points and earning the trophy, etc.).  This is a pity, because the plotline seemed to be good, and if the director had just cut the film's length in half and spent more time developing this story, we could have had a real winner on our hands, on par with other children's fantasys like \"Wizard of Oz\" and \"E.T.\"Veteran British actors such as Richard Harris, Alan Rickman, John Cleese, John Hurt, and Maggie Smith are wasted in throw-away roles, though the lead youngters certainly aren't bad.All in all, a dissapointing effort, made even more dissapointing by the fact that there were so many likable qualities to it, among them the ideas presented and the visuals achieved, which set it apart from any other film of its kind. Watching this film has not motivated me to read the books; however, I shall certainly be in line to watch the second film. Hopefully, with a better story for the viewer to follow, the visually and undeniably magical world of Harry Potter will be a truimph the second time around.*1/2 out of ****",
    "68": "A classic is a classic. You can't get enough of it. The magical magic school really thought it existed before, and especially envied the students who could study at the magic school. Harry Potter is kind and brave and fights Voldemort with his friends. The little actors in it are so cute",
    "69": "Sure, the special effects are somewhat dated and the lead trio's performances are still to be improved. Nevertheless it's easy to see how the first movie charmed audiences worldwide with its sense of awe, wonder and joy. With a horrifying villain and complex central mystery, 'Sorcerer's Stone' is an easy film to recommend, with scenes that remain iconic to this day and a simple 'dark vs light' dynamic that works very well.",
    "70": "I reviewed this film about a year ago when I had seen it for the first time and I said that I liked the book more but the more I see this film I have discovered that I like the movie just as much as the book.  I think that Harry Potter is such a great book and movie series.  I personally love the fact that they started making the movies because now along with my visualizations that I have, I also have the visualizations that go along with the movie.  I can't wait until Harry Potter and the Prisoner of Azkaban(my favorite out of all the books) comes out, I believe that it will be the coolest book to see on the big screen.",
    "71": "'Harry Potter And The Philosopher's Stone (2001)' is starting to show its age in a few areas - though, the majority of special effects still hold up remarkably well. The young actors have certainly come a long way since this first outing, but this is still an entertaining and endearing experience that's as enchanting as it is exciting. It does a great job of setting up the vibrant 'wizarding world' of which we're all now so familiar, it has some fantastically interesting concepts and well-executed ideas and it is surprisingly funny at times, too. While it may now be perhaps the 'worst' in the series, aside from the 'Fantastic Beasts' spin-off stuff (which doesn't really count, of course), it is still a wonderfully charming and enjoyable ride that's better than most of today's blockbusters. 8/10",
    "72": "The first Harry Potter movie is also one of the best in the series, partly because it sticks to it's source material. Columbus doesn't try to condense the movie to make it more appealing to non-fans but instead pleases the already enormous Harry Potter fanbase with a faithful rendition of the HP world. Columbus should get much praise for the focus on the movie's setting. None of the sequels ever brought Diagon Alley or Hogwarts to life like this movie did. The movie is indeed aimed more towards the hardcore book fans, and perhaps, children, then adults and non-fans. Several parts that could have been skipped were still included to please fans, and the Sorcerer's Stone almost never strayed from it's source material. Scenes like the quidditch scene were not particularly relevant, but helped build the setting and definitely pleased the audience.The casting is great, fans found Hagrid and Dumbledore to be exactly how they imagined them. While Alan Rickman was probably not the Snape described in the books, he does brilliantly. As for the child actors, I've seen better, but they did their job's solidly. The soundtrack is easily the best in the series.Overall the Sorcerer's Stone is a great foundation for the series. It's too bad that later installments strayed so much from the tried and true formula that worked here.8/10",
    "73": "This film is the best kids film ever and I never get tired of watching. It just gives that warm fuzzy feeling inside and I'm smiling like an idiot throughout. Each time I see it i notice something different. Thanks to JK Rowling for giving me and my son a bond for life. I can't imagine a life without Harry Potter in it.",
    "74": "There is a major difference between reviews here and this is very easy to explain. Anybody who (like me) has read the books multiple times, knowing the slightest details and loving absolutely everything from the series, can´t be completely happy with the film. For the neutral watcher who read the books maybe once or not even at all this movie must seem like a really entertaining and well directed film. The problem is that though very good acting, especially Alan Rickman as Snape, a beautiful scenery and very good camera work, the most important essentials of the books are pretty much non-existing. For instance, I, as an hardcore fan since the first time reading the books when i was 9, was always extremely interested in reading a passage of a normal school lesson or a normal day at any job of an fully educated wizard, eg in the ministry of magic. Rowling made us have the desire to always experience more of the universe she created. I was always amazed by the lightness and uncomplicated way of Rowlings writing, how she managed to let us accompany Harry in his daily life, making the actually extremely strange and funny way of the magicians life seem so normal and casual for the readers. The film on the other hand is more of a build-up to Harry´s first encounter with Voldemort, a scene that´s perfectly directed with impressive effects and good filming, which is definitely the highlight of as well film and book, with the difference that the book is more focused in describing Harry´s adventrous first year as a whole. The film is a little bit inconsistent in terms of how close it sticks to the book´s plot and this is another problem. Because of the book being so comprehensive and full it is nearly impossible not to skip any sections of the book. In my opinion the screenwriter should have either sticked closer to the book or distanced the filmplot more from it. Another thing i miss is the great dry humour the book is spiced with in a lot of ways. The problem is that this can´t really be translated in the movie because it´s often in the way Rowling describes things and not only in the dialogues. One thing that is awesome is the music. In my opinion John Williams is the best film music composer and the way he captures the mysterious and thrilling atmosphere and the majesty and greatness of Hogwarts is marvelous. At the end I can say that the film can meet the expectations but it´s just not possible to convince a haerdore fan completely, just because while reading the book, everybody creates his own picture of Hogwarts, the characters and the scenery. This is called imagination, it is the best part of reading a book, not possible to be translated completetly satisfyingly into a movie and the reason to my big recommandation concerning Harry Potter and also every other book which is filmed. Read the book first! If you watch the film first and read the books afterwards you´ll miss a great time imagining everything for yourself. And this will come espescially pronounced in the books of Harry Potter.",
    "75": "The Harry Potter series has always been my favorite magic movie. I am a fan of Emma Watson, and I watch every movie of hers. I love Hermione so much. It is a pity that this movie was not seen in the cinema. The storyline is very restored to the novel, continuing the level of the previous few",
    "76": "This one of the best book to movie adaptation than anything else",
    "77": "Harry Potter is a child left at the door of his uncles' house after the early death of his parents by a bearded old man, a small giant and a cat woman when he was just a baby. He is a green-eyed boy who wears split glasses and has messy black hair. He also had a special feature, a ray-shaped scar on his forehead. The uncles hated him and treated him very badly. He slept in a cupboard under the stairs and was constantly badly treated by his fat cousin. One day they went to the zoo and Harry trying to talk to a snake made the glass disappear without knowing how.A few days before his 11th birthday Harry begins to receive mesterial letters brought by owls. The bad uncles do not let him receive the mail, and in one that the house fills with letters, the uncle picks up everybody and flees to an island and they spend the night in a tent. The next day will be Harry's birthday and at midnight a very tall man will break the door and say harry your a wizrd and take the boy with him. Before, he still gives the cousin a pig's tail for trying to steal the cake he brought to Harry.The man tells Harry everything he did not know, that he was a wizard and would study at the best school in the world, hogwarts, for boys like him. He takes him to the witch market to buy material and a wand where we learn that the wand chooses the wizard and harry was chosen by the sorcerer's wand that killed his parents and tried to kill him but he failed and no one saw him again. That's why harry is famous in the wizarding world, because he escaped one of the greatest dark sorcerers of all time and survived with only that ray-shaped scar on his forehead. That man was Voldmort but everyone was afraid to say his name and only called him you know who or the one that shall not be named.When he goes to try on the robes he meets his future nemesis. A blond good looking boy with pure blood family that was not very nice. Next they go to the Gringotts bank and Harry discovers that he is rich and his parents left him a huge fortune. They also went to another vault, where Hagrid, the little giant, had to fetch a special package at the request of Dumbledore, who according to Hagrid was the greatest sorcerer who had ever existed and was also the director of the school of magic. Hagrid also comments that only a fool would assault the bank, as it was very safe.Hagrid leaves Harry at Kings Cross station alone and tells him to take the 9 3/4 platform. Harry does not find this platform, but notices a large family running against a pillar and disappears through it. The mother of the family understands the boy's confusion and helps him. Harry runs against the pillar and quickly crosses to the other side, where he arrives at a new station, where there was red train ready to take him to school. He packs his luggage and goes inside, where he sits in an empty compartment. Shortly afterwards, the youngest boy of the family who has helped him arrives and asks to sit there while Harry nods. His name was Ron Weasley. And as his family he was a red head. Harry also buys all the candy of the candy lady and share wiith his new friend.",
    "78": "I have never read the book this film is supposed to be based on, therefore, I can only judge this movie by itself. And there is not much to judge. I quit after 40 minutes or so and I have no regrets. The acting is ... well, it's not there. The script is a fairy tale, which takes itself way too seriously, making the story as dull and predictable as possible. The camera work is so standard, you can predict the angle of the next shot. What can I say - I just hope the book is better, since many kids like it. I would have given it 3 out of 10, but the wasted budget and the hype take their toll... 1 out of 10. A disgrace.",
    "79": "The Richard's kick off This phenomenal franchise Of you-know-who's tale~jodawa.",
    "80": "Harry potter is a pretty good movie. It has fine cgi, very good world building lovable characters, great acting, etc. The only real problem with the movie is the drawn out ending, which was super boring and filled with plot holes.That said, I recommend this movie to everyone.",
    "81": "This movie was my first introduction to Harry Potter. Seeing it in the theater with a few of my cousins, I didn't know what to expect. What I got was a fairly enjoyable, though overlong, movie that kept me interested until the end. I was pleasantly surprised by the surprise ending; I remember going through the film thinking about the one dimensional plot, and I actually didn't see the ending coming.Daniel Radcliffe does a good job as Harry, but the scene stealer's are Ron and Hermione. Still, I would not consider it a great film. The special effects are impressive (especially the quiddich match), and the adult actors do a good job (especially Alan Rickman as Professor Snape), but in some ways it feels like a commercial, advertising for Harry Potter video games, toys, and the books.Good for a rental, but I wouldn't buy it.",
    "82": "There's nothing like the first in a series, is there? The introduction to the characters, the immersion into the fictional world, the first time you laugh, cry, care, and fear for someone's safety can never be repeated. No matter how many Harry Potter movies they crank out, or if they ever remake them in the future, none will come close to the wonderful first film, Harry Potter and the Sorcerer's Stone.I'm sure everyone has their own childhood memories of reading the Harry Potter books that they'll tell their grandkids about, but I'll never forget going to see the first movie in the theaters. The lights dimmed, John Williams's perfect theme played its first notes as Richard Harris walked down Privet Drive, and everyone in the theater was transported to another world. John Williams's numerous themes, all wonderful and a personification of the wizarding world, took the early movies to another level. As other composers tried their hands at the later films, that quality was missing. There's something truly special about going to see this movie on the big screen, and while the \"magical\" qualities might not all be credited to the music, it's certainly one of them.Welcome to the world of Harry Potter, where if you're a ten-year-old kid who doesn't fit in, you might get a letter delivered by an owl telling you you have magical powers and should go to a special school to hone them. Believe it or not, there are people who watch this movie without reading the books, so a bit of description is necessary. Obviously the stars of the show are the children, who were selected out of millions of other kids to be able to memorize lines, not look in the camera, endear themselves to worldwide audiences, and hopefully act. Daniel Radcliffe, Emma Watson, Rupert Grint, and Tom Felton are so cute and tiny in this first movie, you'll undoubtedly find yourself re-watching it as the years pass just to see them as kids again. I always marvel that child actors train themselves not to look in the camera, so even if their performances aren't perfect, I cut them slack, knowing firsthand how hard it is. And these kids had to dress in funny costumes, recite incantations without laughing, and pretend they're looking at things that were added in post production!Usually, in kids' movies, there's a grown-up or two who add to the cast and make the adult audience members feel less silly that they're watching it. In the Harry Potter movies, everyone wanted to be in them! Throughout the series you'll see a host of familiar faces as \"guest stars\" but the regulars will make special places in your heart. Richard Harris, Maggie Smith, Alan Rickman, and Robbie Coltrane are household names for little kids, because they're so convincing as the kindhearted Dumbledore, the wizened but sentimental McGonagall, the endlessly mimicable Snape, and the jolly Hagrid, kids today can't imagine they've had any other career prior to these movies! Is there any kid who doesn't immediately attribute the word \"earwax\" to Richard Harris, point out striped cats as \"Maggie Smith cats\", mumble \"Shouldn't have said that,\" when they make a mistake, or practice putting pauses in their sentences like Alan Rickman?First movies are so special, since they introduce audiences to a world that will hopefully capture their attention for however many more movies will be made. In J.K. Rowling's fantasy world, there's so much to fall in love with; and in the film adaptation you can really believe it exists. Seeing the Hogwarts structure for the first time creates a special feeling in your heart that can only be recaptured by watching the movie again or going to see the next in the series. The Great Hall, Quidditch, the Sorting Hat, talking portraits, flying lessons, selecting the perfect wand-all these Harry Potter moments are perfectly recreated in the first of a series that saw an entire generation grow up buying toy wands and trying Bertie Bott's Every Flavor Beans.Each installment has its special moments, and this first one has quite a few, even outside of the exposition. If a three-headed dog doesn't immediately conjure the name \"Fluffy,\" chess pieces have never come to life in your imagination, you don't laugh at the idea of counting your birthday presents, and you don't know what Richard Harris wants most in the world, you're missing out on one of the great joys in life. If somehow 2001 passed you by without a trip to the movie theaters Thanksgiving weekend, go find yourself a copy of this iconic, lovely movie.",
    "83": "Once upon a time (and not that long ago), in the vivid, fertile imagination of author J.K. Rowling, a character was born:  A boy.  A young boy named Harry, who was destined to become one of the most beloved characters to emerge from a work of fiction in a long, long time, and was quickly embraced by young and old alike in all corners of the world.  And now, thanks to the magic of the cinema, Harry and his companions fairly leap from the pages of the novel to the silver screen in the phenomenal motion picture, `Harry Potter and the Sorcerer's Stone,' directed by Chris Columbus and written for the screen by Steve Kloves.  Indeed, Harry Potter is a boy, but not just any boy; because Harry (Daniel Radcliffe) just happens to be a wizard.  But, orphaned as a baby, Harry has been raised by his Aunt Petunia (Fiona Shaw) and Uncle Vernon Dursley (Richard Griffiths), who never let him in on the fact that he was, well-- what he was.  It seems that Petunia didn't approve of her own sister-- Harry's mother-- because she was a witch; nor of Harry's father because he, too, was a wizard.  When Harry turns eleven, however, the secret is out of the bag when-- after some strange goings-on-- a giant of a man named Rubeus Hagrid (Robbie Coltrane) shows up at the Dursley's door to collect Harry and take him off to `Hogwarts,' a school for wizards and witches and all who would perfect the gift with which they were born:  The gift of magic!  And from the moment Harry boards the train (from station platform nine-and-three-quarters) that will take him to his destiny, the magic is alive-- for Harry, and for the audience, as well; and it's a journey you will never forget.\tWhat a monumental undertaking to even think of attempting-- translating and transferring this passionately beloved work from novel to the screen. Because to millions of people, Harry and his companions are so much more than merely characters in a book; these are characters for whom people have made a special place in their hearts, which puts a great burden of trust upon the man who would attempt to bring them to life.  And Chris Columbus, it turns out, was the right man for the job.  More than rising to the occasion and with some magic of his own-- and a lot of help from an extraordinarily talented cast and crew-- Columbus has delivered a film that is not only true to the story, but true to the very spirit that makes Harry Potter so special.  The special effects are absolutely beyond astounding, and Columbus, with a keen eye for detail and without missing a beat, keeps it all on track and moving right along at a pace and with a sense of timing that makes this an absorbing, thoroughly entertaining and enjoyable experience from beginning to end.  From the opening frame you get the feeling that you're about to have a singular experience; and you're right. Because you've just entered the world of Harry Potter.  And it's magic.\tEven having the best special effects do not a great movie make, however, and this film is no exception; what catapults this one to the top are the performances, beginning with Radcliffe, whom you quickly forget is an actor playing a part.  And that about sums up what kind of a job this young man does here.  Without question, he IS Harry Potter, physically and emotionally, and when he waves his wand and does what he does, you believe it.  A wonderful performance by a gifted actor who has a great career ahead of him; without question the perfect choice for the role of Harry.\tAlso turning in excellent performances are Rupert Grint as Ron Weasley, and Emma Watson as Hermione.  As with Radcliffe, the casting here could not have been more perfect.  Grint is `Everyboy,' with that special glint in his eye and a manner that makes him especially endearing.  And the spunky Watson adds some real sparkle to the film as Hermione, the one with the sense of urgency and the wherewithal to get things done; a real role model for young girls everywhere.\tIt's obvious that a lot of care went into the casting of this film, and it's a big part of why it is so successful.  Richard Harris, as Headmaster Albus Dumbledore; Maggie Smith as Professor McGonagall; John Hurt as Mr. Ollivander; Ian Hart as Professor Quirrell.  Exceptional performances from one and all, with two that stand out as especially memorable:  Robbie Coltrane, who readily conveys the fact that Hagrid's heart is of a size that matches that of the man; and Alan Rickman, as Professor Severus Snape, deliciously droll while demonstrating menace through the fine art of articulation.  \tThe additional supporting cast includes John Cleese (Nearly Headless Nick), Warwick Davis (Professor Flitwick), Julie Walters (Mrs. Weasley), Zoe Wanamaker (Madame Hooch), Tom Felton (Draco Malfoy), Harry Melling (Dudley) and David Bradley (Filch).  From Rowling's imagination to the written page to real life (albeit via the movie screen), `Harry Potter and the Sorcerer's Stone' is a triumph many times over; a unique film of truly universal appeal, the likes of which is as rare as, well-- a sorcerer's stone.  A film in which adults and children alike will rejoice, because it speaks to the heart in a universal language of life, love, experience and imagination; a film that states unequivocally that magic exists-- as long as there's a single child with a single dream somewhere in the world, and real wizards like J.K. Rowling, Chris Columbus, Steve Kloves and every member of this wonderful cast and crew around to bring it to life as they have here.  An instant classic in every sense of the word, this is truly a film for the ages.  A remarkable achievement, this IS the magic of the movies.  I rate this one 10/10.",
    "84": "Ah, the first film adaptation of the beloved Harry Potter series. Harry Potter is an 11-year-old boy who comes to find out that he is a wizard. He lives with his uncaring Muggle (non magic) aunt, uncle, and cousin since his parents died when he was a baby. They were murdered by a dark and powerful evil wizard named Lord Voldemort. Harry would be dead too, but was miraculously saved, making him something of a legend. Upon learning of his guarded magic roots, Harry gets enrolled in Hogwarts- a British school for witches and wizards. While there he learns to come into his own, meet people that are actually good to him, and learn more of his dark past. Looking back, I don't know if it was a good idea to have Chris Columbus direct this, as he does have a reputation for being something of a hack, albeit a decent one. I think his direction is okay here. Yeah, retrospectively it could have been better, but it could also have been much worse. At least with him at the helm we get a good amount of whimsy to go along with a bit of menace, and that's a good thing, as the book was likewise not too heavy on the darker stuff (though that sure changed as time went on). Many liberties are taken, which is weird since the book is quite short, and the film is two and a half hours. It does get the point across decently enough though, and also works as a piece for those unfamiliar with the source material. John Williams provides great music, there's wonderful art direction and set design, and there's some nifty set pieces too. Featuring an all-British cast, this film is impeccably cast, and the performances are good too. Finding decent child actors is hard, but they really scored here. My enjoyment of this movie has waned over time, but it's still not a terrible piece of work by any means, so check it out.",
    "85": "I watched this movie first time when I was left with no choice. My expectations were extremely low as I always wondered if Harry Potter books were over-hyped. How-ever after watching the movie it did make me a Harry Potter movie fan. And needless to say - this continues to remain my favourite of HP series. That brings to a point here.... the effect of expectations over a movie. True, expectations reduce joy.Without going into the story I would certainly say Chris Columbus churns out a perfect pot-pourri of emotions, suspense and magic, delivering something appealing to all ages.Every character brought to life on screen has done justice and leave an impression on you. Particularly notable performances by Emma Watson and Alan Rickman.CGI are in plenty and made good of. The Quedditch game is picturised amazingly. The wizard's chess is treat to eyes.Let's hope that the forthcoming HP series carries the similar magical touch.",
    "86": "I really liked this film, but I much prefer the book, which has a lot more magic and wonder. Daniel Radcliffe is very likable as Harry, and he is given solid support by a funny Rupert Grint and a good Emma Watson, though she was annoying at times. The scene stealer was definitely Robbie Coltrane; I actually can't imagine anyone else playing Hagrid, Coltrane was just hilarious. Alan Rickman and Maggie Smith were also great, but for me the standout was the late Richard Harris. Now I much prefer Harris's interpretation of Dumbledore. He was soft-spoken, and actually fitted the part better. Both of these qualities were lost in the interpretation that Michael Gambon gave. I am not saying that Michael Gambon was bad, he just wasn't my ideal choice for Harris's replacement. The film is fairly faithful to its source material, and looks very beautiful. However, it is a bit long, and very young children may find Voldemort too frightening. I know because I have triplet brother and sisters who saw it, and couldn't sleep for about a month after viewing. In conclusion, a very good film, well performed and quite dark. 8/10 Bethany Cox",
    "87": "I enjoyed this movie immensely. But, like \"The Phantom Menace,\" I've had a very hard time viewing it objectively. There was so much anticipation leading up to its release, I simply enjoyed the experience of being there. Having read all four books in the series a few times each, I am overly familiar with the events in the story. As I watched the movie, my continuing thought was \"How well will the next part of the story be translated to the screen?\" rather than \"How entertaining is this film overall?\" I have trouble answering the latter question because I was already entertained by watching a wonderful story dramatized, so I'll never know how I'd have reacted had I seen this movie without having read the books.Critics talk about how incredibly faithful the movie is to the book, and perhaps I'd have had an easier time detaching the two in my mind had the movie set off on its own course. Indeed, many classic children's movies, like \"The Wizard of Oz\" and \"Mary Poppins,\" are so successful partly because they're so different from the books that inspired them. But these are exceptions; in my experience, most children's movies reveal their weaknesses in how they diverge from the books upon which they're based. And much of what makes the Harry Potter phenomenon unique is that it is the first time in ages that a children's book, without a movie accompanying it, has generated this much popularity. According to an article I read a year ago, the universe of Harry Potter has become as real in the minds of youngsters and adults as that of a popular movie series like Star Wars. Therefore, it will be very hard for any film based upon it to compete with it. In the minds of die-hard fans, any changes made to the story will be seen as desecrating the fantasy world that Rowling created. That's why it's easy to understand why the filmmakers were so reluctant to change anything.As a faithful rendering of the book squeezed into a two-and-a-half hour period, the movie is beautifully done. I don't have a single complaint about any of the actors, who successfully bring to life, with the aid of costume design and special effects, the many colorful characters from the book. My favorite character, the giant Hagrid, is played by Robbie Coltrane, and I say with no exaggeration that he is exactly how I imagined him while reading the book. It's as if they took the image in my mind and transferred it to the screen. While I had my own personal image of Snape (for some reason, I always imagined him as the head villain from another Chris Columbus film, \"Adventures in Babysitting\"), Alan Rickman is perfect in the role. I usually expect to have words of criticism for some performances, but I just don't. The remaining adult actors, including Maggie Smith as Professor McGonagall and Richard Harris as Albus Dumbledore, are as good as they possibly could be, and the kids do an excellent job of holding their own against these veterans. Some have criticized Daniel Radcliffe for appearing too subdued in the title role, but that's exactly how the character is portrayed in the book: modest, unassuming, and laid-back. The kids who play Harry's two best friends are flawless.I had a lot of worries about the fact that it was being directed by Chris Columbus, whose entire directorial career so far has consisted of over-the-top slapstick films. I was pleasantly surprised that he did not direct the Harry Potter film in this way. Except for brief moments like the children's delayed reaction to a giant three-headed dog they encounter and Harry's swallowing the quaffle ball, there is nothing here to remind us that this film is directed by the same person who gave us films like \"Home Alone\" and \"Mrs. Doubtfire.\" Indeed, I think Columbus may have gone just a tad bit too far in trying not to make the film seem cartoony. I would have liked to see a little more emotion on the actors' faces at certain times. Overall, however, his restraint works nicely in giving the film the kind of believability the book possesses.But much is left out. Harry's caretaker Uncle Vernon, a prominent character in the book, is given less attention in the movie than some of the bit characters. The gently satirical aspects of Hogwarts School aren't in the movie at all. We never see the ghostly history teacher who died several years back but kept on teaching. Lines like the following--\"Professor McGonagall watched [her students] turn a mouse into a snuffbox--points were given for how pretty the snuffbox was, but taken away if it had whiskers\"--find no equivalent in the movie. The movie does include platform nine-and-three-quarters, though the way the kids disappear into the wall isn't as mysterious as I had visualized, and the sorting hat is there, minus the great poem explaining the differences between the four schools.Not that I'm blaming the movie for omitting some details. Some things from the book would not have translated easily to the screen, and it would have been very difficult to stick everything in. Had Columbus done so and allowed the film to be as long as necessary (eight hours, maybe?), like a BBC miniseries, the film might have been a masterpiece, but few kids would ever have had the patience or attention span to sit through it.The problem is that the amusing details are much of what make Harry Potter such a special story. A whole universe is created in Rowling's series, in which a magical society exists within our own ordinary \"muggle\" world and is kept secret by a bureaucracy with its own rules, history and politics. The way magic is treated in her books, not as something medieval but as very similar to the way our own contemporary world works, is a large part of their charm. Take away these details, and you're left with a fairly conventional tale of a young wizard fighting an evil sorcerer.Although the audience I was with broke into applause as soon as the movie ended (something I've never seen happen before, though I don't go to the theater that often), some people have complained about the movie dragging at certain points. I didn't have that problem, but, as I said, I wasn't really trying to get involved in the movie's story. After thinking about it, it does seem like parts of the movie fail to convey a sense of urgency. Why should this be? I never felt that way when reading the books, and this is without a doubt the very same story.The answer, I think, is that the books portray much of Harry's anxiety in trying to succeed in school (for if he's kicked out, he'll go straight back to his horrible uncle) and fit in with the kids there. The movie doesn't tap into these anxieties enough, so why should we care whether he wins the Quidditch match (other than that he survives in one piece) and gets through the school year? The only real suspense in the movie after he arrives at Hogwarts comes from the story of Lord Voldemort returning, which in the book is almost secondary. Harry's adventures getting along in the school are fun and interesting, but as they are presented to us in the film, there isn't enough tying them all together.What we have here is a serviceable dramatization of a wonderful children's series, but it doesn't entirely succeed in standing on its own. Perhaps it should have diverged from the book just a little, to compensate for the difficulties in translating some of the book's delights to the screen. In its current form, it's almost like a preview of the book. Its lack of fullness, and its dependence on the book, might actually increase the popularity and endurance of Rowling's series by making those who see the film yearn for more, which they can get from the real thing.",
    "88": "Harry Potter and the Philosopher's Stone is a film directed by Chris Columbus. For many years, I hadn't given a damn about the Harry Potter series. But seeing the fanfare surrounded by the series, I decided to give it a try. After watching this one, I can definitely say that I am on the verge of being a fan.Plot: Harry Potter, an orphan living with his uncle and his family is invited to Hogwarts School of Magic to become a wizard.Story and direction: I had watched this part around the time it released but never just kept in touch since I didn't understand a word. Seeing it now as an adult and a movie lover, I just fell in love with this fictional world created. The characters, settings, story, etc.. all just feel seamless. Thanks to J K Rowling, Steve Kloves and Chris Columbus who have done justice to the source material provided to them. I feel the themes are so very relevant in this film. The intricacies of those themes are valid in the current world we do live in. This is what I just exactly want from any story presented to me. Although the film is very long, I never felt bored for a single moment. And to adapt quite a huge novel comes with responsibility and precaution, which the makers completely justified. The sets are huge and awesome. You just feel you are in Hogwarts actually. Also each characters costume is just to marvel at. John Williams once again just proves why he is the composer of the century. But I did feel some flaws to the film. Being a first film, the main plot of the film comes at around the 90th minute of the film. Also the VFX of the film felt very amateur considering some great VFX was done in the years preceding this film.Performances: I would say that the casting of the film is just perfect. Applause for the casting team is deserved. Never do you feel that another actor should play the role. The kids, Daniel Radcliffe, Rupert Grint, Emma Watson, Tom Felon just to name a few are fantastic. These 10-11 year old just steal your heart. Also the other cast like Richard Harris, Maggie Smith, Alan Rickman, Robbie Coltrane make themselves likable.Favorite Scene: There were many favourite scenes in this film for me. But one scene in particular was the troll scene where Harry and Ron decide to save Hermione and after the saving Hermione vouches for the boys. This is the scene where you actually happen to see the bond solidified between the 3 as friends.Verdict: For anyone who just loves fantasy film and worlds with great visuals, this film is just for you. I assure you won't be disappointed. I plan on seeing the entire series now because I am fascinated by this world and want to see what else has it got to offer.I am going with an 8/10.",
    "89": "During my childhood, the earlier Harry Potter books got me into the franchise and especially Fantasy Literature in general. They had thought provoking writing, likeable characters, and compelling world building. Then I saw this movie adaptation of The Sorcerer's Stone (The Philosopher's Stone in the UK) back in theaters and loved it. It's not a perfect film I'll admit, but it's a very good start to a successful fantasy movie franchise.Sure, it's a bit overlong and the child performances from Daniel Radcliffe, Rupert Grint and Emma Watson, while not terrible by any means, could have used some fixing though they did get better as the later movies progressed.Everything else still holds up. The visual effects/cinematography are beautiful to look at, the directing from Chris Columbus is great, the make up designs are well built, and the music score from John Williams is enchanting and haunting especially Hedwig's Theme. Not to mention the supporting actors are great with Robbie Coltrane as Harris and the late actors Alan Rickman and Richard Harris as Severus Snape and Professor Dumbledore.Overall, Harry Potter and the Sorcerer's Stone isn't perfect but it's a very good start to the successful fantasy movie franchise after 20 years. Recommended! :)",
    "90": "To millions of children of all ages, November 16 has been more eagerly anticipated than Christmas, as the long-awaited film version of J. K. Rowling's beloved novel \"Harry Potter and the Sorceror's Stone\" hits the screen.Each of Rowling's four Harry Potter books have been critically acclaimed worldwide best-sellers, turning a generation of video-game playing children into avid readers.In translating Rowling's world of wizards and magic to the screen, the film makers claimed to be intensely aware of the fans' high expectations and had sworn to be faithful to the book.\"Harry Potter and the Sorceror's Stone\" is indeed the most loyal film adaptation of a book that this fan has ever seen.It's the story of an orphaned boy who discovers on his eleventh birthday that his parents were wizards and that he is in fact a famous and powerful wizard himself.Released from the clutches of his desperately ordinary (and non-magical) Uncle Vernon and Aunt Petunia - and their deliciously obnoxious son Dudley - Harry takes his place in the wizarding world as a first year student at the venerated Hogwarts School of Witchcraft and Wizardry.A great deal of \"Harry Potter and the Sorceror's Stone\" is an introduction to this fantastic and dangerous world and its richly drawn characters. There's not only a lot of plot to cover in this film, but an entire world to create.At two and a half hours long (hit the restroom before it starts), the film includes the book's most memorable scenes, bringing many of them to life with pure cinematic wizardry.The Quidditch match (a soccer/hockey/rugby thing played on broomsticks) is much more exciting on the screen than on the page, as is the bathroom battle with an enormous mountain troll and the larger-than-life game of wizard's chess.The frightening aspects of the book are in full force in the film, and its PG rating (for some scary moments) should be taken seriously.\nScreenwriter Steven Kloves (\"Wonder Boys\") has done a fine job of streamlining Rowling's tale while maintaining its spirit. Director Chris Columbus (\"Home Alone\") makes good on his promise to be faithful to the book. But at times the film is a bit too reverent; you want the actors to cut loose and have a bit more fun.Columbus clearly understands that fantasy works best when it's played most real. Across the board, his fine ensemble of actors are so perfectly cast that they appear to have literally stepped out of Rowling's book.\nIn the title role, Daniel Radcliffe pulls off the very difficult task of playing an introverted hero who spends most of the movie reacting to the amazing sights and events around him. He beautifully captures the deep soul and untapped potential of Harry Potter. And when this kid smiles the screen lights up.Rupert Grint is delightful as Harry's sardonic buddy Ron Weasley and Emma Watson nearly steals the film as their overachieving friend Hermione Granger. Three cheers to the film makers for giving three unknown child actors the top billing they deserve.The strong cast of veteran actors includes Richard Harris as the wise Headmaster Dumbledore and Robbie Coltrane as the lovable giant Hagrid. Alan Rickman is wonderfully villainous as Professor Snape and Zoe Wanamaker has just the right touch of girls gym teacher as flying instructor Madame Hooch.\nAs the strict but just Professor McGonagall, Oscar winner Maggie Smith seems born to play the role - and is ready for another Oscar.John Cleese (as Nearly Headless Nick) and Julie Walters (as Mrs. Weasley) have all-too-brief cameo roles, but if the next film \"Harry Potter and the Chamber of Secrets\" remains true to the book, we'll be seeing more of them.In addition to being highly engaging, the film is a marvelous thing to look at. From the bustling wizard street Diagon Alley to the magnificently gothic Hogwarts School to the dark and misty Forbidden Forest, the film breaks new ground in imaginative production design.To paraphrase the film's tagline, let the magic (and box office records) begin.",
    "91": "HARRY POTTER / (2001) *** (out of four)Here's a method of evaluating a movie based on previously published material: ask yourself if the film makes you want to read the material from which it is based?  Before the release of \"Harry Potter and the Sorcerer's Stone,\" I was one of the few remaining souls who had not read J.K. Rowling's fantasy book series. After screening the first film installment, I did want to read the book. Borrowing the novel from a family member, I briefly skimmed over the chapters. The book's intelligence and similarities with the film really surprised me.  With over 100 million copies sold in over 46 different languages, J.K. Rowling's best-selling series of books has become a worldwide phenomenon. Naturally, with soaring expectations abound, the filmmakers felt great pressure to create a faithful adaptation. They have. This film is essentially a visualization of the words in the novel, with very few differences. That said, the film does run into a few conflicts with the book's story. The middle of the movie has nowhere to go. It's like a false second act; almost nothing of major significance occurs in this period of the film. The young characters wander from scene to scene with nothing much to do and nothing much to say. We're left with a grand display of eye-popping special effects.\n\"Harry Potter\" certainly dazzles us with a solid beginning and an engaging final act, however. We first meet a young wizard boy named Harry Potter (Daniel Radcliffe). Soon after the film opens, the boy discovers he has magical powers. He's then thrust into an enchanting world of sorcery, magic, and witchcraft. He's sent to a school for young wizard children, where he meets new friends, learns about magic, and participates in fun competitions. But someone at the school doesn't like Harry, as mysterious events begin to occur. Harry soon finds himself in the middle of a diabolical scheme of revenge. Who is the culprit and what do they want with Harry?\nThe film asks some involving questions. Too bad it doesn't give enough depth to the side characters or subplots. We don't really care about the mystery because we don't know enough about the suspects. The movie does conclude with a twist, but it doesn't encourage another examination of the movie. It lacks a foundation altogether. The story spends so much time foreshadowing the villain's identity, it is pointless for the story to abandon its proceeding plot points and develop a new villain at the end. The book gets away with this; the movie does not. After his gentle \"Home Alone\" and sweet-natured \"Stepmom,\" many questioned the ability of director Chris Columbus to bring a sense of darkness to the story-and for good reason. \"Harry Potter\" contains charming, likable characters and a rich pallet of lush, inventive images. Unfortunately, the film lacks an edge. It's missing the dark atmosphere Rowling's novel so vividly brought to life. Columbus does construct some memorable sequences, but the individual scenes themselves are much better than the movie as a whole.Despite it's childish story and pre-teen characters, many define \"Harry Potter\" as a film for all ages. While that's debatable, during my screening, adults were plowing through the isles every five minutes. Going to the bathroom? Getting drink refills? Buying concessions? Who knows? But not a single child budged from their seat. Their eyes were glued to the big screen. Conclusion: It's a sure-fire experience for children, especially if they've read the books. But adults may not encounter the same enticement as kids. Then again, if I had nothing better to do than to count the people leaving the theater, why am I recommending the film?",
    "92": "Harry Potter is a magical and fun movie.Great movie for the whole family, kids will love it and adults will probably also like it.The Harry Potter franchise is the reason i love movies and i love all of them because of that.The characters are great and memorable, i can name every character in the whole franchise and most of the people who is playing them.The story is great and i think JK Rowling did a great job writing it.The acting is good and i think Daniel Radcliffe did a great job as Harry. The rest of the cast was great too.It's long so the middle part of the movie was a bit slow, but it's okay.Overall Harry Potter and the sorcerer's Stine is a great movie for all ages.",
    "93": "That's it! I give up! I surrender! White flag! My friends want to see the new Harry Potter that is about to be released this summer, The Order of Phoenix, but they looked at my like I just lost my head when I told them I never saw the Harry Potter films. They just said I've seen every movie yet I never saw Harry Potter? Well, I never saw the point since I don't read the books or wasn't interested in the films, it looked like typical kid's stuff to me. But my friends said they would not take me to see the movie until I've seen the films, it's now that I realize I got myself into trouble since these movies are all 2+ hours each. I just finished the first one a couple days ago.Harry Potter lives with an extremely cruel family, but there is something different about him, he can talk to snakes and make things appear and disappear. Well, he receives a letter, he's a wizard! Not just any wizard, he is the only wizard ever to survive the wrath of Voldemort, the most wicked wizard. Harry goes to a magical school, Hogwarts, where he learns the truth of his heroic parents and meets two other wizards, Ron and Hermione who soon become his best friends and they discover the power of the sorcerer's stone and what might happen if it's put into the wrong hands.Harry Potter I have to admit is off to a good start with me, it had wonderful and magical effects that anyone could enjoy. The actors were just so perfectly cast, Maggie Smith, Alan Rickman, John Cleese, we have some of England's most brilliant actors. It's a well made film, now I still haven't read the books, so I can't base this film on a comparison. Even if I did, this is the movie and the movie itself is a magical and enchanting experience. Well, I'm onto The Chamber of Secrets, wish me luck.7/10",
    "94": "Harry Potter and the Sorcerer's Stone (2001) *** (out of 4)Harry Potter (Daniel Radcliffe) is taken away from his obnoxious and abusive aunt and uncle and taken to the Hogwarts Academy where he's going to learn to become a wizard. He becomes friends with Ron Weasley (Rupert Grint) and Hermione Granger (Emma Watson). It doesn't take long for Potter to learn about his past as well as what's expected of him in the future.I'm going to be really honest and admit that I've never read a single line of any of the novels and in all honesty I never really paid too much attention to what they were even about. I'm watching this first film on March 15, 2016 so that's nearly fifteen years since this was released so obviously you can't say I'm a fan of anything involving the characters. I really wasn't sure what to expect going into the movie but by the time the end credits started there's no doubt that I was left entertained.I thought for the most part this was a pretty entertaining film and I think everyone got it right in regards to the casting. I mean the three leads are all extremely good for their roles and I thought all of them managed to help carry the film. Radcliffe was certainly believable in the role of this master wizard and I thought both Grint and Watson added a lot of charm. Then you've got the likes of John Cleese, Alan Rickman, John Hurt, Maggie Smith and Richard Harris.I'm not normally a fan of CGI heavy movies but I thought it was perfectly used here and never really took away from the story. Instead of taking away from the story it actually did a very good job at adding to this alternative universe and the various magic that is to be found in it. Technically speaking the film was certainly well made with a ripping score, great effects as well as fine editing and cinematography. If I had to say anything negative about the picture it would be the incredibly long running time.",
    "95": "We live in a world where economics is hard. This forces practical limitations when making a movie. Time and money are sadly finite, cinema owners need to be pleased as well as fans and computer animation ain't perfect. Given these limitations, this film is about as close to human perfection as it is possible to achieve. However, it's extremely clear what an immense challenge it is to turn Philosopher's Stone from book to film.Two and a half hours is not long to explore a wonderful, magical world. Furthermore, the directors have bowed to the inevitable temptation to show us things that cannot be communicated so effectively in a book. The consequence is the feeling of a slightly breathless sprint in places.It also means that the movie has to stay true to the spirit of the book rather than to the letter of it. There are omissions and there are changes. The changes that were made capture and maintain the spirit of the story really well; indeed, there are places where the story is more clearly and straightforwardly told in the movie than in the book. Some aspects of the story are fleshed out on screen and the additions are delightful, completely in keeping with the flavour of the world.The humour of the movie is inevitably more visual than that of the book; no belly laughs, but a lot of smiles. Some punchlines have changed, but the reasons why the jokes are funny remain the same. Not knowing exactly what's coming next is a good thing! It's all kept tasteful, classy and above the belt; there's nothing to cringe about.The voice acting is almost uniformly brilliant. However, there are occasions where some of the actors are required to convey high emotions and are only given a second or two of face shot, or head-and-shoulders shot, to do so. This isn't as much freedom as they need and they fall a little short. The blame here must fall on the decision to give the actors too much to do too quickly, not on the actors themselves.Other than these rare jarring instances, the physical acting is frequently excellent and seldom less than completely adequate, judged against the highest of targets set by the book's clear emotion descriptions.Dan Radcliffe has the look, the mannerisms and the charm of Harry down pat. His strongest expressions are the bemusement that must be inherent at entering a world where science does not rule alone and the bravery that Harry shows in his achievements. Emma Watson possibly slightly overplays Hermione, but does so in a fully endearing fashion. There's one scene which gives her too little chance to truly express panic; otherwise her performance needs no changes.Rupert Grint has comic timing way beyond his years, hitting Ron's lines perfectly. Tom Felton makes a stylish Draco; Matt Lewis' Neville character suffers from the acceleration, so the finale does come as a slight characterisation shock.The Phelps brothers' Fred and George are distinctively cheeky rather than proactive pranksters; Chris Rankin imbues Percy with genuine authority. Sean Biggerstaff shines; his Oliver Wood is likeable and an ideal Quidditch team captain.Robbie Coltrane's Hagrid is the single dominant adult character, with maximum laughs extracted at every step. The movie changes strongly exaggerate one side of Hagrid's nature, though; probably inevitable considering how much plot exposition his character has.David Bradley has a vicious Argus Filch; John Hurt's Ollivander is an eccentric treat, giving a wonderful introduction to the Wizarding World. The professors are uniformly excellent, though Richard Harris' Dumbledore comes off as disappointingly flat until the end.The most ambitious point of the movie is the computer generated imagery. The stills are wonderful, but the fastest animation is restricted by the limitations of real-world technology. The book makes extremely stringent demands of the CGI; sometimes their overall effect in the movie is merely good rather than insanely great. Some of the magic spells and effects look awesome; others don't capture the imagination nearly so much.The world cannot yet completely convincingly animate human beings doing inhuman things, which serves as a clear reminder that you need fictional magic to make the impossible possible. The Quidditch scene is the most demanding of them all; while the sequence is action-packed and good-looking, disappointingly, it's not a total success. Perhaps some of the scenes would have been better with more conventional special effects? (For instance, the lower-tech-looking Sorting Hat scene is one of the most delightful of them all.)The set looks gorgeous. However, it may not stand up to detailed analysis. It's fairly obvious that things are shot in many disparate locations, rather than one big Hogwarts School near Hogsmeade.The score is absolutely wonderful. The soundtrack may rely too heavily on The Famous Bit, but it's clear that the balance and mixture of things in the finished movie are exactly right.The feel of the whole movie is everything fans could have hoped for. The dialogue is intensely measured, the colouring is suitably epic, the selection of what to leave in is really tightly considered. You get chills in your spine at the right places; you feel the triumphs as all-encompassing endorphin highs. It's clear that the production have thought long, hard and lovingly. They are true fans of the story, they are the right people for the job, it all bodes very well for the second film.So it could never have been the film that the hyper-literalists were hoping for, then, but it is as good as the practicalities of the real world could possibly permit. Don't expect miracles and you'll love it. I look forward to watching it again and again.8/10 at the very least. A really satisfactory film!",
    "96": "First episode also known as ¨Harry Potter and the philosopher's stone¨ deal with Harry Potter (Daniel Radcliffe)and friends fighting dark forces in an amazing adventure . In this early installment of JK Rowling saga, our protagonist is freed by Rubeus from the custody of his selfish uncle (Richard Griffiths) and miserable aunt (Fiona Lewis). Harry goes his destiny at Hogwart's school , there meets our friends Ron(Rupert Grint) ,Hermione(Emma Watson) and his enemies Braco Malfoy(Tom Felton), along the dark forces which threatens Hogwart, and finally Lord Voldemor . Besides the professors as Minerva(Maggie Smith), Severus Snape(Alan Rickman), Dumbledore ( Richard Harris), Madame Hooch (Zoe Wanamaker), Quirinus (Ian Hart)and of course Rubeus(Robbie Coltrane). Here some legendary events take place , including a Quiddich match, and Harry Potter competes in confronting in series of dangerous happenings , challenging monsters as unicorn, centaur and horrible creatures and an ending spooky climatic battle .This episode contains loads of adventures and action and is such deeply riveting and emotional as its followings , furthermore gets lots of bombastic special effects and several images have you on the edge of your seat including an amazing array of technical bizarre creatures, a breathtaking ogre ,a three-head animal , and Potter fighting creepy , scary monsters and an exciting final taking on between Harry and the Dark Lord and his henchmen . The picture displays stimulating action set pieces illuminating the full-blown adventures , blending wizardry, witchcraft, horror, humor and is extremely amusing and pretty enjoyable. Darkest even that subsequent chapters is thrilling, dramatic, touching and very exciting. Provide enough amusement to keep the chat rooms humming until the epic ending comes out . In spite of overlong runtime, it suffers from over-length, and the difficult of adapting, the film still managing to keep a quick enough pace for those unfamiliar with the literary and highly detailed work by J. K. Rowling. The motion picture is splendidly filmed with sensational production design and colorful cinematography by John Seale . Phenomenal and spectacular music by master John Williams. The movie is magnificently directed by Chris Colombus . The film is for Harry Potter saga lovers as well as neophyte who have never read J. K. Rowling novels. The follow-up titled ¨Harry Potter and the goblet of fire¨ verse pretty much the same at the first one .",
    "97": "Based on the book Harry Potter and the Sorcerer's Stone, this is the first film in the Harry Potter film trilogy, a story about a young boy (Harry Potter) who is rescued from the clutches of a neglectful aunt and uncle and a bratty cousin, and taken to study witchcraft at the Hogwarts School of Witchcraft and Wizardry. There he meets his future lifelong friends Ron Weasley and Hermoine Granger, witches Professor Snape and Professor McGonagall and the school's all-powerful headmaster, Albus Dumbledore. Harry also learns about his connection with the evil dark lord, Lord Voldemort.I think this movie followed the J.K. Rowling's novel very well, including in it most details that capture the imagination, magic, adventure and drama of the story. Director Christopher Columbus and the team of writers and special effects people gave a pretty entertaining and believable movie. And, the acting was spot-on, most notably the brilliance of Alan Rickman, Maggie Smith, Robbie Coltrane and Richard Harris. The rivalry between the school houses Gryffindor and Slytherin were tastefully depicted; I just wished the other two houses, Ravenclaw and Hufflepuff were emphasized a little more. I didn't care too much for the Quidditch match, as I thought it was a long-drawn out ballgame.Overall, it's a good introduction for the film series and I think is one of the best in the series as well.Grade B+",
    "98": "If for nothing else, the Harry Potter films always find a way to give me a great sense of nostalgia. I, like many others, grew up with this franchise. In many ways, this was our generation's Star Wars. It was the 2000's pop culture phenomena. I'm happy to say that the first film, The Sorcerer's Stone, still undoubtedly holds up.I feel like I should first mention just how impressive it is that Warner Bros and their casting directors found the perfect Harry, Ron, and Hermione. Yes, the rest of the film is also impeccably casted with Maggie Smith, Richard Harris, Robbie Coltrane, and Tom Felton just to mention a few, but it's the core three characters that carry this franchise. Watching the three of them play off each other so effectively at such a young age is truly awe-inspiring.Granted, heroes are only as good as their villains, and luckily they have a great one in Lord Voldemort. Even though in Sorcerer's Stone it's hard to really call him in the big-bad, considering he's not resurrected yet, but his presence is definitely felt. With that said, I wish they would have involved Professor Quirrell more in the main plot. He's a sketchy guy, but you never get a real sense that he's working to resurrect Voldemort. In fact, he's barely in the movie, so his presence towards the end is unexpected, but I didn't feel like it was earned.But the mishandling of the villain doesn't diminish the tremendous amount of fun The Sorcerer's Stone brings to the young franchise. Chris Columbus does a nice job of setting up all the relationships and characters we will come to love later like Hagrid, Dumbledore, and even Snape. This is clearly focused on the trio, but they each get a chance to chew up some scenery with the young wizards. Everything from a clumsy giant, the dark forest, a game of quidditch, to an important game of chess make The Sorcerer's Stone one of the most memorable entries into the Potter franchise. +The trio are effortlessly cute and entertaining+Pacing+All the beloved characters sprinkled in+Balances a bunch of genres in one-Villain reveal is iffy8.4/10",
    "99": "Harry Potter and the Philosopher's Stone is a terrific movie with a very well developed storyline and a talented cast. It's a delight to watch, I've seen this movie numerous times and it never fails to make me smile, to cheer me up when I'm feeling down, the Harry Potter franchise is magical both inside and out, and it's simple fun to watch Harry go in to his first year at Hogwarts, the story's quite simple as the series kicks off with a light start, but it will still leave you wanting more. The films biggest flaw is, at times, it is too faithful to the book that it is based off, I'm sure this is pleasing for anyone who's read the book, but for those who haven't it tends to drag out at times, more than an hour passes before Potter even goes to Hogwarts and the main adventure dosen't unfold properly until at least one hundred minutes in, it can get a little tedious at times and that's why I'm giving it an eight instead of a nine that it easily could have received. The cast is outstanding, the young cast members are ridiculously talented for their age, Daniel Radcliffe seems to have no trouble playing a lead role, and both Rupert Grint and Emma Watson shine as his closest friends, they never lose a single bit of likability. They are joined by a terrific adult cast, including the likes of Alan Rickman, Maggie Smith, Robbie Coltrane and, the highlight of the movie for me, Richard Harris, he shines as Professor Dumbledore (sadly only for two movies), his characterization is perfect, he is wise, heartwarming and simply a lovable character. It may be a bit slow at times, but Harry Potter and the Philiosopher's Stone never loses its sense of fun and magic, and because of this it is a perfect film for the whole family to watch and enjoy. A young boy learns the truth about his special powers, that he is a wizard and must prove his worth at Hogwarts School of Witchcraft and Wizardry. Best Performance: Richard Harris Worst Performance: James Phelps",
    "100": "I feel, next to Willy Wonka and the Chocolate Factory, Harry Potter and the Sorcerer's Stone is the best book-to-movie adaptation that I've ever seen. The sets were stunning - the actors were first rate - the effects were breathtaking.  The film flowed quite smoothly in it's transition from page to screen, never tripping on the awkward conventions that other books on film have struggled with.   The screenplay, by Steven Kloves, stripped away all unnecessary elements to get to the root of the story.  Though many events from the book were excluded, the essential ones made it to the film. And it makes for one smooth story and very enjoyable movie-going experience.Many kudos to Chris Columbus and the rest of the Harry Potter cast/crew for not turning this movie into what it easily could have become:  a 2 and a half hour commercial advertisement for action figures and collectibles, kid's meals and fast food tie-ins, soft drinks and snack products, etc. and instead focused on bringing J.K. Rowling's story to life as accurately and as lovingly as it deserves.  There has been much speculation on whether Columbus was the correct choice for the first two installments of the series and I say to that, Yes.  I feel that he accomplished what most would have failed.  He has proven, at least to me, that Diagon Alley truly exists - if only I could find the right brick to tap on.  The world of Harry Potter is no longer fantasy to me, but instead a place where any of us mere Muggles could hope to visit, one day.One of my favorite moments, is what I'm going to refer to as the Adrenaline Sequence.  By Adrenaline Sequence, I mean the sequence in a movie that for all intents and purposes, doesn't necessarily propel the story, but gives the audience a huge theatrical payoff, ala the Pod Race sequence in The Phantom Menace.  The Adrenaline Sequence for this particular movie is the Quidditch sequence.  I was very happy to finally see the 'hockey/soccer hybrid on a broomstick' come to life.  The Quidditch Sequence is, by far, my favorite sequence in the whole film.  The scene is dizzying in it's violence and it's one breathless moment after another.  My hat goes off to Columbus and his team for succeeding in making this scene as memorable as it should be.Harry Potter and the Sorcerer's Stone is a fantastic movie for children of all ages.  Fans and non-fans alike will enjoy this colorful story of good versus evil and the friendships that endure.",
    "101": "Okay, I never read the Harry Potter Books. I couldn't have cared less, but I have nieces and nephews and other children in my life who are from ages 7 to 12 who have. What I had to do was remember what it was like when I was that age, so long ago, and what \"new\" movies I had to entertain myself with.\nSo...I had \"Oliver!\", \"Willie Wonka and the Chocolate Factory\" and \"Chitty, Chitty, Bang! Bang!\". Other than those, it was \"R\" rated films that I was more interested in.  Why? For that is what interested me via what Hollywood made available. I was \"too old\" for those cutie Disney Animated cartoons of that time, and too young for the adult theme films that were being advertised which I DID want to see. This is why I like this film, it brings back the genre for children, the wonder, the fantasy in film just for them.A nice effort production wise, with the casting, with the story. Children love fantasy, wonder, adventure, a character THEIR age doing and thinking like THEY would and...watching kids eat lots of \"sweets\". This Harry Potter film fit the bill. For me as an adult, it was...nice. For children between 7 and 12, its fantastic. The special effects were neat, the story was engaging for them, but what I liked the best was the school itself. I thought that the classes and interactions of the children with each other were on their level. So it was at a Wizards school. Point is, it could be at ANY school. (or boarding school!)In my surroundings, there have been a few adults/parents screaming about how this film and the school \"Hogwarts\" promotes kids to get into the black arts. I think that is so awful to think that, and I think it does not give children the benefit of the doubt. \"Harry Potter and the Sorcerer's Stone\" is a nice little film about something a child/pre-teen has fun with. I actually compared it to the Disney film \"Fantasia\" and the scene of Mickey being the \"Sorcerer's Apprentice\". I watched that over and over as a 6 year old and trust me, I had no desire to get into \"the black arts\".To me, this film is geared towards that audience that has been forgotten AND portrayed in the last 15 years, the 7 to 12 year olds. Yes, Disney had alot of animation that was marketed to that group of children, but its been quite sometime to make a long full length feature film of fantasy where children are the focus, and they are just...children. Reminds me of \"Willie Wonka and the Chocolate Factory\" and \"Chitty, Chitty, Bang, Bang\"...fantasy films for the 7 to 12 year old to enjoy the movie going experience on their level, but NOT talking DOWN to them.Children under 7 may be a bit scared at some parts and teens over 13 may not get into this film at all. But for the 7 to 12 year olds, this film is a nice one for them in the same vein as \"Oliver!\" and \"Willie Wonka and the Chocolate Factory\" was for me.",
    "102": "Platform number 9(3/4) would have been discovered easily by muggle world as train platform are not that empty.At the place where harry where harry acquires remembrall (bhul na jana). He wins seekers position instead of any punishment. It was awesome.Harry potter as Seeker or khoji wins my opinion. The reason is in spite of wearing spectacles he is assigned such a position. I simply like that.Home is another point where my opinion is that harry could have been located at a better place. A place where he is respected may be with Hagrid. The life could have been made less troublesome.There is a scene where Hermione is in toilet and lies regarding entire situation. I feel if she would have just mention the truth, they would have ended up in even better points.The message boards are gone, so sharing opinion this way.",
    "103": "This movie is a delight for those of all ages.I have seen it several times and each time I am enchanted by the characters and magic.The cast is outstanding, the special effects delightful, everything most believable.You have young Harry, a mistreated youth who is \"Just Harry\" to himself. And then, he embarks on a most beautiful adventure to the Hogwarts school.He meets Ron and Hermione, one an adorable mischief maker, the other a very tense and studious young lady.Together, the trio try to set things right in the school.It's the ultimate fantasy for young and old.",
    "104": "Dropped with his aunt and uncle as a baby, Harry grows up in a loveless home and is made to sleep under the stairs.  On his 11th birthday Harry learns the truth of his past when he is visited by Rubeus Hagrid and invited to attend Hogwart's school for wizards and witches.  Whilst learning his craft Harry and his friends notice some strange things and begin to investigate, leading them deeper into a mystery that involves a dark wizard who killed Harry's parents and a quest for a powerful stone that brings immortality.I had no strong desires to see this film.  I have not read any of the books, nor do I have any plans to as they just don't interest me.  Back in my family home one week I noticed they had bought a copy of this film on VHS and I decided to give it a watch.  I knew little of the plot but it carried me along well enough.  It did seem a little long and that the film was trying to cram as many effects scenes as possible where it should really have been developing characters instead.  Don't get me wrong the effects are all good and hold the interest well, but without the characters I felt like I didn't care very much about the plot.I know this is a children's film so characters aren't that important but that leads me to another point  the running time.  At over two hours I struggled to care enough to sustain my interest.  I don't have kids but I did wonder how many would be able to focus for that long  but I suppose that the reason for throwing in an effects scene every five minutes just to wake them up!The cast is crammed with talent  most of which it fails to make good use of.  In the lead Radcliffe is quite bland and didn't do too much with his role.  Happily Grint and Watson who both are funny and have good characters  even if they are only sidekicks in the film, supported him.  It is telling that recent publicity for the second film has put these two on a par with Harry  even giving them their own posters.  Of the support cast only Coltrane is well used, everyone else just has cameos of one sort or another. Hart, Cleese, Harris, Rickman, Smith etc all have only a few scenes at most and (in the case of Rickman and Cleese) a few lines at most.  This is annoying on two levels.  Firstly, the fact that such talent is wasted and secondly the fact that none of them are allowed characters  only a chance to show their face briefly once or twice.Overall it was enjoyable and will please kids even if only for the regular effects scenes.  It has flaws and it is clearly aimed at those who have Potter fever already.  N the strength of this I will not be going to see the second film until someone gives it to me to watch.  It's a good film but it feels like it is made to see Happy Meals and start a franchise than to be a good film in it's own right. (as a side note  I find it hilarious that it had to be renamed for the USA as the studio felt that the word `philosopher' would confuse American audiences who didn't know what it meant!)",
    "105": "This masterpiece must be preserved perfectly to all the generations to come. This is a genius simple story that everyone can relete to sometime in their life. Every humans desire to escape from reality for a while, this excellent film series is one of the greatest series, if not the greatest and never gets old.It is perfect in every detail and must be remembered as one of the best in movie cinematic history and really should be seen by everyone at least one time in their life.The series gets even deeper and deeper as the story develops.The first time i watched this and still to this day im still as enchanted by the universe of Harry Potter, as when i was a kid. Its just one of the most perfect stories that mankind ever told.If you havent seen this fantastic movie, you really have too see it. Theres no excuse. Its a classic!",
    "106": "I have recently been revisiting the Harry Potter franchise during the ongoing pandemic and I have been wondering whether these movie that I hadn't seen in a decade would have aged well or not. My conclusion is that most of them have aged particularly well and this is especially the case for the first two movies that I consider the best of the franchise. The producers' idea to hire veteran director Chris Columbus was certainly a decisive one in hindsight since he managed to transform a first novel with numerous lengths into an extremely entertaining film for the entire family.The movie has numerous other strengths that need to be pointed out. Even two decades later, the special effects still look stunning and do the great novel series justice. The visual effects are magical, the sound effects are epic and the lighting techniques increase the movie's multiple shifts in atmosphere.The locations have been chosen with care as well. Harry Potter's home looks as boring, desolate and exchangeable as it's described in the novel. The scene at the lighthouse oozes with atmosphere. King's Cross busy Platform 9 3/4 looks very colourful, detailed and imaginative. The extraordinary train ride to Hogwarts invites to dream yourself far away. The highlight is obviously Hogwarts and its surroundings as nearly every section in this gigantic castle comes around with creative details and imaginative surprises.The film certainly convinces with its detailed storytelling and diversified subplots. It takes all the time it needs to introduce us to numerous most entertaining classes at Hogwarts. The sections that show and explain Harry Potter's Quidditch career are so detailed that even someone who hasn't read the novel will understand how this fascinating wizarding sport works. The film carefully and credibly develops the friendship between lead characters Harry Potter, Ron Weasley and Hermione Granger. Everything is however wrapped up perfectly in an adventurous, entertaining and epic finale where the three protagonists have to face numerous challenges related to the main plot as an impostor is aiming to steal the mysterious Sorcerer's Stone for a most sinister purpose.The young actresses and actors are doing excellent jobs and are truly convincing in their roles. Daniel Radcliffe shines as confused and isolated but soon enough adventurous and imaginative young wizard going through dynamic changes. Rupert Grint excels as friendly but clumsy young wizard who you are going to appreciate right from the start. Emma Watson shines as self-confident, intellectual and slightly arrogant young wizard whose academic performances are incredibly inspiring. The adult actors have also been chosen with care. Richard Harris's performance as principal Albus Dumbledore is the best ever for this role as he convinces as wise, patient and kind mentor that you will like right from the start. My personal highlight is Alan Rickman as cold, gloomy and unpredictable professor who seems to be antagonist and protagonist all at once.In the end, Harry Potter and the Sorcerer's Stone is not only the only movie that I prefer over its novel version in the franchise but also one of the two best movies in the inspiring fantasy film franchise that has left a significant mark on an entire generation of children and teenagers two decades ago. The film has aged quite well and should still impress children and teenagers as well as their parents all around the world nowadays. The movie has been executed with care in every single department and has lost nothing of its unique charm. It would go as far to state that it stands as one of the very best fantasy movies of the twenty-first century.",
    "107": "I have, in all my life as a lover of both literature and the cinema, hardly ever come upon a piece of work more unimaginative, more ugly, more uninteresting, more lacking in suspense, more lacking in charm, more greedy, more incoherent... Okay, okay. I'll stop with the superlative negatives. Surely there have been worse, and, yes, off the top of my head, I can think of many that are worse. However, for a book that over 125 million people have read, and for a movie that cemented the record for the biggest opening weekend in history, and also for a book that has had not only kids but critics singing its praises, and also for a movie which one particularly fat-headed critic called the Wizard of Oz of its generation, I am more than severely disappointed. I know that, had it not been so overhyped, it would have been just as bad. Now, however, my anger for it is completely hardened and it's going to be a passionate battle for me for years to come.I go into an in depth criticism, but it would be impossible for me to keep to 1000 words. There is hardly a piece of it that I liked. As a film, it was poorly edited, poorly acted (by most), poorly filmed. The only really memorable scene is the troll in the bathroom, although the payoff to it makes no sense whatsoever. The Quidditch game, which has been hyped to all heaven, is completely boring and poorly created. It looks like the FX guys created it with photoshop. When the chess game looked like it was about to be the most exciting sequence in the film, Christopher Columbus, who, I must say, lives up to his reputation completely, begins to edit furiously. I heard afterwards that this was done to avoid a PG-13. My immediate thought is that the filmmakers didn't trust their young audience to enjoy watching a chess game, no matter how exciting it might have been. I'm still not sure which story to buy.But the person I really want to tear into is J.K. Rowling. What a hack. Never has the word \"hack\" been more fitting. A former waitress, her idea of imagination is to call things by weird names. Only in the mind of a psychopath (or idiot) could the name Draco Malfoy or a Cerberus clone named Fluffy be considered clever. Writing children's literature is not difficult, but this is simply awful. She's clearly ripping off Raoul Dahl like there's no tomorrow, especially in the exposition. The game of Quidditch, which seems to be a drawing point of some sort, is absolutely nonsensical. As a preteen, I invented much more interesting games with much less interesting playing pieces. Quidditch is a game where people score ten points at a time, unless someone catches a special type of ball, which ends the game immediately. So theoretically, the game could end in thirty seconds. And all the other forms of scoring matter not at all. And let's talk about the surprise climax. Really, anyone could have been standing in front of that mirror at the end. It is tremendously unclever. And the penultimate sequence, where the crown is awarded to the best dorm, is anticlimactic and just rude to the children of Slytherin, We only hate one of them, so why should we be happy that the award at first goes to them, and then is cruelly snatched away. And what about Hogwart, anyways? If you're not supposed to use magic when you're away from Hogwart, why the heck would you want to be a wizard anyways?Friends, you're well on the path to making your children drooling morons. If they want a great series of books about sorcery and magic creatures, make them read the Chronicles of Narnia by C.S. Lewis. This is the most soulless garbage imaginable. And I thought Shrek had taken that title. 3/10",
    "108": "It's hard to imagine just how influential the Harry Potter series has been on my life. It was released around the time I was born, and I can't really ever remember a time when it wasn't my favorite world to escape into. Harry Potter and the Philosopher's Stone is the first book I can remember becoming a fan of, and wanting to read it again straight away. I'm not even going to pretend that I can judge this without bringing over my fondness for the books.For all the fault this first movie has, it feels like a soon-to-be classic, with many aspects featured here becoming ubiquitous in popular culture. The score by John Williams is recognized worldwide as a magical and wondrous piece of music, conjuring up images of broomsticks, wands, and giant castles hidden in the mountains. Hogwarts Castle itself is now an enormously successful theme park in Florida, Osaka, and more on the way. King's Cross has become a tourist attraction, with hundreds of fans waiting in line to take a picture with the trolley at Platform 9 3/4 every day.The cast from the very beginning is stock full of British acting royalty, great actors sinking their teeth and relishing every bit of dialogue. The young actors do their best and it's fun to see them start off, knowing what lies ahead for them, both in the course of the series and afterwards as well.The opening sequences have a real sense of mystery and wonder, possibly enhanced by the knowledge of the truth about Harry's real identity. The introductions to characters and places are perfect, most notably: Diagon Alley, Alan Rickman as Snape, and our first glimpse of Hogwarts.The story is simple and mostly an excuse for world-building, but what a world to get lost in. In my head, Hogwarts wasn't so...practical, but it looks like a place a child of 11 would consider the most amazing place in the world. The creatures and rules and spells add to the fun.The film does feature shoddy CGI (the quidditch match is particularly bad) and at 2 and a half hours it is overlong. It's hard to ignore, though, the place in popular culture it has attained and the earnest sense of wonder and fun that it offers to everyone who gives it a chance.",
    "109": "This first Harry Potter surprised me. Not a reader of the books nor a proponent of occult beliefs, I still went into this with an open mind and found I enjoyed the movie. I watched the first three films and own the third (\"Harry Potter and Prisoner Of Azkaban\").This film offered good escapist fare with lots of interesting sets and special- effects, as all the films have done. There is very good color and sound in here, making it even more attractive with a good TV and sound system.Daniel Radcliff was a likable hero, with his round glasses and winsome smile. You can't help but root for him. His friends, played by Rupert Gint and Emma Watson, are okay but Watson gets annoying as the know-it-all school girl. She became more likable in the subsequent Potter films. For me, the British accents in here were not always easy to understand.The story, despite its length of two-and-a-half hours, movies pretty well as there is always something interesting to view. Once again, this movie and the sequels all excelled in this department with great visuals.",
    "110": "With the sixth book now out (and one more to go), I feel that I should review \"Harry Potter and the Sorcerer's Stone\". By now, the Harry Potter books have become so well entrenched in our culture that I don't even need to explain the story. But I can say that director Chris Columbus did a great job adapting the book to the silver screen.The cast does very well with the roles: newcomer Daniel Radcliffe plays Harry Potter, making him strong-willed but vulnerable. Rupert Grint and Emma Watson play his friends, the uptight Ron Weasley and the no-nonsense Hermione Granger. The Hogwarts staff is played by a who's-who of British actors: Richard Harris as headmaster Albus Dumbledore, Maggie Smith as anthropomorphic Prof. Minerva McGonagall (and one can detect a hint of Miss Jean Brodie there), Alan Rickman as unctuous Prof. Severus Snape, and Robbie Coltrane as gamekeeper Rubeus Hagrid. Others include Zoe Wanamaker as Quidditch teacher Madame Hooch, Julie Walters as Molly Weasley (Ron's mum), Richard Griffiths as Vernon Dursley (Harry's mean uncle) and even John Cleese as Nearly-Headless-Nick, one of the school ghosts.All in all, this is a movie for the ages. I know that religious fundamentalists will claim that the Harry Potter books are promoting witchcraft, but are we really going to believe those kinds of people, considering that they claimed the same things about \"Bewitched\"? Harry Potter will live forever - something that no Muggle can do.",
    "111": "Well, for starters, the older cast, almost all of whom are instantly recognizable if you've seen much of British television or film, are simply delightful in their roles, with special honors going to Alan Rickman as Professor Snape, Richard Harris as Albus Dumbledore, and Robbie Coltrane as Rubeus Hagrid. Some other positive aspects to the film is that it is a faithful adaptation for the most part, and the child actors certainly aren't the worst I've ever seen. Moreover, John Williams' brilliant score was at the time one of the best in years.With all this talent at his disposal, Chris Columbus seems almost determined to make the movie as childish and as non-magical as possible. One of the main reasons the Harry Potter books were so successful in the first place was because they really weren't just books for kids, they were books for kids that adults could enjoy. J.K. Rowling created a beautiful, magical world and a bunch of very interesting characters that could keep you interested in reading a book for days, if not weeks. Chris Columbus, however, dumbs it all down to the level that it's not even interesting for two and a half hours. On a superficial level, Columbus might have seemed a good choice to direct; he had been commercially successful in the past, had made some funny comedies (\"Home Alone\", \"Mrs. Doubtfire\") and even handle a drama reasonably well (\"Bicentennial Man\"). However, Columbus has also failed at both those styles before; \"Stepmom\" was manipulative, overly sentimental dreck and \"Nine Months\" simply wasn't funny.Columbus decides to direct this as a kids' movie, and effectively ruins the film in the process. Steve Kloves' script doesn't help either, as it simply plays into Columbus' childish perception with some unbearable slapstick 'humor', which completely destroys most of the novel's charm.There are a couple of solid sequences in this mess of a film, particularly the final scenes, but considering the solid source material and the talent involved, the film is ultimately a failure. It is technically competent and the visual effects are definitely good but unfortunately, in concentrating on the technical aspects, Columbus has wasted a lot of talent and forsaken most of what makes a movie good (acting and writing) for the sake of making the movie merely look good. This may work the first time but the film is a bore on repeated viewings and just doesn't hold up well at all.4/10",
    "112": "Harry Potter is an Orphan who on his eleventh birthday discovers he's a wizard and is called to term at Hogwarts School. But Harry is soon to find out that his past, and his destiny, is a truly remarkable, magical, and terrifying thing.Harry Potter And The Philosopher's Stone arrived in a blaze of publicity, one of the most hyped and talked about motion pictures of the decade had finally arrived. The box office was guaranteed to bulge based on fandom book base alone, regardless of if the film got bad word of mouth or not, it was destined to be a monster smash hit. To someone like me who to this day has never read any of the Harry Potter books, it was easy for me to view objectively without comparison to the source - I enjoyed it immensely upon theatre release, and I still enjoy it equally as much now.Director Christopher Columbus, I believe has wisely stayed loyal to the source material, and thus pleased the literature masses. Yet not all newcomers to the party were that taken by the magic on show, that's a little baffling to me because the budget explodes from the screen at every turn. Oliver Twist like sets form the marvellous Diagon Alley, dream like smoke cloaks the splendid Hogwarts Express, the school itself is a monolithic delight nestling in among eerie mountains - and what about the exhilarating introduction of Quidditch? Pulsating and frantic with no amount of devilment to keep us intrigued throughout.The characters are all perfectly formed in the first two thirds of the film, here Columbus pulls off a masterstroke by interjecting the character arcs with dashes of wonder so that we the audience never gets bored. The final reel plays out solidly as per the mysterious \"who done it\" core of the piece, but it's down to the previous work in the film that we actually care come the finale. Some great casting of the adults really helps to make the film triumph, with Maggie Smith, Robbie Coltrane (one of the best casting jobs of the decade I would say), Richard Harris, Alan Rickman and Zoe Wanamaker all doing excellent work here. The kids are all newcomers that overnight were to become household names, all fresh faced and wet behind the ears, Daniel Radcliffe, Emma Watson, Rupert Grint & Tom Felton are a delight to watch, and they all help to keep the feeling of charm constantly glowing up on the screen.Owls here, witches there, what's that strange three headed dog doing over there? The Harry Potter franchise begins with a bang and a whip of the wand, and I and gazillions of others personally love it. 8/10",
    "113": "\"Harry Potter learns, on his 11th birthday, that he is the orphaned son of two powerful wizards, and possesses magical powers of his own. (Sent to) 'Hogwarts School of Witchcraft and Wizardry', Harry embarks on the adventure of a lifetime, discovering a world of magic and fantasy, where he is destined to live,\" according to the film's official synopsis. This was the first of the films bringing J.K. Rowling's beloved \"Harry Potter\" characters to motion picture life; and, it must be considered a rousing success.Importantly, Ms. Rowling insisted on retaining much creative control, so a higher than usual amount of integrity to the material is maintained. This doesn't benefit the film in every respect; but, it certainly was, in hindsight, the only sure-fire way to introduce these adventures to cinema. One change, done for the book, was that the title would be altered from \"Harry Potter and the Philosopher's Stone\" to \"Harry Potter and the Sorcerer's Stone\" for U.S. consumption; it goes against the grain, and works perfectly. \"Sorcerer's Stone\" is shorter, provides alliteration, and better illustrates the conflict present in the story.Initially, it wasn't obvious that the young trio playing \"Harry\", \"Ron\", and \"Hermione\" had the acting ability to go along with looking right for the leading roles; fortunately, Daniel Radcliffe, Rupert Grint, and Emma Watson would turn out to be just perfect. Richard Harris (as Albus Dumbledore) and Maggie Smith (as Minerva McGonagall) herald a stellar parade of Brits playing throughout the \"Potter\" films, with Robbie Coltrane (as Rubeus Hagrid) going to the head of this, the first class.******** Harry Potter and the Sorcerer's Stone (11/4/01) Chris Columbus ~ Daniel Radcliffe, Rupert Grint, Emma Watson, Robbie Coltrane",
    "114": "The Debut Movie that Flag-Shipped the Film-Series, that became a Phenom in Itself.It was Hardly a Chance-Effort.The Popular Books by Rowland had a Built-In Audience Salivating at the Prospect.CGI had Evolved into a \"We Can Do Anything\" in SFX for the Asking and the Budget was Magical to say the Least.Top-Notch Acting Talent Among the Adults, Coupled with Energetic and Charming Tweens Added the Finishing Touches on a Guaranteed Block-Buster.Most Fans Reacted, Admitting it is Slavishly Faithful to the Books and the Scope of the Story is Made for an Audience from 6 to 60,By most Accounts the Initial Movie was a Bona-Fide Success, Artistically and Commercially.Outsiders, Newbies, and the Uniformed also seem to Warm Up to the Charming and sometimes Edgy Youth Material.There were Rumblings from Evangelicals about \"Satan Worship\", Witchcraft Corrupting the Minds of the Impressionable.But that is Expected and an Argument as Old as the Printed Word.Kids Love it and most Adults went along for the Magical, Fantastic Ride that was On-Screen Fresh in 2001 and quite the Treat for Movie-Goers.It's about as Inoffensive as this Type of Thing could be, and maybe went Too Far with its \"Play it Safe\" Attitude.The Movie Leans Away from the Cutting-Edge and can be a bit Dull for those Expecting more Horrifying Elements.It's a Wonderful Movie for the Whole Family and when its Initial Release Date Finally Arrived,Everybody seemed to get in On the Fun.Colorful, Fanciful, Mysterious, and Adventurous.Some Scary Stuff, but Most of All a Celebration of Youthful Imagination and Wonder.Note...Why did they change it to Sorcerer's Stone for Americans?\" ... It was changed by the American publisher, Scholastic, because it thought American children wouldn't want to read a book with \"philosopher\" in the title.",
    "115": "I was drawn into the story the moment the letters started whirling through the air to \"the boy under the cupboard\" and to the amusing trio (Aunt, Uncle, brother) that give interest to the early scenes and make you anxious for Harry to escape life in this demented household. And from the opening scene on, the special effects are nothing short of marvelous despite what some \"critics\" here are calling \"cheesy\" -- I'm sure the film is a strong contender in that category for a Best Special Effects Oscar.Having said that--and not being a fan of Dragons and Dungeons, etc. kind of games--my only disappointment was that most of the \"magic\" was too much on the dark side--without enough humor to keep things in a lighter vein for the most part. If this is what kids like, they'll love being scared time and time again by some of the creatures and situations.I have only praise for the performances, although I agree that Daniel Radcliffe seems to only have two expressions and is indeed bland, but appealing enough, as Harry. Everyone else does their best to bring the characters to life--especially Maggie Smith as head witch and Alan Rickman as Snapes. I think his is the film's outstanding performance.I was aware of too much exposition in the film (to explain to those of us who haven't read the book what Muggles are, etc.) but I'm sure this sort of thing will diminish when the series continues. I was disappointed by the John Williams score, relentless throughout with only one jaunty theme worth remembering.  This was made even more obvious by the fact that a trailer for the upcoming re-release of \"ET\" emphasized the difference between his \"ET\" score and the one he wrote for \"Harry Potter\". Obviously, he had much more of an emotional connection to the characters in \"ET\" than was possible for him to have with the characters here. There is no such connection to the characters in this relentlessly busy score.Even Potter's farewell scene before boarding the train for home, lacks the emotional warmth so strongly suggested in \"ET\" -- a factor that makes the entire movie seem a one-dimensional but highly competent version of a beloved book. All of the set pieces are extraordinarily detailed and well executed, including the Chess Game--and there's a nice plot twist toward the end that I won't reveal here. All in all, a good film version of the book which I understand is remarkably faithful to the novel--and don't let anyone tell you the special effects are anything less than superb!Nevertheless, a John Williams letdown. I'm sure Daniel Radcliffe--who is physically perfect for the role--will improve in his bystander reactions. After all, he made a wonderful 'David Copperfield' on PBS not long ago. Despite some drawbacks, looking forward to the next visualization of Potter's adventures.The film is known in England and many other countries abroad as \"...and the Philosopher's Stone\".  Frankly, I think the American title is more suitable as it implies \"witchcraft\" which is the very essence of the story. With the U.K. constantly changing American film titles, it's not surprising at all that we sometimes do the same thing. Apparently, we don't really speak the same language!",
    "116": "Orphaned not long after his birth, \"Harry Potter\" (Daniel Radcliffe) is forced to live in the home of his only living relatives who treat him rather badly. That all changes one day when he is informed by a man named \"Rebeus Hagrid\" (Robbie Coltrane) that his parents were famous magicians and because of that he is invited to attend the Hogwarts School of Witchcraft and Wizardry. Needless to say, Harry accepts almost immediately and after Hagrid and he buy the necessary school equipment he begins his journey to the mystical academy. It's then that he meets two fellow students named \"Ron Weasley\" (Rupert Grint) and \"Hermione Granger\" (Emma Watson) who become his good friends and share in his triumphs and travails. Now rather than reveal any more I will just say that this film was based on the very successful book \"Harry Potter and the Philosopher's Stone\" by J.K. Rowling and from what I understand remains quite faithful to the book. At least for the most part. In any case, I found it to be a fine fantasy film with the interaction between Harry and his two friends especially entertaining. Admittedly, there are some slow parts here and there and it does run a bit long (152 minutes). Even so, despite the faults just mentioned, I believe this to be one of those rare movies which can be enjoyed by the entire family and I have rated it accordingly. Above average.",
    "117": "I'm finally in a position to re-watch and review the Harry Potter film series - I'm way past over due for reviewing them.First of all, I don't know of anyone that has not seen at least one Harry Potter flick. Everyone seems to agree that these are great films - I am no exception.Secondly, the entire series is highly entertaining! If you haven't seen this series then I highly recommend you should. Comical, magical and all around fun to watch.This first film starts out with a bang as when Hagrid, Dumbledore and Minerva McGonagall show up with baby Harry Potter on the doorstep of Harry's relatives home. The film ends on a good note with the house cup being awarded. In between the beginning and ending is non-stop entertainment.Great to watch this film again9.5/10",
    "118": "If you watch \"Sorcerer's Stone\" without reading the book first, there are certain narrative points that you will miss or not quite be as clear on (as usual). However, watching the movie closely following the reading experience will actually expand upon the Potter myth (I gave the first book four stars) due to this film's ability to lay the groundwork of the series in such stunning visuals and characters.For a basic plot summary, \"Sorcerer's Stone\" sees young Harry Potter (Daniel Radcliffe) living with his aunt and uncle and being mistreated horribly (sleeping in a closet under the stairs, told how rotten he is all the time, etc.). Right before his 11th birthday, however, Harry begins receiving letters from a mysterious owl (as well as a visit from a rather large gentleman riding a flying motorcycle) informing him that he is in fact from wizard lineage. Thus, Harry is whisked away to Hogwarts, a \"Wizard Academy\" of sorts, to begin his training. While at Hogwarts, Harry meets new friends Ron (Rupert Grint) & Hermoine (Emma Watson) as well as discovers the mystery behind the death of his parents regarding a shadowy character called Voldemort.In terms of following the novel, this film does a pretty good job of keeping in lock-step. There are certain scenes that are excised for time/continuity and a few \"facts\" from the book that are blatantly different from the movie, but other than that it is a great representation.In fact, in a departure from the norm, I actually enjoyed the movie experience better than the book. Why? Because of the way it was able to so wonderfully put a visual to all the great characters. For some, the \"mystery is gone\" when they see their literary characters up on the big screen, but in this case I was very pleased to put a face to all these great characters.The movie also has (just like the book) a sense of \"epic-ness\" to it. It is very clear that this is only the beginning of an epic series, with more and more mysteries and character development to come.Thus, \"Sorcerer's Stone\" is a great cinematic experience that will leave you wanting more as soon as it concludes. The mysteries and characters are paced perfectly, and the story (as it is geared for young adults in the first place) is easy enough to latch onto while nuanced enough to get sucked into.",
    "119": "With billions upon billions of pounds in revenue generated from book sales, film adaptations and all other mediums, and with the hysteria surrounding the series now all but gone, it seemed the perfect time to re-visit the Harry Potter film franchise. I'll state outright that I'm a fan of the books: they are hardly ground-breaking pieces of literature, but they are a meticulously crafted and widely imaginative set of novels, maturing with it's progression and with the age of it's characters and readers. The movie adaptations were consistently average, fiercely loyal to J.K. Rowling's prose but always somewhat lacking in substance.Shut away in the cupboard under the stairs by his adoptive parents (Richard Griffiths and Fiona Shaw), 11 year-old Harry Potter (Daniel Radcliffe) lives an unhappy life. But there's something different about him, as he learns when he talks to a snake at a zoo and makes the protective glass disappear, causing his vile cousin Dudley Dursley (Harry Melling) to fall into the tank. His life changes when he is invited to enroll at Hogwarts School of Witchcraft and Wizardry. The invitations are burned by the Dursleys, and they go to great lengths to stop him going to a place that will teach him magic, until he is rescued by a hairy giant named Reubus Hagrid (Robbie Coltrane).When introduced into the magical world with Hagrid, Harry learns that he is famous. His parents were killed by an evil wizard named Lord Voldemort (generally referred to as You-Know-Who), but Harry survived the attack, seemingly killing Voldemort and inflicting Harry with a lightning bolt scar on his forehead. When he gets to Hogwarts, he is befriended by the bumbling Ron Weasley (Rupert Grint) and the precocious Hermione Granger (Emma Watson), and the three are quickly embroiled in a plot involving murdered unicorns, a mysterious artefact known as the philosopher's stone, and a giant three-headed dog.Philosopher's Stone is almost defiantly faithful to the books. Sure, lines are altered here, and minor characters are snipped out there, but this is as close as literally 'bringing a book to life' gets. Yet while this works in it's favour in terms of visualising Rowling's creations, it doesn't even try to develop any ideas of it's own that would have only worked in a visual medium. Much of Rowling's silly and charming sense of humour is lost in simply filming whatever happens on the pages. One of the main criticism's I have for the books is that a lot of the major characters are little more than archetypes, so a lot rested on the three young leads' shoulders in making us interested enough to stick with them.Sadly, two of the three fall rather flat, with only the gurning and hang-dog Rupert Grint showing a natural gift for appearing on the big screen. Potter is a simple enough character anyway, at least he is at this point of the story, shy, naive but brave, but Radcliffe gives an incredibly one-note performance, encapsulated in the scene in which he discovers he can perform magic. \"I'm a... wizard?\" he says, lacking anything resembling a facial expression. Watson also struggles to bring much likability to her self-satisfied bookworm, her eyebrows constantly rising and falling as she struggles to perform her lines with any conviction.For the rest of the cast, director Chris Columbus has rounded up a smorgasbord of British and Irish talent, a collection of well-trained thespians who steal the entire film from it's leads. Richard Harris plays Professor Dumbledore, Hogwarts' headmaster, Maggie Smith is Professor McGonagall, head of Gryffindor, the house Harry is chosen for, Alan Rickman is Professor Snape, Harry's greasy-haired Potions teacher, and John Hurt makes a small appearance as a wand-maker. Coltrane probably steals the film as the beast-loving grounds-keeper Hagrid. It's an amazing line-up that would consistently grow both in talent and in numbers as the films progressed.Ultimately, Harry Potter and the Philosopher's Stone is a success, weaving an interesting enough story about the possible return of the dark lord Voldemort, with Harry's wide-eyed introduction to the world of hocus pocus. John Williams' Oscar-nominated and now widely recognisable score captures some of the giddy movie magic of early Spielberg, and the attention to detail is often remarkable. But like the book, it ultimately suffers from being too kid-friendly, spoon-feeding lessons in morality without giving much for adults to chew on. It's little more than a well-told children's story, something that would change as the novels became darker and more complex, but at this point, it's a gentle introduction to a captivating world.",
    "120": "In the first outing for Harry Potter, he learns of his descent from a magical background and enrols at the school of witchcraft and wizardry 'Hogwarts'Largely character building this magical adventure takes Harry and his new friends, Hermione (a very talented young Witch) and Ron (Harry's best friend) on a quest for the Philosopher's stone, a powerful stone wanted by the murderer of Harry's parents (Voldomort)Not having read the books, i can't make any comparisons, but even as a stand alone movie, this makes a fine fantasy adventure, fun for all ages. The characters are great, the scenery is wonderful and there is enough magical enchantment to charm and entertain all of us.8/10",
    "121": "Harry Potter and the Sorcerer's Stone is not a perfect film, but it is a magical film. The franchise has been a large part of my life for most of my life. With the first book coming out when I was three years old and the first movie when I was seven, there is a special place in my heart for the Wizarding World of Harry Potter.I know that it is not the most remarkable piece of art when looking at it from a filmmaking perspective. However, let us remember that this movie was made for children. When it comes to world-building and enveloping the audience, I would argue that this movie goes toe to toe with Lord of the Rings and some of the other greats.What Chris Columbus and company did is nothing short of game-changing. They took excellent source material, stayed true to the book and built upon it. The visuals, specifically involving Hogwarts, are gorgeous. The score by John Williams is one of the most recognizable of all time. The characters are instantly likeable (or despicable). There is honestly so much to praise and love about this movie.While not every scene is necessary to the plot, those \"pointless\" scenes further add to the feeling of magic. From sitting in Flitwick's classroom to ruminating on a windowsill with an owl, I could watch footage of Hogwarts on repeat. This is a movie that I could turn on at any time and jump right into the story. Simply put, I instantly have a warm feeling which stays with me the whole way through.While the acting and dialogue have some rough moments, particularly with the younger actors, the casting is excellent. From Alan Rickman and Robbie Coltrane to Richard Harris and Maggie Smith, there is not a single dud when it comes to the adult cast. The students are also perfectly cast, with the main trio's chemistry on full display.At the end of the day I'll say it again, I know that this is not a perfect film, but it is a magical film. The movie is highly rewatchable, endlessly quotable and enchantingly enjoyable. When defining \"comfort film\", this movie is at the top of the list. Simply put, Harry Potter and the Sorcerer's Stone set the stage for one of the most popular movie franchises of all time and one of the most impactful parts of my childhood.Best Character: Rubeus HagridBest Moment: Arriving to Hogwarts on the boats.Best Quote: \"It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.\" - Albus DumbledoreAdditional Note: Having the house cup ripped from Slytherin is why I have issues with premature celebration. That being said, the whole sequence is still chill-inducing.",
    "122": "My sister, bless her heart, used to work in a bookstore, and brought the novel this turkey is based upon home one day. After everyone else in my family had read it, I decided to give it a go because I had little better to do at the time. I wound up throwing the book across the room in around thirty pages, feeling that not only had my intelligence been insulted, so too had the already-persecuted-enough faiths of Wicca and its pagan relatives.So when I was given the chance to see this film for free, as long as I delivered my considered opinion to the local distributor when it was all over, I knew I should have let someone else take the assignment. But I just couldn't let fate smack me in the face once without giving it a chance to even out the marks. I basically had a similar reaction to the film that I did to the book: I walked out on it in about thirty minutes. As for what I told the local distributor, it runs something along the lines of missing the book's feeble, so-obvious-it-will-make-you-shake-your-head-in-despair attempts at satire and not being all that well-acted to boot. It is nothing more than a 152-minute commercial for a bunch of merchandise that is basically useless and prone to falling apart, but it does have Harry's visage on it.Since this film has been released in Australia, there has been constant comparisons between it and the upcoming Lord Of The Rings adaptations. There is no comparison for the following reasons: LOTR treats its audiences with respect, LOTR treats the faiths, cultures, and peoples it takes a lot of its details from with respect, and LOTR is not aimed at the lowest possible common denominator. Now that I have that out of the way, I'll just sit back and bask in my superiority to HP fans until the local distributor gets around to releasing LOTR this boxing day. :P",
    "123": "About halfway through Harry Potter 1, I considered walking out.  It's not that it was godawful, but having read the book, I knew how it all worked out-- and I had no confidence left that there would be anything the least bit interesting about how Rowling's story would be illustrated.That's what it is; the book faithfully, and dully, illustrated, line by line.  It's so faithful to the order of incidents (and the need to keep the story moving) that it has no time to give us any of the characterization that made us root for Harry; at best we get instantly recognizable movie stereotypes (Draco Malfoy has a Richie Rich 'do, therefore he must be from the same snotty rich kids' fraternity as Greg Marmalard).  Seemingly ideal casting-- Alan Rickman as Snape, say-- is wasted when the characters turn out only to have half a dozen lines in the entire movie, most of them expository.  Maggie Smith, Ian Hart, Richard Griffiths, Fiona Shaw, all wasted; the peerless John Cleese as Nearly Headless Nick has, as memory serves, all of two lines-- one to explain why he's nearly headless, and one to announce, in Boys' Own Weekly cliches, that the Quidditch Cup is sure going to be hotly contested this year.  Maybe only Robbie Coltrane and John Hurt get enough dialogue to begin to sketch a character.\nThe other problem-- not unrelated, surely-- is that Chris Columbus is, for the millionth time, the wrong wrong wrong director for the job.  He has no sense of magic, of mystery, of English eccentricity.  Give him two wizards skulking about a suburban tract house, and he'll make them seem as ordinary as two retirees strolling and chatting about the weather.  Give him an evil spirit sucking the blood of a dead unicorn and being interrupted by a centaur, and he makes it seem like two retirees strolling and chatting about the weather.  Give him a chess game, and he makes it seem like World War III.  Give him Gringott's bank, and he ignores the baroque set that's been built and can't wait to show us a big pile of gold, which is surely a bit revealing.  This isn't as awful a blockbuster as, say, Tomb Raider, but it comes from the same land of impoverished imagination camouflaged with booming, expensive yet somehow cheap-looking special effects.",
    "124": "I think I may sound like a stooge if I say this, but it is now that I have finally watched this movie. Throughout my life - school days, college, internet; I often used to see people going non-stop about Harry Potter (I think they are called Potterheads). Harry Potter this, Harry Potter that. So finally yesterday I decided to give it a try and oh my god, it's amazing! Why didn't I see it back when I had the chance to?It is kinda unbelieveable that such a nicely detailed CGI movie was released in 2001. I know the VFX had grown a lot better since Lord of the Rings trilogy was also made at the same time, but still I was not prepared for it. I was expecting it to be just some regular CGI that didn't age too well. Trust me, if you haven't watched the movie till now, it hasn't aged at all. It can very much still be the selling point of the movie.I had watched some parts of the movie, like the beginning where Harry's cousin was brought back home after he fell in the snake's cage and the Quidditch scene, but I didn't have any powerful memory of any other scene from the movie. In the scene where Voldemort says to the professor, \"Kill him!\" somehow I used to remember that scene to be the teacher first saying \"What should I do?\" to which Voldemort replies that. And I'm glad I didn't have any previous memory of this movie, because that way I was able to experience everything for the first time.This movie has the 2001 movie's vibe to it, where the story is very straightforward and the childish background music makes it seem very easy to understand. I haven't seen any other movie of the franchise, as I'm going to watch the next part after writing this review. But I hope it stays that way, since it's very easy to understand and thus I can watch the movie on my phone while doing my work on my laptop.",
    "125": "Cut about an hour out of the middle of HARRY POTTER and you'll have a pretty decent little movie.  As is, it's a bloated mess.  There's no heart to this, no characterizations.  It's just a product reel for all the special effects companies that worked on it.Seeing actors of the caliber of Alan Rickman and Robbie Coltrane and Maggie Smith wading through this, I wondered what went through their minds while they were performing.  They have to eat and pay bills like the rest of us, but the last time I felt so sorry for actors was watching Dudley Moore in SANTA CLAUS.There's no need for viewers to feel any emotional reaction.  The goshawful musical score by John Williams telegraphs everything to us and makes sleeping during the dull parts nearly impossible.This made a bundle opening weekend and the studio has started work on the sequel.  I wonder if business will hold at the same rate as the opening. It's playing on three screens at our local theatre and we didn't have to wait at all for tickets to the 7 pm show tonight (Saturday) and there were plenty of seats empty.",
    "126": "What else can I say about the world of Harry Potter that hasn't been said already? After the first book came out, everyone was going crazy for Harry Potter. But then Potterheads minds were blown when in 2001, Harry Potter and the Sorcerer's Stone was released. The film was directed by Chris Columbus and stars Daniel Radcliffe, Rupert Grint, Emma Watson, John Cleese, Robbie Coltrane, Warwick Davis, Richard Griffiths, Richard Harris, Ian Hart, John Hurt, Alan Rickman, Fiona Shaw, Maggie Smith, and Julie Walters. The film was a huge success financially and critically and luckily won fans of the books over and continued with seven more films plus three spinoff films.Harry Potter is an ordinary boy who lives with his aunt and uncle and is poorly treated. He finds out that he is a wizard and that his parents, who died when he was a baby, were wizards too. He goes to Hogwarts where he starts his education to become a wizard.I remember going through a Harry Potter phase in elementary school. Having read all the books and watched all the movies and even played some of the video games (primarily Lego Harry Potter). The world that the books and movies created were something that I could easily escape into. Nearly 10 years after going through that Potter phase, I decided to return to the movies and I must say that I forgot how good this first film is. Is it perfect? No. What has been said about this film has been said millions of times by other viewers. Sorcerer's Stone serves more as an introductory film to this magical and magnificent world. Chris Columbus and the rest of the crew had a lot of hard work to do to pull this film off and the end result is fantastic overall. Many book to movie adaptations fail due to numerous issues, mainly being not faithful to the source material which this film has no problem with. Everyone working on this film had so much love, dedication, and respect to the source material that it is no wonder why fans of the books had such a positive reaction to this film upon release. As previously stated, Sorcerer's Stone serves as an introductory film here. In that regard, it executes it flawlessly. Brilliant set pieces , a fantastic John Williams score, and fantastic characters are all what makes this film pretty magical. The casting of all the film's characters are spot on as I cannot picture any other actor or actress playing any of the characters in the film. The film does a nice job at appealing to viewers of all ages. The overall lightheartedness of the film and magical wonder easily appeals to kids and the film's moments of that have a bit of darkness to it can appeal to the older audience as well. But the film has a few minor problems. The film seems to have no building of suspense at all when it comes to the plot at hand and it really isn't until the last half hour or so until the plot really gets moving but again, it is only minor considering that most of the film is building this world up for us and does that flawlessly but the film does have a runtime at over two and a half hours so it did make me wonder if the film was being a bit excessive on the world building. Perhaps a bit more focus on plot would make this a near flawless film. My other minor complaint is the computer effects in this film. A lot of the time, it is very convincing but there are a few instances where the effects are heavily dated. As much as people praise the Quidditch scene, I have to say that is where the computer effects are a bit dated. Full character CGI is used and is very noticeable but I can say that for 2001 it probably did not look that bad.Harry Potter and the Sorcerer's Stone is a triumph in what it sets out to be and a large part of Harry Potter's success can largely be traced to this film. It is a film that should be able to appeal to fans and non fans alike.",
    "127": "How sad it is to begin the reader's comments with a whining, complaining, drone against everything about this movie. Why not pick a balanced view. Good grief! Did someone poison your dog? It made it sound like this doesn't compare favorably with \"Hamburger: The Movie.\" I am a over fifty years old and thought I would be pretty lukewarm to a \"kids\" movie. I have been listening for a year to kids raving about the Harry Potter books. Their eyes light up--they are enthused about a \"book.\" When I went to see it, I had just read the book the night before because I like to see how they translate. The script was delightful. The characters were charming. The acting in this movie is wonderful--were you expecting Bergman? The pacing is delightful. The sets are eerie and forbidding. I thought that the wonderment of the characters was there in full force. Who did you have in mind to play Harry? Are there any actors that you approve of? Perhaps Kevin Spacy should have played Harry. How about the blond girl from American Beauty as Hermione. Johnny Depp as Ron Weasley. Oh yeah--as I recall, Stephen Spielberg has made a couple of pretty decent movies.We are introduced to the Harry Potter canon as he becomes a foundling, taken into a family that mistreats him and has no respect for his general goodness. Of course, they pay a price for their insensitivity and Harry takes the magical journey to enroll at Hogwarts. It is obvious that his coming has great import for everyone. He meets Ron Weasley and Hermione Granger and they begin a quest to locate the Sorcerer's Stone. We find out about Voldemort and the curse that hangs over Hogwarts, going back centuries. We are also introduced to Quiddich which will be a staple for all episodes. Harry also must struggle with what happened to his parents and, like Frodo in \"Lord of the Rings,\" his quest and what it means. Outstanding film.",
    "128": "The main story is about a famous boy that named harry potter and the reason of his famous is because of he was the only child that he alived from the Voldemort. So he had a really good character smart enough, brave and he was a honestly person to his friends because at the end of movie he shows himself dreams or lies can't track him and he was ready to sacrifice for his friends furthermore we can say he was much powerful to have fight with Voldemort. The girl played and important part to she had a really strange character because she's really careful person about everything the smartest one and with high knowledge about different kinds of magices. The friend of harry potter is the trueness one because of his veracity he was ready to sacrifice himself for his friends and it shows he had the most honest character between harry potter and the girl . These three friends together could stop Voldemort if non of each weren't going to have friendship to each other Voldemort will comeback again and just couldn't face with him because he just need a stone to get his power again, but harry patter wich is strong enough for Voldemort. He should face his dreams and don't fall for the lies of Voldemort and don't turn to darkside of magic and with Voldemort. It describes harry potter is strong enough. To sum up movie shows that the three main characters with their character reviews are just complete wich each other and they're being complementary together harry potter : the strongest the girl : smartest the boy: Sincerely . The director wanted to mention that loyalty can play a really important part in friendship no matter girl or boy also we should be honest to our friends to make the relationship better and better also the trust is the other side of it that makes relationship complete 100 percent when a both side of friendships have honest the can trust each other and solve problems that we saw in this movie so the director wants to prove it to us.",
    "129": "I don`t rate JK Rowling as a writer so when the hype machine stated that HARRY POTTER AND THE PHILOSOPHER`S STONE ( As it`s called in Britain ) was going to be faithful to the book I thought this was a film that wasn`t worth seeing but I decided to give it a chance , after all I hadn`t expected much from THE FELLOWSHIP OF THE RING but I ended up falling in love with Peter Jackson`s beautiful masterpiece . But after watching THE PHILOSOPHER`S STONE my instincts had been proved right and in many ways the film had lived down to expectations .First of all I found it highly patronizing the way it talks down to its audience in a very substandard Roald Dahl way . Secondly the film has far too many characters that add nothing to the plot , and thirdly I`m not sure if the film actually has a plot . Yeah things happen but many of these things don`t seem to lead to anything so why were they included ?\nI noticed the second Harry Potter film didn`t perform as well as hoped which gives me hope that the next films in the franchise bomb big time . And I reckon Frodo Baggins could kick Harry Potter`s ass",
    "130": "Harry Potter and the Sorcerer's Stone, based on the novel it seems every kid has read (to my surprise considering that I hated reading most books as a kid, especially ones that looked longer than 200 pages and had little or no pictures but then I'm not a kid anymore) is now a movie and while it is certainly overrated and sometimes stupid, it gives some decent moments of entertainment.  It is another film that will depend on the viewer on how much he/she can take with near non-stop adventure and (impressive) visual effects.  It's a wonder the film made 93 million in one weekend (isn't that a sign of biblical armageddon though), but since the film is directed a lot more at kids it's not a total surprise since the movie gets a big reccomendation in the family film department.  But teens and adults might not want to walk in the theater prepared to see the greatest film since Wizard of Oz like the kids are.  A little long but never really boring, Harrpy Potter offers up a nice stew of excitement on this thanksgiving weekend with some great visuals and score (from John Williams).  Yet it is not a great film.  Grade: between A- and B+",
    "131": "Harry Potter seems to highlight what today's society is missing; the age of magical innocence, the pure abandonment of that essence of childhood. In this day and age of computer games and quick fix takeaway electronic happiness and incessant CGI violence, it's brilliant to see the world excited by story telling and the simple things. It reminds me of years ago as a child reading volumes of Roald Dahl's compositions and hanging out to read the next chapter of 'Danny the Champion of the World'. Harry Potter has engaged the world back into that innocence, even if it is for a two hour movie.The Philosopher's Stone is majestic, bold and outrageously expansive... and I want more. I took my son to a packed cinema and we were both entranced with the.. well.. magic of the package. The awesome Harry Potter theme and musical score, meeting of the main characters, hunting for school items, the train ride, the first look of Hogwarts... It is all magical. The casting of adults are perfect. Richard Harris typifies what a respected all powerful all knowing headmaster should encompass, all the professors are brilliant and Snape could be played by no one else except Alan Rickman.The 'magic' of the surroundings, the little gadgets and seemingly insignificant details are lovely. To be honest, the whole production smacks of that professional quality that is European/British and it was refreshing to be free from the American drawl and plentiful explosions and swearing.Make no mistake, this is a child's movie. But one that transcends through time and makes a cynical crestfallen adult smile and feel like a child again. Sure you have to ignore the sometime sugary scenes and I just looked at my son's beaming face... Harry Potter works.",
    "132": "Adaptation of J.K. Rowling's very popular book is as good an adaptation as possible...but it doesn't completely work.The big problem was they were afraid to cut anything out of the book (they'd have school children all around the world after them), so they try to put everything in and there's too much for one movie.  Also it's a virtual word-by-word recitation of the book--if you've read the book, you've seen the movie.  This doesn't allow director Chris Columbus any leeway to change things or add his own personal stamp (not that Columbus was ever an inventive director to begin with).  So, it just ends up being the book visualized exactly as written.The acting is so-so.  The kids picked to play Harry, Ron Weasley and Hermione Granger are pretty good--not great, but certainly not bad.  The adults vary wildly--Maggie Smith and Zoe Wanamaker (love her yellow eyes!) are just great as teachers at Hogwats...Alan Rickman, Richard Harris and Robbie Coltrane are horrible...they're REALLY not enjoying themselves.  Also John Williams bombastic score is annoying.Still, it looks great, moves fairly quickly and there's a fantastic sequence showing a Quidditch game.  So, it's OK but nothing great.  Maybe if Spielberg had directed it...",
    "133": "Harry Potter, a seemingly normal 11 year old boy soon discovers that there is far more to the world and himself then he ever imagined. Famous for an incident at his birth he soon discovers the world of magic as he is invited and attends Hogwarts, a school for witchcraft and wizardry. While there he learns that not all wizards are those to be trusted and there are those still serve an old evil, an old evil that wants Harry Potter dead.Based off the acclaimed series by J.K. Rowling, Chris Columbus directs the first of the series. Touching, heartfelt and innocent is one way to describe the first of the series, lighthearted in its enjoyment and in its scope, one feels after watching this film that they've barely scraped the surface of the world of magic and muggles and one would be right in making that assessment. John Williams scores the film beautifully and the entire score itself feels like a part of the magic that is this film. The child actors mainly Radcliffe, Grint and Watson do a marvelous job and the chemistry between the three cant be denied by the viewer at at any point. Alan Rickman, who plays the sinister Snape is wonderful in his role and is easily one of the many who do a wonderful job within the film. The late Richard Harris also does a magnificent job as does Maggie Smith. One cant help but be inexplicably drawn to the film, it almost feels as though you are let in on a secret, one in which you are glad to be a part of. While some would argue that the first of the series is perhaps a bit to childish in its nature, i disagree and say it is the most care free of the series, a good introduction piece into a series that only gets darker and more adult as they go. For any fan of fantasy, or any fan of film in general the first Harry Potter film is a true gem and one I'm glad to have watched.",
    "134": "After my Nine years old daughter almost finished to read all of Harry Potter's books it seemed like the right time to start with the movies or a least with the first and the less scary or inappropriate for young kids.I think that I have seen it several times, but now it was even more special, to watch it with the kids and my own Hermione Granger, that was willing to Spoil(er) the plot for her brothers.Anyway, it is one of a few cases which the book gets a fantastic translation to a movie and as a film, which you try to disconnect from the book series, it is still an outstanding creation, almost a myth.It is for kids, but two hours and a half long. It has some moments of scare, but it is a perfect interpretation, which contains the Drama, fun and funny bits and even the scary moments, which the book made you feel.I liked it now even more, based on my personal life's surrounding, but even then, when I wasn't a father yet and just a reader who seek to find a good movie to this iconic story, it had made it and delivered.Once delivered, now still delivers...probably it will last for another 20 years and still deliver.",
    "135": "I was quite surprised to see that this movie only rated around 6.5. So it begs the question, exactly how enjoyable, clever, truly magical and unique does a fantasy movie have to be to rate close to or specifically a \"10\"?I would guess that many felt that the film didn't compare to the quality of the book(s). I never read the books and probably never will. But taking the film on its own merits, of which there are absolute boatloads, this first in a series of box office smashes, delivers on every possible level.The actors were perfectly cast and wonderful in their respective rolls. The effects, props, lighting, sound, music, dialog and story line fulfill every movie goer's needs.Yes. I give it a very enthusiastic \"10\" and will continue to watch it a couple of times a year, along with other adventure films like Indiana Jones #1 and #3, DaVinci Code, Castaway and Jaws.",
    "136": "I'm not really a big fan of the HP films. I don't think that they translate well from the books as they are often quite long and need severe cutting down in order to fit into a 2 hour+ film. This has been increasingly evident in the later HP sequels, but Philosopher's Stone seems to be pretty much all intact.I do find Chris Columbus' mostly naturalized approach to shooting the film to be the most appropriate. In GOF, Mike Newell had the cheap and uncheerful logic of shooting everything with a heavy green filter to make it look 'mysterious' and 'magical'. I think it just looks stupid and that the far-fetched fantasy nature is more identifiable if shot more ordinarily.What does bug me about this film and always surprises me on repeat viewings, is how horrible the entire kiddie cast are at acting. Check out the terrible performance from the guy who plays the blandly named Oliver Wood! Woof! It's like watching some rubbish Primary School play with big budget visual effects. It takes me out of the movie every time.The 150-minute running time seems to pass by in a breeze, something I've never really felt with the sequels. But something that bugs me is even right here at the beginning Dumbledore seems to be like 'I'll tell you about it when you're older, Harry.' Which is a cheap hook to make us read/watch the later installments. I don't really have that much to say about Philosopher's Stone, which is why my review is short and spiceless. It's a shame the sequels had to be so boring. Stick with the books, a couple are overwritten but they are superior to the films. A clichéd thing to say, but still true.",
    "137": "This film is by all means a classic, but classic does not mean great. Though the set design and camera work (not specifically cinematography but rather how the camera moved through scenes) and editing was great. That film as a whole does not deserve as much credit as it gets.The acting is awful and, I mean that in the biggest way possible. And the pacing throughout the movie also makes no sense. The introduction of the film feels forced and like a joke, but not in a funny way, and finally the cinematography is plain and average at best.What makes me give this 5 stars instead of 2 or 3 though, is the outstanding set design and beautiful scenes which where definitely not made great through cinematography.If you are going to watch the harry potter series, start from the prisoner of azkaban, as that is the first really good harry potter film.",
    "138": "Harry Potter, arguably one of the most famous book series, didn't take long for to be adapted for the screen. Facing big expectations the first movie did well to hold its own. Harry (Daniel Radcliffe) is a neglected boy who lives with his mean aunt, uncle, and cousin. Odd things happen around him and before long he is told that he's not like other people, he is a wizard and a famous one to boot. He leaves his world of neglect behind and enters the magical world where young wizards of England attend Hogwarts School of Witchcraft and Wizardry. With the help of friends, Ron (Rupert Grint) and Hermione (Emma Watson), Harry navigates his first year of school with the looming prospect of the dark wizard who killed his parents trying to return to power. The film has an all-star cast including Richard Harris, Maggie Smith, and Alan Smith. Chris Columbus (The Goonies) directs and does a fine job of bringing the magical world to life. It is definitely worth seeing but be sure not to neglect the books. It would be interesting to see how a Harry Potter miniseries would do, but at the moment we just have the films. The movies can only create so much of the books' brilliance, but to be fair this first one does a decent job.",
    "139": "This is not a film, it is a trap door to a life, we all wanted to live in when we were kids. It's been years since I had watched the first chapter of JK Rowling wizarding world, I wanted to review with utmost passion and dedication but my thoughts, feelings never inked on the words.\nSeems like, I was missing that feather pen to wrote it down.Harry Potter, changed the dimensions of my life. I escaped my reality countless times while watching this film. I was in 8th standard when I watched the cinematic world of Harry Potter.\nBeing a Small Town Pakistani Boy, It was really hard for me to live in the reality. Always wanted to be the part of the famous trio. As years commenced, I always wishes to have freinds like Harry, who were brave to stood up for their friends. A female friend like Hermione Granger, with her wit she can help to course with social and academic life but this was just a dream. There are millions around the globe who have viewed it.Chris Coloumbus magnificentlly crafted the Wizardly World of Harry Potter. I really loved his direction, the way he captured the metaphors of the first novel was aesthetic. Campus, classrooms, dormotories, dining room, Hogwarts, Quiditch, we feel to be stuck in there and When Hagrid waves to the trio in the End, that scene seems like a 3rd act to wave to the audience to go back in your reality, the world is waiting you.Emma Watson shines through her role of hermione granger. Her cleverness and wit make her character memorable. I liked her british accent, the words sounds symphonic and melodical.\nDaniel Radcliffe was truly the Boy who lived. He was innocent yet brave. Robert Grint supported him well throughtout the film. Tom Felton did great in the limited version of Draco Malfoy, wanted to see him more when I was kid.\nRichard Harris was calm, affectionate version of Albus Dumbeldore. His countenance makes him the Grandfather figure of Harry.\nRobbie Coultrane as Hagrid leaves an imprint which makes him the most loveable character in the series. His performance makes me emotional in the end.\nAlan Rickman was compeling, Maggie Smith charming and IAN Hart as Voldemort voice freaking genius. Rest of the cast shines in their respective roles.Music of this film holds a special place in my life, It is a trapdoor to the days of my adolesence, I find myself in my school all the time.\nWaiting for a friend, who can be Hermione Granger.Overall, Harry Potter is the world, I always wanted to be part of, it is life, fantasy and this film takes me on the journey to live with all the beloving characters",
    "140": "'Harry Potter and the Philosopher's Stone' no doubt divided many fans of the 'Harry Potter' novels, of whom I am one. The film adaptation of a much loved book was never going to please everyone and, while it is an enjoyable way to spend a couple of hours, there is no denying that it has both good and bad points.For those who have just flown in from Pluto, the hero of PS is young Harry Potter, a bi-spectacled British boy who has lived with his brutish relatives since he was orphaned at the age of fifteen months. However, on his eleventh birthday, Harry's life changes forever when he discovers his secret legacy...that he is a wizard. He sets off eager to start his First Year at Hogwarts School of Witchcraft and Wizardry, making friends with fellow First Years, know-all Hermione Granger and Ron Weasley, the sixth son of an impoverished but kindly Pureblooded wizarding family. Yet life is not destined to be all fun and games for as our young hero quickly adapts to this wonderful new world, he learns the disturbing truth behind his parents' deaths and that sometimes evil doesn't die easily.The quality of the adult actors was just superb. Alan Rickman as Snape, Maggie Smith as McGonagall, Robbie Coltrane as Hagrid and Julie Walters and Mark Williams as Molly and Arthur Weasley were all destined to play these roles, truly bringing the characters to life in a way I didn't think would be possible. I was less keen on Richard Harris' Dumbledore, feeling he was just a shade too cold and stand-offish to play an paternal man who the neglected Harry came to trust with ease. That said, the adult cast were definitely the backbone of the film, especially in light of the rather mediocre child cast.While Daniel Radcliffe may resemble the living embodiment of Harry Potter, it was evident from his lacklustre performance in PS that he was chosen purely on looks rather than talent. At the best of times, he portrayed Harry as a rather bland and uninspiring hero and, at his lower moments, he was just cringe-worthy (the scene where he discovers he is a wizard is particularly clunky). Devon Murray, who played Seamus, and James and Oliver Phelps, cast as the Weasley twins, were equally as wooden. However, there are a few gems in the group. Tom Felton was excellent in bringing the maliciously mischievousness of Draco Malfoy to life and he is, undoubtedly, the best of the bunch. Emma Watson's Hermione was suitably condescending and obnoxious as the character was aged eleven (sadly, come GoF, Emma didn't comprehend that Hermione had largely out-grown the conceitedness was an integral part of her character in PS). While Tom Felton was the best of the child cast overall, Rupert Grint, who played Ron, was the best of the trio, bringing to the character a quiet loyalty to his friend balanced with the boyish exuberance that was very much apparent to eleven-year-old Ron.The script might be a tad too childish for those over twelve, with not enough focus on the more interesting adult characters, but I believe it suited the mood of the novel given Harry was eleven in PS so viewed the wizarding world in the very innocent, awestruck manner of a child. Director Chris Columbus nicely compliments this by capturing a wondrous, Disney-like feel to Hogwarts in a way that leaves the audience joining Harry in his delight at exploring the magic of the wizarding world. The special effects are acceptable with the exception of the cartoony Quidditch match, which seems to have been lifted straight from the Nintendo video game and awkwardly pasted to the film, and the hideously computerised centaur.PS was a fair adaptation, enjoyable in itself although no-where near the epic of LotR. It does capture the innocence of the characters at a time when they believed the world was neatly divided into good and evil and magic could sort any problem, however, older fans will most likely find the faster, mature pace of the adaptations of the latter novels more suited to their tastes as, in comparison, PS seems to be directed mainly at little fans under twelve.",
    "141": "Harry Potter and the Philosopher's Stone is the first of eight films based on the seven best selling novels by J.K. Rowling. While I certainly don't think it is one of the better films, it is the one that starts them off and crucially it does so in the right way.The tone of the Philosopher's Stone is considerably lighter than the rest of the series. It is quite childish at times and you never really feel there is any danger. That is a problem because in some scenes you probably should feel a threat. The effects in the series overall are fantastic but in this one they are patchy. The troll, fluffy, the quidditch and Voldemort when he appears all look quite cartoonish.The biggest success of the first HP film is the world building. So many fantasy films throw you straight into a complicated, elaborate plot and spend ages trying to explain what is going on. The result is that you never feel like you have been transported into another world. That is what Chris Columbus got right about this one. The plot here feels, for large parts, less important than introducing the world itself. The focus of the film is primarily on the wonder and magic of the world.The sets and locations are fantastic. Hogwarts, Diagon Alley and Gringotts all look great. The costumes are also stunning and give the film a real vibrancy. The soundtrack from John Williams is iconic. The cast features some of the best British and Irish talent from the last half-century and they all give memorable performances. The kids definitely grow into their roles but I had no problem with any of them here.Some of the later films have far more depth, character development and danger about them but they are allowed to because of the foundations laid in this one. When you see Hogwarts, the owls, etc. in the later films you automatically know it is the Harry Potter world and crucially feel a connection to it. That is the Philosopher's Stone's greatest triumph.",
    "142": "Despite being part of the generation that grew up with these books/films I was never particularly a big fan of Harry Potter the way so many others were. I saw the films on TV every now and then and found them mildly entertaining but they never managed to truly win me over. At the time I was more of a fan of the lesser appreciated Chronicles of Narnia series of films.I had watched the Harry Potter spin-off Fantastic Beasts a few years ago and found it quite enjoyable so with it being twenty years since the original film's release, what better time to revisit it and give it another go?Upon rewatch I was pleasantly surprised and found myself enjoying it more now than I did all those years ago as a child, ironic given it's intended target audience. I liked the sense of mystery in the story and how our protagonists uncover the conspiracy within Hogwarts, leading up to the big confrontation at the end which was also done very well. This first film also has much more whimsical and lighthearted moments compared to later films in the series which depending on your personal tastes could be a good or bad thing.Where the film really shines is in it's characters and the actor's portrayals of them. The young cast of course do a fairly good job, with Radcliffe being the perfect fit for Harry. There are also some great performances from the older cast members such as Robbie Coltrane as the gentle (half) giant Hagrid, the late Alan Rickman as the stern and intimidating Professor Snape and of course the late Richard Harris as the wise and gentle yet powerful wizard Professor Dumbledore who sadly passed away after the second film and as such could not play the role in the following films.After rewatching this first Harry Potter film so many years later I had a newfound appreciation for it and the series as a whole. If like me you were never that into the series the first time around I'd recommend revisiting it and perhaps you'll be pleasantly surprised as I was.",
    "143": "In many ways the best of the franchise so far. I was free from any anticipation for this film being not overly impressed by the fantasy genre. This film redeems itself above other sorcery films with its old fashioned English ambiance being greater than arch and portentous fantasy.Unlike other fantasy films the directors face the challenge of a highly critical audience of children who are more familiar with the books that they are & waiting expectantly for their favorite part of the book and would tear the director to ices if he was there in their anger such omissions. Any changes in the film would be seen as desecrating the fantasy world that Rowling created. In the production of the first film this was a contention in preproduction. As a faithful rendering of the book squeezed into a two-and-a-half hour period, the movie is beautifully done as far as special effects go. The actors although experienced are let down by the younger cast not being trained and coming from a stage school background with the exception of the lead show the typical stiltedness of such training. Daniel Radcliffe has been accused of being too subdued in the title role but as he becomes older he character does become more sombre. Alos it allows the other characters oddities to shine more clearly in contrast to his quieter style.",
    "144": "I recently revisited the enchanting world of Harry Potter and the Philosopher's Stone, and it was just as captivating as ever. Director Chris Columbus truly brought J. K. Rowling's magical universe to life with his impeccable direction.The story, which serves as our introduction to the Wizarding World, is nothing short of perfection. From the moment we meet young Harry, we are drawn into a world filled with wonder and mystery. The story effortlessly balances the ordinary and the extraordinary, making it relatable to both wizards and Muggles alike.What sets this film apart is its ability to transport viewers to a place where magic is real and anything is possible. The special effects, from the magical creatures to the breathtaking Quidditch match, are still impressive even years after the film's release.But it's not just the magic and visuals that make this film great; it's the heartwarming friendships, the lessons of bravery and loyalty, and the battle between good and evil that resonate with audiences of all ages. Harry Potter and the Philosopher's Stone is more than just a movie; it's an enchanting journey that reminds us of the power of love and friendship.Whether you're a devoted Potterhead or a first-time viewer, this film is a timeless classic that will continue to capture hearts for generations to come. Don't miss the chance to experience the magic all over again or for the very first time. It's a delightful adventure from start to finish.",
    "145": "I've read all four (to date) of J.K. Rowling's excellent HARRY POTTER novels.  As an 18-year old American college student, I'm far from the target audience for this movie, but I went to see it on opening day in hopes that it would live up to its source material.It did not disappoint.Practically everything onscreen was close to the way I'd imagined it in my head, and points go to the set designers.  Also, this is one movie where the SFX crew really were wizards.The actors all performed marvellously.  The standouts in my mind were Alan Rickman as Professor Snape, and (surprisingly) Sean Biggerstaff as Oliver Wood.The script was also excellent, hewing very close to the book.  A few scenes were removed or merged, but they affected the movie not a bit.I highly recommend this!",
    "146": "So, to set the scene a little bit, I believe this is the third time I've seen this movie. I read the nearly all the books when they came out and watched just the first one when it released and then, over lockdown pounded out the whole series. Thought I'd come back to it again and give it a more critical eye.The Somebody's Stone is an interesting film. There's so much nostalgia here for me and I can't help but enjoy that and yet, I never find myself drawn into this one. It's a decent introduction but it feels off to me every time. It has this odd mixture of young and mature themes that I don't think quite hit their perfect balance yet, though an argument could be made that as the movies progress so to do their maturity and intricacies to match the plot but still, as a single film this feels like a child's movie with childish issues. The child actors, for a start, are going a bit over the top and it feels like we could use a Looney Tunes sound effects track to go with some of the things happening here. Also, I can't help but be annoyed by the wish fulfillment involved. Poor orphan boy is suddenly the chosen one and becomes a huge deal at school, wildly popular and rich in both gold and friends without ever even trying!That all may sound like I'm really bagging on this but I don't mean to. I still think this is a good movie but every time I see it I'm reminded of why I abandoned the series so early on upon it's original release. It's a wonderful visualization of a spectacular, magical world but as a film I'm underwhelmed by it and find myself just sort've shrugging and going \"It's ok.\"",
    "147": "\"Harry Potter and the Sorcerer's Stone\" is devotedly faithful to the book. The special effects, especially the Henson Creature Shop and the quidditch game, are fun, but not fantastically magical.There's a lot riding on those three kid leads, more than probably any kids can communicate; it makes one realize how much of the book really takes place inside Harry's head. The great British character actors are underutilized, especially John Cleese as nearly Headless Nick. The music is too loud and obvious. A must for fans of the books but this won't make any converts. It is long -- don't take kids too young to read the book; the little kids in our audience were screaming to go home already. (originally written 11/25/2001)",
    "148": "There is a classic early 90's \"Far Side\" cartoon of 3 people standing in an otherwise empty room with a banner hanging overhead painted with the letters, 'DLDWWS,' which stands for \"Didn't Like Dances With Wolves Society.\" Gary Larson really captured a phenomenon of what I'd call the 'societal embrace.' People look for things to identify with to make them feel like they're a part of mass culture. Enough people give this product their stamp of approval that it nearly becomes propaganda. No person can escape at least making a decision about that product. People are more likely to decide something's good if someone else tells them it's good, even though they would have felt indifferent otherwise. This cultural phenomenon has happened many times, including this year. In late 2001 and early 2002, there was no escape from Harry Potter. (pronounced 'Paw-TUH' because I've rarely heard it said otherwise. Hogwarts, Middle Earth, Ridley Scott, James Bond, Austin Powers, Shrek-talking like a stuffy brit is definitely cool again.)\nWith that, I hereby begin DLHPSSS (Didn't Like Harry Potter and the Sorcerer's Stone Society). The first half hour or so I found interesting. Then I noticed that the film continued to roll, but there was still no sign of an actual story. Poor cute little Harry had no objective. There was no jeopardy. Two hours in, finally, something. There's this magic stone created by the world's most powerful wizard (probably all that's preventing him from mass ridicule over being named Dumbledore), see and-oh never mind. By that time I had ceased to care. I can't remember ever caring less how a film was going to end (or wishing more that one simply would). The ending that did eventually come, frankly, sucked. Then they add to the agony by reminding us that there was the points contest between the houses. I was actually happy when the Slitherin house won. They even ruined that moment for me.\nOn the way out, my brother, whom I saw this with, made a good analogy. He said the film was like 'Pirates of the Caribbean' or some other Disneyland ride where you just travel through and watch various animatronic things jump out at you. There's no real story, it's just a bunch of neat things to look at. Same thing with \"Harry Potter.\" This is the most offensive kind of film to me, one that passes itself off as cinema, but is really just assorted eye candy. The effects and sets and cute kid actors are designed to make you feel like you've been entertained when you've really just been gypped.\nIt's been a long time since \"Harry Potter and the Sorcerer's Stone\" has been released, so long that I'd forgotten why I avoided seeing it in the first place. I sensed, knowing that director Chris Columbus had stayed nearly verbatim faithful to the book, that this was a cash cow just waiting to be fed. There was no risk involved for the film's creators, who knew its audience came built in. Now it's up for a Golden Laurel award, which is the Producer's Guild of America's year-end pat on the back for 'excellence in producing a motion picture,' which translates as 'best job of making lots of money on a motion picture.' (Why do movie producers need a guild? No one knows. No one wants to ask. But that's for another time.) The award should be replaced by something that looks more like the one they give the winners of the MTV Movie Awards: a gold-encrusted bucket of popcorn. \"Harry Potter\" producer David Heyman should certainly win for creating the 'movie project that moved the most popcorn at cineplexes worldwide.'I never believed in the \"Harry Potter\" propaganda and I was right. But there I was, buying a ticket anyway. I sensed a hesitation from the vendor, actually, when I heard 'Harry Paw-TUH' come out of my mouth, like he was giving me one last chance to change my mind. (\"Dude, are you sure you want to see THAT movie?\") Curiosity got the best of me. My solace is that there are still a couple of people out there who haven't seen it who can still be saved. Maybe I should have seen it sooner.Grade: D",
    "149": "First let me say I have not read any Harry Potter books, and I think that is an advantage to enjoying these Harry Potter films. Second, let me say I am a Christian and a grandfather, and I found the witchcraft not one bit troubling.  It's a movie, after all, and in the end \"love\" is the main quality Harry Potter is credited with.Even though the film is almost 2 1/2 hours long, it never seems too long. Perhaps that's because each step in the development of the characters is so interesting. The various stars are just perfect for their roles. I especially enjoyed Emma Watson as the precocious Hermoine. She is a good young actress and I enjoy her typically British facial contortions when making certain word sounds.For the young, or simply young at heart, the various depictions of \"magic\" are so much fun to watch. Hermoine read her assignments, memorized useful spells, and was always ready when the need arose. The broom flying lessons on the playground. The selection of the perfect magic wand in the wand store. Catching the train to Hogwarts on platform 9 3/4.  All highly entertaining. I can understand why the Harry Potter books are so popular, the author has a great imagination.When the film finally got around to action and excitement during its latter stages, it had a \"Raiders of the Lost Ark\" feel to it, falling in a pit of wiggly things, making narrow escapes. And the one character that at first seemed meek, mild and handicapped, later turned out to be a villian, had a \"Usual Suspects\" feel to it. Just part of film evolution, every good thing influences things that come later.The DVD picture is remarkably sharp and colors realistic. The 5.1 surround sound and John Williams score complements the film very well. For collectors of good movies, a fine DVD to own. I'm happy that I have my own! :-)"
}