{
    "0": "I suppose this worked for me not because it has Liam Neeson dispensing typical Liam Neeson savior duties, but for its '70s Irish backdrop, some fine supporting performances, and a snowball-ish plot. For a change, Neeson looks and feels comfortable on his home turf, and his \"good heart\" becomes the reason for things spiraling out of control. An attempt to help one of the locals invites trouble, and though this is somewhat of a cliché in actioners featuring older stars, the story progression is quite interesting. Kerry Condon, in an antagonistic role, is having fun and chewing up the scenery (I can't wait to see how good she is in Night Swim). There's also the amusing sidekick character played by Jack Gleeson and the confused cop friend played by a reliable Ciarán Hinds; both commendable. Tom Stern's effort in capturing panoramic Irish imagery is probably the strongest reason, however, to watch the film.",
    "1": "After their Belfast bombing goes awry in terrific 1974-based Irish dramatic thriller \"In The Land of Saints And Sinners\", IRA militant Kerry Condon (excellent again) & crew hide out in the small Donegal hometown of Ciarán Hinds (a quiet cop) and his pal Liam Neeson (a low lying hired killer (with Jack Gleeson (outstanding)) under Colm Meaney). As paths cross, friction flares, violence kicks in, all leading to quite the explosive show-down. While director Robert Lorenz doesn't QUITE do justice to his superb cast (the film's not as dark & weighty as it maybe coulda been), writers Mark Michael McNally & Terry Loane certainly still make it engaging. Eminently watchable fare.",
    "2": "It's 1974 Northern Ireland. IRA members Doireann McCann (Kerry Condon), her brother Curtis June, and two others plant a bomb in Belfast. It kills the target but also some innocent kids. They are trying to hide out in remote County Donegal. Finbar Murphy (Liam Neeson) is a local killer executing for corrupt cop Robert McQue (Colm Meaney). Finbar is tired of killing. When he encounters an abusived girl, he goes back to his killing way. The abuser turns out to be Curtis June and Doireann is out for revenge. Vincent O'Shea (Ciarán Hinds) is another policeman.It's a pretty simple revenge killing plot. I expected some more compelling twists. The Northern Ireland and family history could be more visceral. On the plus side, these are great Irish actors doing their normal great level of work. The most intriguing part may be the trees. I do like Doireann confronting Robert although I like it more for the mother. This movie has the actors and the place and the killings. I would like more surprises.",
    "3": "In the Land of Saints and Sinners shows perfectly how you make a solid movie without putting billions into special effects and explosions - just tell an old tale new with the help of a superb cast. Especially the acting shines bright in this little flick and makes the story and the characters believable. No doubt, for someone just wanting lots of bum bum and computer generated gimmicks a la Fast and Furios or Tom Cruise's quests on high octane, this won't work to well, but for someone who wants a well told story, this one will do and provide plenty. Not an excellent one but a good one for sure.",
    "4": "At first glance this movie looks like the typical Liam Neeson action-revenge-flick that we all have gotten used to. But \"In The Land of Saints and Sinners\" stand out due to great acting by a stellar supporting cast and by fantastic cinematography.The story takes place in a small irish coastal town during the 70's. Liam Neeson plays an ex war hero now turned hitman, and when trying to turn his old sinful life around he gets in trouble with a bunch of IRA.terrorists in hidehout after a bombing in Dublin.The movie is filled with great supporting actors such as Ciarán Hinds, Cold Meaney,Jack Gleeson and Kerry Condon. The latter was great in The Banshees of Inisherin, and in this movie she plays a fantastic villain. The overall story and dialogue is OK, but it's the acting together with the beautiful cinematography that carries this movie to an above average Liam Neeson revenge flick.",
    "5": "Liam Neeson is Finbar Murphy, living in Donegal at the times of the Troubles in the north of Ireland in 1974. The hitman for hire has decided that it is time to hang up his gun when a troubled little girl forces him to come out of retirement for one more kill.Kerry Condon is a dedicated member of the IRA and has just led a car bombing in Belfast which has killed two children near the blast.She and her cohorts wind up in Donegal where her brother has been done in by Finbar for his treatment of the daughter of a neighbor. The gun toting freedom fighter seeks revenge for the death of her brother.Neeson and Condon are terrific in the lead roles and the Irish scenery is breathtaking. As a fan of Dostoyevsky, I was able to guess the final scene. One of the best films of 2023.",
    "6": "Really good Liam Neeson film.... One of the better films he's made in the last few years.... Good cast from a lot of well known faces ..and great acting keeps you watching til the end.....Liam Neeson looks right at home in this film , hope he continues down this road of thriller drama movies because he's very good at what he does , maybe the big action movies are a bit past him now, but this one is perfect ..... Liam has a really good on screen presence, like him as the tough bad but good guy character.... Great Thriller..... Hope to see more high class films like this from him.... Highly recommended..... 👍",
    "7": "So me and my husband do not have the same taste in films. I air towards strong character films with well thought out scripts. My husband likes a good cop,bad cop film or a sports legend with a tragic injury. Anyway, when I looked up to see he had put a Liam Neeson film on, I expected to see an elderly man blowing up fifty people and fighting six young men with one arm. I was nearly right. But very wrong.I knew in the first ten minutes, when a man dug his own grave and gave a rousing speech that this was going to be good. Just look at the cast. All legends but Jack Gleeson??? Absolutely amazing. I loved his role as Joffrey in GOT but naively thought this was just a great character for any actor to play. Now I know that without Jack Gleeson, the role would not have been the same. It took me ten minutes to realise it was him in this film. I was just thinking wow, who is this lunatic. Then the penny dropped and I sat amazed every time he was in camera. Liam Neeson reminded me what he was capable of when he is finally given something other than a hologram character. Yes, some of the brilliant supporting actors were underused but personally, it made it more interesting as screen time wasn't carved up in accordance to fame.So pleased to have enjoyed a film my husband picked. Next year I might let him pick another one. I said might.",
    "8": "Oscar Wilde once said the only difference between saints and sinners is that saints have a past and sinners have a future. It's a great title for a Liam Neeson lone-gunman Western set in a village in Ireland's northwest county of Donegal in 1974; a place where sinners are thick on the ground. Take Finbar (Neeson), for example, who has been working as an assassin-for-hire for a local 'bone-man' (played by Colm Meaney) since 'the end of the war'. That would be 30 years, and he doesn't know why he does it, how he started or even who he is doing it for. Jack Gleeson is cast as a second hitman working out of the same one-horse-town: while things weren't quite right in Ireland in the 1970s, they weren't quite that wrong either. The land has saints and sinners and a way out.",
    "9": "This is such a boring movie. The film score works and Liam is a solid actor. I wish this movie never came out as it is ungodly boring. He's played this role way too many times where he's a hitman trying to become or stay retired.. This feels like a really, REALLY boring Irish take on The Transporter (Jason Statham) for the most part minus the flashy car, the moderately attractive Asian woman and going interesting places. The landscape near the town is beautiful and reminds me of where my mother is from but that's about the only nice thing I can say.Liam is a Hitman for some man we barely know anything about at first. Is it mafia? A street gang? Who knows. Maybe I missed what the man was as after the first 5 or 10 minutes the movie got so dull, I did like the idea of using all the trees. They kind of give him a touch of back story about 3/4 into the movie for Liam's character, by then it's too late to care. The co-stars all suck and the only other guy on Liam's side is so creepy looking. I get it, it's the 70s and that may have been the style back then. For the most part the film revolves around Liam seeing a little girl who has been abused and kills the mothers boyfriend or whatever he was/is. He didn't need permission from that mafia guy to do so as all it became was a loose end, then again we wouldn't be treated to such a riveting story, would we? Then 4 people in the IRA come and try to kill him. The villain almost works. ALMOST.This movie is so slow paced. I don't need car chases or explosions every few seconds to stay interested but this is such a boring movie. Whether it be from lack of explaining certain characters, bland writing or something besides from time to time you've really got to stretch your ears to understand what the heck they are saying. This movie and that noire detective movie Liam did, or the one he survived the plane crash and wolves are chasing them across the tundra are some of his worst. Skip this. I'd rather endure Taken 3 again. I'd rather watch the 2023 movie where 90% of it he's sitting in a car is better.. If I was Liam's agent I wouldn't wipe with the script how bad it is. Better yet if I was Liam I'd get a new agent all together!",
    "10": "Finbar Murphy (Liam Neeson) works as a under the table bounty hunter in 1974 in his native Ireland. He kills IRA radicals who make bombs. After a killing, he decides he wants to retire, letting Robert McQue (Colm Meaney) his contact know his intention. While in retirement, he encounters a young girl who is being abused by an IRA bomb maker. He decides it is time for one more kill.This is a vigilante film with little action. This is one of Liam's more boring films. It doesn't relate well to American audiences who are used to more colorful vigilante's who enjoy killing.Guide: F-word. No sex or nudity.",
    "11": "Not another Liam Neeson action film. It's a drama about Ireland during 1970s, but from much more better perspective\nthat I saw in film with the same theme. Though I consider\nThis is Irish English. The script is very awful. The film is not good. C'mon Liam... I really like your movies but this one seems a waste of time. The Special Effects look like they were made in the 80's..... guess low budget Movie. Watchable but nothing Special.In fact, Jack Gleeson has left acting because everyone thought he was like Joffrey from GoT in irl as well. And for the last 3 years he has been trying to climb back up. Such a shame, Too bad about the CGI explosions, doesn't anybody actually blow anything up anymore?",
    "12": "The only thing that lets this film down is a couple of lines of dialogue which were a tad cheesey, but they were delivered with such class that it didn't really matter. For such a short film, the character arcs of some of the players developed pretty well, especially that of Jack Gleeson. And that's another thing, wonderful to see that guy acting again. It was also good to see Liam Neeson in a film set in Ireland with a plot that, for the most part, was believable. I mean, Colm Meany, Ciaren Hinds, Kerry Condon, Sarah Greene, to name just a few. This film is pure class and I suspect it will be one of those films that will get more popular over time. Why the rating is so low, I have no idea. Full credit to the producers, directer, and actors for this day's work. One of the best films of 2023, if you ask me.",
    "13": "One of the worst film with Liam..\nI always have high expectations when he is in a movie..i love his act and kind of movies he plays, but this one really dont make it, its very Borring, and acting from many of the involved is very bad. I lost my attention many time in this movie, took myself in looking on my phone instead.. so this movie i cant recommends for anyone..\nI look forward to his next movie (Liam) and hope this is not his new standard of movies he will be playing in.Not much more to say about this movie then this.. i hope you find this review helpsome because , if you can avoid, do this, and do not det your expectations high.",
    "14": "Liam Neeson has been pumping out so many slightly generic action/revenge thrillers with the regularity of an alarm clock since Taken took off in 2008 that sometimes it's refreshing to see him do... an actual movie lol. In The Land Of Saints & Sinners is admittedly an action/revenge thriller by definition but it's a damn sight more thoughtful and artistic than most he's done lately and reminds us just what a powerful presence he can be with the right material. Here he's Finbar, a hitman in 1970's Northern Ireland who works for a local kingpin (Colm Meaney) whose outfit solely targets bad people. Finbar has vowed to give up killing, until he can't help himself knocking off the relative of a friend of his whose daughter the guy has been molesting. One less scumbag in the world, the only problem being that this particular scumbag is heavily connected to IRA factions that have been skulking in the area and soon his fiery sister (Kerry Condon) comes looking for those responsible with guns blazing. This is a wickedly suspenseful, character driven piece with vicious bursts of violence and terrific passages of philosophical dialogue in between. Neeson hasn't been this good in a while, he isn't simply on tough guy autopilot, he's actually playing *somebody.* Condon is terrifying as the fierce villainess, a monster who lost sight of her cause long ago and despite twisting morality to suit her own bitter agenda, isn't without a humanity herself that emanates through in her performance. Jack Gleeson proves that he's got more that Joffrey Lannister's sickening impudence in his acting stable and provides solid character work as a younger hitman with an unfortunate past who both admires and resents Finbar, while the usually striking Ciaran Hinds is oddly and sadly underused as the ineffective local policeman. This is a fine thriller with a rock solid, emotionally charged Neeson performance, intense antagonist work from Condon and gorgeous Irish scenery, one of the strongest films so far this year.",
    "15": "In the Land of Saints and Sinners is about an assassin that have quitted his job and is about to start a new life, but then, the new problems are coming, and the small place in England in the middle of nowhere, is in danger. The story isn't new, but the thing they do in here is very good. First of all, the main character, Finbar Murphy, is a well presented person, with good character development, and they show very clearly the connection between his good friends and the people that lives in the small place. I could see that he really cared about them, the audience make them care about them, and the plot feels much more important then. The story was a little strange to understand at the beginning, which direction are they going to go, but later on everything went good, the puzzles were placed on the right places, and the action and suspense was turned on. The suspense was holding and I really enjoyed the storyline and how everything was evolving and leading nearer and nearer the grand final, with the final moment of action. The action sequences were well made, with some nice camera filming and good music in the background. The film did have generally good music, some\nsuspenseful, some old violin music and some classic British style. Besides that, I really liked the pictures in here. Great pictures of beautiful nature, and the light set-up and camera angles were outstanding. The small town was presented very well too. After all, the movie ended good, it was generally good, and I have to admit that this was a very nice thriller! The start could have a better beginning, something more that could give me a clear focus of the situation, but after everything, the bricks went on the right place. I do recommend it.",
    "16": "I have seen every single Liam Neeson movie to date and I can assure you that this Irish Liam Neeson flick is definitely one up from some of his latest more run of the mill gangster stories, because this Irish picture is quite a bit better allround at acting and story, hence the higher 8 stars rating...The good: great suspense from start till the very last scene. A solid storyline that kept me on edge, contineously wanting to know what would happen next. Lots of nasty killings by evil terrorists, who have even murdered children!And Liam Neeson, (however violent he is in this story), still is the GOOD GUY, who cares for children and even cats! And even when he kills (for money) Liam says he never enjoys it. You gotta give it to Liam Neeson for making me sympathize with a violent gangster! Another really solid performance!Recommended watch for the Liam Neeson fans and also for others ofcourse, who are into a solid Irish crime story, although subtitles may be helpful (for some folks) when having to fully understand (some of) the Irish accents, although I managed alright understanding them without subtitles.The story: Liam Neeson as an Irish professional killer for hire, who wants to retire from his relentless killing business because he feels remorse and wants to do something better with his life and he even starts a vegetable garden (!!), but just at that moment IRA terrorists enter his small rural village and reap mayhem. Will Liam Neeson be able to protect his own small Irish village from the evil IRA terrorists?",
    "17": "Latest movie of Liam Neeson is a very very interesting movie. I feel it deserves more than it's IMDB ranking of 6.1 and Rotten tomatoes score of 60%. For me it's a straight 8.0 at least.In the backdrop of a Irish country seaside village, in 1974, a Retiring assassin tries to get settled in the calm routine life. He wants to leave the life of sin. But a group of IRA hitmen is taking refuge there at the time and slowly causes ripples in the society. There are small industries, shops and church based communities- which trudge along the sea side village. People develop bonds and relations. Liam Neeson's character comes into conflict with the reclusive IRA group and that threatens to open wide his plans to leave his old sins and live a saintly life.Viewers may remember Jack gleeson from The game of thrones, the abominable character as Joffrey Baratheon, acting as a helpful assassin here.Many character actors are familiar from other movies. But each and everyone is typical of Irish characters which we imagine to be. The mid 70s ambience has been recreated nicely. A sense of underlying optimism flows through the Movie in spite of the gloom of death and sins against children and penury for people who are trying to stay afloat. The movie is not that gritty and dull but not flamboyant also.I would recommend a definite see !",
    "18": "Finbar Murphy (Liam Neeson) is a retired hitman, looking forward to a peaceful life in a village with minimum friends. Set in 1974, in the middle of attacks from a group calling themselves as freedom fighters, 3 of them are on the run after a bombing leads to their faces being recognized. They are hiding at the same village Finbar is in. As expected, things force Finbar to clash with them and eventually they all go on a duel to sort things out. What happens to them and ofcoure with Finbar is for the audience to check out in the film.Once again, Liam Neeson gets a rehashed story set in the 1970s where a little kid is the center of the conflict, prompting Liam to take matters into his own hands leading to the baddies to seeks revenge. This done to death story offers nothing new expect rely on Liam Neeson's shoulder to carry the film and he does keep the film barely engaging. With nothing more happening thanks to the generic villain and not much contribution from the 1974 Irish setting as well, it ends up as a one time watch for Liam Neeson fans only.",
    "19": "Liam Neeson seems well suited to the role as a widowed hitman going up against the IRA, probably because its on his home turf and seems more relaxed around others from the same county?He plays well off Ciaran Hinds as the local Garda and their friendship is funny and touching.Kerry Condon is excellent as the villian; believable and refreshing to see a female as the baddie.I liked the scenery (obviously!) and the soundtrack is solid.We did struggle a lot with the dialogue , the accents here are very thick so we found it difficult to follow events.The sweet, good natured Irish villagers and their simple life seemed trite and stereotypical but it's an watchable, well acted would be 'Western'",
    "20": "The movie mostly shines in capturing the essence of a 70s Ireland by showcasing some vintage cars and presenting beautiful visuals of the Irish countryside. It introduces compelling thematic elements that spark interest but frustratingly remain unexplored throughout the narrative.Despite its unique and independent storyline, the film's delivery falls short. The story feels a bit shallow and the motives behind the antagonists actions at times seem unclear.Condon as the villain is the standout performance of the film, and the involvement of Jack Gleeson is intriguing, but largely due to his nearly unrecognizable appearance due to his mustache. The film has a tremendous cast but it doesn't really seem to know what to do with them.The thick Irish accents occasionally pose a challenge in understanding the dialogue, but it's a refreshing change to witness Neeson embracing his natural accent.Nonetheless, Liam Neeson, at 71, continues to impress, adding another film to his impressive roster of action movies. Though this one feels much smaller than the rest, it goes without saying that he's showing no signs of slowing down.",
    "21": "I have to say that I'm so relieved to finally see a great movie with a great cast, great writing, great drama, and the golden wit of Ireland grace the movie screens once more.Liam Neeson is great in this role as Finbar, a gun gun for hire, wrestling with his conscience, but, do not be fooled, this is not another one of those 'I have a particular set of skills' roles, this is a very different and more realistic and comfortable role for this legendary actor, and he's back in his home country! And yes, you get to see him actually act in this one.Great direction too, hats off to the director 👌🏾The show stealing performance for me is Kerry Condon... Wow !She is absolutely amazing in this movie, but, I mean, what is she not amazing in?I want to see more of her, in fact I think the entire planet could really benefit from seeing more of her in greatly written and directed movies and TV.Her past resume is also kind blowing.All in all, this movie, with great script, acting, direction, and wit! Is an easy 10 out of 10 rating from me!I want to see more from IRE's! And what an incredibly beautiful country too.",
    "22": "This just succeeds as a mediocre but decent, bleak-comic book/melodramatic revenge tale.There's not much depth. It's full of contrived movie moments, never considers the scope of the religious & political situation in Ireland at the time (mid 1970's); and instead has some entertaining encounters in the countryside imparting 'old wisdom ' , and some daft interchanges between ' hit men'.The direction & cinemaphotography are rather bleak and the film is played straight with some witty asides. Overall it is actually rather morose (in a typically desolate Irish countryside way). Unless you can learn to enjoy the intense performance of the main 'villain' this film would be really annoying.The contrivances began at the start with an IRA bombing of a pub which kills some passers by.Kerry Condon, playing the role of the uber-bossy, psycho-b*tch ( no sane person would deny this description- she is so Over hte Top it is hilariously 'bad') leader Doireann McCann in a small IRA team, sees a young mother and her children fumbling about over some dropped BOOKS by the pub door just before the explosion, and she moves towards them and starts shouting at them to move, we are meant to think she actually has compassion & empathy, despite being capable of blowing up a city pub, full of working-class locals... & their dogs.During the gangs escape the driver of the car deliberately smashes into a local village (county?) sign smashing it to pieces and scaring the paintwork of the drivers door.The paintwork is never repaired & they drive around in it all the time while trying to 'keep a low profile' in the same area as the sign damage!The policeman mate of Neeson notices the paint colour on the signs shredded remains then does FA about it despite saying he will.Later, psycho-b*tch boss ('PBB' from now on!) visits a single mum and her young daughter who were housing PBB's lousy, molester brother. PBB, as is her habit, says an expletive almost every other word in the exchange , while the young daughter watches, then she strangles the mother forcing her to the floor- and this is towards a family that are helping her out...! The mother is no better, also swearing for the sake of it,in front of a young child (rarely seen back in the 70's) and confronting a woman she knows could tear her apart!In a strange way PBB is the best thing about this film. Her performance & dialogue are so utterly deranged that it adds an unexpected level of (unintentional) humour in an otherwise rather mediocre & predictable piece of action fodder. She can't stop being triggered and dangerously indiscreet; screaming at her cowering male colleagues at a local rugby (?) game in front of the entire village- just after all of their pictures have appeared in the newspapers ! She has no decorum, manners, sense of consequence and screeches throughout the film like a banshee with Coprolalia. Its all played straight & hyper-intense, even bolstered by foreboding music.... at least she's memorable.Some may say she ruins the film, it is an insulting portrayal of the IRA and their 'cause/agenda' and takes away a certain dramatic tension, /they are all issues worth considering if you like, however this is really an revenge-action fantasy (as 99% of action films seem to be), the events are unbelievable and could never transpire in the way they do. Any real-life similarities are there purely as part of the plot contrivances and justification for the landscape/location.For me, her OTT character & performance are the only reason I'd re watch this.There's plenty of other eye rolling moments.A female neighbor & friend of Neesons sees PBB smashing up Neesons car with a baseball bat . She comes out of her cottage with arms folded and a scowl. PBB confronts the neighbor with another explosion of foul mouthed insults, threats, & a look of utter contempt. The neighbor is quite old and gives PBB more scornful looks and armed with nothing more than a righteous attitude calls PBB a b*tch (she missed out the psychopathic bit) .... ....PBB punches her, knocking her out.Neeson watches all of this while hidden with his hit-man colleague (who is played with a variable accent by Jack Gleeson from GameOfThrones, who also gets some amusing side-quips but they are too often lost due to poor sound recording & sometimes weak delivery),The biggest eye roll is possibly the Policeman/Guarda mate of Neesons, who is suspicious but clueless. I wont give away any spoilers, but the ending with the BAG is possibly one of the daftest moments in the entire film,,, well, actually, the lack of people crowding the bar in a full pub is probably the most unbelievable element of this film for those of us who grew up at the time in similar place- maybe the film makers have never had a drink in an actual pub, & imagine they are like wine bars instead ?Some literary pretentions are woven into the film, to say more would ruin the filmmakers 'joke' at the end.So (for me) it is actually a marginally better Neeson film of this ilk, while certainly no master piece (or even very good really) , it is one of the few I'd re-watch, preferably with friends to laugh along with the hysteria of the cartoon PBB with Coprolalia."
}