{
    "0": "This is probably the best Vacation film to come from the National Lampoon series.  There are so many laughs to go around (thanks to writer John Hughes) that it boggles the mind (and it might be the final time Checy Chase brings belly laughs).  Here, the Griswalds don't go on a vacation, but instead the family stays in Chicago where there relatives come to town and hell will come too.  Randy Quaid makes this film a treat by having just laugh out loud moments on the screen.  Great fun for the whole family (I think).  A+",
    "1": "This is the one Christmas movie that I don't anyone can ever get tired of. Chevy Chase returns in the third installment of the Vacation series as Clarke W. Griswold as he tries desperately to maintain his sanity during the holidays with all of his relatives coming to stay under his roof and enduring all the mishaps along the way.This is the funniest film in the series plain and simple.  Chevy Chase has never been better.  Christmas Vacation is filled with countless jokes and gags that it's impossible not to laugh.10/10",
    "2": "... crazy? At least at the brink of madness at times. Chevy Chase as Mr. Griswold .. not few will remember those names. I reckon some might have wanted to be in the extended and already big Griswold family alltogether. Now I might have rewatched this out of season, but I do think it works no matter what time of the year it is.And that is what makes this a great comedy. Also the actors and the script involved! Some jokes may be a bit .. well don't be too woke about certain things or too PC. Also yes some are just plain silly and there is a lot of don't try this at home stuff. It's a movie, try to accept it (like when Chevy is in the attic and sets his chair in the one spot where it makes no sense at all, other than to get a laugh out of the audience).So great cast and good natured humor. What else do you need?",
    "3": "I don't know how anyone could ever go in life without seeing Christmas Vacation, it's one of the necessary movies you have to watch during the holidays. The reason being is that everyone can relate to this movie in one way or another. Who hasn't had their crazy family over during the holiday season? Well, that's Christmas Vacation, one of the funniest movies you will ever see. You think that Vacation topped it off with the laughs, believe me when I say that you've seen nothing yet. With an all star cast that clicked so well, you couldn't go wrong going on a great Christmas Vacation with the Griswolds.Clark Griswold has really got the Christmas spirit this year, and his wife Ellen, son Rusty, and daughter Audrey have noticed that. Clark has invited Ellen's parents Art and Francis Smith, his own parents Clark and Nora Griswold, and his Aunt Bethany and Uncle Lewis to spend the holidays at the Griswold house in Chicago. But in spite of all the good intentions and careful planning, Christmas plans start to go awry: crazy squirrels, SWAT teams, burning Christmas trees, an over cooked turkey and of course a visit from the world's favorite white trash with a heart of gold Cousin Eddie! A Christmas ride not to be missed with the Griswold family.One of the things I just adore about this movie is the little touches they put in the film: the grandparents falling asleep to an old Christmas movie playing on TV, the anxiety you feel as the doorbell rings knowing who's going to be behind it, and the little awkwardness during dinner when you hear everyone chewing their food. Chevy Chase is still such a pervert of course going for the hot sales lady instead of Cristy Brinkley this time, but you can't help but love and laugh at his fantasy in the back yard while the whole family is swimming in his most wanted work bonus: a family sized pool. He maybe a crazy pervert at times, but you feel the love he has for his family and how badly he wants Christmas to be perfect.There are some great laughs in this movie: a squirrel gets caught in the Christmas tree that Clark brings in and it attacks the family and neighbors! Clark gets upset that there is no Christmas bonus so his cousin Eddie kidnaps Clark's boss, wraps him in a bow and gives him to Clark so he could kick him in the butt! A cat chews on the Christmas lights and gets electrocuted under the chair. But if you also get past all the slap stick humor, you still feel the Christmas message at the end, that despite all the craziness that comes around Christmas, don't forget what it's really about: peace and love. A wonderful ending and a perfect movie for Christmas that I watch every year, Christmas Vacation is definitely in Santa's movie collection somewhere.10/10",
    "4": "It mayn't be one of my favourite Christmas movies, but it is one of the funnier ones for me. I agree some of it is silly, and when I say silly I mean silly, and the story is really quite predictable. But it at least looks good with some nice cinematography and scenery, and the music is fine too. The script has many funny moments and the sight gags while silly are respectable. The direction is competent and the performances from Chevy Chase and Beverley D'Angelo are likable while Randy Quaid gives some great relief as a decidedly obnoxious relative. So in conclusion, no masterpiece but it is entertaining, that's what matters to me. 8/10 Bethany Cox",
    "5": "Since the holidays are approaching, I feel I should comment on this Christmas classic. Chevy Chase is hilarious once again as Clark, and this is the funniest Vacation next to the original when they go to Wally World. Some of the funniest lines too: \"Gonna burn some dust here, eat my rubber.\" \"It is a bit nipply out, I mean nippy out!\". A Christmas movie to own , and if you don't, worthy of a rent at the holidays. Randy Quaid has some great moments as Eddie, and don't miss Chase's run down the hill in the sled!",
    "6": "I loved this movie especially the bit with the Christmas lights",
    "7": "My family only has 1 tradition, every year during the holiday season we all get together to watch Christmas Vacation. We have been doing this for a long time so I have watched this movie a lot and it still makes me laugh.Favourite scene...\"Where's the Tylenol\".Its just about the perfect film much better than other xmas movies like Die Hard and Lethal Weapon!",
    "8": "This is My favorite Christmas movie! Its so funny and it has an excellent cast and acting!The film has non-stop laughs and I recommend all people who love comedies to rent this or even buy it! Its the at funny!",
    "9": "If there ever was someone who understood the effects of Murphy's Law it's the always-maligned Clark Griswold who just wanted the perfect family Christmas and instead is leveled with one disaster after another. If Clark isn't battle scarred from putting up Christmas lights, he's contending with problems with the tree. Bickering relatives, long-awaited bonus(which doesn't turn out to be what Clark was hoping for so he could pay for a new pool), Cousin Eddie, getting locked in the attic while the family is gone(not to mention getting smacked in the face with the attic latter and falling out altogether while watching old family reels on the projector), an overcooked turkey, Cousin Eddie, a sled ride that goes terribly wrong..did I mention Cousin Eddie? With plenty of Chevy Chase zingers(his demand at the end that no one leaves when all is not well, what he'd like to tell his (insert insults here) boss who screwed him over regarding the late \"bonus\", and especially his comments about Eddie), slapstick, and one hell of a supporting cast, \"National Lampoon's Christmas Vacation\" stands the test of time as a real comedy Christmas classic worth revisiting every single year. The mayhem brought on by one nightmarish scenario after another(the tree going up in flames thanks to Uncle Lewis' cigar, the cat getting \"lit up\" when Clark plugs in the lights, Eddie filling the Griswold sewer with \"toxic s#it\", a runaway squirrel causing the family to panic, etc.)provides plenty of chuckles. Before this film John Hughes was mainly putting out teenage fare, but afterward you'd have other Christmas slapstick comedies like HOME ALONE where destruction in a cartoony fashion would erupt on the unlucky. Probably the last great comedy Chase would be a part of; the next decade wasn't as kind as the 80s.",
    "10": "Christmas Vacation is a hilarious movie and you are sure to laugh at least once while viewing the film unless your name happens to be Scrooge or Grinch! I've loved the Griswold family since they took a \"Vacation\" to Wally World then off for a \"European Vacation\"! Their \"Christmas Vacation\" is just as comical as their other two.If you have refused to watch this film or if you just plain missed it - then I urge you to watch the movie! You many laugh so hard you will spit your drink out of your nose while tears of laughter stream down your face.This is a great Christmas movie classic! 9/10",
    "11": "There's no way that National Lampoon's Christmas Vacation should be as good as it is. By 1989, Chevy Chase had become, well, Chevy Chase and a holiday film three movies in feels like a cash-in. And yet this is a movie that my wife's family watches every single year and now, I've become part of that tradition.The first movie by director Jeremiah S. Chechik (who went on to direct Diabolique), the real joy of this movie is the script by John Hughes, based on his story Christmas '59.Chase and D'Angelo are back, but as always, the kids are played by different actors. This time, Audrey is Juliette Lewis and Rusty is Johnny Galecki. This probably has the smartest casting of any of the films in the series, with Clark's parents being played by John Randolph and Diane Ladd, Ellen's by E. G. Marshall and Doris Roberts, William Hickey and Mae Questel as the elderly and deranged Lewis and Bethany Griswold, evil neighbors the Chesters played by Julia-Louis Dreyfuss and Nicholas Guest, and most importantly, Randy Quaid and Miriam Flynn returning as Eddie and Catherine.Eddie's appearance surprises me every time, how he just shows up out of nowhere and then takes over the movie. Yes, in the days before he was a conspiracy driven near-insane man, Randy Quaid had incredible comic timing.It also has the episodic story idea that works so well from the first movie as you can come into this movie at any time and enjoy it. I mean, the shopping for lingerie scene? The sled riding? Randy waving in the pool dream? There are so many moments that make me laugh just imagining them.Director Chris Columbus started as the director, but he and Chevy Chase did not get along, so John Hughes replaced him and gave him Home Alone. That worked out, right?It also will never fail to blow my mind that Angelo Badalamenti did the score to this.We haven't watched this movie since two Christmas Days ago. My father-in-law, who would shush us all and make us all watch it together no matter what, is gone and maybe it's too hard to watch. The closing line, where Clark just says, \"I did it\" used to make me cry before because it's so wonderful and perfect and sums up the end of the holidays as an adult so well. But now, in a year where I've lost both of the fathers in my life, it seems like it all could all be too much.",
    "12": "Where do you think you're going? Nobody's leaving. Nobody's walking out on this fun, old-fashioned family Christmas. No, no. We're all in this together. This is a full-blown, four-alarm holiday emergency here. We're gonna press on, and we're gonna have the hap, hap, happiest Christmas since Bing Crosby tap-danced with Danny f*cking Kaye. And when Santa squeezes his fat white ass down that chimney tonight, he's gonna find the jolliest bunch of assholes this side of the nuthouse. We're going to have the hap-hap-happiest Christmas ever! It's that time of year again! You can't celebrate Christmas without watching National Lampoon Christmas Vacation, first! Directed by Jeremiah S. Chechik. It is the third installment in National Lampoon's Vacation film series, and was written by John Hughes, based on his short story in National Lampoon magazine, \"Christmas '59\". This movie is notable for being the only one of the Vacation series to take place at the Griswold home which gives the vacation concept, something new. Some people think as this movie as a reboot than a sequel. The film tells the story of Clark Griswold (Chevy Chase) whom is trying to create the best Christmas for his family, but everything, he wants to happen, go against his favor. Can Clark Griswold make the best Christmas holiday for his family or will it turn out to be another disaster? Watch it, to find out. Without spoiling the film, too much. The movie is a great watch. Most of the humors hit the funny bone than miss to me. I love the animated opening credits with the Christmas vacation theme. Apparently even Santa Claus isn't immune to the comic misfortune. I love the slapstick humor has for Clark. Clark trying to set up Christmas lightings is probably the highlight of the film. The movie was very smart in its recycle on old jokes like the Easter eggs, Wally World Cups. Still, other old clichés felt a little overused by other films at the time such as the dog humping scene. Even, Mele Kalikimaka pool sequence was kinda overused. It remind me, of the pool sequence from 1982's Fast Time at Ridgemont High. It wasn't really funny. The fan service, Mary's (Nicolette Scorsese) scenes are hot, but it could be taken out, in my opinion as it has nothing to bring to the table. She's no Christie Brinkley. Some people might not like the dark crude raunchy humor, the movie brings. After all, it does have a cat getting killed on screen and an elderly man getting catch on fire. This movie might not be for everybody. If you got small children, this movie might not be for them with all the sex, violence and harsh language themes. A parent should judge for themselves, if this movie is alright for their children. For the most part, it felt like a PG-13. The movie is well acted. The original cast is just as good as they were in the original previous movie. Chevy Chase is awesome as the everyman father, who just wanted to give the best Christmas ever to his family, but has to fight so much to do it. In my opinion, this is Chevy Chase's greatest film. Supporting characters like Ellen (Beverly D'Angelo), were alright for the most part, despite her, being the submissive of sorts, type of wife. The children, Aubrey (Juliette Lewis) and Rusty (Johnny Galecki) were kinda forgettable as they are given little to no screen time. It's seem like in every Vacation movie, new actors are always playing the Griswold's children. It can be a bit confusing as Rusty and Audrey's age differ from film to film. In this film, Audrey tends to be older, despite Rusty being older in the previous two films. Anyways, the previous Griswold's children actors really didn't do much, after their film. At less, these actors went on to become bigger names in the industry. One of the most entertaining part of the film, had to come with Randy Quaid's character of Cousin Eddie who comes back from the original film to plays the opposite of Chevy Chase's straight man character as the scene-stealing slob. He wasn't too annoying or unlikeable. Quaid did the right amount of balance. Other people worth noting is Julia Louis-Dreyfus as the yippie neighbor, Margo Chester, whom always get accident abuse from the Griswold. She was funny. The movie has way too much elder characters to remember. Those could be cut down, or written better. The only ones, I can remember are Francis (Doris Roberts), Bethany (Mae Questel), Lewis (William Hickey) and Art (E.G. Marshall). All of them add their own bits of amusement. Overall: Having seen the previous two films in the Lampoon series. 1983's National Lampoon's Vacation & 1985's National Lampoon's European Vacation. I was delighted, this film was really enjoyable. In my opinion, it's the best comedy in the National Lampoon series as a whole. It was not a disappointment, like the sequel, 2003's Christmas Vacation 2: Cousin Eddie's Island Adventure & 1997's National Lampoon's Vegas Vacation. Since its release in 1989, Christmas Vacation has often been labeled as a modern Christmas classic. This film should definitely raise your spirits and give thanks that your Christmas isn't as stressful as the Griswold.",
    "13": "As someone who went to the theatre in '89 to see this, and had it on VHS, then DVD when it was available, I still watch this every Christmas Season. It's definitely in my top 5 Christmas movies, and my top 20 comedies.So what could I possibly add in 2020, that hasn't been mentioned before? Not much.Still, as I watch this for the millionth time (thank you cable TV and legal weed), I've decided to officially chime in.After an arguably disappointing sequel, this third 'Vacation' instalment comes back with a super-clutch performance. Think 'walk off home run, in the bottom of the ninth to win the game', level of salvation.As a fan of National Lampoon during its heyday, this was such a nice 'win' for the franchise. Even though by that point, The Lampoon was past it's prime, this movie really tied a bow on the Doug Kenney (RIP)/Chevy Chase era. See 'A Futile and Stupid Gesture' for more info.Chevy deserves all the praise for this performance. It's the culmination of all his best roles-from SNL, Caddyshack, Spies Like Us, Three Amigos, and two Vacation movies. It's crazy that this is arguably the last time he is considered funny, or leading man material. The 90's and beyond were not kind to him.Although, that could be karma. The stories are plentiful and unfortunate. But that does not change his impact on American Comedy, because that is undeniable.So here he is, at the end of a decade in which he has seemingly proven to 'critics' that his decision to leave SNL for Hollywood, was the right one. Chevy in the 80's was a powerhouse, and here he is in '89, still killing it.Same goes for Beverly D'Angelo. My goodness I had such a crush on her. She is so amazing in this film, and she often steals the scenes. She's the glue of the franchise, and her on screen chemistry with Chase is never better, than in this movie. She plays 'straight' comedy and the blissfully resigned, so well.When she clues into the Christmas Lights situation, it's so hilarious...every time. Her facial expressions are next level.I mean, Ellen and Clark's scenes are the only good thing about the second 'Vacation' movie, in my opinion.I love that they lean into the circumstances surrounding the decision to have different actors portraying the kids. (See trivia section for European Vacation)As much as I love the original duo, I always feel this siblings pairing was the best. Their comedic sensibilities are fantastic.I also loved meeting the various parents, grandparents and of course, the amazing Eddie and Catherine are fantastic as usual.I love that Brian Doyle Murray is in this.I love that when I first saw Seinfeld, I said: \"That's the girl from Christmas Vacation!\".I love that the actress who played Aunt Bethany, Mae Questel, is the real-life Betty Boop.I love that rant from Clark, regarding his bonus. It NEVER gets old.I love that the ending for this movie, was the original ending in the FIRST Vacation movie.I hate that they didn't end this franchise, here. This should've been the final chapter, because Clark finally wins!He finally creates the 'perfect' family experience.While the original Vacation will always be my favourite, this one is decimal points away, in comedic value.",
    "14": "It's Christmas time - Clark decides to invite all the family to have 'the most fun-filled old- fashioned family Christmas', which nobody shall ever forget. When the first relatives arrive, Clark soon flees on the roof to rig the lighting. The one thing the loving father wants to surprise the whole family with is the installation of a pool, which he already ordered. Unfortunately, the bonus cheque Clark expects any minute is overdue - and tempers rise, but not only because of the cheque. A big event is the arrival of uninvited cousin Eddie with his family in their mobile home, as well as a little sledding afternoon with a new lubricant from Clark's company, or his shifting relationship with the very hip and clean neighbours. Cousin Eddie chooses to top off all presents with his very own special creation, only intending to deliver a real reason to be jolly......After nearly 23 years, this is one of the last 'traditional Christmas films' released, before we had a slew of self referential and ironic, Christmas movies.It's also easily the best Vacation movie, and in my opinion, Chases finest movie. It's hilarious and also one of the very few films that actually gives you a Christmas fuzzy feeling inside.Plot wise, there is no plot, it's just basically a series of sketches that build up to a family dinner, with a subplot of a bonus cheque waiting to arrive.The cast are great, and although it has a very eighties feel to it, it still feels very fresh when you watch it year after year, and it never gets boring.See it, and get that warm feeling inside every single time.A true Christmas classic.",
    "15": "\"National Lampoon's Christmas Vacation\" is probably one of the funniest christmas comedies i've ever seen in all these years, and definitely worth watching every holiday season.",
    "16": "National Lampoon's Christmas Vacation (1989): Dir: Jeremiah Chechik / Cast: Chevy Chase, Beverly D'Angelo, Randy Quaid, William Hickey, Brian Doyle-Murray: The third in the hilarious comedy franchise contains an exaggerated yet modern theme, which viewers may relate. Clark W. Griswold desires a holiday Christmas at home with extended family but everything goes wrong. Chevy Chase delivers several great physical jokes including a sled race that goes beyond fast. As Clark he awaits his bonus so to surprise the family with a swimming pool. He goes beyond standard family procedure especially when lighting the house. Beverly D'Angelo returns as his loyal and sensible wife Ellen who tries to make sense of Clark's mishaps. Randy Quaid steals every scene he is in as redneck cousin Eddie who arrives in a beat up R.V, and delivers some of the best lines. One element of concern is too many characters to really advance although William Hickey as Uncle Lewis is a steal when he accidentally burns down the tree. Everyone else is a role call of great talent with a few lines and moments but little development. Not for children due to adult humour including a controversial scene involving an electrocuted cat. This film is filled with great moments and non stop laughs while presenting a sense of normality within its setting. The result is a grand way to spend the holidays. Score: 8 ½ / 10",
    "17": "I saw this movie for the first time in 2017, and it's portrayal of a desperate attempt to recreate a nostalgic white-bread Christmas that never actually existed seem weirdly apropos. But even outside of that this is a very funny movie, as a well-meaning but fairly deluded father puts his children through hell to create a perfect family Christmas with a big tree, a bazillion lights, and goodwill for all, and winds up with electric shocks, a white trash trailer, and vicious squirrels. Chevy Chase shows off a lot of his SNL physical comedy skills as the father, and the rest of the cast is solid, with a notable performance by the original voice of Betty Boop and Olive Oyl as a hilariously befuddled relative.Even though this is very slapsticky, it still offers the sort of sentimentality required of any Christmas film, giving an underlying sweetness to the movie even as it spreads mayhem and madness.",
    "18": "Adult comedies have changed a lot. Now you're bombarded with the all out R rated horrifying dirty comedies of nowadays. Not all of them are bad if you like that gross out comedy style. But back in the 80's, even the late 80's, adult comedy was a whole different ball game and the National Lampoon Vacation Movies pioneered many of those laughs. Christmas Vacation is definitely unique because I don't believe there were a lot of adult oriented Christmas movies out there. And no matter what anyone else says this an adult comedy. It has bad language, sexual connotations, and just general a lot of adult humour. But it works so well and this film is downright hilarious. The script is just incredibly clever and the film makers let Chevy Chase do exactly what he does best and delivers the dialogue like a comedy legend. The cast works so well together and its such an ensemble cast of wacky and zany characters and you can't help but fall in love with the entire Griswold family. Its a laugh out loud, slapstick, comedy classic.This was Chevy Chase at his best. Even now years later if you see him on Community he still delivers that awkward, gangly everyman type character that delivers outstanding one liners and hilarious dialogue. Clark Griswold is perfect and no one could do that role like Chase. You just love this guy no matter what through all his mistakes and stupid follies. I always thought that Beverly D'Angelo had a strange chemistry with Chevy Chase, they seem like polar opposites but yet their chemistry has always worked for the Vacation movies and still works perfectly in this one. She's definitely the straight man to the entire film and doesn't get a lot of the gags but she is Chevy Chase's perfect partner. Juliette Lewis and Johnny Galecki are the Griswold children this time around and they are good and they fulfil their duties appropriately but neither one really stand out. One of the legendary performances in this film is that by Randy Quaid as the infamous Cousin Eddie. Quaid is downright brilliant as the white trash trailer park Cousin with a big heart but no brains. Him and Chase are brilliant together and you can't help but howl at his misfortunes and stupid blunders. The supporting cast are one of the best ensembles in movie history, all bringing about some of the best laughs ever. William Hickey, Mae Questel, Doris Roberts, John Randolph, and Miriam Flynn are a few of the truly stand out performances in supporting roles. Also deserving of mentioning is Brian Doyle-Murray in a small role as Chase's money hungry boss. Two performances that are wasted and pointless are that of Julia Louis-Dreyfus and Nicholas Guest as the annoyed neighbours. There is no purpose to them in the film and they are just more annoying than anything.The film makers, led by Canadian director Jeremiah Chechik, packed so much into this movie and yet it doesn't feel crowded. It feels like the perfect Holiday slapstick comedy. You feel like you become one of the Griswold's and partake in every moment of their insane holiday. Ridiculous physical comedy, hilarious chemistry between the cast makes this an absolute must see every Holiday season or even any time. This was director Chechik's debut and its easy to see why he's worked steadily in Hollywood since then, even in Television because he clearly has an eye for making a film feel right, pacing it right, and letting the actors do what they do best. This will make you fall in love with the Griswold's and see the whole series again and again! 9/10",
    "19": "I love the Griswolds and have since I first saw their European Vacation film. I later saw the original film. Anyway, this film is great about Clark's ideal Christmas holiday with the family around. The only problem is that nothing ever goes right for him just like his vacations. Anyway, a great cast including Chevy Chase and Beverly D'Angelo as the Griswolds. The kids are played by Juliette Lewis and Johnny Galecki. THe visiting family members are played by Doris Roberts, John Randolph, Diane Ladd, and E.G. Marshall. You can't forget Cousin Eddie played by Randy Quaid and his wife Kathryn played by Miriam Flynn. The film is always a treat around the Holiday season. It reminds us that no family is perfect and problems often arise. As John Randolph's character, Mr. Griswold replies \"I had help from Jack Daniels.\" Of course, I can't forget Julia Louis-Dreyfus playing the snobby yuppie neighbor. I also liked watching Bill Hickey and Mae Questal as the older family relatives who come on Christmas Eve. It's always worth the laughs.",
    "20": "National Lampoon's Christmas Vacation is a terrific movie,one of the greatest Christmas movies ever made and a must watch during the holidays that the whole family will enjoy,the movie is a huge laugh from start to finish,with a great story line,fantastic characters,a hilarious cast,which keeps the whole movie extremely enjoyable,but it wouldn't be anywhere without Chevy Chase.Clark Griswold (Chevy Chase) wants to have the perfect,big family Christmas with his entire family,including his parents and his wives parents,but things don't go exactly as planned when his Clarks cousin Eddie,along with his family, drops by unexpectedly to spend Christmas with them.",
    "21": "We all have our holiday favorites, movies or TV shows that we revisit each and every year, and this is mine. This is the story of the Griswalds and their debacle that is Christmas. Clark, Ellen, Audrey and Rusty set out to have \"an old fashioned family Christmas\", when all hell breaks loose, as is par for the course with this family. Both Clark's and Ellen's parents are invited and cousin Eddie and his family crash the party.\nTo me, this is the best of the Vacation movies. Even thirty years on most of the humor is still current enough to be relevant. Even though I will be watching this for the 30th time this year, I know I will still laugh along with their mishaps. If you have not yet welcomed this into your yearly holiday viewing, please do so this year and be ready to laugh.",
    "22": "The holidays are the hot time for those who love family to gather, and make merry. For the other 90% of the population it's a hassle, a burden, and frankly a pain in the butt. Without a doubt we've all experienced the \"worst Christmas ever\" but probably not like the Griswolds. This is without a doubt one of my favorite holiday films because even though family gatherings can be a pain, it's always there to (hilariously) remind me to be grateful.This is without a doubt one of my favorite Chevy Chase movies, and it puts newer \"National Lampoon\" titles to shame. If you're a \"deadpan comedy\" fan and haven't seen this movie you owe it to yourself to wait until it gets cold, start a fire, and pop in this movie.",
    "23": "Christmas Vacation is one of the movies I try to watch every holiday season. It has a lot of fun memories associated with it. It's cheesy and ridiculous, but it's familiar and traditional. This is one of the few National Lampoon movies that I enjoy.",
    "24": "\"National Lampoon's Christmas Vacation\" is a silly comedy that is an exaggerated version of what may occur at holidays; it's full of relatable tidbits. But this is a story that has heart, and that is what makes it a classic film. I give it an 8/10 rating, easily the best in the series.",
    "25": "Wow, I see opinions are well divided here. Here's mine then. Most of the \"National Lampoon\" films are pretty awful, even my American friends agree on that. Vacation was good, but European Vacation, Vegas Vacation and a long list of others are best avoided. However, in amongst all the dross there are two absolute classics: Animal House & Christmas Vacation. I LOVE this movie and it's been a part of my family's Christmas every year since 1990. I'm delighted that British TV will be showing it again in 2 days from now, December 25th. Why is it so good? Because unlike almost every other comedy it's hilarious ALL the way through. There's no let-up, no \"weak\" sections and no scene that doesn't work. From Chevy Chase driving his car under a 40 ton truck right at the beginning, to the SWAT team crashing into his living room right at the end, you'll be laughing the whole way through. We all know what a nightmare Christmas can be and this film takes the idea, wonderfully, to the ultimate. Clark Grizwald tries to give his family the perfect Christmas, way beyond anything that could possibly happen in real life, and it's - literally - a disaster from start to finish. I'm sure every husband & father in the western world will identify with Grizwald and see something of ourselves in his antics? The supporting cast are all excellent, particularly Randy Quaid as the freeloading hillbilly Cousin Eddy. I recently discovered Chevy Chase's greedy boss is played by Bill Murray's brother. yeah, I can see the similarity now. There are SO many priceless scenes in this movie it's hard to pick out the best, but if you like the thought of exploding Christmas trees, electrocuted pussy-cats, wrecking your neighbours' house and kidnapping your boss (gift-wrapped) then you'll love Christmas Vacation. I give this movie 9 out of 10 and hope everyone who hasn't seen it yet will take the opportunity, and treasure it as much as I do.",
    "26": "It is not just a good Christmas movie it is one of the best comedy's. All the joke's land.they are all relatable you would be hard pressed to find something wrong with the film.it always makes me feel like it is Christmas time no matter how many times I watch it.it never gets old and i watch it every year.",
    "27": "It seems to me that they didn't really need another addition to the \"National Lampoon's Vacation\" series after the second one, but this one is zany enough to ensure that they still had it going (although I can't quite say the same for part 4). Portraying the Griswolds inviting several relatives to their house for Christmas, the movie portrays one mishap after another (well duh; that's what all of Chevy Chase's movies are). Particularly hilarious are the sled scene, the light scene, the squirrel scene, and Clark's rant after he finds out about his Christmas bonus.It's weird to think that among the relatives invited were the \"Prizzi's Honor\" godfather (William Hickey), the voice of Betty Boop (Mae Questel), the \"Everybody Loves Raymond\" mom (Doris Roberts), and of course Cousin Eddie (Randy Quaid). All in all, \"Christmas Vacation\" is enough to put anyone in a holiday mood, even if it involves getting perpetually embarrassed.",
    "28": "An all time great Christmas classic. It's insanely funny and captures the chaos of the lead up to Christmas in an obviously exaggerated, but still relatable way. A must watch each Holiday season.",
    "29": "Really the movie has wit and charm. And how everything and anything that can go wrong. With the Griswalds due to not too bright patriarch Chevy Chase's Clark always stirring up trouble there.That with also in the obnoxious guests there like Randy Quaid's uncle Eddie there. And Clark wants his bonus but that finds out that he and the other workers will not get one due to their greedy boss.Hilarious results with Eddie using all means to make sure Clark gets the bonus.",
    "30": "A classic Christmas chaos movie, the griswolds take on the holidays with mishaps and crazy uncle Eddie. Solid storyline, decent acting, and some truly laugh out loud moments.",
    "31": "Third \"Vacation\" movie finds star Chevy Chase in fine form, as perpetually stubborn Clark W. Griswold is determined to have a happy holiday at home with the family and the in-laws. What he didn't count on was the return of his cousin Eddie (Randy Quaid, full of all the expected swagger and an absolute hoot), the ultimate hick, who brings along his family and his dog in an RV.What's great about this movie is how likable it remains even as it comes up with one ridiculous (yet funny) setback after another. The in-laws aren't the only things Clark will have to contend with: there will also be an incident on the road with some redneck drivers, the attack of a psychotic squirrel, Eddie dumping his sewage into the storm drain, the inability to get Clarks' elaborately decorated house to light up, a pair of snot nosed, disapproving neighbours (one of them played by a pre-'Seinfeld' Julia Louis-Dreyfus), and a Yuletide visit by the local SWAT team!One has to admire Clark: he soldiers on, running on a lot of heart even if he doesn't quite have the brains to match, and when he loses it in a couple of memorable, hysterical rants, they can't help but feel some sympathy for this guy. Director Jeremiah Chechik, working from a screenplay by John Hughes (who'd written the first \"Vacation\" and co-written the second), does a great job of mixing some genuinely poignant moments into all of the farcical highlights. There's some very quotable dialogue, especially from Clark and Eddie.It's great fun, too, to see so many familiar faces in this large cast; lovely Beverly D'Angelo is fine as usual as the long suffering wife Ellen; also appearing are Juliette Lewis and Johnny Galecki as the latest incarnations of Audrey and Rusty, Diane Ladd, E.G. Marshall, Doris Roberts, Miriam Flynn, William Hickey, Sam McMurray, Nicholas Guest, and Natalia Nogulich. Mae Questel, long ago voice of Betty Boop, is a riot.Christmastime simply wouldn't be complete without a viewing of this personal favourite. It starts out brightly and keeps the momentum going for a very enjoyable 98 minutes. In the words of Eddie, it's the gift that keeps on giving.Eight out of 10.",
    "32": "This film always kicks off our annual Christmas movie marathon throughout December. Utterly ridiculous, juvenile jokes and lunatic one liners from Chase complement Hughes' winning script. Quaid is grotesque again as Cousin Eddie, and the supporting cast are stellar. Easily the best Vacation film 8/10.",
    "33": "I first saw this a long time ago, and liked it a lot. On a recent viewing, I find that it hasn't aged as well as I thought. It was fun to see John Galecki and Juliette Lewis as children, and I had forgotten how pretty Julia Louis-Dreyfus was back then. I got one big laugh-out-loud moment from the whole movie, when the old aunt forgets that she is supposed to say the pre-meal blessing, and starts into the Pledge of Allegiance instead, and the whole family dutifully joins in. Clark Griswold is such a sad sack, and even though I know it is the point of the film, it's still a bit cloying. This is still OK as \"one of the Vacation films\" but if it stood alone, I think it would suffer.",
    "34": "I watched National Lampoon's Christmas Vacation just now, and I have a lot to say about this movie.The crazy events that take place in this film are so insane that it entertained me. The humor in the movie brought me joy. The script was cleverly written. The movie had a jovial tone to it. Usually whenever a movie has strange antics, I don't really like it. But this movie managed to pull off the 'so strange that it's good' idea so well that I couldn't hate it at all. The movie is a funny madcap holiday comedy that is perfect for getting the holidays started.",
    "35": "We watch this movie every Christmas on Christmas Eve (the whole family gets together).We laugh harder every year as we unpeel the humorous layers of this film.Watch for when Clark's wife checks out Snot's balls.It's hilarious.How about when Eddie returns with Clark's boss and kicks him in the ass as they walk up the path to the house.How about these quotes: \"Why is there water everywhere Todd?\" \" I don't know Margeaux.\" The Ray Charles Christmas song during the attic scene is one of the most beautiful songs I've heard.His voice is so sweet.The eyes crossed,kicked by a mule,falls in a well comment still cracks me up.I love it when Clark's Dad says that if he (Clark) needs any help that he (Dad) will be up in his room taking a nap.How about the office scene? \"Good morning ,kiss my ass,kiss his ass,etc.\"This movie is more fun to watch in a large group.Enjoy.",
    "36": "This is my favorite of the \"Vacation\" movie installments AND (next to Baddest Santa) one of my favorite Yule-time movies. While the first was the strongest, this one captures some aspect that makes me love it more. I have no idea what that aspect is, but it works.Clark has invited the whole family for Christmas Vacation and as usual, nothing goes right. With the sudden, unexpected appearance of Cousin Eddie and his whole family (including their beloved dog, \"Snot\"), Clark slowly begins to develop a nervous twitch. The lights he has installed all over the entire house do not work, and his family is driving him insane. Short trip.The only real gripe I have with this movie has to do with Rusty and Audrey. It's \"Back to the Future\" meets the Grizwolds! WtF?! WHY is Rusty now SHORTER and YOUNGER than Audrey?!But the zany factor lacking in the last installment, is back with a vengeance. And, while I found the constant transformations of Rusty and Audrey to be annoying, I suppose I've gotten used to it, and come to expect it, as it did not bother me nearly as much this time around.By far, my favorite of this series.It rates a 7.8/10 from...the Fiend :.",
    "37": "just finished watching this Christmas classic with my roommate,and,i have to say,i really enjoyed it.not only is it funny.but it's also pretty realistic in terms of how people relate to their families from their immediate family to their close relatives,distant relatives and their in laws during the holiday season,especially if they are all under the same roof.things can get a bit hairy.most people will be able to relate to Clark Griswald and what he has to deal with.i also likes the fact that the movie is very low on the syrupy sweetness that many holiday movies fall prey to.this is really just a movie that doesn't try to be anything more than it is.fun entertainment that people can relate to.for me,Christmas Vacation is an 8/10.",
    "38": "One of the greats ..wouldn't be Christmas without it ....but why are they now calling it National Lampoons Winter Holiday ...the title song is Christmas vacation ! are they gonna change that too = Stupid !!",
    "39": "\"National Lampoon's Christmas Vacation\" is not quite as good as the original, but is a hundred times better than the second installment (\"European Vacation\").  This time Chevy Chase, Beverly D'Angelo, and their kids decide to stay at home and have the whole family over for the holidays. Of course nothing goes as planned and the whole thing turns into a disaster.  Randy Quaid, Juliette Lewis, E.G. Marshall, Julia Louis-Dreyfus, and Brian Doyle Murray all add great moments of comedy as supporting players.  The direction and screenplay are solid.  Everything seems to come together fine in this one.  3.5 out of 5 stars.",
    "40": "Chevy Chase never fails to bring out the belly laughs in me with this movie and I watch it every xmas. One of the peculiar things i'm trying to fathom is why it's called Winter Vacation, it isn't the real title.",
    "41": "This is my favorite Christmas movie. I watch it multiple times a year. Christmas wouldn't be complete without it.",
    "42": "Easily one of the funniest Christmas movies ever. Just like the original National Lampoon's Vacation Clark Griswold sets out to make the perfect vacation and everything that can go wrong does go wrong. The result is hilarious and over the top with just the right amount of silliness and remains light hearted. There's many memorable quotes and scenes from Clark, Cousin Eddie, and Aunt Bethany. It's also relatable if you've hosted guests during the holidays and perfectly highlights the family drama.",
    "43": "I first saw \"Christmas Vacation\" when it was in the theaters. I've seen it many times since. It never fails to hit the spot. Chevy Chase has never been better. The supporting cast is also top-notch. Writer John Hughes wrote a lot of good scripts but this one might be his best. There are big laughs throughout this movie. There is also just the right amount of Christmas warmth. \"Christmas Vacation\" deserves to be the Christmas classic that it has become. Honorable mention: a wildly dreamy Nicolette Scorsese.",
    "44": "Christmas Vacation is one of the best films of all time! It's hilarious, clever, and fantastic. The whole family dynamic and acting is genuine. Every scene is full of fun, twists and turns, and laughs.\nIt's a really special movie.",
    "45": "This is an absolute classic. Best Christmas movie ever made. Only a Scrooge gives it less than 10stars! It wouldn't be the Christmas season without Clark, Eddie, and the family.",
    "46": "This movie never lets up. Every scene is brilliantly written and acted. Most importantly, it's hilarious, even after 23 viewings. Chevy Chase utterly brilliant in role.",
    "47": "I liked the TV version best, without the language and weird pool day dream. The true version has a struggle with being a family comedy or a adult comedy. The movie has become something to bring me into the spirit each year. The gags are unique, with the feeling of family love and fellowship in between. One can relate to this movie and then feel good that it never got that bad.",
    "48": "I know this movie by heart. Watching it has been a tradition in my family since it was released. The craziness that ensues when trying to have a family gathering during the holidays is something so many people can relate to and the overall meaning of the holidays is something many people easily lose sight of during all the hustle and bustle. This movie is a great way to be reminded that the holidays are really about family and not things.I think everyone can relate to the characters in the film and it's fun to laugh and joke about who resembles who while watching.I highly recommend watching this every year!!",
    "49": "No this isn't the best movie of all time. Some of the jokes miss while others are great, but it's got enough spirit and holiday cheer to have managed to last and it's an annual watch in my household!",
    "50": "From the first time I saw this movie back in '89 I've loved it ever since. It's pure comedy gold & its totally hilarious. I watch it every Christmas & it still makes me laugh out loud. Chevy Chase has always been so damn funny as Clark Griswold & Randy Quaid as Cousin Eddie always cracks me up. It's such a quotable movie too. They don't make comedies like this anymore. Thank goodness for classic movies.",
    "51": "Christmas Vacation is essential holiday viewing, should your holiday traditions include watching a slew of good holiday-themed movies. Add to the list one of National Lampoon's most memorable, if not funniest movie, they have ever added the name to.Join Clark Griswold's quest for a good old-fashioned \"Griswold family Christmas,\" in which, once again, despite his wife's warnings, is another attempt to make the more of a holiday than most think he ought to (see previous Griswold adventures in 'Vacation' and 'European Vacation'). And if you are familiar with these movies, you know that lots of things will go wrong before they finally go right. I think, more than the other Griswold vacation movies, this one was immensely helped by a hilarious supporting cast, including Randy Quaid showing off his great comedic talent as redneck Cousin Eddie (who shows up unexpectedly with his wife, drooling dog, and two kids in their camper), William Hickey who plays grumpy Uncle Lewis (from whom my quote is from), deaf but lovable Aunt Bethany (Mae Questel), and Julia Louise-Dreyfus and Nicholas Guest as the arrogant yuppie neighbors who have plenty of hilarious (and disastrous) run-ins with Clark. Think of it as a situation similar to 'Madhouse' (the Kirstie Alley/John Laroquette comedy), but much much funnier. It's a damn good comedy.",
    "52": "Chevy Chase, Beverly D'Angelo, Randy Quaid, Juliette Lewis, Johnny Galecki, Brian Doyle Murray, John Randolph, Diane Ladd, Doris Roberts and E.G. Marshall star in this 1989 comedy sequel. Food preserves exec, Clark Griswold (Chase) plans to have the perfect Christmas with his wife, Ellen (D'Angelo) and 2 kids, Rusty (Galecki) and Audrey (Lewis). He also wants to invite his father, Clark Sr. (Randolph), his mother, Nora (Ladd), mother-in-law, Frances (Roberts) and father-in-law, Art (Marshall). Quaid returns as cousin Eddie who unexpectedly shows up with his family and Murray plays Clark's rich uptight boss, Frank Shirley. Soon, Clark's plans backfire and it becomes another disastrous vacation for him and his family. I watch this every year on Christmas Eve and Chase is great as usual. I recommend this holiday comedy classic.",
    "53": "How anyone could not give this a 9 or more must not understand humor. This is just as good as Orginal vacation if not better. More classic scenes are reused in today's films and cartoons than almost any other movie because they are just classic.",
    "54": "This movie is exactly what Christmas is all about. Trying to get everything perfect and things never go exactly as planned.So many funny moments and a great cast. Chevy Chase's best movie!Pay attention so you don't miss all the extra funny moments!",
    "55": "Chevy Chase is a great physical comedian. Lots of great gags related to the family dynamics associated with the holiday season. The crazy in-laws and the hillbilly cousins. The snobby neighbors. The smarmy boss and the children cringing at the dad's honest and heartfelt attempts to micromanage the perfect family Christmas. I watch this every year around Thanksgiving/Christmas time with family members, it's one of those movies that never loses its luster and you will find more and more things relatable as the years go on, whether you can relate to the kids, the dad, the extended family, or the grandparents.",
    "56": "One of the many movies ya have to watch every Christmas",
    "57": "A one to watch at Christmas time. Fun fun all the way. There are so many comical bits in this film. Watch this every Christmas and never gets old, one of the greats that just makes you smile and laugh about the holiday's.",
    "58": "9/10 - hysterical holiday classic will keep you laughing and feeling festive throughout",
    "59": "Year after year, never gets old. I might watch other Christmas classics every few years, this one gets watched every year!",
    "60": "I have always loved Christmas Vacation. It has always been a family tradition to watch every year. I was disappointed when someone changed the title to 'winter holiday'. IMBD please amend. I love Christmas Vacation!",
    "61": "This was the end of the 1980s, and the end of National Lampoon´s series success. And, the mid 2010s bomb remake was the wrong way to put families in their nostalgia blindness. This time it´s about the unlucky family in the Holiday mood with too big of a Christmas tree, bob sledding going out of hand, Hawaii summer vacation memories, and at last a Christmas family gathering ending in a squad coming on a visit. This is the classic Christmas movie to watch when you and your family want some old fashioned movie fun with the Griswold family before 1990s comedies with edgy kids in the main role took over.",
    "62": "National Lampoon's Christmas Vacation is a pretty fun film, but I couldn't help but feel like it was a tad dated. Perhaps this is because a lot of its comedy has since been copied so it doesn't feel as fresh. I don't know. But it didn't quite do it for me.Chevy Chase is great in the lead role and the rest of the cast are all good.There are plenty of decent laugh out loud moments but a lot of the comedy just wasn't quite my style.I think as Christmas films go though this is a no brainer as it will be sure to entertain the whole family. I do think it is a little overrated but there are plenty of funny moments to get stuck into.",
    "63": "The third VACATION and the second written by story creator John Hughes, Christmas is more of a reboot than a sequel, starting everything from scratch for a new generation: as if there were no other trips beforehand.Audrey's still in high school and Rusty's thirteen-years-old again. The kids and mom don't amount to much anyway, merely witnessing Clark Griswold (Chevy Chase at the tail-end of his comedic peak) and his clumsy misadventures as the host of an overcrowded holiday home: including both sets of in-laws.The only real input for family's sake is Randy Quaid's white trash Cousin Eddie. A scene- stealer in the first film given his own fifteen minute layover, Eddie becomes Clark's partner- in-crime. But Quaid seems to be doing an exaggerated imitation, turning Eddie into an over- the-top comic book character. Meanwhile, Clark's reactionary disdain for his cousin-in-law's gross personality becomes redundant after the first ten times.Most of the film's spoken jokes are limp and somewhat forced. The funniest moments rely on physical gags: the fate of a curious cat; an enraged squirrel; and Christmas house lights that refuse to work.The direction, including hand-held camera and intentionally awkward moments, flows pretty well with the John Hughes script that, as usual, mixes semi dark comedy with pathos and hijinx. While the soundtrack can be spooky and ominous, befitting what's going on in Clark's troubled mind, successfully contrasting with the old fashion Norman Rockwell house and backdrop.Touted as a Holiday classic, this is really a hit-and-miss outing. The most family oriented Lampoon venture keeps some of the blue humor hidden yet it's implied throughout.Glimpses of a brooding Clark at work in the office, hoping for a bonus check to buy a swimming pool, and the intrusion of a put-upon yuppie couple who live next door – victims of whatever Clark's doing outside – are distractions to get us out of the crowded house. Yet with these sporadic reminders of real life, we often forget we're on vacation.",
    "64": "I find National Lampoon's Christmas Vacation is excellent, Because It is very Hilarious in the awesome and proper way. The Characters are very enjoyable and very likeable. Clark Griswold is a bumbling dad in the loveable way. His wife Ellen is very Kind-Hearted and supportive to her husband and her children. His two children are Audrey and Rusty are the voice of reason to their father. Catherine Johnson of the cousin of Ellen Griswold, Her husband Eddie Johnson is enjoyable and likeable. The Children Rocky and Ruby Sue Johnson are very adorable. Frank Shirley is Clark Griswold's boss was harsh at first, But He redeemed himself in the end. As for Todd and Margo Chester, They've got hilarious karma by the Griswold Family's shenanigans. I find this movie is a better example of the Christmas Comedy Movie, and it is more enjoyable than Christmas With The Kranks (2004). I'm giving this a 10/10 and Merry Christmas.",
    "65": "29 years ago one of the funniest Christmas films was made and we have all been laughing at it ever since. This film is in My top 10 Christmas Films and the reason...its a side splitting film, so many funny scenes and from start to finish it makes me laugh.Its just a film that holds its own in this day and age where we have billions spent on films and CGI thrown in from every angle. This is no such film but its unbeatable in many ways and i think every year there is always a challenge to be the next best film ever....This story is of a Vacation to be spent at a house with the whole family including the pets, what could go wrong and does makes it a hilarious family film....well worth a watch and highly entertaining.",
    "66": "One of the best Christmas films even after so many years. Chevy Chase is doing its best. Groundbreaking for subsequent films. A very great family film for Christmas time.",
    "67": "\"National Lampoon's Christmas Vacation\" or just \"Christmas Vacation\" is an American live action film from 1989 and as this one was of course also released during the season, you can say that it is almost exactly 33 years old now. Or slightly over as Christmas here is just four days away and this film came out in early December back then apparently. It runs for slightly over 1.5 hours or if you include the closing credits, then it even comes close to the 100-minute mark. The director is Jeremiah S. Chechik who was only slightly over 30 back when this was made, so he is still alive and well in 2022 and he is working mostly on television episodes nowadays, episodes from shows you may or may not have heard about. Nothing super famous, but also nothing that people have not seen at all. This film here is surely among his most famous releases though. The more known name is the one of writer John Hughes. He was also not too old when he penned the screenplay for this movie and still under the age of 40, but he is sadly of course not with us anymore and died way over a decade ago. Obviously, this film here is not among his most known efforts, not even his most known Christmas-themed effort, but this is mostly because he has just worked on so many movies that are still remembered today and not because this one here is forgotten or so. On the contrary. The fact that it was shown again on the big screen the other day (and I am not even in America) is evidence for the fact that people still remember the film. And many hold it dear.My screening was a German dub, so as a consequence there were also a handful children in the room and in general it was an okay amount of visitors. Not a great one though as I have witnessed it with screenings of other older films and to be honest I expected more people to come and see the film. It also looked like this on the website from the amount of seats taken, but I guess the fact that it was shown at one o'clock in the afternoon was also a bit of an issue for some. Still props to those who were there and I think the film has a bit of a tradition with the theater where it was shown and apparently it will be on there every year during Christmas time now. Hopefully, more people will come in the following years and I felt that those who were there had a good time. Some even had a great time, like one lady who was constantly commenting and laughing. With some of the humor in here, you could definitely identify Hughes's footprint. Now let us take a look at the cast: With Chevy Chase, turns 80 next year, I do not have to say a lot. He is the one and only lead in this film and always easy to identify. His wife is played by Beverly d'Angelo and you probably saw her in other films too. Fittingly, she is also part of the cast from \"Violent Night\", one of the most talked-about Christmas films from 2022. And CV is also not the only National Lampoon film she has been part of. Yes, there is a series. The Christmas film is a contender for most known. Maybe also for the one that has aged best from all the installments. The family's son is played by the very young Johnny Galecki (\"Roseanne\", \"The Big Bang Theory\") and if you know it is him, then you will perhaps recognize him. Despite his age, this is not even his earliest performance. Juliette Lewis plays the family's daughter and she is a few years older than her brother and of course always annoyed by him. She became an Oscar nominee only three years later, actually two you could say given the release dates and day of the Oscar nominations. Who would have guessed back then after her performance here? Not that she is bad or anything, but this is never a film for the actors to show their strengths, rather about the fun to it all and how much Christmas chaos and mayhem you can fit into slightly over 1.5 hours.This includes literally everything you can think of. There is a great deal of slapstick comedy to it and moments when people are hit in the face with something like how the moment of relaxation up there on the attic ends for Chase's character. And he was of course locked in accidentally up there. Needless to say. But as for Christmas, well what do we have? The film begins with the family led by the father going on a ride to find their Christmas tree that turns out way too big though and this ride show us that he is also not taking anything from any other traffic participants and he almost seems like a psychopath there. Solid introduction. What follows next is trouble with the Christmas tree lights or actually it is rather the lights for the entire house. Daddy gives the task to get these in order to somebody else of course, but then the lights won't work eventually, but this gets fixed and it is working like a miracle after some back and forth. When the 24th is moving closer, we also find out a little bit about the presents, but not as much as I would have thought. We only realize there is a cat in one giftbox and this cat is not only locked in there, but also really gets it later on. This was one of the maybe less politically correct moments from the film and with stuff like this you could already get in trouble today in 2022 with all the social justice warriors around. What they will dislike the most about this movie probably, however, is the scene with an actress named Nicolette Scorsese that is not related to Martin Scorsese though. Or I should say scenes because there are two. One with verbal sexual implications, the other with physical nudity. It also gets a bit more graphic than I expected. But she is absolutely beautiful there is no denying. Funny they included all this, but you could see in the almost very first scene in the car already how careful they had to be with swear words and what the father is saying there on one or two occasions. This was apparently what really made Americans upset in the late 1980s and what families did not want their kids to hear. So yeah, this film is from the year of the Fall of the Berlin Wall and this shows you how much time has passed.As for the cast, there is also Julia Louis-Dreyfus, who plays one of the family's neighbors. About her, there is not too much to say. She and her man are constantly getting punished despite not doing anything wrong, but the shenanigans of Chase's character have major impact on them and their house. As for the actress, I don't like her at all anymore. Her rich background is one thing, but how she constantly feels the need to get political and show us she is not as conservative at all as you could think given her family's fortune is utterly unlikable. Very hypocritical too. But enough of that. An actor who feels more likable in general and also adds more to the movie is Randy Quaid. He is one of those additions that get in as family members here when the movie continues and bring their own brand of comedy. His best moment was maybe the kidnapping towards the end, well not what happens inside then, but how we see him leave with his truck and then return with the protagonist's boss as a hostage. That was hilarious again thanks to the lack of political correctness and also how exaggerated it all was. They also did not (ab)use this inclusion longer than they should have. Police is right there and the situation is solved just a little later. The cop there reminded me a bit of the one from \"Family Matters\". His comment on how the boss deserved it also could have come from this series. In general, I felt that this film reflected humor and comedy from 80s and 90s sitcoms fairly well. There was one inclusion that the daughter was not happy about her brother sleeping so close to her and she tells her mom and the mom responds that she has to sleep with Chase's character in the sense that that is even worse. Maybe the funniest moment of the film for me. A touch of \"Married... with Children\".But I am sure that everybody will find something else funny from this movie we have here. It all depends on your taste. Maybe some will like the moment when the delicious Christmas roast unfortunately turns into a catastrophe, even if it looked so mouth-watering. Maybe others will like the idea of the dangerous foams down there and how inevitably it would all have to explode at some point. Which it does at the end and it is almost fireworks and resulted in a pretty nice inclusion of the American national anthem. The Star-Spangled Banner is always nice to listen to, no matter who sings or performs it. Such a great tune! This scene maybe also some would have had problems with. Let's not even talk about the idea of the German anthem being used for such a purpose. People would be up in arms and the film would not get shown anymore. Censorship galore. But again, another story. Before I get to the end of my review, mentions go out to Doris Roberts who is always easy to identify, but most of all to Mae Questel and even if she lived on for another decade after this film, this was her last on-screen performance and if you look at what she did many decades earlier in animation, then this is definitely a Hollywood icon that deserves to be mentioned. Age-wise, you can say that with this film here she was not anymore in her chameleon days, but her turtle days already. This is pretty much it then. Just some more brainstorming: There is not just a cat in here, but also a dog that causes some chaos. There is a really young girl, who could have delivered on the sweet and innocent front, but truth is she loves to use really obscene language and this is more proof here that this was not intended as a cute and harmless Christmas film, but they were all about the comedy. I mean, even if one issue is fixed in the end (I did not know about these Christmas salary raises, not a thing anymore), almost everything else is chaos and catastrophe almost. But this film is not a catastrophe. Not a revelation either, but surely worth being seen during the holidays. I give it a thumbs-up. The Bing Crosby song is also really nice.",
    "68": "Essentially, 'National Lampoon's Christmas Vacation (1989)' is a series of skits surrounding a Christmas-time family get-together that just keeps going wrong. There's a loose plot but not all that much of a narrative, with most sequences seeming like they could work entirely in isolation. The most major problem with the picture is that it just isn't funny. Don't get me wrong, it isn't exactly 'unfunny' either - I mean, it doesn't make you cringe with its humour or anything like that. It just isn't as successful as it perhaps ought to have been when it comes to the laugh department. It's a passively entertaining experience, the sort of thing that just unfolds before your eyes and doesn't require much thought. It isn't engaging, but it also isn't boring. It's absolutely fine. That's all there is to say about it. 5/10",
    "69": "National Lampoon's Christmas Vacation (1989) *** (out of 4) The third film in the series has Clark (Chevy Chase) deciding to stay home and instead of going anywhere he invites all the family over for the holidays and sure enough nothing goes right. I must admit that I enjoyed the previous two films more than this one but there's still enough laughs here to make this one well worth seeing. I think the film certainly has some flaws in it but when there are so many laughs you really can't complain too much. I think Chase is in fine form as he goes more over-the-top here than in the previous installments. He's so wild here that at times he seems like he's playing a cartoon character. This certainly isn't a bad thing as Chase can handle this type of comedy but there were a few too many slapstick scenes early on. I think what really makes this film so memorable is the terrific supporting cast. Beverly D'Angelo is just fine as the supporting wife but we get terrific work from Diane Ladd, E.G. Marshall, Juliette Lewis, John Randolph, William Hickey, Brian Doyle-Murray, Julia Louis-Dreyfuss and Mae Questel. The stand out however has to be Randy Quaid returning as Cousin Eddie. The actor really does a terrific job bringing this character to life and the comic timing is just flawless no matter what he's doing. There are so many classic scenes here that it's hard to pick out the best but some of the highlights include the cat sequence, the walk through Wal Mart, the hilarious dog-under-the-table and of course the first appearance of Eddie.",
    "70": "Poor Clark Griswold, no matter how optimistic he is, his family vacations always seem to go severely wrong. First time around he went across America in a metallic pea Station Wagon and it ended in disaster. Then they went across Europe and met similar, albeit much less funny, results.For those of you who are unfamiliar with the Griswolds, Clark is food additives expert who works for a company that doesn't appreciate him. He sets high standards for holiday events that no one can live up to and is notorious for dragging his grudging family along on every painstaking detail of every scheme. His wife Ellen (Beverly D'Angelo) is the voice of reason, who keeps the family rooted in reality and responds with frequent deadpan bewilderment to his constant disasters. The long-suffering kids, Russ and Audrey (Johnny Galecki and a very young Juliette Lewis) have turned into the living embodiment of pure cynicism, but there's no talking any sense into Clark Griswold. Ever! But now Clark just wants to stay at home in the snowy Chicago suburbs for a 'fun, old-fashioned, family Christmas' and he's going to let nothing stop him. His enthusiasm for the holidays manages to infect the audience and you'll be rooting for him the whole way. He's an anti-Scrooge and if you're having a Christmas crisis then you need to watch this movie. Any disasters can be overcome.But that's easier said than done. He didn't bargain on bickering family members (including the voice of Betty Boop, Mae Questel, as a senile old aunt), a house covered in non-working Christmas lights, a seriously over-cooked turkey, snotty Yuppie neighbors making fun of him or Cousin Eddie (Randy Quaid) and his hickabilly family turning up unannounced to sponge some Christmas cheer off him.What stops it from being just another generic Christmas movie is a brilliant script by John Hughes packed full of hilarious set-pieces and perfect comic timing from Chevy Chase. He's a great actor but his appeal sadly declined in the 90s when he refused to evolve into more serious roles like Bill Murray did. Clark Griswold and Fletch are probably his most famous roles and this Vacation is definitely one you need to take.It's hard to pick the best moments but Randy Quaid's sudden appearance will make you grin a mile wide, a cat wrapped up in a box (with Happy Birthday paper!) that meets an unfortunate end and 'an asshole in his bathrobe emptying a chemical toilet into the sewer' are just plain brilliant. But what gives Christmas Vacation something more that makes it so much more special that all the other Christmas movies is that wonderful theme song! It's absolutely brilliant! But that ain't the only great tune the film as to offer. There are also some classic songs by Ray Charles, Bing Crosby and Gene Autry.Although not the best of the bunch (Harold Ramis' direction had an evil edge to the first film that made it just that little bit better), this film has become a Yuletide classic and must be watched every year. Since Christmas is full of annual traditions this film is definitely one you should add to the list. It would criminal to give it anything less that the highly coveted 10/10.",
    "71": "The Griswold family is set to celebrate the holidays like never before, in `National Lampoon's Christmas Vacation,' directed by Jeremiah S. Chechik and written by John Hughes.  Clark Griswold (Chevy Chase) has decided to have a traditional, old-fashioned family Christmas, and has invited his parents and in-laws to stay with them through the season.  He has a surprise he wants to share with everyone this year; with his Christmas bonus from work, he's putting in a pool, to which he's already committed the down-payment money (so the bonus had better come through, big time, or he's `in it up to here').  To kick off the season, he takes Ellen (Beverly D'Angelo) and the kids, Audrey (Juliette Lewis) and Rusty (Johnny Galecki) to the mountains to find the perfect `Griswold family Christmas tree.  And it's only the first of one hilarious scene after another, as we follow Clark and clan through one long laugh-fest, filled with surprises and fun. \tChase is at his best here, in the most enduring (and endearing) character he's ever done; Clark the Everyman, who only wants the best things for his family and himself, but whose plans more often than not go awry, doomed to fall just short of realization.  When he decorates the outside of the house, he uses 25,000 twinkle lights; they use enough juice to black-out an entire neighborhood, and they do (once he can get them to work).  Then when cousin Eddie (Randy Quaid) and cousin Catherine (Miriam Flynn) show up unexpectedly in the `RV' they now call home, Eddie asks Clark if he's surprised to see him.  Surprised?  Eddie is the last person on earth Clark expected, or wanted, to see.  `Eddie,' he tells him, `I couldn't be more surprised if I woke up tomorrow morning with my head sewn to the carpet.'  Another memorable scene involves a wild squirrel who came in with the Christmas tree and proceeds to make his appearance during dinner, only to provoke a wild romp upstairs and down as they all pursue (and in some cases try to elude) the deadly invader. \tA terrific cast was assembled for this movie, but Quaid is the stand-out, and he perfects the Eddie character in this one; forever the lamebrain with the big heart, and the one who takes the situation in hand when Clark's bonus turns out to be an enrollment in a jelly-of-the-month club.  Clark's parents are played by Diane Ladd (Nora) and John Randolph (Clark, Sr.), and Ellen's by Doris Roberts (Frances) and E.G. Marshall (Art).  Other notable performances are turned in by Julia Louis-Dreyfus (Margo) and Nicholas Guest (Todd), as Clark's yuppie next door neighbors, and also by William Hickey (Uncle Lewis) and Mae Questel (Aunt Bethany).  Rounding out the supporting cast are Nicolette Scorsese (Mary), Cody Burger (Rocky), Ellen Hamilton Latzen (Ruby Sue) and Brian Doyle-Murray (Frank Shirley).  `National Lampoon's Christmas Vacation' is timeless comedy, a must for every video collection.  It can be watched over and over again, and the humor stays fresh while the laughs get even bigger.  There's a little bit of every family in here, and this movie may be just the tonic you'll need some day to get you through your own `special' holiday season.  I rate this one 10/10.",
    "72": "My Christmas is filled with ritual, as I guess most people's are. Part of that ritual is National Lampoon's Christmas Vacation, about which I have nothing but good things to say. This should be part of your Holiday season too, because despite it not seeming like it all the way through, the film as a whole is just so thoroughly festive, cheery and good-hearted.\nIt opens with a great set-piece, Clark taking his family out in the \"front-wheel drive sleigh\" to dig their Christmas tree out of the snow-covered ground. He's a desperate loser, but you have to love the guy, working his butt off to give his extended family the perfect Christmas. (That's the difference in this Vacation movie, by the way - the Griswolds don't go anywhere, their folks come to them).So the shenanigans finding a tree set the pattern for a season of chaos, fighting in-laws, squirrels, stupid relatives, huge dogs, snooty neighbours and collapsing turkeys. And as if that wasn't stress enough for poor Clark, he's waiting for his Christmas bonus to come through to cover a cheque he's already written.The script brims with festive jollity, enthusing the audience with Clark's excitement for the holidays. Stand out moments include the welcome (and hilarious) return of Randy Quaid as Cousin Eddie, the uber-hick sponger with a trailer-full of weirdo kids and rubber sheets, and Mae Questel's appearance as Aunt Bethany. She used to voice Betty Boo, and plays the crazy old woman to perfection.See this movie. Get it on video. I normally watch it the first time on a miserable October Sunday, when I start to think properly about Christmas. Nothing can replace this movie as the one thing guaranteed to get me looking forward to late December. Fabulous stuff, and as festive for me as tinsel and carols. Cuddle up with this one.",
    "73": "A comedy with laughs is good.  A comedy with feel-good laughs is better.A comedy like \"Christmas Vacation\" is great.When the Griswolds go on vacation, disaster is a certainty.  But staying home to celebrate Christmas with some far-flung relatives (who obviously weren't flung far enough) leaves room for not only some top-drawer fun but also time to reflect on family, love, goodwill, belief in one's self....Who expected so much from Chevy Chase?After watching \"Christmas Vacation\", you will.Nine stars.  And when you light up your house this Christmas, make sure there's a nuclear reactor nearby.",
    "74": "The third installment in National Lampoon's Vacation film series, 'Christmas Vacation' is A Laugh Riot! A slap-stick, over-the-top comedy, that delivers laughter in abundance. 'Christmas Vacation' Synopsis: The Griswold family's plans for a big family Christmas predictably turn into a big disaster.'Christmas Vacation' is gleefully funny & lively. John Hughes's Screenplay is notorious, wacky & extremely funny. Even the dialogue are so clever at times. Jeremiah S. Chechik's Direction is efficient. Cinematography, Editing & Art Design, deserve a special mention.Performance-Wise: Chevy Chase is fantastic, as always. He pulls off every joke with effortless ease. Beverly D'Angelo supports very well. Juliette Lewis is adorable, while Randy Quaid is in form. Johnny Galecki, John Randolph, Diane Ladd, William Hickey & Mae Questel are perfect. Julia Louis-Dreyfus & Nicholas Guest are splendid in cameos. On the whole, 'Christmas Vacation' works big time.",
    "75": "There is barely room for discussion regarding the fact this is a Christmas comedy that's perfect in virtually every respect. Withing its running time there are some of the funniest moments ever captured on film, holiday movie or otherwise. The script is one of the most hilarious, sharp, and intelligent in cinema history. The direction is inspired and technically it is without a doubt excellent. There is something about it that so stunningly captures the spirit of Christmas and the atmosphere of a family gathering. The cast is nothing less than remarkable, with an astonishing display of incredible talent. Everyone does a superb job and their comic timing is unbeatable. As an ensemble, it is truly a fantastic group effort. This is a director's dream cast and Jeremiah Chechik puts them through their paces as if he had a magic wand. Chevy Chase has never been better and Beverly D'Angelo is utterly amazing. Randy Quaid gives a knockout performance as Cousin Eddie and the motion picture wouldn't be complete without his visit. A yearly favorite at our house and one my late wife looked forward to very much. It is a happy memory of the holidays and always managed to make us laugh even though we've seen it every season since it was first shown on HBO. A funny, lovely gift to everyone for Christmas.",
    "76": "Clark Griswold plans an old fashioned family Christmas.I enjoyed this one for it's humour and Chevy Chase's hilarious performance.The story is pretty thin but contains a little nod to Dickens' A Christmas Carol with the Griswolds in place of the Cratchits and Brian Doyle-Murray playing a Scrooge-like Frank Shirley. The main focus is Clark's mission to have a big, joyful family Christmas and everything associated with this that goes spectacularly wrong.As a comedy it is reasonably strong and the jokes come thick and fast. From the start we see Clark's visual buffoonery in a plethora of disastrous actions, decisions and situations. There is a fair bit of slapstick and one-liners that worked well for me. Also the family dynamics involving the children, grandparents and other eccentric relatives are easily recognisable.Christmas Vacation is probably best known for Clark's ridiculously over the top exterior light show that he plasters all over the house. These are the strongest scenes in the movie and Chevy Chase has some of his most memorable moments here.Chase's performance for me is superb. He can make me laugh with facial expressions, physical awkwardness and one-liners. It is him and his characters that carry most of his movies and this is no different. Clark is a control freak who has everything planned out and we have the pleasure of seeing him unravel as the plans backfire. He has good support from Beverly D'Angelo and the remaining cast but it all revolves around him. Julia Louis-Dreyfus has some funny moments as one half of a couple of Yuppie neighbours.My only negatives are that it does contain a few too many recycled concepts from the original Vacation movie for my liking, such as 'the girl', the car-jump, animal death, Clarke's meltdown and heart to heart with a child. Also for me, the comedy dips in quality a bit in the second half, particularly with the protracted squirrel sequence and the repetition of fire/explosion related gags.As 'Christmas movies' go it's pretty good. How many have a cultural impact you can actually see when driving around suburban housing estates after dark during the month of December?",
    "77": "Going back to the 1930s, Hollywood has produced some very good humorous holiday films. National Lampoon's Christmas Vacation has more laughs than any that I have seen. Year after year, this movie continues to regale me over the holidays. Come Thanksgiving each year, I start checking my DVD list and begin playing my favorite holiday flicks. I like to save Christmas Vacation until close to Christmas. After my children and their families have finished most of the hectic shopping for Christmas, this is a good film to sit down to for some laughs. This is an adult film – in much of the humor and some of the language and actions. We will show it to kids when they reach their teens, with explanations and reminders about foul language or disrespectful parts. There is a genius in the writing of this film that combines occasional witty dialog with side talking built around slapstick and other situations. The situations and characters are sources of many laughs. It's all built around Clark Griswold, played to perfection by Chevy Chase. This is one of those rare original films that makes a hit and lasts so long that no one would think to try to do a remake. Indeed, who could equal or top the humor of this story as given us by this great cast? I can't imagine Clark Griswold as anyone other than Chevy Chase. Or Eddie played by anyone other than Randy Quaid. Or even the yuppie neighbors, Todd and Margo as played by Nicholas Guest and Julia Louis- Dreyfus, respectively. All the cast contribute to the humor, but it all revolves around Clark Griswold. This is a wonderful laugh-out-loud comedy that never seems to wear out. Of course it might if one were to play it incessantly during the year, instead of holding it for the holidays.",
    "78": "I think it's not necessary to write too much about this film.It's simply a masterpiece.In my opinion only Billy Wilder possibly-POSSIBLY-could have made an even better Christmas movie.For me that says a lot.This is my second review.The first one was about \"Rambo II\" It's difficult to imagine something more contrasting than these two movies.Whereas \"Rambo II\" represents (and shows) the bad,evil and disgusting things on earth,\"Christmas Vacation\" represents (and shows) the good,pleasant and beautiful ones.For example the incredibly beautiful woman in the store.Chevy Chase's reaction is so funny!! And quite understandable as well.Who wouldn't have reacted similarly...All characters-really ALL-in the movie are played excellently. Yes,also Audrey's.Juliette Lewis had to play the same character as,for example,Pamela Tiffin in \"one,two three\"-more or less a silly goose.It's quite understandable If you don't like such characters-but-as in the case of \"one,two,three\"-why blame the actors for playing them convincingly? By the way,Griswold's yuppie neighbors also don't make a very pleasant impression- because (not although) they are played so well.For me-and obviously for many others too-Christmas without \"Christmas Vacation\" cannot be a real Christmas.I would like to watch it more often than once a year,but I have the-unjustified,many may say-fear of liking this masterpiece somewhat less if I watch it \"too\" often.",
    "79": "BEWARE OF FALSE REVIEWS & REVIEWERS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 300 HOLIDAY FILMS & SPECIALS. I HAVE NO AGENDA.This hilarious 3rd film from the \"Vacation\" movies series is now its most popular. I love the original \"Vacation\" however \"Christmas Vacation\" is just as funny maybe even funnier.In this film the \"I want to be the worlds greatest dad\" Clark Griswold (Chevy Chase) is hosting a huge Christmas season at his home. Both his parents and his in-laws come in for the holidays and the party is also crashed by cousin Eddie. As we all know Christmas is never perfect and for Clark he sets himself up to a world of huge appointment.Everything Clark seems to do in this film is BIG. From getting the tree to decorating his him. He wants to do everything to the max and for all us who had to cut down trees and put up Christmas lights we understand his frustration.The film was released in 1989. I have seen this film every Christmas since. I never get tired of it. Its now part of my holiday tradition. I can honestly say the film is now a classic.You do not need to of seen the previous films to know what's going. All you need is a funny bone.",
    "80": "\"National Lampoon's Christmas Vacation\" is a Christmas classic, and there is no denying it. It is one of those movies that you just have to watch year after year come Christmas time. And the movie never gets old, no matter how many times you have seen it.Following in the tradition of the previous \"National Lampoon's Vacation\" movies, also starring Chevy Chase and Beverly D'Angelo, the 1989 \"National Lampoon's Christmas Vacation\" is every bit as hilarious, enjoyable and entertaining as the previous movies. And if you have seen the previous movies, which I assume you have as they are also classics, then you will immediately love \"National Lampoon's Christmas Vacation\" as well.The Griswold family is hosting a big family gathering for the Christmas holidays and have everything planned out, from decorating the house to the grand feast. But of course everything goes awry for Clark and the family, true to the Griswold family streak of bad luck and misfortune.What works out so well for \"National Lampoon's Christmas Vacation\" is a combination of things. First of all, the storyline is good and hilarious, with some truly wonderful situations playing out on the screen. But it is also a gallery of some magnificent characters with lots of personalities and quirks, and it is characters that easily can be identified with members of your own family. And it is, of course, also the comedy that is ever-present throughout the entire movie. There are so many laughs throughout the entire movie, and it is fabulous because it is laughs that you enjoy every year as you watch this Christmas classic.Chevy Chase is of course the embodiment of Clark W. Griswold and he carries this role with grace and perfection. And Beverly D'Angelo is right alongside him in her role as Ellen Griswold, his wife. And she not only compliments Chevy Chase, but she also stands her own ground quite well. Furthermore there are great performances by Johnny Galecki, Juliette Lewis, Randy Quaid, Doris Roberts, John Randolph and William Hickey to name but a few of the performers who shine here in this movie.\"National Lampoon's Christmas Vacation\" has truly withstood the test of time and stands out as a classic movie to brighten up Christmas year after year.",
    "81": "I remember renting 'National Lampoon's Christmas Vacation' from a video store back in the late eighties and again in the early nineties (until I figured it was simply more convenient and cost effective to buy a VHS copy and watch it whenever I want). I was young at the time and clearly loved its slightly dumb, cheesy humour (plus I was a fan of the two previous 'Vacation' films, but you don't actually have to have watched either of those to watch this one - you'll just not be one of us who get confused at the repeated new casting of the kids, Audrey and Rusty). However, for some reason, the film didn't survive my eventual binning of my tapes and buying everything again on DVD. Therefore, I was delighted when a popular online streaming service put it on their schedule in time for the festive season.It was only now did I realise how much I must have watched it back when I was young, as I knew the script practically word for word. So, in short, I still loved it and was in nostalgia heaven. And I could almost leave the review there if it wasn't for the fact that I was watching it now with my girlfriend who had never seen it before in her life. She hated it.Therefore, I was sort of forced to re-evaluate it and, although I maintain my love for it, try to see what some people may find wrong with it. Yes, the jokes are dumb. It's sort of like the 'American Pie' of its generation. It's definitely not high-brown entertainment and you have to accept that you're going to be watching a buffoon at work when it comes to the central character, played by Chevy Chase, Clark Griswold. I guess it could be said that some people may simply find him too annoying and stupid to root for.I suppose a few of the gags do fall a little flat and just as many are predictable, but then by now most adults will have seen so many comedy films by now that they can see 'old humour' coming a mile off. There was actually more profanity in this than I remember, including one 'F-bomb' which does mean that the film may be more unsuitable for 'all' the family than I remember.I suppose it's quite tame and, because of its age, has a feeling of being done before. However, I still maintain that, overall, it's stood the test of time reasonably well and should still pick up a few new fans here and there (especially in terms of good/funny Christmas movies). You'll definitely get more out of it if, like me, you have nostalgia on your side, but even my girlfriend had to admit that Randy Quaid was a joy to watch. Although, she still maintained that the (seldom-used) neighbours got all of the best gags!http://thewrongtreemoviereviews.blogspot.co.uk/",
    "82": "\"Christmas Vacation\" has became a classic over the years, and I've liked it since I saw it! This film is a must see during the holiday season, the laughs just get you into the spirit of Christmas so much! You again have the comedy legend himself Chevy Chase returning for a third round in the Lampoon Vacation series, this time the theme is Christmas. As anybody knows when you have a Hughes film and another vacation film with Chase you will have plenty of slapstick comedy and laughs! Clark Griswold(Chevy Chase) vows his clan will enjoy the most fun-filled family Christmas ever! So oh boy get ready for the crazy mishaps, just scene after scene is hilarious, some of my favorites are when Clark gets tongue-tied in the shopping mall at a lingerie counter in front of that sexy female clerk! Also inside the home once the family gathers around the crazy scene of 25,000 lights on the roof. The family Christmas eve dinner is just a mess from an exploding turkey to cat food mixed in the jello! The living room and the Christmas tree don't have any better luck either, as the family experiences capital punishment on a cat, and a forest fire on a Christmas tree! A merry and jolly supporting cast make this film enjoyable also as Beverly D' Angelo is back as Clark's cool wife and Juliette Lewis is adorable as Clark's teen daughter. The rest of the family clan is played perfect by veterans like John Randolph, E.G. Marshall and William Hickey who all in my mind are legends. Just to mention crazy country cousin Eddie returns and he's around for the holiday as always this character is played just fine by Randy Quaid. Before her big fame, Julia Louis-Dreyfus has a small part as Clark's snobbish sexy black bra wearing next door neighbor! Overall this film is a script full of wit, and fine moments just like when Clark has memories watching old holiday films in the attic! Mainly the sheer goofiness makes people love this at Christmas time. This is one of the best Christmas films around, and this is my mother's favorite Christmas movie too, this is a must watch every Christmas.",
    "83": "If you're stuck for gift ideas for that special someone this Christmas, why not give them the gift of laughter with the Chevy Chase comedy classic 'National Lampoon's Christmas Vacation? Heartwarming and hilarious, this festive favourite will guarantee a very merry time.Chase plays Clark Griswold, a well intentioned family man whose plans for the perfect Christmas go disastrously wrong: the thousands of lights that adorn his home refuse to work; his in-laws argue with his parents; the Christmas tree goes up in flames; he is trapped in the attic while hiding his gifts; a sledging incident almost costs him his life; the turkey is overdone; his embarrassing hick relatives turn up expectedly for the holidays; a wild squirrel invades the home; and worst of all, his bonus cheque seems to have gone missing in the post.Naturally, by the time Christmas Day arrives, Clark is a complete nervous wreck, and when he discovers that his Christmas bonus is a 'year's membership to a jelly club', rather than the expected cash bonus, his temper finally snaps (of course, this being a good natured Christmas tale, everything turns out right in the end, thanks to the intervention of dumb, but well-meaning Cousin Eddie).Written by 80s comedy genius John Hughes, Christmas Vacation's script is bristling with very funny lines of dialogue, but it is the visual gags that get the biggest laughs: Clark somehow driving the family saloon between the wheels of a huge truck; the bushy tailed rodent clinging to Clark's back; the sight of Clark careering across a freeway on a well oiled sled. Chase gives one of his most memorable performances, making Clark a thoroughly likable character that one can't help but admire, despite his failures, and he is given able support by a superb cast that includes Beverly D'Angelo as his long suffering wife Ellen, Randy Quaid as Cousin Eddie, and Juliette Lewis as his daughter Audrey.And the best thing about the film? You can watch it time after time and it'll always put a smile on your face; it really is the gift that keeps on giving.",
    "84": "The Griswold family's plans for a big family Christmas predictably turn into a big disaster.How do you beat this? Frank Capra III helping to direct, John Hughes writing and Angelo Badalamenti on the score? There is no way these three folks could make a bad movie. Then throw in Chevy Chase, Brian Murray, Julia Louis-Dreyfus, Bill Hickey and Randy Quaid... you have an instant classic.I could maybe have done without Juliette Lewis. I mean, she has her moments, but how did she get to be in this film? Being the daughter of Geoffrey Lewis? It certainly was not her work being Wayne's girlfriend on \"The Wonder Years\". Oh well. At least she went on to do better things.Today, the film is considered a modern Christmas classic, and I would have to agree. It also is a strong third entry in the franchise, second only to the original. Ebert wrote, \"The movie is curious in how close it comes to delivering on its material: Sequence after sequence seems to contain all the necessary material, to be well on the way toward a payoff, and then it somehow doesn't work.\" I have to say, I think he was wrong.",
    "85": "The third VACATION and the second written by story creator John Hughes, CHRISTMAS is more of a reboot than a sequel, starting everything from scratch for a new generation: as if there were no other trips beforehand...Daughter Audrey is more bitter and frustrated than ever, and somehow Rusty, now with brown hair instead of blonde, is thirteen-years-old again...The kids and mom don't amount to much anyway, merely witnessing Clark Griswold (Chevy Chase at the tail-end of his comedic peak) and his clumsy misadventures as the host of an overcrowded holiday home: including both sets of in-laws...The only real input for family's sake is Randy Quaid's white trash Cousin Eddie: A scene-stealer in the first film given his own fifteen minute layover, Eddie becomes Clark's partner-in-crime instead of a guy who annoys him...But Quaid seems to be doing an exaggerated imitation, turning Eddie into an over-the-top comic book character; meanwhile, Clark's reactionary disdain for his cousin-in-law's gross-out personality becomes redundant, especially after the first ten times.Most of the film's spoken jokes are limp and somewhat forced. The funniest moments rely on physical gags: the fate of a curious cat, an enraged squirrel, and Christmas house lights that refuse to work...The direction, including handheld camera and intentionally awkward moments, flows pretty well with the John Hughes script that, as usual, mixes semi dark comedy with pathos and slapstick while the soundtrack can be spooky and ominous, befitting what's going on in Clark's troubled mind, successfully contrasting with the old fashion Norman Rockwell house and backdrop (which worked much better in Chase's underrated FUNNY FARM)...Touted as a Holiday classic, this is really a hit-and-miss outing. The most family oriented Lampoon venture keeps some of the blue humor hidden yet it's implied throughout...Glimpses of a brooding Clark at work in the office, hoping for a bonus check to buy a swimming pool, and the intrusion of a put-upon yuppie couple who live next door -- victims of whatever Clark's doing outside -- are distractions to get us out of the crowded house...Yet with these sporadic reminders of real life, we often forget we're on a vacation at all. The real title should be STAY-HOME VACATION.",
    "86": "National Lampoon's Christmas VacationIn this third installment of the widely successful and popular `Vacation' franchise, Chevy Chase returns to his role of Clark Griswold, along with Beverly D'Angelo as his wife Ellen. Also along for the ride is Randy Quaid, reprising his role as Uncle Eddie from the first film.`Christmas Vacation' doesn't really take the same formula as the first `Vacation' film, but it certainly is as funny. What I mean when I say, `The formula isn't the same,' is that the original film was about a family taking a road trip across America; the humor was restricted to jokes regarding road travel. The second film did the same, but became tiresome after a while.Now, `Christmas' works in the restraints of not a road travel comedy, but of a Christmas comedy: the family coming, the frustrations and aggravations ofChristmas! But also, the film captures the pure joy of Christmas at the same time, as the first film did with traveling.Perhaps the fact that John Hughes, writer of `Vacation,' wrote this film; I feel he did so because he wanted to get the series back on track after the first sequel. In an interview once, James Cameron said of `Terminator 2': `I knew the sequel would be made; I wanted to carry it on in the right direction and not let it stray from the right path' or something vaguely familiar to that. I feel that is what John Hughes did with this film. I think, in his mind, he thought this would be the last sequel, and he wanted to end it with a bang. Of course, almost a decade later in 1997, audiences were introduced to `Vegas Vacation,' which is, in my opinion, an underrated comedy, but I'll get into that in my next `Vacation' review.Clark Griswold has finally settled in for a peaceful Christmas with his family, including children Audrey (Juliette Lewis) and Rusty (Johnny Galecki). The family is coming, including Clark Wilhelm Griswold, Sr. (John Randolph), Nora Griswold (Diane Ladd), Art (E.G. Marshall), and Doris Roberts as loudmouth Frances.Only this year, Clark has made sure that EVERYTHING will go as planned. Unfortunately for him, and fortunately for us (very much so!), Clark's planning will be to no avail, as everything, much the same in the previous films, will go to pieces and this Christmas will be just as crazy as the Christmases before.Chevy Chase found his roots in the `Vacation' films; I really do not enjoy him as a regular actor/comedian, but he is perfect as Clark Griswold. He is extremely gung-ho, and has all these crazy notions and the idea of an absolute perfect vacation built up in his head, and it is more than enjoyable as we watch them wither away while he loses his cool.\nBeverly D'Angelo is, as I said in my review on the first film, surprisingly convincing as a housewife. I would never expect for her to work as an average mother, but behold, she does.The kids in this new movie are good. They may not be as great as Anthony Michael Hall and Dana Barron were, but their attitudes fit the characters for THIS script much better: Audrey has a bigger attitude and Rusty is younger and more innocent.And in this movie, the filmmakers return to what helped make the first movie so good: Cousin Eddie. I think his lack of presence in the second film really harmed its reputation, but this film brings him back in a hilarious introduction sequence outside the house (`Eddie?!).All in all, the film has some excellent gags and parodies the Christmas season we all go through very, very well. While I don't think it is quite as good as the first `Vacation' movie, it is almost as good. The reason it's hard to evaluate in comparison is because it is so different from the original; the formula as I said before is entirely different.\nIn fact, director Jeremiah S. Chechik seems to give the film an entirely different overtone. The first film had an orange tint to it, in a way, because it took place in summer and the Griswold family drove through some very dry areas. In this movie, it is Christmas, and the cinematography isbleaker? Weighed down? Darker? Not in a bad way, in a good way. It suits the film. But all these little tidbits make it harder to efficiently compare the two films together because they are so different.Overall, `Christmas Vacation' establishes itself as one of the best Christmas films to emerge out of Tinseltown in the last twenty years, along with `Home Alone.' It just parodies the season we all love so well, that it has become, for me, a Christmas tradition. I watch it at LEAST once a year around Christmas, but usually five, six, maybe seven times a year. Sometime I'm going to have to buy it on DVD and stop watching a taped NBC broadcast of the film.`Christmas Vacation' gets 4.5/5 stars from me  it's a great satire.John Ulmer",
    "87": "CHEVY CHASE IS A COMIC GENIUS & LEGEND OF CINEMA!!!!\nChristmas Vacation is my absolute favourite Xmas film as it's beyond hilarious thanks to the GENIUS that is CHEVY CHASE. I grew up watching & loving this Vacation film & of Course i love all the fantastic Vacation films & pretty much all of Chevy's flicks some of my faves of the Comedy legend's are FLETCH, FLETCH LIVES, SPIES LIKE US, THE VACATION FILMS, THREE AMIGOS, MEMOIRS OF AN INVISIBLE MAN, NOTHING BUT TROUBLE & COPS & ROBBERSONS, those are the one's i grew up watching & loving.\nChevy has been a huge part of my movie loving world since little & consider him the best movie Dad character ever with his hilarious but also touching role as Clark Griswold, the guy just wants to have the best time with his family & have as much fun as possible, he's an old fashioned all American Family man & i love him for it.\nChristmas Vacation is a masterpiece of Comedy it's truly hilarious from it's Awesome animated opening to it's crazy ending it's a fun filled & hilarious crazy Christmas Comedy that never gets old, i still laugh like i did as a kid watching it.\nChristmas Vacation is also a really beautiful film as its drenched in the beautiful look of Christmas with lots of snow & lots & lots of lights lol & there's a real sweet innocence fun to everything & at the heart of all the craziness is a nice Family man trying to have a big old fun family Christmas & he loves his family.Chevy is fantastic here as Clark & is probably the best of the Vacation franchise & really shows why he's one of greatest comic leading men in Cinema history.\nChevy is also a real nice family man in real life too & that makes me respect him & appreciate his films even more!!! Big Nostalgic Love for Chevy Chase, i wish Clark Griswold was my dad.\nA total Christmas Classic & Chevy is my favourite actor",
    "88": "Although there's not a whole lot I can add to what's already been written about this iconic 1989 holiday themed film, I'll try to offer some speculation as to why fans continue to unabashedly adore this crazy movie. Heck, I even purchased a pair of the Officially Licensed Warner Brothers Christmas Vacation Moose Mugs, and by gosh I fill them with strong eggnog (or Tom & Jerry) for a spirited toast every Christmas!If you compare all of the National Lampoon Vacation movies, this is arguably the one that stands out the most. Indeed, Christmas Vacation may be the undisputed Holy Grail of all contemporary holiday themed films.What is it about this particular movie that has people of all ages still quoting selected scenes word for word? Perhaps it's the Griswold family, emblematic of all that we dare not speak of when it comes to families merrily torturing each other over the holidays? Even with the best of intentions, sometimes the holidays can get overwhelming. And when that happens, \"good tidings\" quickly evaporate and are replaced with chaos, foul moods, and unconscionable bad behavior. And from there it's down the proverbial rabbit hole for one and all.The prolific writer/director/producer, the late John Hughes, understood these complicated family dynamics very well. There's no such thing as a perfect Christmas, or a perfect family, perfect job, or perfect life. Nothing human generated is perfect. And it is these imperfections that make Christmas Vacation such a uniquely allegorical viewing experience.No spoilers here as usual, but I can reveal that the absolutely hilarious role of Clark's Aunt Bethany was played by Mae Questel, and sadly, this was her final film appearance. And for those IMDb readers who are too young to recall, Mae was the 1930s cartoon voice of the lovable Betty Boop!",
    "89": "I enjoyed the start of the movie with the Cartoon, it's really gets you in the Christmas mood.The cartoon scenes, had some very funny moment, that will makes kids laugh,The start of the movie, I did find a little silly but however as the movie goes on, it gets a bit more funny, for the whole family not just for kidsI found this movie, had some very funny moment, that had me laughing time to time,thought out the whole movie. There were few jokes that didn't work but most of ghe Jokes worked really well , evdn with the small plot this movie had. The acting was really good from the whole cast,I found the ending was a little too cheese.8 out of 10",
    "90": "Christmas Vacation (1989) is a movie we all sat down and watched out of the DVD collection this holiday season. The storyline focuses on the Christmas season when Clark Griswold hosts both sides of the family at his house. His brother also mysteriously drops in and adds to the party. When nothing goes as planned temperatures rise and an explosive climax to the holiday festivities ensues. This movie is directed by Jeremiah S. Chechik (Benny & June) and stars Chevy Chase (Spies Like Us), Beverly D'Angelo (American History X), Juliette Lewis (From Dusk till Dawn), Diane Ladd (Wild at Heart), Randy Quaid (King Pin) and Doris Roberts (The Taking of Pelham One Two Three). The comedic content in this are so smart, clever and timeless. You get so many nostalgic feelings every time you watch this. It's one of those movies you've watched so many times you can't remember the first time you saw it. This is well done from beginning to end and is a must have for your DVD collection. This is a hands down 10/10 all time great. Maybe the best Christmas movie ever.",
    "91": "I took my parents to see this opening night which was December 1, 1989. I am glad I did. All 3 of us could relate to the things we feel WE Must Do\" at Christmas Time. From getting the tree to decorating the home! WE put huge expectations hoping everything will turn out fine and of course they don't. This was the 3rd \"Vacation\" film and most likely the most popular. Millions of us could relate the original \"Vacation\". The family road trip during the Summer. However 99% could relate to something in \"Christmas Vacation\". In this film it is of course holiday time and Clark wants to have a big old fashioned family Christmas. This means not only is his parents coming for Christmas but so is his in-laws/ Most importantly however Randy Quaid returns as Cousin Eddie. This film is a laugh a minute. If you don't like cussing and are prudish stay away. I have seen this film every year since 1989 and I still laugh as hard as I did when I saw the first time. The only film I think I have seen more is \"The Wizard of Oz\". If you have big family gatherings then watch this with them. Everyone will have a good time.",
    "92": "I was surprised to log on here and see so many negative reviews. This film is a classic! This is probably one of my most favorite movies of all time (not just Christmas), and it holds up well. It is not Christmas until I watch this film. I can literally watch this movie at any time of year and feel overwhelmed with joy. I will usually watch this film right after thanksgiving for the \"normal\" holiday season, but I will often sit down and watch it multiple times a year. This film is my favorite film of the series, and in fact because I had seen this film so many times before I watched the other films, it actually ruined them for me. It's just that good! This film is the only one that takes place solely in the Griswald residence and it gives us a chance to meet other members of the extended family. Although, eddy was in two of the other films as well but he's definitely the craziest in this one! Randy Quaid is one of few actors I know of who is actually less crazy in movies than in real life. This film is jam packed with tons of slapstick comedy, and epic one liners, though most of them are probably too inappropriate to post on here! This is must watch Christmas film that I encourage everyone to add to their Christmas traditions, you won't regret it!",
    "93": "National Lampoon's Christmas Vacation not only stands as one of the best Christmas movie staples around the holiday season, it's one of my all-time favorite movies. This is the third entry in the National Lampoon's Vacation franchise, and it follows the Griswold family setting up their house for the arrival of their relatives. Along the way, Clark Griswold (Chevy Chase) encounters a few situations that hilariously go wrong. The comedy is inventively funny, as it takes some of the recurring jokes in the Vacation movies and refreshes them for the holiday theme. The acting talent is brilliant. Chevy Chase, Beverly D'Angelo, Randy Quaid, and Miriam Flynn all reprise their roles from the previous Vacation movies, Cape Fear's Juliette Lewis and The Big Bang Theory's Johnny Galecki step into the roles of Audrey and Rusty this time around, and there are supporting performances from Julia Louis-Dreyfus, Brian Doyle-Murray, Doris Roberts, and Mae Questel. Each performer does great in their roles, especially Randy Quaid as Cousin Eddie, who steals most of the scenes. And the writing is incredible, as it balances out the comedy with moments of Clark trying to realize the true meaning of Christmas. Christmas Vacation is one of 5 sequels in the National Lampoon's Vacation franchise, and it's easily the best one. It may not eclipse the first Vacation movie, but with its holiday theme, it stands on its own. It's a timeless classic that continues to hold up today, and it has managed to stand as one of the best Christmas movies, as well as one of the funniest movies of all-time.Score: 99/100Recommendation: The highest of recommendations",
    "94": "It may well be because going to see this movie at a theatre in the east end of Toronto was the first date that I ever went on with my now wife of over 20 years, but National Lampoon's Christmas Vacation will always own a piece of my heart! I have watched this many, many times since that first date - I wouldn't say every Christmas season, but probably most - and it never, ever gets stale. Even though there are parts of the dialogue I now know off by heart it still makes me laugh. Chevy Chase was born to play Clark Griswold. He's had the character nailed perfectly since his first appearance, and this is no exception. Clark is such a lovable guy. He's kind of irritating, he's a bit clumsy, he overdoes everything and he grumbles (and sometimes worse) a lot of the time, but he's a good guy. That side of him really comes out in this movie. Clark might grumble, but he loves having the family around him - even cousin Eddie (who thankfully returns after being absent from European Vacation) although he likely wouldn't admit it. He not only loves having his family around him, he loves his family - all of them. It's a simple scene, like the one in which he has his heart to heart chat with Eddie's little girl Ruby Sue about Santa Claus, that shows that off. He might look put off when Eddie goes overboard with his requests for Christmas presents after Clark tells him he'll buy them for him since Eddie has no money, but you know he doesn't really mind doing it. I like Clark. I'd be buddies with Clark.There's so much going on in this movie that works so well. The chaotic family gathering is really nothing more than a deliberate exaggeration of the experience so many people have in getting their families (in all their diversity) together for the holidays - which means that in a bizarre sort of way it's pretty easy to relate to. Then there's Clark's struggles with getting the 25,000 lights he's decorated his house with to turn on; the understandable frustrations of the neighbours in having to deal with this insane family living next door; the wild sled ride. And there's the cat. Oh the cat. The poor, poor cat! It's funny.Strangely, the weakest parts to this for me at least were the beginning and the end. Both seemed to go a little overboard. The battle with the truck driver at the beginning of the movie as the Griswold's were heading out to get their Christmas tree really doesn't grab me - in fact it comes across as silly (and not in a good way) - and the end, where cousin Eddie kidnaps Clark's boss and brings him back to the house just seemed too much. But everything in between is astonishingly funny and well done. (8/10)",
    "95": "Chevy Chase lends his abundant comic talents to a tale where everything that could possibly go wrong does, while preparing his house for a gathering of the Griswold clan for a typical American Christmas. He goes overboard, believing that he's about to receive a nice Christmas bonus. The nerve-wracking turn of events that follow are enough to create havoc when he almost suffers a nervous breakdown before a happy ending.Lots of sight gags enliven a cheerful script by John Hughes, many having to do with the lights going up all over the housetop and walls as our hero prepares to illuminate the neighborhood with lights and music. Naturally, almost every attempt fails until someone accidentally turns on the main switch.Funniest moments come after the arrival of Cousin Eddie (Randy Quaid) who really gets into the spirit of the farce with an engaging hillbilly performance as the head of a family of rednecks. Doris Roberts and E.G. Marshall add their own bits of amusement and a senile granny, played by the woman who voiced Betty Boop, offers her own brand of clownish behavior.Summing up: Could have been better, but brightens the holiday mood with some shenanigans about eccentric relatives that just about anyone can relate to.Chevy Chase, as the fumbling and enthusiastic do-gooder, takes the Scrooge out of Christmas with some very entertaining, if somewhat improbable over-the-top antics and Beverly D'Angelo is charming and patient as his long-suffering wife.",
    "96": "Christmas Vacation is one of the best Christmas comedies that I have seen. Now that it has been 20 years since it was released, I think it is safe to say it has attained classic status.Christmas Vacation follows the Griswald family dealing with Christmas. Unlike the other vacation films the Griswalds don't travel anywhere. They have Christmas right at home. However just because they don't travel doesn't mean that it isn't a funny movie.The film is about Clark Griswald (played by Chevy Chase who does his role perfectly) trying to create the perfect Christmas for his family. However much like the other films things constantly go wrong or don't succeed. As the film goes on the mishaps become worse and funnier by the second.Christmas Vacation is a hilarious film that will have you laughing constantly. It is possibly the best of the Vacation films and is well worth watching.",
    "97": "Get your downvotes ready people, because I don't like this one.With Amazon Prime now cycling on from Halloween Horror films towards Christmas, the irrational rules I set up to decide what I watch meant that reluctantly sat through \"National Lampoon's Christmas Vacation\" - a film I might have liked when it was released, as I was nine - but now couldn't wait for the witless, tedious, pratfalls to be over.Clark Griswold (Chevy Chase) wants to have the ultimate family Christmas, like the ones he remembers from his youth. Unfortunately, disaster befalls him at every turn as his Christmas tree is too big, his lights won't turn on and his extended family arrive to argue and snipe at him. He's also reliant on an incoming Christmas bonus from his job, which he's already spent on a Swimming pool.I just don't like slapstick comedy that much and that's all \"Christmas Vacation\" is, there's no wit or jokes - there's nothing intelligent about it. It's just Chevy Chase falling over and his grandfather blowing himself up (I swear he does that the same way three times). This even extends to his neighbours (one of whom is played by Julia Louis-Dreyfus!) who must do the worst scene of 'comical' falling over that I've ever seen in my life.It doesn't help that we now know that both the male leads of the film are terrible people in real life. Nor the scenes when Clark lusts after a shop assistant despite already having a wife that is several times out of his league. Ultimately though, I just didn't find it that funny, I say again, it's just falling over and explosions. I'm not going to suggest for a moment that all these people giving the film a good review are wrong but I just wonder if their history with it is clouding their objectivity.",
    "98": "Clark and his wonderful family want to celebrate Christmas at home and he wants to make it as perfect as possible but there is one disaster coming after the other! This is one of the comedy Christmas classics. With a great cast and many jokes.Actually, the humor is not always my thing. I am not a big fan of slapstick comedy. Animals being hurt just makes me cringe and I need a bit more to laugh but people falling or a table break down. But it still has some good moments.One thin that bothered me the most was the lack of participation by most family members. It is such a great cast but we don't see much of them besides Chevy Chase and Randy Quaid (and both were great). I was excited to see Doris Roberts, but she basically got nothing to say or do, I felt it was such a waste.As usual when watching older movies it was fun to see actors I know in their earlier roles. One would be Johnny Galecki whom I wouldn't recognize if I wouldn't see his name.I am probably more generous to this movie than I should be. If it wasn't a Christmas movie it would probably get a 6 from me, but it is just a part of the Holiday season that is worth watching. It has the usual \"family is more important on Christmas than anything else\" message, and I rather get it from this movie than It's a Wonderful life.",
    "99": "A friend of mine called Willie swears this is one of the best, if not THE best Christmas movie ever and gave me his treasured DVD from off his shelf so that I too could share in the fun. However, given that his musical taste runs only as far as Shaking' Stevens and Five Star (in other words naff 80's music), I wasn't hopeful sitting down to watch it on a cold, snowy-outside pre-Christmas night (i.e. everything in its favour!).Having said that, my wife, who loves TV shows like \"You've Been Framed\" featuring the public falling down a lot, laughed quite a lot, but that too is no recommendation. I appreciate that it probably struck and continues to strike a chord with the American public, where massive family re-unions on Christmas Day with the house done up like the Blackpool or Vegas Illuminations are de rigeur (although the latter practice is certainly growing in the UK), but for me, who's never really latched onto the National Lampoon type of humour, I was left colder than a penguin.Chevy Chase does his best with his portrayal of Everyman USA, hoping for his big Christmas bonus from his employer, fantasising about younger women and trying to please everyone in the family, even the black sheep (although in this family, some are blacker than others!) but despite many pratfalls, explosions and embarrassing moments, my funny bone resolutely refused to be tickled.Not much more to say really, other than I'll be watching \"White Christmas\" and \"It's A Wonderful Life\" over the next two days, where I know I will be transported into the world of Christmas, but this particular damp squib, I'll leave to the very young, very American and Willie.",
    "100": "This is one of the handful of comedies I remembered watching when I was a kid. National Lampoon's Christmas Vacation is a Christmas comedy featuring the Griswolds trying to celebrate the holiday at their home with a joyous family get-together, but they only run into bad luck and disastrous events one after the other.This movie is one with some feel-good holiday cheer and laugh-out-loud humor. You will get dry absurdity and slapstick comic relief all bundled in one big laugh fest, including the hilarious mishaps when the family attempts to put up the huge Christmas tree in their living room to the Christmas lights decoration debacle. The filmmakers could have, though, lighten on the crude innuendos, which I think are out of place for a holiday movie.Overall, it is a somewhat fun story full of hilarious surprises and off-the-chart characters, with a touch of dramatic moments and complete absurdity. It's not a film for everybody of all ages at your own Christmas get-together, but one to watch along or with a few friends if you need some cheering up. Grade B-",
    "101": "In the course of the three National Lampoon vacation movies, Clark Griswold has become an emblem for all that is sweetest and most ineffectual in the Hollywood husband. What he wishes for his family, most desperately, is that they have a good time. All he is able to deliver is chaos and hair-raising misadventures. His wife is at least loving and grateful, but his two children are thoroughly weary of his schemes and have lost all faith in his ability to deliver on his promises. \"National Lampoon's Christmas Vacation,\" the third in the series, rings a small change on the formula. Instead of the Griswolds going on vacation, their relatives take vacations to visit them. By Christmas Eve, the Griswold household is vibrating with the pent-up anxieties and resentments of two sets of in-laws, a thoroughly wacko uncle and aunt, and a hillbilly cousin who seems to have traveled in his camper directly from Dogpatch. There are long stretches in \"National Lampoon's Christmas Vacation\" when this almost works. The movie is curious in how close it comes to delivering on its material: Sequence after sequence seems to contain all the necessary material, to be well on the way toward a payoff, and then it somehow doesn't work. And yet the parts don't fit. Maybe the movie's problem is with the director, Jeremiah S. Chechik, a first-timer at feature length, although he has won awards for his TV commercials. The screenplay was written by John Hughes, whose \"Planes, Trains and Automobiles\" was a masterful comedy about two travelers trying to find their way home for Thanksgiving, but with the Griswold saga he seems to set up sequences that Chechik isn't able to make pay off. You have the odd sensation, watching the movie, that it's straining to get off the ground but simply doesn't have the juice.",
    "102": "It's a goofy and rather entertaining little Christmas flick that needs no introduction, not all of it works, but somewhere down the line, this film's peculiar and satirical nature just ends up winning you over someway or another. First off, I want to praise John Hughes for his screenwriting, cause obviously no one but him could have written this film, and make it work as well as it did. That being said, there are a few problems when it comes to gags and delivery of them throughout the film. It isn't to say the gags aren't funny, it just feels like they could have worked a lot better if given a little more time and thought into how they were delivered, but instead a few of them feel kinda rushed. The look of the film isn't anything too special, but many of the physical gags can be quite fun, and perhaps some of the best moments of the film in general. The music is fun and lively, its cast is often electric, with Chevy Chase providing an excellent comedic performance as always. I also rather enjoyed the performances of the two kid actors in the Griswold family, although it can be a bit annoying that they change up the family dynamic so often with these films. In the end, Christmas Vacation did what it promised to do, and that was make me laugh. It's an entertaining and fun little Christmas flick that may just be the best Vacation film since the original.\nMy Rating: 8.5/10",
    "103": "I forgot how funny this film was till I shared it with my 83 year old father and mother.The comedy might be a little cruder than The Christmas Story (another Christmas comedy classic) and the story might not be as tight, but the cast is what really brings this story to life as comedy gold. The list of comedy stars is endless starting with Chevy Chase, Beverly D'Angelo, Juliette Lewis, Johnny Galecki, John Randolph, Diane Ladd, E. G. Marshall, Doris Roberts, Randy Quaid, Miriam Flynn., William Hickey, Mae Questal, Julia Louis-Dreyfus, and the list just goes on!In National Lampoon's Christmas Vacation we join the happy-go-lucky Griswald family once again, where the father just wants to have a hap-hap-happy family Christmas with both sets of in-laws staying at their family home. He is also on pins and needles waiting for his annual Christmas bonus from work. He has been counting on this bonus so much that he has already made a downpayment on a swimming pool...to be built in the spring. As with all Griswald family vacations, everything that can go wrong does...from receiving the jelly of the month club instead of a bonus, to a cat chewing through the electrical cord on their tree, there are wonderful laugh out loud moments in this film...along with some equally tender moments like the family picking out their Christmas tree together and supporting Clark through some really bad moments.This is a fairly family friendly (if you are ok with some curse words and implied sex) Christmas comedy that I highly recommend. As stated their is some crude comedy involving excrement and it's byproducts, but if you can make it through that...I think you will find some great laughs in this film. And big shout out to Chevy Chase, who as usual, is just phenomenal in this film as well as the underplayed Beverly D'Angelo, who is a great foil for Chase.",
    "104": "The Griswold's are planning a big festive get together (involving both sides of the family) which both Clark and Ellen are nervous about. Despite Clark's best efforts nothing goes to plan and Clark's various misdemeanours do not go unnoticed by his neighbours Todd and Margo...Although it doesn't really have a plot as such to speak of it says a lot that Christmas Vacation still manages to be both funny and topical all at the same time...In many ways, Clark Griswold reminded me a bit of Frank Spencer from Some Mothers Do Ave Em (incompetent, but his heart is in the right place). Whilst, in my opinion, Clark isn't quite as bad as Frank it is this very endearing quality that warms you to him even though you know more often than not he's going to eff up.Naturally the further things progress, the more unruly the Griswold's get (though Clark is to blame for most of the problems that arise, not everything is his fault). There are many notable highlights in this film; getting the Christmas tree at the start; \"Dad did you bring a saw?\" \"I'm hear to help you son, if you need me I'll be asleep.\" Those are 2 gems that I can think of, but I know there's a lot more.What really makes this film work are the wonderful performances from the cast, but if I was to single out praise I'd say that Chevy Chase and Randy Quaid were the standouts; I haven't seen many of Randy Quaid's films, but I've always felt that he brings something different to every role so I'd probably say he edges it over Chase (though Chase is extremely good).Perhaps the only criticism I could levy on this film lies with the Griswold's neighbours; when they were introduced I thought that more conflict would exist between the neighbours, but it never really manifests which was a tad disappointing.Having said that, I think what becomes the cherry on the cake for this film comes with what happens at the end with Clark's boss (I won't say anymore than that), but it embodies what Christmas is about in a humourous way without being saccharine or beating our heads with the point. A truly wonderful way to end what was a very funny film.",
    "105": "Clark Griswold, Jr. (Chevy Chase), his wife Helen (Beverly D'Angelo) and their kids, Rusty (Johnny Galecki) and Andrey (Juliette Lewis) are spending Christmas at their home in the suburban Chicago. Clark invited his family (Diane Ladd and John Randolph) and his wife's family (E.G. Marshall and Doris Roberts) for Christmas. Clark is hoping to get his big Christmas bonus, so, he can buy an swimming pool for his family. As Christmas comes near, Helen's cousin Catherine (Miriam Flynn) and her husband Cousin Eddie (Randy Quaid) unexpected comes to their home with their two kids (Ellen Hamilton Latzen and Cody Burger) and their dog. Clark's Christmas holiday is suddenly getting bigger and also turning into a mess. Nothing is sane for Clark during his vacation and especially the holidays.Directed by Jeremiah S. Chechik (The Avengers, Benny & Joon, Diabolique \"2006\") made an amusing Christmas movie that is occasionally dark but over two decades, the movie has become an modern holiday classic. Chase is certainly fun to watch in this picture, who does his best to give his family the best Christmas ever but always turns opposite instead. Quaid is great as Cousin Eddie, who steals the show, when he is on-screen.DVD has an good anamorphic Widescreen (1.78:1) transfer and an good Dolby 2.0 Surround Sound. DVD's only real extra is the decent commentary track by the director, the executive producer:Matty Simmons and cast members:D'Angelo, Quaid, Flynn and Galecki. DVD also includes the original theatrical trailer. \"Christmas Vacation\" does have some clever gags, some real laughs with some cheap jokes but the movie manage to be good-hearted and it is always fun to watch the holidays. Don't miss it. Written by the late John Hughes (The Breakfest Club, Ferris Bueller's Day Off, Uncle Buck). (****/*****).",
    "106": "Normally when you can see a film's jokes coming from a mile away, it tends to take the film down a notch in most people's eyes, but in \"Christmas Vacation,\" the third Vacation film from John Hughes and the National Lampoon's crew, it still finds away of charming your pants off--or on fire.This time the Griswolds in fact are not vacationing, but invite their extended family to spend the week up until Christmas. This time, everything goes awry at their place. It's pretty much exactly what you'd expect. Clark (Chase) goes overboard with the Christmas lights to find they don't work and manages to have assorted objects smack him in the face or take him out completely on numerous occasions. The grandparents are completely off their rockers and the kids can't stand it. Then of course what would a family Christmas be without their hick cousins the Johnsons, especially their father figure, Eddie (Randy Quaid) who is more reckless and stupid than ever in effort to push Clark over the brink.80s comedy mastermind Hughes (\"The Breakfast Club,\" \"Ferris Bueller's Day Off,\" the other 2 vacation movies) pretty much decided to stuff everything he included in the tons of other comedies he wrote in the decade into this film. It has everything from extreme physical comedy to wacky relatives to animals causing mayhem. That's why it's so predictable, but of course Hughes is also the master of reminding us of our family values and keeping them close (easy enough in a Christmas film). The comedy starts out rusty but once the ball gets rolling \"Christmas Vacation\" gets harder to roll your eyes at. The subtle outlandish humor and hi-jinx win you over every time.Chevy Chase remains the glue of the Vacation films. Every man feels like Clark Griswold at times (trouble at work, extra-marital temptations, putting all their effort into something to fail or be under-appreciated) and every person has or knows a dad like Clark Griswold. He's the epitome of the Hallmark greeting card \"Dad.\" Without his ho-hum but quick to heat up personality that Chase nails down, these films wouldn't be as good; it would be harder to get past the predictable slapstick.",
    "107": "The film has several references to the original National Lampoon's Christmas Vacation: opening scene, with the family singing in the car, is similar to an early scene in the original Vacation; their car flying over snowbank is similar to car flying over roadblock in Arizona in Vacation; another befuddled, elderly aunt drops in, but the movie is good enough that it doesn't become a rehash of the first film.It takes its time getting started; the first thirty minutes are hit and miss, but after that, it gets good, and the final thirty minutes are hilarious.Aunt Bethany is introduced with some funny lines (\"Is your house on fire?\" she cheerfully asks upon seeing 25.000 Christmas lights on it) but filmmakers wisely avoided a repeat of Aunt Edna from the original, as this confused granny lives happily through the holiday.Speaking of *holiday*, 'Holiday Road' worked well in the original Vacation, was tired and formulaic in Euro Vacation, and was wisely avoided here, and replaced with a wonderful original score.The music, and the overall tone of the entire film, is sentimental without being overly sappy; Clark watching old home movies of his youth has just the right amount of sentiment, then it was ended perfectly with a well done gag.Uncle Lewis is a delightful Grinch, with his strangled voice and deadpan delivery of lines which could have been painfully unfunny complaints, but his delivery and timing makes them work.The kids are great replacements, upgrades, for the two awful, nitwit kids in Euro Vacation.My favourite film in the National Lampoon's Vacation series, and probably my favourite Christmas movie, also.",
    "108": "\"Christmas Vacation\" hasn't fared all that well in the intervening years. It's the sort of movie you take to as a kid when you hear your dad howling at almost every turn. But it took a hefty 40 minutes of running time for Randy Quaid to mosey in and finally get the ball rolling. \"Stole the show\" is an understatement; he's the reason to sit though this.As a \"Vacation\" entry, it follows the formula to a T: Chevy Chase gets the ideal Christmas into his head, puts himself through hell getting it with a series of destructively poor decisions, sentimental lessons are learned. But the jokes are painfully forced. Cousin Eddie and Clark losing it are both peaks, but it's mostly valleys; gags that are obvious and still lack the satisfying dividends.I'm onboard with most of the holiday classics, but this is one that loses me.5/10",
    "109": "This movie, about the Griswold family's plans for a big family Christmas that predictably turn into a big disaster, is an okay sequel to National Lampoon's European Vacation (1895).It's funny, but not as funny as I remember. The pace gets slow sometimes, and it takes its time to get to the next funny moment. The humor is the strong element, and it's a movie that you don't need to pay full attention to, which is sometimes the best in terms of Christmas movies for families. Anyway, it has its own charm and can make you smile or laugh at least a few times.While this movie offers some humorous moments, its slow pace and lack of sharpness make it a somewhat underwhelming sequel. The movie's charm lies in its relatable family dynamics and the occasional chuckle it provides, making it a decent choice for a laid-back Christmas movie night.",
    "110": "Great Christmas comedy that everybody can relate with, especially if you're a family man. The one part that gets me every time is the ending when Clark looks up to the night sky with a big smile on his face and says \"I did it\". That sums up the whole film for me - just in those three words.We are all searching for success, family, friendship, and trying to make sense of this life. But Clark is the symbol that defines all of that. Throughout our lives, we go to work; we pay our bills; we fall in love; we get married; we have children; we change baby diapers. And then eventually we get to that point in our lives where everything is in place - the perfect home; the perfect job; the perfect Christmas dinner with the love ones. Clark is at the point in his life where he has accomplish all the hallmarks of a 'successful' person. So epistemically, the pinnacle of all his success is to invite all his family to Christmas, to share his love and acknowledgments. And yes, bad things happen on the way, but if you do it out of love for the sake of family, usually good things come your way.There is no greater happiness for a man than approaching a door at the end of a day knowing someone on the other side of that door is waiting for the soud of his footsteps.",
    "111": "\"National Lampoon's Christmas Vacation\" is a film that is clearly beloved of many folks and they enjoy watching it each and every holiday season. I honestly am happy they enjoy it, though I myself cannot see the charm in watching it. I first saw the movie shortly after it debuted and watched it again tonight and felt disappointed.The story is about the Griswold family NOT traveling but welcoming their parents to spend the holidays with them. Then, unexpectedly Clark' scummy Cousin Eddie and his brood show up. In the midst of this, which Clark hates tremendously, he keeps his hopes up for a Christmas bonus from a nasty boss.As I watched, again and again, I just kept thinking that this isn't funny. Or, if something was funny, it could have been done funnier. In addition, I think making Clark a rather unlikable guy hurt my viewing experience, as he seemed more interested in adultery than his loving and VERY patient wife.",
    "112": "There's a lot of hype around this film, it's one of the ones that people watch every Christmas. So I thought i'd give it a try.The bit draw for me was John Hughes, who of course famously gave us 'Breakfast Club', 'Pretty in Pink' etc. And there are lots of the standard things we expect from him in this film. It's broadly funny, it's sentimental, it's got some nice set piece moments.I think your enjoyment of this film largely comes down to whether you find Chevy Chase funny. I did not. I spent most of the film wondering which modern actors could do this better. Apart from falling on his face or widening his eyes, I didn't find Chase that funny.In fact the supporting case are the ones who take most of the laughs, with Doris Roberts in particular being a good example.If it's your favourite Christmas film then don't listen to me, go and enjoy it. For me though this one won't be making it onto my 'must watch at Christmas' list.",
    "113": "This is the third movie about Griswalds . This time they aren't leaving their home . It's Christmas folks. The guests are coming and it's about to Clark (Chevy Chase) to make everything perfect. With his lack of luck it won't be easySome people were disappointed with the second movie in the series – \"European vacation\". They didn't expected much from this third part , because really how much good third movies is out there ? \"Christmas vacation\" turned out to be a really pleasant surprise. Its not only a good movie , but according to many (including me) the best in the series. I like first one , the second is bad , the forth is a disaster , but this one is great. For me it's one of Chase's best movies and one of best Christmas movies . It's a quite huge success , because most of Christmas movies is unwatchable plastic. Jeremiah Chechik is the director of this one. The kids have been re-cast again . This time Juliette Lewis is Audrey and Johnny Galecki is Rusty . I have to say that I really liked Lewis as the typical angry teenage and Johnny Galecki (Lenard from \"The Big bang theory\") as Rusty. There are also new actors and actresses who play Clark's parents and Ellen's parents and his rich neighbors. They give a decent support.Most of the jokes comes from Clark (Chevy Chase) , Ellen (Beverly D'Angelo) and  cousin Eddie (Randy Quaid) ! Yes , he's back with his family and it's he's tour de force . He almost steals the show from Chase . The funniest moments are for me : the cartoon intro , almost every scene with Eddie , Clark talking to the sexy salesman , Clark struggling with the lamps and the Friday 13th reference. Oh , and I love the Tasmanian devil cup that Clark has at his office. And the song \"Christmas vacation\" by Mavis Staples is pretty great.The best movie of Chevy Chase. I give it 8/10.",
    "114": "National Lampoon's Christmas Vacation isn't just a wonderful Christmas film, it's also one of funniest comedies I have seen. It has countless laugh-out-loud moments and the absurdity of it all, makes it tremendously entertaining throughout.This was the second time I have watched this film, and I have to start by saying that I liked it way more than I remembered liking it. It has been a few years since I last watched it, so maybe it has something to do with my age, or perhaps I simply didn't enjoy it as much the first time around. However, watching it now, I had an absolute blast. In fact, I can't think of a single joke or gag that didn't work. While I wasn't in a constant state of laughter, the best bits are truly hilarious. And while I expected to laugh, I certainly didn't remember it being as funny as it was. However, the thing that surprised me the most was how Christmasy this film is. It goes through every bit of preparation that the holiday involves, be it finding the right Christmas tree, setting up the lights and decorations, or dealing with the relatives, and makes it feel familiar. Indeed, National Lampoon's Christmas Vacation does a tremendous job of capturing the feel and chaos of all the things that come with Christmas. It tells a story that almost anyone can relate to, which makes it easy to laugh at.Speaking of the story, it follows Clark Griswold on his quest to have the perfect family Christmas. While his wife, and kids, feel like it's a bad idea, Clark decidedly pushes on. And while everything goes great in the beginning, it soon becomes evident that things won't be exactly going to plan. And come Christmas eve, everything ends up in chaos, and it looks like Christmas is ruined. Or is it?\nIt's a simple story, and it's mostly told through jokes and comedy. And while the focus is on the funniest bits, the overall feel of the story is surprisingly homey and warm, which is exactly what I look for in a holiday movie.While I always considered National Lampoon's Christmas Vacation a fun Christmas comedy, I never considered it as something that I would want to revisit every Christmas. However, having now seen it again, it has become evidently clear that it will become a part of my yearly Christmas movie marathon. It's tremendously funny, and easy to enjoy, it's entertaining throughout, and most importantly, it's filled with holiday cheer. All the qualities that I hope to see in a Christmas film.",
    "115": "Each of the early Vacation movies nails a certain aspect of middle class family life, be it the cross-country road trip or a rare overseas adventure, and most of their laughs come from the lack of romanticism or glossy, nostalgic veneer. They dig straight into the dirty reality of awkward family dynamics, the unfulfilled promise of adulthood and the emptiness of the American dream; weighty subjects for a comedy, but the results are never all that serious. This time we're home for the holidays, with a busy household of nosy, noisy, overly dramatic relatives, in from out of town for a long, unpleasant visit. A Lampoon stay-cation, in other words, with a whole mess of awful family obligations.John Hughes is in the writer's chair again, delivering his usual high-quality, relatable laughs with just a hint of sentiment. Clearly, he's lived this life and made these mistakes, and with the benefit of hindsight, he's all too happy to share and enjoy with the rest of us. Chevy Chase runs the show on-screen, his stress levels spiked as the maligned, tormented family man who's always on the verge of a nervous breakdown. He's picture perfect as the seemingly-jolly patriarch with a devilish glint in one eye, and his visibly mounting frustrations enhance almost every scene before the inevitable blow-up.Spotted with legendary lines and fantastic scenes, the tale of the Griswolds' latest spectacular misfortune is a rumbling, tumbling wrecking ball of yule-tinted mayhem. A few of the jokes have grown dated (like most of neighboring Julia Louis-Dreyfuss's home décor), but the spirit remains rich and the broad, physical humor is timeless. I know it all by heart and I still laugh until my face hurts.",
    "116": "Clark Griswold (Chevy Chase) drag his wife Ellen (Beverly D'Angelo), daughter Audrey (Juliette Lewis) and son Rusty (Johnny Galecki) to get a Christmas tree. It's the start of a season of ridiculous family celebration. Clark doesn't get along with his yuppie neighbors, the Chesters (Nicholas Guest, Julia Louis-Dreyfus). Clark's parents (John Randolph, Diane Ladd) and Ellen's parents (E. G. Marshall, Doris Roberts) join them. Ellen's cousin Catherine (Miriam Flynn), her idiot husband Eddie Johnson (Randy Quaid) and their family pay a surprise visit. Clark desperately needs the year-end bonus from his boss Frank Shirley (Brian Doyle-Murray) to cover a cheque for the pool but he only gets a Jelly of the Month Club.There are a lot of random Christmas jokes. Some of them actually do hit well. However Chevy's shtick was getting tired at this point. Beverly D'Angelo is fine as always. The grandparents are more annoying than funny. The movie misses a great opportunity to give them some personality and depth. Honestly, I couldn't tell them apart. I don't know who are who's parents. The sets of parents could fight against each other over the kids or how Clark is doing or who the family loves more. There is a world of possibilities but they are simply lumps of coal. Even the Griswold kids are not doing the sibling rivalry that well. They're the least convincing kids of the franchise. The fact that the kids are always different could be a source of self-referencing jokes. It seems like Chevy is doing all the heavy lifting to get the laughs. Everybody is playing the straight man until Randy Quaid arrives. Cousin Eddie livens up the movie a little. At least, he adds something to the movie. Also I don't really know who Nicolette Scorsese is, but she's no Christie Brinkley. The movie has a few jokes. I love the cat getting toasted.",
    "117": "Enjoyable and funny sequel of the Griswold family finds them celebrating a nutty Christmas . Good dumb fun has lots of attractive scenes , giggles and being entertaining enough . The Griswold are a suburban Chicago family embarking on an uproaring Christmas , but the celebration proves to be much more arduous than they ever anticipated . The family's as follows : father Clark Griswold (Chevy Chase) , mother Ellen Griswold (Beverly D'Angelo) , children : Rusty (Johnny Galecki previously played by Jason Lively , Anthony Michael Hall) and Audrey (Juliette Lewis , formerly performed by Dana Hill , Dan Barron) . Nowadays , in this third vacation for the Griswold family finds them hosting repulsive relatives for Yuletide . Clark's continual bad luck is worsened by his obnoxious family guests , but he manages to keep going ; however things go wrong . Along the way suffering several incidents full of mayhem, accidents , hijinks , chaos and other funny problems , while preparing the party . Yule crack up!. There's No Place Like Home For A Holiday! For over two thousand years , America has survived many great disasters !. Now for the real test... The Griswold's !. Chevy Chase & his family are coming from America to celebrate Xmas ! . The eccentric family bumbling around in the Christmas day ! The Griswolds nearly redefine the term Ugly American ! .Third installment of the series dedicated to the Griswold family and their calamitous vacations . Again a script by John Hughes but this time directed by newcomer Jeremiah S. Chechik , starring Chase and D'Angelo as the parents of this hapless and misfit family who this time must stay home for Christmas and end up receiving a visit from a battalion of relatives and friends . The Griswolds want to surprise their whole family with a big party, however a succession of crazy disasters will turn the long-awaited surprise into true chaos. This diverting picture blends cynical sense humor , familiar relationship feeling , tongue-in-cheek , entertainment and amusement . The movie contains numerous ingredients for the bemusing , it results to be an agreeable comedy with charming family bonds . The sight gags , although predictable , are sometimes on the mark . Furthermore, there's a brief exploration about family way of life and relatives-parents-children relationships . A sympathetic movie with a host of secondaries who went on to more serious works , such as : Juliette Lewis, Johnny Galecki , Julia Louis-Dreyfus , Nicholas Guest , Nicolette Scorsese and veterans as John Randolph , Diane Ladd, E. G. Marshall , Brian Doyle-Murray and Randy Quaid is a standout as well , playing the slovenly cousin . The motion picture was professionally directed by Jeremiah S. Chechik (Diabolique, Avengers , The beast , Meltdown , Benny and Joon , Tall Tale) .The Chavy Chase/ Beverly D'Angelo trilogy about the Griswold's as follows : ¨National Lampoon's vacation¨ (1983) by Harold Ramis with Chase , D'Angelo , Anthony Michael Hall , Dana Barron ; it is followed by ¨National Lampoon's European vacation¨ (1985) by Amy Heckering with Chevy Chase, Beverly D'Angelo, Dana Hill, Jason Lively , John Astin , Paul Bartel and ¨National Lampoon's Christmas vacation¨ (1989) by Jeremiah S. Chechik with Chevy Chase , Beverly D'Angelo , Juliette Lewis , Johnny Galecki , John Randolph , Diane Ladd .",
    "118": "Its a fun filled Christmas, Clark Griswold style with Chevy Chase more likable and less laconic who wants to have a traditional family Christmas with his family.He goes out to the mountain to get a big Christmas tree, he puts down a deposit for swimming pool hoping his Christmas bonus will come through and wants to have the perfect Christmas, what can go wrong?Almost everything as more family members turn up including his cousin played by Randy Quaid and his troublesome dog. His neighbours are annoyed and if that bonus does not come through Clark is up a creek without a paddle.Its huge zany fun especially as some of the cantankerous elderly members of the family provide a lot of humour, plenty of slapstick and the syrupy schmaltz is kept to a minimum. Its probably the last great National Lampoon vacation film made.",
    "119": "I know that no cares about the second \"Vacation\" and fourth \"Vacation\" movie, but all of you would say that the first and third are the only good ones; which is very true but I don't remember watching the second and fourth from beginning to end, so, instead I only see parts of them and probably don't care seeing them. Maybe I could, but for right now here is my review for this movie. \"National Lampoon's Christmas Vacation\" is the third installment of the \"Vacation\" series as Clark Griswold and his family are spending their holiday at their home instead of taking a vacation elsewhere; instead is Clark and Ellen's family that are on a vacation as well as Clark's brother Eddie and his family. They are the ones who are having a vacation on Christmas, so now it seems that the filmmakers decide to go with a change of pace which is a good thing. The movie does have some good laughs, and it does have some great moments. Chevy Chase is always great as Clark Griswold, and the rest of the cast are great too. However, there are some parts of the film that aren't funny but it doesn't take away the experience as I am watching it. Also, on the DVD, when you watch the ending on your HDTV you can see the box where Santa Claus and the reindeers are flying in the air after Uncle Lewis drops the match into sewer as there are gas in it; that effect looks a bit dated for my taste. Anyway, the movie really does have that wonderful Christmas spirit and it really is a lot of fun to watch during the holidays. Overall, this is the best \"Vacation\" sequel ever made and I give it a 9 out of 10.",
    "120": "John Hughes. What a sad case: is it drugs?He started his career with huge promise: he made films that showed he knew how to dramatize the teenage world without using teenage bluntness. These were sensitive little things that impressed not by what they were but by how gently they rested in the world they portrayed.Then for some reason, he transmuted this into a more exaggerated more broadly drawn and more juvenile form in the \"Home Alone\" stuff. These were stuffed with enough bits to keep our eyes busy, but the real magic was in how they situated us in a ten year old's mind. Less miraculous, but still interesting.Now he has devolved into an even more juvenile world, but the light touch is completely gone. Now, we have nothing but the jokes that fill the space. Instead of rewarding the viewer with a gentle journey into a simple world, we are hammered with puerile minievents. Ted's Evaluation -- 1 of 3: You can find something better to do with this part of your life.",
    "121": "After a vacation to Wally World and a European vacation, Clark Griswold (Chevy Chase) has traded in his old son and daughter for two new kids and a \"Christmas Vacation.\" Who would not prefer Juliette Lewis over Dana Hill for the part of Audrey?It seems that writer John Hughes entered a more physical comedy stage of his career that we'd see in \"Uncle Buck\" and the two \"Home Alones.\" I guess watching \"Christmas Vacation\" after the three aforementioned movies made \"Christmas Vacation\" somewhat hohum.Instead of being on the road making a fool of himself and screwing things up, Clark is at home doing that. To be fair, he did have the help of his off kilter family, but Clark is still the sultan of screw-ups. There were some laughs to be had though I felt like I'd seen much of the material before. Christmas is supposed to be a time of holiday cheer except I didn't find myself cheering too much.",
    "122": "A fun, Christmas-themed comedy movie featuring Chevy Chase and Beverly D'Angelo. I liked this more than NATIONAL LAMPOON'S European VACATION, although I still haven't seen the original VACATION as yet. This film plays out as you'd expect, featuring Chase juggling the demands of his visiting family members with putting on the whole Christmas razzle-dazzle.The first half of this film is particularly strong when it focuses on decent slapstick moments: the whole situation with the Christmas lights, the stuff in the attic, and the bit with the staple gun, which is my favourite moment. By the time all of the old-timers show up, it does start to get bogged down a bit, although the film is enlivened by the presence of Randy Quaid's enjoyably scuzzy cousin and there are some hilarious scenes like the turkey carving.Occasionally, and especially towards the end, Christmas VACATION descends into schmaltz, but then that's down to John Hughes who can never resist inserting some sentimentality into his work (it's even there in my favourite of his films, PLANES, TRAINS & AUTOMOBILES, although John Candy is so sympathetic that it works). Chase and D'Angelo are on top form here and the film as a a whole is difficult to dislike as it has so much energy and so many constant gags. Watch out for a fresh-faced Juliette Lewis in one of her earlier performances.",
    "123": "Just because it is a Christmas movie I am afraid they do go a bit heavy at times on the sentimental stuff. The movie has the Griswolds, not going on a family trip of any kind, but rather having a nice family vacation right in their own home. You know the type, the one where everyone comes together to celebrate the xmas season together as the parents of both spouses are there. You know the type, hell in your house type scenario. Why anyone would subject themselves to the kind of torture that can only come from having as many family members under one roof is beyond me. We also know the Griswolds do not have the best track record when it comes to planning that perfect vacation. Not only do they have trouble getting a tree right from the get go they also have pandemonium when the in-laws arrive. Clark has run ins with his yuppie neighbors, of course he would be living by people like this. It always seems people who like to decorate their house get stuck by the ones who like the minimal xmas and vice versa and boy does Clark believe in a lot of lights. Of course, once he gets them all put up there is a bit of a trick to getting them on. Then guess who stops by, but the relatives that are not invited in the form of good ol cousin Eddie (Randy Quaid stealing the show a bit in this one). So there you have it, a more realistic movie than European to be sure, but I still liked it a bit better and of this one the first one and European I like this one the least. Never saw Vegas, from the previews it did not look all that good to me. However, this one is still funny and even though I consider it the weakest it is actually rather strong for a xmas movie.",
    "124": "Maybe it was because I wasn't too much in the mood for this one (my mother had just broken a leg a couple of hours earlier) or perhaps because I was watching it in the wee hours of the morning, or else the fact that I found it too engrossed in the typical American working-man's preoccupationsbut, the point, is that this would-be modern Christmas comedy classic seemed to me to be little more than a mildly amusing affair. Having said that, this is only the second NATIONAL LAMPOON film I've watched – after the similarly overrated ANIMAL HOUSE (1978) – and the film itself is the third VACATION with Chevy Chase and Beverly D' Angelo playing the Griswolds.The film starts amiably enough with the amusing animated opening credits, the car chase and tree cutting sequences but slowly starts going downhill once the other members of the family come into the picture. Apart from the fact that it seemed exaggerated to me to have relatives calling at the house for the Christmas dinner from a couple of weeks earlier, Chevy's \"losing it completely\" antics after not getting his all-important (why?) Christmas bonus were pretty over-the-top as well. The ultra-illuminated house gag also outstayed its welcome as did Randy Quaid's rude Cousin Eddiealthough the fried cat bit was funny, as were the perennially ill-fated neighbors. Even so, the supporting cast is surprisingly good: Juliette Lewis (as the Griswold's daughter), John Randolph and Diane Ladd (as the elder Griswolds), E.G. Marshall (as D' Angelo's unimpressed father), William Hickey (as the cigar-smoking, toupee-wearing uncle) and Mae Questel (as the senile aunt)."
}