{
    "0": "There are some romantic comedies that I don't like, but The Holiday is an exception. I found it sweet and very entertaining at times. The four stars, Cameron Diaz, Kate Winslet, Jude Law and Jack Black are very talented actors, and their performances take centre stage here. Kate Winslet was lovely as Iris, but I was really delighted with Cameron Diaz as Amanda, especially when she is seen wearing stilettos in the snow. At my first viewing the whole cinema were like \"How does she do that?\" I also thought their exchange on the phone was hilarious too. As the men, I really liked Jack Black as Miles, a perfect blend of subtlety and spirit. Jude Law, an actor who isn't always my cup of tea, does very well indeed, as Diaz's new friend Graham. This tells the story of two women who swap homes and make lifelong friends, or something along the lines of that. My sister has this on DVD and absolutely loves it. I have only two quibbles with this movie, the script is a little weak and frothy at times, and there are some places where the story is underdeveloped. Still a beautiful-looking and hugely enjoyable film. 8/10 Bethany Cox",
    "1": "Well yes, a 2006 romantic comedy that delivers what it promises. Mostly due to the disarming likability of the four leads plus Eli Wallach. Not for cynics, naturally, but very few things are and what the hell I laughed I was moved and I surprised myself all the way through. I came out of the theater smiling from ear to ear. Listen, that's not small feast in a world that seems too self conscious to be cute, even smartly cute like in this case. Kate Winslet can't help but being truthful so, there you go, you identify with her Rufus Sewell situation rooting for her - and I'm a guy! Cameron Diaz is, how can I put it? Yes adorable. A scatterbrain with a brain. Jude Law is another than I don't remember when was the last time he was this charming and Jack Black manages to keep it real and I was taken for a ride, going along, falling happily in Nancy Meyer's lovely trap. Well done!",
    "2": "The Holiday is about two women who each have recently had problems with the men in their lives. Amanda lives in California and Iris lives in England. Neither of these women have ever met before, but they both want to escape for the holidays, so they talk online and decide to swap houses and automobiles for two weeks, so in other words Amanda would be staying at Iris's house in England and Iris would be staying at Amanda's house in California. Once they both reach their destinations they are both pretty bitter about men, but each of them soon meets different men in their lives who mean a lot to them and may make their holiday something to remember. The Holiday has good direction, a good script, good performances by the entire cast and good original music. At first I wasn't really getting into this film and thought it would be a film that would probably appeal more to a woman than to me. Also the Amanda character played by Cameron Diaz annoyed me at first and I found her kind of artificial and ego centric. However as the film played on I found myself really liking this film. The characters grew on me and I found quite a bit to like about this movie. The chemistry between all the different characters works very well and their parts are all quite well written and the actors playing them each do a good job. I found that the film also developed and showed a lot about these characters which I enjoyed because the more I got to know about them the more I liked them and they were able to grow on me more. Each character in this film brings something unique to the table by being different and by really making this film more interesting than perhaps it sounds. The really rewarding thing about this film is how well the characters work with one another and that they are well written and well acted. This film is a romantic comedy and for the most part a lot of romantic comedies do not do a whole lot for me because I find them silly and more for the female viewer than the male viewer, but this movie offers a lot of humour, heart and is just generally a pleasant feel good film that I think both male and female viewers will enjoy. One of the better films of the year and one of the better romantic comedies of recent years as well.",
    "3": "Iris Simpkins (Kate Winslet) is a pushover for her ex (Rufus Sewell) and she's blindsided by his engagement. Amanda Woods (Cameron Diaz) is tired of her cheating boyfriend (Edward Burns) and leaves her LA life for a few weeks. They use a vacation website to chat up a home exchange. During their vacation, they each fall for their own local guys.It's a double rom-com. Jack Black is trying to be a romantic lead. He and Winslet make an odd couple. She's absolutely charming. He's not himself, and Eli Wallach is better as the lead. Jude Law is a more conventional choice for a leading man. He and Diaz work well together.It's an unabashed chick flick. It does exactly what you expect it to do. It just does it twice. It explains the running time of over 2 hours. It's kinda corny and kinda formulaic, but it has its heart in the right place.",
    "4": "This is probably my all-time favourite Christmas movie. I actually watch it every year!What's not to love? Wonderful actors, a heart-warming script, beautiful connections/chemistry throughout the movie and a depth in characters you rarely see anymore in the \"Christmas-feelgood-romance\" kind of movies. Oh and such a fun soundtrack, I really enjoy that too.Eli Wallach (RIP) is just charming and a reminder that good actors can make a simple storyline a film you want to watch again and again. Just beautiful!",
    "5": "In London, Iris Simpkins (Kate Winslet) write a wedding column in a newspaper and has an unrequited love for her colleague Jasper Bloom (Rufus Sewell). Nearby Christmas, she is informed that Jasper is engaged and will marry another colleague, and her life turns head over heels. In Los Angeles, the movie-trailers maker Amanda Woods (Cameron Dias) has just broken with her unfaithful boyfriend Ethan (Edward Burns) and wants to forget him. Amanda access a house exchange website, and impulsively swaps her mansion for Iris' cottage in Surrey for the holiday along the next two weeks. While in Surrey, Amanda meets Iris' widow brother and book editor Graham (Jude Law) and they fall in love for each other. Meanwhile Iris meet her next door neighbor, the ninety year old screenplay writer Arthur (Eli Wallach), who helps her to retrieve her self-esteem, and the film composer Miles (Jack Black), and they fall in love for each other.\"The Holiday\" is a charming and delightful homage to love, and also to the romantic movies of the Golden Age of Hollywood. Nancy Meyers is great in the romantic comedy genre, and this movie is not an exception. Kate Winslet and Cameron Dias are extremely charming and gorgeous in their roles, as well as Jude Law, but the excellent comedian Jack Black is miscast as romantic pair of Kate Winslet. In the end, this predictable film is a great entertainment. My vote is seven.Title (Brazil): \"O Amor Não Tira Férias\" (\"The Love Does Not Take Vacation\")",
    "6": "Years after my mom got this movie on DVD as a present, we both finally just watched it right now. It's got Cameron Diaz in Los Angeles as a movie trailer cutter and Kate Winslet in England as a publishing associate. They both experience breakups and are looking for a change of scenery, so to speak so they communicate on the internet and then go to temporarily live in each other's residences for a couple of weeks. I'll stop there and just say that they as well as Jude Law, Jack Black, and Eli Wallach make this quite charming and there are also some funny scenes that make this go down quite easy. There's also a glorious movie star cameo at a Blockbuster Video sequence. So on that note, I recommend The Holiday.",
    "7": "One of the most heart-warming holiday movies ever!",
    "8": "Well I have to confess I was dreading seeing this film, but actually I loved it.The story is quite fantastical. But once you can go along with the ridiculous plot, it is very funny and totally charming. It's a bit like eating liquid chocolate, and somehow manages to last for 2 hours and 10 minutes without you feeling sick.At the start of the film, the acting is very hammy, but this removes your desire for believability enough to carry the film. Cameron Diaz and Jude Law look absolutely lovely. Kate Winslett really pulls off her comedic role brilliantly. The are some beautiful touching moments about Hollywood history and a couple of famous faces appear in cameo roles. The English countryside is lovely. Lots of laughter and tears in the audience.The nutritional value of chocolate is limited. This film will uplift you though if nothing else. Excellent Christmas movie (from a bloke!).",
    "9": "For the romantic fool in all of us. This is one of the good movies that shows that there are good guys out there is this world.Jude Law makes a really good Graham. This is one of his first films that he plays a father in and he does it so well. He is fun loving and so sweet. The first scene that he is in with Cameron Diaz in which he kisses her eyes is so romantic. It makes all of us single girls just want to keep Jude on our couch and not let him get away. The kitchen scene is just a heart melting, gut wrenching, make your husband look out.Jack Black is displaying a different role as Miles. This shows that he has a softer side and is willing to step out a traditional role that we are so used to seeing him in. He still does display the comedy that we are used to seeing but it is downplayed.The music helps set the mood in this movie. It is all tamed down and helps to set the feeling of again I must say romance. It makes it so easy to watch and if you can find a guy that will sit down and watch this with you it will create feelings that may lead to something else.Cameron Diaz and Kate Winslet make this movie great. They both shine equally and neither tries to steal the limelight. This is one of the first roles that Kate has done as a comedy and it she does it very well.",
    "10": "I laughed. I cried. I awed. My jaw even dropped a couple of times. This movie surpassed all of my original expectations. At almost two and a half hours, I thought it might drag on, but I never felt like it was really that long. This movie is not only about heartbreak and heart ache, it's about finding yourself and appreciating the true things in life. I felt that Kate and Cameron did a wonderful job. Their characters come from two very different worlds yet they both seek the same thing...escape. They encounter so much more upon arriving at their destinations, and ultimately end up finding the completely unexpected. Jude is a star charmer as always, and Jack, well, he's Jack. Seeing this movie should be on everyone's holiday \"to-do\" lists, and I can guarantee it will be in my DVD collection once it is released. Nancy Meyers hit a home run with this one and it is sure to bring everyone a nice large dose of holiday spirit.",
    "11": "A perfect Christmas romantic comedy, It seems to pull out all the stops of a great love story, and comedy. Everyone was perfectly cast in there roles, you couldn't ask for a better cast. The film begins in England with editor named Iris(Kate Winslet), for her this holiday is not to jolly, when she is the last to know that the man she has been in love with for years named Jasper(Rufus Sewell) is engaged to be married. In L.A. a promo expert named Amanda(Cameron Diaz) is having it just has bad when her live in boyfriend named Ethan(Edward Burns) has been cheating on her. She is feeling upset and needs get away, she looks at a home exchange on the computer. She picks Iris cottage in England, and Iris agrees to her house in L.A.. When the switch is done, Amanda finds love with Iris brother Graham(Jude Law), and Iris finds love with the witty film composer named Miles(Jack Black). This is perfect date movie. Please don't miss it.",
    "12": "I watched this movie on a 14 hour plane ride from San Francisco to Hong Kong, and believe me, I can't imagine any other circumstances in which I would have sat through the entire thing immobile. I'm not a great fan of Romantic Comedies, which I find are rarely very romantic and even less frequently funny. Possibly I'm just too old and cynical. But there wasn't much choice as a combination of boredom and a very efficient Cathay Pacific stewardess, had tied me to my (coach class) seat. And I started about a third of the way into the movie, which I realized later was definitely the best place to start.This is a movie about two young women Amanda (Cameron Diaz  not one of my favourite actresses) and Iris (Kate Winslett  I adore Kate Winslett so I'm almost prepared to forgive her this dire interlude), who swap houses on a whim one Christmas, to escape their various romantic entanglements. Of course they meet new men and fall in love, as one always does when swapping houses, in this case with Jude Law and Jack Black. And I can't even recall the name of their characters (Graeme and Thingy? Ben and Jerry?) Amanda, who owns her own film promotion company and is a skinny over achiever (portrayed as a bitch of course, because she is successful), trots off (first class) to the English countryside where she wrestles with every British cliché in the book, such as driving on the left and stumbling across snowy meadows to reach the quaint, idyllic but chilly Rose Hill Cottage. Iris, an under achieving journalist, wronged in love by a classic British cad, legs it (economy) to LA, where she finds herself living next to a curmudgeonly old screen writer who turns out to have a heart of gold  no surprises there then. I came in where Iris arrives in LA and Amanda arrives in the UK.Amanda falls for Iris' brother (Jude Law), widowed tragically and left with two sweet children. We never find out how he was widowed so young but I spent most of the movie hoping that it would turn out he had murdered his wife, and wishing he would do the same to Diaz. This would have cheered me up enormously, but I guess Cathay Pacific wouldn't have shown it on a long haul flight? (This script has definite possibilities as a horror movie. Isolated cottage, stranger knocking at the door at night, etc. In Surrey, no one can hear you scream.) I have rarely seen a worse matched pair than Cameron Diaz and Jude Law. She is all sharp angles and a whiplash tongue, playing the crazy LA stereotype and he is wildly miscast as stoical Graeme (or Thingy?) Diaz here reminded me of a piece of barbed wire. Meanwhile Iris is getting up close and friendly with Jack Black's character in LA, who has himself been wronged by some actress or other. I actually found Winslett and Black a much more convincing couple than Diaz and Law, although it looked briefly like she might get shacked up with the curmudgeonly old screen writer. Jack Black is actually very good here, playing it very straight, and his character won my sympathy even if I can't recall his name. I found myself warming to them both by the (very predictable) end. I could see why she found him appealing. Then, as the film looped back to the start, I saw the first third. Oh dear. Truly awful. Diaz' character, Amanda, is just appalling. Can she seriously enjoy playing this kind of stuff? Or does it fill the time between surfing? Does anyone really find this offensive portrayal of modern, successful, young women entertaining? Is it me or is this just so unfunny? At one point, Amanda actually physically assaults her ex lover, with two right hooks to the chin which knock him flat. This is presented as amusing entertainment. Just imagine if you can the reverse; a couple splitting up, so he decides to go out on a high note by punching his ex girlfriend to the ground. Would we still be expected to laugh? We have spent years trying to convince the world that men assaulting women is wrong, and here we have a woman assaulting a man presented as light entertainment. Is that really OK with everyone?Yes I know this is just a popcorn movie, and I'm not the target audience  far too old and boring. But it matters, it's insidious. I don't want my teenagers watching this trash. And the worse part? It was written and directed by a woman. She should be ashamed of herself.",
    "13": "The 2nd movie in a row I watch starring Kate Winslet and Jude Law, previously watched Contagion. Anyway The Holiday is so light and lovely; I absolutely love the way it was directed by Nancy Meyers! The scenes are so smooth, dreamy and genuinely entertaining. I'm glad this has a 6.9 on IMDb that's perfect for this. Maybe I'm weird for craving this movie but it's sweet all around with a perfect flow!",
    "14": "Nancy Meyers has quickly gained my respect as a formidable director that really knows how to pull the heart strings and tap into the viewers emotions. She is brilliant. She has produced, written and directed some of the greatest sweet dramas of the last two decades. The Holiday is no exception to this rule. I waited a long to see it and after my girlfriend absolutely raved about it I sat down to watch it and was absolutely blown away. The Holiday is sweet, touching, funny, watchable, a great story with a small but effective cast. The Holiday and many other Meyers' films have been considered 'chick flicks' but even still The Holiday pleases on many levels with laugh out loud comedy, adorable romance, and dramatic flare that could bring tears to your eyes.Cameron Diaz is Amanda, a high profile strong, and very successful woman who has nothing but problems with the men in her life. I am not a huge Diaz fan although she can be very versatile and has had some good roles but in this film she nails it and is very watchable. Her story line is far more comedic than the rest of the film including the odd and yet perfectly made voice over-film trailer style narration to major turning points in her life (Amanda is a film trailer editor adding the irony to it.) They don't over use Diaz and make her the focus of attention simply because she is the biggest name in the film amidst some very talented actors. Kate Winslet is Iris, a woman who is also finding her life unbearable and desperately needs and wants a change from her simple country life where the man she had an affair with and fell in love with is now marrying the woman he left her for. Winslet is the perfect opposite to Diaz's character and they balance the film between each other's stories. While both suffering from guy problems, they are so different and have different life styles. They are both fun to watch and a commanding screen presence, and they are both brilliant in their respective roles. Enter Jude Law as Graham, Winslet's brother who bumps into Diaz after she switches homes and life with Winslet. Law is another actor I am not a big fan of. I think his ego is far bigger than his talent but that being said he does well in this compassionate, good guy role although at times his ego still is too inflated and I think someone less known might have done better. Still Law and Diaz have good chemistry and make a good couple. Jack Black in a total different turn plays Miles, a successful musician who has fallen in love with a beautiful actress and has his heart broken but has found a new friend in Winslet and their love blossoms together. Black still manages to be funny without being over the top and fits into the drama just fine. This might be his first real turn at proving he is versatile and can do other things. The four of them make two very different stories and very different romances...polar opposite stories that could stand on their own as it is. You're getting two romances for the price of one. Winslet and Black have this slowly growing friendship that turns to love and Law and Diaz have this whirlwind one night stand that turns into something more seemingly by destiny.Although The Holiday was written and released as a Christmas film you really can watch it any time with anyone, it's that good at what it does. It can go from deep drama to slapstick comedy to dry humor in a single bound and you love every second of it. From England, to L.A. and from heart break to romance...it is quite simply brilliant. Anyone who loves a good romance must see this film because it is wonderfully written, beautifully directed and brilliantly performed and still has a very different feel to it. Also look for a very brief yet very funny cameo by Mr. Dustin Hoffman, and a hilarious phone scene involving Winslet and Diaz and the trouble with call waiting. Go see this one, you won't be disappointed!! 9/10",
    "15": "Winslet and Diaz both have men problems so they swap their perfect houses in Surrey and LA for Christmas. Diaz meets Law and Winslet meets Black.The difficulty here is that both romances are largely unconvincing. The Cameron / Law romance is deadly dull and it's hard to imagine Winslet falling for Black's unfunny idiot. The Winslet side of the story is the most entertaining due to the presence of Eli Wallace as an Oscar winning writer neighbour to Winslet and indeed this friendship feature the best scenes in the film.Nice cameo in the video store",
    "16": "How could I see this movie so late !!I am an ardent movie addict and after having watched most of the renowned, acclaimed, super-hits and all such movies from various countries, I find hard to find a good movie. I do not know how I missed on this one ! \" The Holiday \" swept me off my feet literally. I have already a little crush on Kate Winslet and this movie yet again made me fell in love again with her. Not to miss the equally charming Diaz and Jude Law. Living in India, holiday rentals is an almost unheard concept for us. So the plot and the idea completely was new to me. More than a love story, this is about finding your inner-self. Its about finding happiness even when chips are down for you. I believe that though this movie hugely kinda runs into a fantasy and a dream world with all the best things happening around at all times. I am more of a close-to-reality movie fan, but no complaints this time, as this is one the most charming love stories that I have seen.The script of this movie is awesome and equally well acted by all the characters. However, the best part for me in this movie is the soundtrack by Hans Zimmer. In a nutshell, this is a complete movie for me. 9/10.",
    "17": "I really enjoyed watching this movie. It's the first time I watch a movie with cameron diaz starring in it. She is really funny and charismatic on the screen. I didn't get bored for a second. Strongly recommending this movie for a bice romantic night.",
    "18": "THE HOLIDAY, in my opinion, is one of the most romantic, funny, and touching holiday season films of all time. When Iris (Kate Winslet) and Amanda (Cameron Diaz) met and started seeing Miles (Jack Black) and Graham (Jude Law), I was really touched. You'll have to see the movie if you want to know why. If you ask me, everyone looked nice in the dressy clothing they wore. At the beginning of the film, when Iris got dumped by Jasper (Rufus Sewell), I felt a lot of sympathy for her. Before I wrap this up, I'd like to say that the direction was excellent, the performances were terrific, and the production design was lavish. Now, in conclusion, if you're a fan of any of the stars of this romantic, funny, and touching holiday season films of all time, I highly recommend it.",
    "19": "Jude is amazing in this, funny and clever. The rest of the all star cast helps too, and even jack black is almost tolerable. Its a pretty good holiday Rom com even if you don't like Rom com.",
    "20": "One of the best Christmas movies released in the last 20 years. It's a perfect fluff film to turn your mind off and to just enjoy it. They don't make lots of films like this anymore especially Christmas movies. The plot is cute and the four leads are amazing. The only flaw is the movie is long they could of cute maybe 15 min off and then the film would of been perfect.",
    "21": "This is the first 10 I've ever given on a Rom-Com. I've watched it a couple of times and it's really very good, I was going to give it a 9 but I asked myself, what would I change about it if I could, and the answer was nothing.The chemistry between Jack Black and Kate Winslet wasn't as strong as Cameron Diaz and Jude Law, but their story line was (in my opinion) secondary to the main characters. Their attraction was one rooted in commonality and just being perfect for each other, where as the main characters attraction was more of a blindsiding, unexpected, deeply romantic attraction. The kind that only a day before, you couldn't have imagined it even being possible and the day after, couldn't live without. So in the overall scope of the movie, even this small imperfection, ended up being perfect. Very well done and a must watch movie.",
    "22": "The 2006 production \"The Holiday\" starts off quite generic but once it gets rolling, the story gets more interesting by the minute. Soon we have a bunch of folks struggling with relationships, emotions and personal needs. Their encounters are interconnected and despite the story rolls out between two continents thanks to the pacing I could follow the narrative easily. I heard that this film was written specifically with Cameron Diaz, Kate Winslet, Jude Law, and Jack Black in mind. Their chemistry on screen is great. This is one of the rare movies where Hollywood actors actually show genuine human emotions. Cameron Diaz plays a troubled character and through her effort she puts into her performance it feels a bit like over acting but okay. The most convincing part comes from Kate Winslet who did a tremendous job of making her character emotionally palpable. Her facial expressions are truly significant. Jude Law does great. Only Jack Black is the one I could not relate to since he plays like he does not want to be there. Prefect soundtrack by Hans Zimmer!",
    "23": "This is a delightful, romantic, screwball comedy,that does not make sense & it is not supposed to.This is the crazy kind of comedy that made our parents, Grandparents & still some of us laugh.Take 2 entirely different women (30 'ish) one In Hollywood & the other in England, they are unsatisfied with there current boy friends, & switch houses for a 2 week vacation.Cameron Diaz is our wealthy Hollywood executive,Kate Winslet is our English working girl, They just dumped Edward Burns & Rufus Sewell & trot off to each others house.Now it seems that Kate has a handsome brother Jude Law who drops in on supposed sisters house & meets Cameron, & thusly they fall for each other. Now back in Los Angeles. Kate is getting used to living in this luxurious house of Camerons & who walks in but a co-worker. Jack Black & of course we have another romance cooking.This fine foursome in roles written for them by Nancy Meyers have a field day. Ms.Meyers also capably directed trheis romp.Now add to this fun an old time Hollywood writer superbly played by 91 year young Eli Wallach..The film is long BUT for a 135 minute movies the pace is fast & you hardly realize it.The acting (except for a bit of silliness) is flawless.There also is an excellent well balanced song score that actually fits the scenes.Ratings ***1/2 (out of 4) 96 points(out of 100) IMDb 9 (out of 10)",
    "24": "Favorite Christmas movie, favorite cry-by-myself movie, favorite pick-me-up movie, favorite all around! I love this movie! Diaz and Jude Law romance... I mean, come on? Of course, Kate Winslet and Jack Black were so so so good. But Jack Black playing a slightly more \"serious\" role is everything! He's still goofy here, but in a subtle way. Just such a wholesome movie about love and relationships, and messy life (and you'll fall in love with Jude Law all over again.) Always make me wish I lived in a little cottage on a hillside in England. Grab some hot cocoa or fettuccine Alfredo and cozy up to this movie! This will forever be one of my favorite.",
    "25": "When i see the names Jude Law, Jack Black, Kate Winslet and Cameron Diaz in the cast, i'm likely going to see the film. Nancy Meyers is a writer first, and i enjoyed Baby Boom, so i went hoping for the best. Although there were no surprises in this boy)s) meets girl(s)film, it was a charming piece brightened by the performances by all four principals. i especially enjoyed Kate Winslet, who woke up air-rocking to the music in the morning, and Jack Black playing that theme-song game in the video store which i have done myself many times for a lark. Jude Law was a great love interest, this time not an AI love droid, nor an assassin, sniper, sky captain, paraplegic, rich playboy, cad...he has a surprise about his life sure, but a normal one, and a sweet one to boot. Oh, and the wonderful Eli Wallach; he was simply a joy to see in this film. Nobody ran away from love, at least not true love. The characters were running from relationships which weren't reciprocated nor appreciated, only to run in to the love of their lives while on the run. Not particularly inventive, but charming and satisfying all the same. Is it a date movie? yes. Is it a deep film with deep meaning? nope. Is it a pop-corny movie? yup. nothing wrong with that. A very charming, sweet-natured film.",
    "26": "On the 31st December 2022 I sat down and watched The Holiday with my partner.For years I had dodged this movie. The first name anyone mentions is Jack Black and I find his acting in movies way over the top. I could not imagine him as a romantic lead and as it turns out I didn't have to.The first 40 minutes was just as I thought it would be, a Cameron Diaz movie with sledgehammer humour. Then it settled down very nicely to become a gentle romantic tale. I do wonder if somebody took over the directing half way through.The stories became more personal and the characters rich, I will not spoil the story but I was very and quite pleasantly suprised by this movie.",
    "27": "For the romantic fool in all of us. This is one of the good movies that shows that there are good guys out there is this world.Jude Law makes a really good Graham. This is one of his first films that he plays a father in and he does it so well. He is fun loving and so sweet. The first scene that he is in with Cameron Diaz in which he kisses her eyes is so romantic. It makes all of us single girls just want to keep Jude on our couch and not let him get away. The kitchen scene is just a heart melting, gut wrenching, make your husband look out.Jack Black is displaying a different role as Miles. This shows that he has a softer side and is willing to step out a traditional role that we are so used to seeing him in. He still does display the comedy that we are used to seeing but it is downplayed.The music helps set the mood in this movie. It is all tamed down and helps to set the feeling of again I must say romance. It makes it so easy to watch and if you can find a guy that will sit down and watch this with you it will create feelings that may lead to something else.Cameron Diaz and Kate Winslet make this movie great. They both shine equally and neither tries to steal the limelight. This is one of the first roles that Kate has done as a comedy and it she does it very well.",
    "28": "I laughed. I cried. I awed. My jaw even dropped a couple of times. This movie surpassed all of my original expectations. At almost two and a half hours, I thought it might drag on, but I never felt like it was really that long. This movie is not only about heartbreak and heart ache, it's about finding yourself and appreciating the true things in life. I felt that Kate and Cameron did a wonderful job. Their characters come from two very different worlds yet they both seek the same thing...escape. They encounter so much more upon arriving at their destinations, and ultimately end up finding the completely unexpected. Jude is a star charmer as always, and Jack, well, he's Jack. Seeing this movie should be on everyone's holiday \"to-do\" lists, and I can guarantee it will be in my DVD collection once it is released. Nancy Meyers hit a home run with this one and it is sure to bring everyone a nice large dose of holiday spirit.",
    "29": "A perfect Christmas romantic comedy, It seems to pull out all the stops of a great love story, and comedy. Everyone was perfectly cast in there roles, you couldn't ask for a better cast. The film begins in England with editor named Iris(Kate Winslet), for her this holiday is not to jolly, when she is the last to know that the man she has been in love with for years named Jasper(Rufus Sewell) is engaged to be married. In L.A. a promo expert named Amanda(Cameron Diaz) is having it just has bad when her live in boyfriend named Ethan(Edward Burns) has been cheating on her. She is feeling upset and needs get away, she looks at a home exchange on the computer. She picks Iris cottage in England, and Iris agrees to her house in L.A.. When the switch is done, Amanda finds love with Iris brother Graham(Jude Law), and Iris finds love with the witty film composer named Miles(Jack Black). This is perfect date movie. Please don't miss it.",
    "30": "I watched this movie on a 14 hour plane ride from San Francisco to Hong Kong, and believe me, I can't imagine any other circumstances in which I would have sat through the entire thing immobile. I'm not a great fan of Romantic Comedies, which I find are rarely very romantic and even less frequently funny. Possibly I'm just too old and cynical. But there wasn't much choice as a combination of boredom and a very efficient Cathay Pacific stewardess, had tied me to my (coach class) seat. And I started about a third of the way into the movie, which I realized later was definitely the best place to start.This is a movie about two young women Amanda (Cameron Diaz  not one of my favourite actresses) and Iris (Kate Winslett  I adore Kate Winslett so I'm almost prepared to forgive her this dire interlude), who swap houses on a whim one Christmas, to escape their various romantic entanglements. Of course they meet new men and fall in love, as one always does when swapping houses, in this case with Jude Law and Jack Black. And I can't even recall the name of their characters (Graeme and Thingy? Ben and Jerry?) Amanda, who owns her own film promotion company and is a skinny over achiever (portrayed as a bitch of course, because she is successful), trots off (first class) to the English countryside where she wrestles with every British cliché in the book, such as driving on the left and stumbling across snowy meadows to reach the quaint, idyllic but chilly Rose Hill Cottage. Iris, an under achieving journalist, wronged in love by a classic British cad, legs it (economy) to LA, where she finds herself living next to a curmudgeonly old screen writer who turns out to have a heart of gold  no surprises there then. I came in where Iris arrives in LA and Amanda arrives in the UK.Amanda falls for Iris' brother (Jude Law), widowed tragically and left with two sweet children. We never find out how he was widowed so young but I spent most of the movie hoping that it would turn out he had murdered his wife, and wishing he would do the same to Diaz. This would have cheered me up enormously, but I guess Cathay Pacific wouldn't have shown it on a long haul flight? (This script has definite possibilities as a horror movie. Isolated cottage, stranger knocking at the door at night, etc. In Surrey, no one can hear you scream.) I have rarely seen a worse matched pair than Cameron Diaz and Jude Law. She is all sharp angles and a whiplash tongue, playing the crazy LA stereotype and he is wildly miscast as stoical Graeme (or Thingy?) Diaz here reminded me of a piece of barbed wire. Meanwhile Iris is getting up close and friendly with Jack Black's character in LA, who has himself been wronged by some actress or other. I actually found Winslett and Black a much more convincing couple than Diaz and Law, although it looked briefly like she might get shacked up with the curmudgeonly old screen writer. Jack Black is actually very good here, playing it very straight, and his character won my sympathy even if I can't recall his name. I found myself warming to them both by the (very predictable) end. I could see why she found him appealing. Then, as the film looped back to the start, I saw the first third. Oh dear. Truly awful. Diaz' character, Amanda, is just appalling. Can she seriously enjoy playing this kind of stuff? Or does it fill the time between surfing? Does anyone really find this offensive portrayal of modern, successful, young women entertaining? Is it me or is this just so unfunny? At one point, Amanda actually physically assaults her ex lover, with two right hooks to the chin which knock him flat. This is presented as amusing entertainment. Just imagine if you can the reverse; a couple splitting up, so he decides to go out on a high note by punching his ex girlfriend to the ground. Would we still be expected to laugh? We have spent years trying to convince the world that men assaulting women is wrong, and here we have a woman assaulting a man presented as light entertainment. Is that really OK with everyone?Yes I know this is just a popcorn movie, and I'm not the target audience  far too old and boring. But it matters, it's insidious. I don't want my teenagers watching this trash. And the worse part? It was written and directed by a woman. She should be ashamed of herself.",
    "31": "The 2nd movie in a row I watch starring Kate Winslet and Jude Law, previously watched Contagion. Anyway The Holiday is so light and lovely; I absolutely love the way it was directed by Nancy Meyers! The scenes are so smooth, dreamy and genuinely entertaining. I'm glad this has a 6.9 on IMDb that's perfect for this. Maybe I'm weird for craving this movie but it's sweet all around with a perfect flow!",
    "32": "Nancy Meyers has quickly gained my respect as a formidable director that really knows how to pull the heart strings and tap into the viewers emotions. She is brilliant. She has produced, written and directed some of the greatest sweet dramas of the last two decades. The Holiday is no exception to this rule. I waited a long to see it and after my girlfriend absolutely raved about it I sat down to watch it and was absolutely blown away. The Holiday is sweet, touching, funny, watchable, a great story with a small but effective cast. The Holiday and many other Meyers' films have been considered 'chick flicks' but even still The Holiday pleases on many levels with laugh out loud comedy, adorable romance, and dramatic flare that could bring tears to your eyes.Cameron Diaz is Amanda, a high profile strong, and very successful woman who has nothing but problems with the men in her life. I am not a huge Diaz fan although she can be very versatile and has had some good roles but in this film she nails it and is very watchable. Her story line is far more comedic than the rest of the film including the odd and yet perfectly made voice over-film trailer style narration to major turning points in her life (Amanda is a film trailer editor adding the irony to it.) They don't over use Diaz and make her the focus of attention simply because she is the biggest name in the film amidst some very talented actors. Kate Winslet is Iris, a woman who is also finding her life unbearable and desperately needs and wants a change from her simple country life where the man she had an affair with and fell in love with is now marrying the woman he left her for. Winslet is the perfect opposite to Diaz's character and they balance the film between each other's stories. While both suffering from guy problems, they are so different and have different life styles. They are both fun to watch and a commanding screen presence, and they are both brilliant in their respective roles. Enter Jude Law as Graham, Winslet's brother who bumps into Diaz after she switches homes and life with Winslet. Law is another actor I am not a big fan of. I think his ego is far bigger than his talent but that being said he does well in this compassionate, good guy role although at times his ego still is too inflated and I think someone less known might have done better. Still Law and Diaz have good chemistry and make a good couple. Jack Black in a total different turn plays Miles, a successful musician who has fallen in love with a beautiful actress and has his heart broken but has found a new friend in Winslet and their love blossoms together. Black still manages to be funny without being over the top and fits into the drama just fine. This might be his first real turn at proving he is versatile and can do other things. The four of them make two very different stories and very different romances...polar opposite stories that could stand on their own as it is. You're getting two romances for the price of one. Winslet and Black have this slowly growing friendship that turns to love and Law and Diaz have this whirlwind one night stand that turns into something more seemingly by destiny.Although The Holiday was written and released as a Christmas film you really can watch it any time with anyone, it's that good at what it does. It can go from deep drama to slapstick comedy to dry humor in a single bound and you love every second of it. From England, to L.A. and from heart break to romance...it is quite simply brilliant. Anyone who loves a good romance must see this film because it is wonderfully written, beautifully directed and brilliantly performed and still has a very different feel to it. Also look for a very brief yet very funny cameo by Mr. Dustin Hoffman, and a hilarious phone scene involving Winslet and Diaz and the trouble with call waiting. Go see this one, you won't be disappointed!! 9/10",
    "33": "Winslet and Diaz both have men problems so they swap their perfect houses in Surrey and LA for Christmas. Diaz meets Law and Winslet meets Black.The difficulty here is that both romances are largely unconvincing. The Cameron / Law romance is deadly dull and it's hard to imagine Winslet falling for Black's unfunny idiot. The Winslet side of the story is the most entertaining due to the presence of Eli Wallace as an Oscar winning writer neighbour to Winslet and indeed this friendship feature the best scenes in the film.Nice cameo in the video store",
    "34": "How could I see this movie so late !!I am an ardent movie addict and after having watched most of the renowned, acclaimed, super-hits and all such movies from various countries, I find hard to find a good movie. I do not know how I missed on this one ! \" The Holiday \" swept me off my feet literally. I have already a little crush on Kate Winslet and this movie yet again made me fell in love again with her. Not to miss the equally charming Diaz and Jude Law. Living in India, holiday rentals is an almost unheard concept for us. So the plot and the idea completely was new to me. More than a love story, this is about finding your inner-self. Its about finding happiness even when chips are down for you. I believe that though this movie hugely kinda runs into a fantasy and a dream world with all the best things happening around at all times. I am more of a close-to-reality movie fan, but no complaints this time, as this is one the most charming love stories that I have seen.The script of this movie is awesome and equally well acted by all the characters. However, the best part for me in this movie is the soundtrack by Hans Zimmer. In a nutshell, this is a complete movie for me. 9/10.",
    "35": "I really enjoyed watching this movie. It's the first time I watch a movie with cameron diaz starring in it. She is really funny and charismatic on the screen. I didn't get bored for a second. Strongly recommending this movie for a bice romantic night.",
    "36": "THE HOLIDAY, in my opinion, is one of the most romantic, funny, and touching holiday season films of all time. When Iris (Kate Winslet) and Amanda (Cameron Diaz) met and started seeing Miles (Jack Black) and Graham (Jude Law), I was really touched. You'll have to see the movie if you want to know why. If you ask me, everyone looked nice in the dressy clothing they wore. At the beginning of the film, when Iris got dumped by Jasper (Rufus Sewell), I felt a lot of sympathy for her. Before I wrap this up, I'd like to say that the direction was excellent, the performances were terrific, and the production design was lavish. Now, in conclusion, if you're a fan of any of the stars of this romantic, funny, and touching holiday season films of all time, I highly recommend it.",
    "37": "Jude is amazing in this, funny and clever. The rest of the all star cast helps too, and even jack black is almost tolerable. Its a pretty good holiday Rom com even if you don't like Rom com.",
    "38": "One of the best Christmas movies released in the last 20 years. It's a perfect fluff film to turn your mind off and to just enjoy it. They don't make lots of films like this anymore especially Christmas movies. The plot is cute and the four leads are amazing. The only flaw is the movie is long they could of cute maybe 15 min off and then the film would of been perfect.",
    "39": "This is the first 10 I've ever given on a Rom-Com. I've watched it a couple of times and it's really very good, I was going to give it a 9 but I asked myself, what would I change about it if I could, and the answer was nothing.The chemistry between Jack Black and Kate Winslet wasn't as strong as Cameron Diaz and Jude Law, but their story line was (in my opinion) secondary to the main characters. Their attraction was one rooted in commonality and just being perfect for each other, where as the main characters attraction was more of a blindsiding, unexpected, deeply romantic attraction. The kind that only a day before, you couldn't have imagined it even being possible and the day after, couldn't live without. So in the overall scope of the movie, even this small imperfection, ended up being perfect. Very well done and a must watch movie.",
    "40": "The 2006 production \"The Holiday\" starts off quite generic but once it gets rolling, the story gets more interesting by the minute. Soon we have a bunch of folks struggling with relationships, emotions and personal needs. Their encounters are interconnected and despite the story rolls out between two continents thanks to the pacing I could follow the narrative easily. I heard that this film was written specifically with Cameron Diaz, Kate Winslet, Jude Law, and Jack Black in mind. Their chemistry on screen is great. This is one of the rare movies where Hollywood actors actually show genuine human emotions. Cameron Diaz plays a troubled character and through her effort she puts into her performance it feels a bit like over acting but okay. The most convincing part comes from Kate Winslet who did a tremendous job of making her character emotionally palpable. Her facial expressions are truly significant. Jude Law does great. Only Jack Black is the one I could not relate to since he plays like he does not want to be there. Prefect soundtrack by Hans Zimmer!",
    "41": "This is a delightful, romantic, screwball comedy,that does not make sense & it is not supposed to.This is the crazy kind of comedy that made our parents, Grandparents & still some of us laugh.Take 2 entirely different women (30 'ish) one In Hollywood & the other in England, they are unsatisfied with there current boy friends, & switch houses for a 2 week vacation.Cameron Diaz is our wealthy Hollywood executive,Kate Winslet is our English working girl, They just dumped Edward Burns & Rufus Sewell & trot off to each others house.Now it seems that Kate has a handsome brother Jude Law who drops in on supposed sisters house & meets Cameron, & thusly they fall for each other. Now back in Los Angeles. Kate is getting used to living in this luxurious house of Camerons & who walks in but a co-worker. Jack Black & of course we have another romance cooking.This fine foursome in roles written for them by Nancy Meyers have a field day. Ms.Meyers also capably directed trheis romp.Now add to this fun an old time Hollywood writer superbly played by 91 year young Eli Wallach..The film is long BUT for a 135 minute movies the pace is fast & you hardly realize it.The acting (except for a bit of silliness) is flawless.There also is an excellent well balanced song score that actually fits the scenes.Ratings ***1/2 (out of 4) 96 points(out of 100) IMDb 9 (out of 10)",
    "42": "Favorite Christmas movie, favorite cry-by-myself movie, favorite pick-me-up movie, favorite all around! I love this movie! Diaz and Jude Law romance... I mean, come on? Of course, Kate Winslet and Jack Black were so so so good. But Jack Black playing a slightly more \"serious\" role is everything! He's still goofy here, but in a subtle way. Just such a wholesome movie about love and relationships, and messy life (and you'll fall in love with Jude Law all over again.) Always make me wish I lived in a little cottage on a hillside in England. Grab some hot cocoa or fettuccine Alfredo and cozy up to this movie! This will forever be one of my favorite.",
    "43": "When i see the names Jude Law, Jack Black, Kate Winslet and Cameron Diaz in the cast, i'm likely going to see the film. Nancy Meyers is a writer first, and i enjoyed Baby Boom, so i went hoping for the best. Although there were no surprises in this boy)s) meets girl(s)film, it was a charming piece brightened by the performances by all four principals. i especially enjoyed Kate Winslet, who woke up air-rocking to the music in the morning, and Jack Black playing that theme-song game in the video store which i have done myself many times for a lark. Jude Law was a great love interest, this time not an AI love droid, nor an assassin, sniper, sky captain, paraplegic, rich playboy, cad...he has a surprise about his life sure, but a normal one, and a sweet one to boot. Oh, and the wonderful Eli Wallach; he was simply a joy to see in this film. Nobody ran away from love, at least not true love. The characters were running from relationships which weren't reciprocated nor appreciated, only to run in to the love of their lives while on the run. Not particularly inventive, but charming and satisfying all the same. Is it a date movie? yes. Is it a deep film with deep meaning? nope. Is it a pop-corny movie? yup. nothing wrong with that. A very charming, sweet-natured film.",
    "44": "On the 31st December 2022 I sat down and watched The Holiday with my partner.For years I had dodged this movie. The first name anyone mentions is Jack Black and I find his acting in movies way over the top. I could not imagine him as a romantic lead and as it turns out I didn't have to.The first 40 minutes was just as I thought it would be, a Cameron Diaz movie with sledgehammer humour. Then it settled down very nicely to become a gentle romantic tale. I do wonder if somebody took over the directing half way through.The stories became more personal and the characters rich, I will not spoil the story but I was very and quite pleasantly suprised by this movie.",
    "45": "What would at first seem to be a particularly predictable storyline turns out to be a wonderfully written, beautifully told love story. Two women currently unhappy in their own skins decide to temporarily trade lives, or homes at least. Iris (Kate Winslet) escapes the horror of unrequited love and ends up in an enormously plush house in L.A. Amamda (Cameron Diaz), fresh out of an unfaithful relationship finds herself in a cramped little cottage on the outskirts of a small English town. While Iris is immediately impressed with her new surroundings, Amanda needs a little convincing and this comes along in the form of Graham (Jude Law), Iris's brother, in whom Amanda takes an immediate, if very reluctant interest. The story goes on from there to include a mixture of both wonderfully cliché and surprisingly original situations. The dialogue between the characters is brilliantly written and completely believable and the little snippets of movie trivia along the way keep it interesting and fresh. This movie was a delight to encounter and will be a pleasure to watch over and over again.",
    "46": "Combination of Kate Winslet and Cameron Diaz is itself worth few stars. The Holiday is kind of movie which indeed take you through the all the emotions and state of theme of the movie. It's wonderful to see how things unfold for both Kate and Cameron. It's indeed a feature where characters from there real life jumps into their respective bookish life. It even teaches one how something useless or better we can say not of use in good concern is useful or is of use to someone else. Which is all they need in order to fill the missing blocks of their own vision. The Holiday might split audience in two halves based on there personality; I found myself happy in \"Iris's half\"",
    "47": "Wow this movie was so much better than I expected! Disclaimer: I am a sucker for Rom-coms and this one was just magnificent. There were many scenes which just made me laugh, and the movie is so wholesome it just makes my heart warm. The acting for this movie was equally fantastic. I cannot think of a better actor or actress fit for this film.On to the parts that some may not be a fan of, this movie does follow your standard rom com format. While this is a tried and true format which I enjoy dearly, some may find that this format gets dull after a while especially if you're not a fan of rom coms.Overall, this is an amazing rom com Christmas movie that is sure to leave a smile on your face.",
    "48": "The Holiday is one of my favorite films! It's one of those movies that, whenever you see it while flipping channels, you have to stop and watch. It's like a comfortable sweater you slip-on or a visit from an old friend. Make this classic one of your favorites, too!",
    "49": "After the year 2020 has been, I caught this on TV and watched it for the umpteenth time. It was just the tonic. Warm, romantic, feelgood and fuzzy, it's just complete escapism from all the crap going on in the world at the moment.\n2 women trying to get over bad relationships swap lives over the holiday season leading to unexpected events. All the characters are likeable (okay maybe with the exception of Rufus Sewell's 'Jasper'). I think this is a lovely film that should definitely be on par with the other big British romantic Christmas films (although I find Love Actually grates on me a little these days, whereas this one seems to have aged well). This is the perfect movie to stick on over the holidays when the weather is rubbish outside, or when wrapping presents, or just when you fancy a lazy day on the sofa. Who doesn't like a bit of warm and fuzzy?!",
    "50": "Amanda, (Cameron Diaz) is a brash, neurotic and highly successful business woman, living the jet set lifestyle amongst the orange groves and palm trees of sunny L.A.Iris, (Kate Winslet) is a belittled and insipid newspaper wedding correspondent existing in a permanent state of self pity in windswept and snow battered England.Despite these contrasting lifestyles, these two very different women have something in common. They are both lonely, hurt, depressed and facing one of the most miserable Christmases either of them have ever experienced.Could it be that Amanda and Iris each hold the answer to the others prayers? Of course they do!!! After meeting online it is agreed that they would swap lifestyles in a two week home exchange whereby both women can escape from their immediate misery and enjoy a well earned rest in new and novel surroundings.The arrival scenes for each of our heroines is fun to watch as we see the English Iris amazed and excited by her new L.A. mansion and king size swimming pool, and the well off Amanda looking with equal disdain on her quaint Victorian cottage in the Surrey downs with no mod cons and its tiny bath tub.Yet each adapt quickly to their new surroundings after all its only a means to an end, which is an opportunity to spend a Christmas without the worries and hassles of men complicating matters.That is until Amanda is visited by Iris' brother Graham (Jude Law) who just drops in unexpectedly on his way home from where we can only assume to have been the English charm school, and Iris meets and befriends part-time film score composer and full time eye-brow flirt, Miles (Jack Black)Okay this is a Rom-Com and therefore I need not go into too much detail of how things turn out for our intrepid foursome, yet the rest of the film is not just the run of the mill romance you might expect, there are other plots and sub-plots which give this movie greater scope and depth which also goes a long way in making the main characters more tangible.One such plot involves Iris and an aged Oscar winning screen writer named Arthur played brilliantly by Eli Wallach, who now lonely, infirm and forgotten by almost everybody, finds a new friend and confidant in the compassionate and caring English tourist. Indeed at times it is this relationship that pulls at the moviegoers heartstrings more than any of the others.The Diaz/Law thing was fun to watch too in what is essentially a mutual love at first sight relationship, between two people who for different reasons refuse to acknowledge that it is anything more than a minor fling., Two people who are both determined to keep things uncomplicated despite the overwhelming feelings each have for the other.I suppose my one criticism would be that so much screen time was given to the Diaz/Law relationship, and the Winslet/Wallach friendship, that when the Winslet/Black thing came about, it didn't really fit into place as believably as the others. I feel more screen time was needed to flesh this one out a little more. This is nothing against Jack Black who many have said was unsuitable in the role and unbelievable as a love interest. Rubbish in my opinion. He was great in the role and perfectly believable, its just the essential scenes that would have made made it work were just not here.Despite this one criticism this movie is definitely one for the DVD shelf. A classic Rom Com and a classic feel good movie which for once sees everyone deliriously happy at the end which at this time of year especially, is always nice to see.",
    "51": "Winslet, Diaz, Law and Black at their very, very best. All four made it look like they had been acting together forever.Although great stars and actors these four are, even they were overshadowed in my opinion by another truly great actor who has never had the true recognition he deserves. This is Eli Wallach.Every time he appeared on screen the film shone even brighter than ever.SPOILER BEGINSWallach plays Arthur Abbot a bit of a ditherer and senior gentleman who used to be in the Hollywood film business when Hollywood was truly 'Tinsel Town'.Kate Winslet (Iris Simpkins) rescues Wallach when he appears to have lost his way home.From then on their friendship blossoms and Winslet convinces him that he should attend a special evening in his honour to celebrate his great success and contribution to the movie industry years previously.SPOILER ENDSI cannot see anyone not loving this film.Although we all know basically how the film is going to end, or do we?. The Holiday was a joy to watch for both its comedy and tissue box moments.The acting was wonderful and each and every cast member played their parts brilliantly.Full marks to the writer, director and cast.Added to this the two little girls, Miffy Englefield (Sophie) and Emma Pritchard (Olivia) were adorable. The downside is that we just did not see enough of them.",
    "52": "The concept of two women swapping their houses for two weeks (one in LA, the other in the UK) just to get away from men troubles was interesting enough. Though there are no surprises and everything falls into place rather conveniently, it was fun to watch the two lead characters putting themselves into whole new environments and eventually finding ideal partners. As for the cast, Jack Black might not have been the best choice to play this ordinary good guy. But Cameron Diaz, Kate Winslet, and Jude Law all shined gorgeously with glittering star aura. Too sweet for my taste, nevertheless a well-made romantic comedy that you might enjoy on your holiday.",
    "53": "THE HOLIDAY (2006) **1/2 Kate Winslet, Cameron Diaz, Jude Law, Jack Black, Eli Wallach, Edward Burns, Rufus Sewell, Shannyn Sossamon, Bill Macy, Shelley Berman, Kathryn Hahn, John Krasinski. Predictable yet well acted romantic comedy about two unlucky in love gals from opposite ends of The Big Pond  Brit newswoman Winslet hopelessly in love with cad co-worker Sewell and LA-based movie trailer producer Diaz in bad break up with jerk Burns  who exchange their living quarters for the winter holidays and wind up falling in love with respectively Black and Law. A real chick flick with all its sugary clichés and filmmaker Nancy Meyers really needs to make her female characters a tad more believable and a whole lot smarter. Still it is a delight to see Winslet in her first attempt at comedy and it suits her lovely.",
    "54": "Seriously, it was like someone had spilled Fondue over everything it was that cheesy. It was also completely predictable and formulaic. Winslet and Diaz overacted (and badly so) throughout the whole movie.I was actually cringing when Cameron's character tells Jude that her family was so close they used to call themselves \"The three Musketeers\"! In fact, I was actively cringing for most of the film. I thought Kate Winslet's character was excessively stupid for being in love for three years with a cardboard man that used her when he needed to and then ran back to his fiancée. And to get over him she decides all she needs is two weeks in LA? And he still doesn't leave her alone then, but she never outrightly tell him to F*** Off, which really really got my goat because if she had the film might, just might, have been worth the 9.20 I paid to waste 2 hours of my life on this dire atrocity. The only thing I liked about the film was Jack Black but he was woefully underused. It was also as if the director told him \" OK we're going for completely formulaic here, NO IMPROVISING, no off-the-cuff funny stuff, nothing, just work from the script\". And they probably cut any bits out that he did do on the spur of the moment. In conclusion, if you want to numb your brain and do have a few hours and a bit of money to waste, by all means go and see this.",
    "55": "5 January 2007. Except for two moderate miscues, this romantic drama entertainment is a dazzling display of natural portrayals of banter between romancing couples. The emotional relationships on screen are refreshing, lively, and revealing for their depth of realism and delight. Except for Jack Black's usual character performance that is beginning to become almost stale (missing a great opportunity to play against type) and a rather typical ending, this movie is a solid credit to romance pictures in lifting the level of performance and true dialogue in this genre. A great movie for the holiday season. Cameron Diaz continues to perform well as an under-rated and overlooked actress along with her co-stars (Kate Winslet and Jude Law) all doing well (if only Jack Black could expand his range). The scene with children is a truly wonderful, quality family performance with tender dialogue and acting from the young ones. Eight out of Ten Stars.",
    "56": "This is one of my happy films. It's a cute, romantic comedy with a star-studded cast that will leave you feeling like even in life's darkest moments, there are still good things to come.Set in L. A. and a charming town in England, the film tells the tale of two women in different parts of the world who are unlucky in love, but through chance meetings, end up crossing paths and having an indelible impact on one another's lives.\"The Holiday\" will leave you with a smile on your face and warm feeling in your heart. It's one of those films that should definitely be included in your holiday repertoire of films to watch!",
    "57": "Jack Black, Kate Winslet, Cameron Diaz and Jude Law star in this brilliant comedy about true love and how you can find it in the simplest of places.Here's the basics:Cameron Diaz and Kate Winslet are both troubled with guy problems. Diaz lives in LA, and Winslet in England. The two meet in an online chat room and talk about \"home exchange\", living in each other's homes, driving one another's' cars, for two weeks.As you guessed, they each meet a man while on vacation.I wasn't expecting anything much when I saw this movie. I mainly went to see it because I wanted to see if Jack Black could pull off a \"regular nice guy\" type part, and, in my opinion, Jack stole the show. This is Mr. Black's best performance that I've ever seen him do, just ahead of School of Rock.Jude Law was funny and charming, and had good chemistry with Diaz.Cameron Diaz pulled it off as a workaholic, single women just looking for some fun. She wasn't bad to look at either.Kate Winslet was fantastic as well, and had the second-best performance, under Jack Black, whom she had incredible chemistry with.The supporting cast included a pretty great performance by Eli Wallach, as a former screenwriter who gets to know Kate Winslet's and Jack Black's characters very well.The entire cast put on a believable performance, and fit into their characters very nicely.I enjoyed this movie very much, and I think you will too. I recommend this movie to anyone and everyone that I know.",
    "58": "Nancy Meyers can make them like they used to. This old fashioned comedy shows the talents of an interesting quartet of movie stars that do very well playing relatively normal people. Cameron Diaz continues to do well with light comedic parts, and Winslett, is of course, a fantastic actress who appears to be able to handle just about any genre. The revelations are Black and Law, who haven't really handled romantic with this much finesse. They're both charming and look like they've been doing this for a long time. There is something engaging about Black, and how he can portray an everyday man very well. Law who has tried this before, glows this time out.The film is both touching and funny, and what makes it work is the good chemistry between each of the two pairs of leads. As a n added bonus, there's a great turn by Elli Wallach, as the representative of a generation that is not being honoured in Hollywood anymore, that of the writer with the insight. He charms his new friend (Winslett), and through her, we experience what most movies now lack, heart and the ability to connect through good and clever dialogue.In the end, \"The Holiday\" is not much more than a cute, romantic film, something that we'd like to see more of, a return to a time where everything works out at the end, with the necessary bumps of course.",
    "59": "9/10 - joyful holiday flick that serves as a perfect companion to the beloved Love, Actually",
    "60": "I haven't seen this film for quite a while, but I can definitely remember that I really enjoyed it. The casting is perfect, with a range from Kate Winslet to Jack Black. I can certainly tell you it was unexpected to see this group of people together, but it definitely worked out well! The storyline and character development is also so amusing and entertaining. Couldn't keep my eyes off it for a minute, I was glued😳! It's a lovely romance and definitely something to watch and share with your teenagers and family. It's a great recommendation for anyone that's into films like Nativity and Love Actually. Personally, I'd recommend it to a friend!",
    "61": "Some movies helps us see that when our hearts are switched on and we are vulnerable, then we are more likely to have greater intimacy with our loved ones. This movie did that for me with great acting (loved Jack Black's character here) and the quirky use of trailers.",
    "62": "Follows in the footsteps of any vanilla-flavoured romantic comedy really. Two women decide they need change in their lives and switch locations. Mind you, this is not a deliberate search for a new love which is about as cliché as it can get.However, there's something very heartwarming and sympathetic about this story. Perhaps it's the idyllic British setting with its little holiday-themed shops and quirky English cottages that brings the charm, or perhaps it's the retired filmmaker friend in Los Angeles.I have watched this film ever since I was little and it has become the ultimate feel-good film for me. Nothing special, but still, it has a special place in my heart.",
    "63": "I loved the characters, the sets and the storyline.I especially loved Winslet and Wallach's characters and how they brought out the best in each other.Beautiful and heartwarming, this is my second viewing in one week. Well worth the time to watch.I love that there is something outside the romantic relationships in the story. Love a lot of the dialogue.",
    "64": "When you are feeling down you can watch this movie over and over and cheer you up! One of the best feel good movies you have ever seen!!!Great cast at their best !Oh gosh you will forget your problems and escape from reality for 2 hours and fifteen minutes. Must watch movie!",
    "65": "Loved everything about this movie. I wish they do more like these movies nowadays :(",
    "66": "Kate Winslet does her best, but it is only her scenes with Eli Wallach that redeem this tiresome movie. Cameron Diaz is a dreadful actress.",
    "67": "Some reviewers here seem to think that Jack was miscast opposite Kate Winslet. While I agree that no one in the film is on Kate Winslet's level as an actor, I've always thought that she and Jack Black made an adorable if unconventional couple. I thought it really worked. I'm surprised that more folks aren't criticizing Cameron Diaz's performance over Jack's. I think all four of them are appropriately cast, but IMO if there's one semi-weak link, it's Cameron. I love her to death, but she's not on the same level as Kate Winslet or Jude Law. She gets the job done and it's hard to picture another actress in the role, but I don't believe that Jack Black is the film's weak point. No, it wasn't gonna win any Oscars, but the film is a perfect and entertaining holiday flick. And it's also ripe for rewatching.",
    "68": "I remembered this as a better movie than I found it to be when I rewatched it. What may be my bias away from RomComs and towards RomDrams might have been the filter that lowered my rating. Romantic Comedies seem to root the comedy in hysterical hyperbole and the first 35 minutes of this movie is exactly that (I was not amused) but after those initial scenes there are some great moments of Romantic Drama (which I liked) that finds the core of it's comedy in people confronting the unexpected consequences of their life choices. Jude Law and Kate Winslet bring more rooted performances but I think the hyperbolic tone of the film was a directorial choice, so even they were pushed to the extremes. I also wondered if the roles were cast to highlight stereotypes of Yanks and Brits. Good acting smooths off the harsh angles of stereotypes by filling out the characters, which is what great performers do. Jack Black is always better than I expect him to be. Not a bad movie but more so a fair movie with nice moments. I give this film a 6.8 out of 10. {Holiday RomCom}",
    "69": "Great watch, will watch again, and can recommend.This is a great parallel stories movie. Think of it dueling pianos but as movies for a romantic comedy.Everyone does a great performance, the timing and writing is solid, and the movie is heart warming and touching.Jack Black really shows he CAN do a more serious role when he's finally done playing silly.Honestly, the only real problem I have is that Shannyn Sossamon got such a small part (Maggie).",
    "70": "Nancy Meyers releases a film every three years. In 2000, she directed the pretty funny What Women Want. In 2003, she directed Something's Got to give (Her best film to date). And in 2006, Nancy Meyers directed The Holiday. The Holiday is sweet, charming, funny, and romantic. The Holiday is about two women. Iris (Kate Winslet)is a journalist living in England. She still has feelings for her ex(Rufus Sewell)until she finds out that he's engaged.Amanda (Cameron Diaz)is a film trailer maker who breaks up with her boyfriend Ethan because he slept with his receptionist.THe two hate their lives so they meet over the internet and decide to switch homes for two weeks. Amanda goes to Surrey, England while Iris goes to L.A. Iris loves where she is. Amanda is used to being the rich person so she doesn't like it where she is. But everything changes when she meets Iris's brother Graham(Jude Law).Iris meets two men. One is an eighty year old movie producer. And the other is Miles, film composer. I think you can already tell what happens in the end. Cameron Diaz does a good job as Amanda. Iris's life and romance doesn't really seem real. Like I highly doubt that somebody like Kate Winslet would fall in love with Jack Black. I know she's upset but is she that desperate. The Holiday is a good romantic comedy, though the plot isn't exactly fresh. The Holiday is pretty funny and it's better than something like Twilight.",
    "71": "I have watched this movie many times (usually when my hub is at work, lol) and I never tire of it. It has humor, aching heartbreak, and joy. The dynamic between Kate Winslet and Jack Black is one of the reasons that I enjoy it so much - they have the best chemistry - Jack Black is a surprisingly lovely and romantic leading man. Of course, veteran actress, Kate Winslet is always perfect. The inclusion of Eli Wallach adds depth to the story and gives me another reason to love this movie. Iris opened up a new family for Amanda to come home to, assuming she does come back to LA after finding love in England. Sweet story. And a nice score.",
    "72": "I am astounded that this movie doesn't have at least nine stars, I mean really people are brutal! If you can't enjoy this movie then there's something wrong with you. Needless to say this is a wonderful film! I was a little apprehensive about the strange cast (I mean Kate Winslet and Jack Black!?) but I was totally wrong, the cast is PERFECT together! There really was chemistry among them and they made a wonderful group. In addition the movie had me laughing and crying the whole time! It's a good movie for Christmas, Valentine's Day and anytime you want a good RomCom. However, girlfriends beware! Your guy prob won't enjoy watching this movie with you as much as you do! With that said enjoy!",
    "73": "Although this isn't my typical pick on movies I'd love to see, I have to say I enjoyed screening this one. The run time is a bit long, and the movie gets a bit soft in the middle, but considering you're actually watching two love stories (as opposed to one), I guess the run time is justified. It still seemed a bit forced to get the story told in a descent amount of time (still over two hours). The performances were moderate to good, with exception of Jude Law as Graham, who was wonderful.If you're tired of holiday films that are so stacked with so much Christmas cheer that it makes you sick, this is the perfect alternative. Light enough for some serious laughs, and with enough drama to keep it interesting to audiences, this one's a good date movie. Leave the kids with a sitter. There are a few adult themes that could be uncomfortable to try to explain to a younger one.",
    "74": "Not much not to like about this film! I watch it every year and love it every time! Great cast and has all the feels.",
    "75": "I usually go to the cinema disappointed with romantic comedies; they are not a genre of film I enjoy because they tend to be lacking in storyline or tend to be a little too cheesy. However, I did enjoy 'The Holiday', a film about two women (one from the UK and one from the USA) with troubled love lives who swap houses. Both women end up improving some aspect in their life and finding romance at the same time. The film has a list of well-known actors and actresses. It's just a happy little romantic comedy for the holiday season and it succeeds where 'Love Actually' fails. The story is a good one, and it's a complex series of stories for each character. The film is filled with surprises, and well - it's a must-see for the holiday, even if you don't care for this genre, you'll be surprised.",
    "76": "Music, images, dialogue, camera shots, soft focus, scenes like the lifetime achievement award bit -- all supposed to make the audience do the one thing the Cameron Diaz character can't do...cry. Unfortunately, I caught her problem with this movie. Try as I might I couldn't find any real emotion in this movie, other than nausea.Nancy Myers self-indulgent look into her own fantasy of life that no-one else could possibly care about. With the one occasional exception of Kate Winslet, I didn't believe a word from any of these characters. Explain how the Jude Law character is supposed to be such a perfect father that he goes out regularly to get drunk and spend the night unexpectedly at his sister's house while I guess his kids fend for themselves?!!! Why does every character jump up and down like a 6 year old. OK, I did believe the cameo and unintentionally apt line of disgust from Dustin Hoffman...\"can't go anywhere...'\" Take all that and multiply it by 136 excruciatingly long minutes and you might find something to cry about after all.",
    "77": "This is what movie making is all about. Fantanstic performance from all across. Take a bow. I watched this movie every 6 months or so just to feel good again in life.",
    "78": "I watch this movie again yesterday evening, again great! Love Kate Winslet and Jack Black :) , the positive story and the acting are great!Give it a go , you won't regret. Not a real fan of comedy, only if they have a good storyline with a sentimental touchy message. This one is!!",
    "79": "Perhaps I'm getting soft but this is a really good movie. Exploring the emotional roller coaster of distance relationship and daring as a single parent. Highly recommended.",
    "80": "I should have known better. No, I did know better, but the Missus insisted that we go see this year's Christmas chick-flick called \"The Holiday\". What can I say? It's \"Love Actually\" all over again only worse. Every cliché, every little bit of kitsch you could possibly think of is here. It's a wonder Julia Roberts and Hugh Grant aren't in this.The story is incredibly boring and not funny for a moment. Its cutesiness is the worst thing about it. Like Jude Law's character. Aww... he's a father of two kids. Aww... he's a single father, but he's not divorced, no, his wife died. Aww...she died two years ago, so it's okay for him to walk around drunk fcuking blonde strangers. Yeah, I'm sorry, but that's what the movie is like. Like it or not.What's even worse, though, is that there isn't just one boring storyline, no, there are TWO! \"The Holiday\" is an example of how parallel storytelling can go wrong. The only thing I could think about while almost falling asleep during Law and Diaz' incredibly dull romance was that there was still another dull romance to dissolve before I could finally leave and go home. As much as I like Kate Winslet and Jack Black in other movies they were just as bad as everything else here. And their storyline has even got a \"lovely\" old man in it, which made things even more horrific.If you find yourself contemplating suicide while watching this movie, don't worry. It's not you who's too cynical, it's the movie that's too damn sweet. Oh, and in defense of my Missus it must be said that she hated the movie, too. Thank God. I might have had to think about breaking up otherwise.",
    "81": "When I saw that this film clocked in at over 2 hours I thought I'd be asleep within an hour, but there was enough going on to keep me awake. Although this is strictly a piece of date-flick fluff it has its enjoyable moments. Jude Law and Kate Winslet are good and Cameron Diaz is, well, cute. Jack Black is the only actor who seems miscast and his \"Well, hello\" line that seems to pop up in almost every film is wearing thin. Don't expect any depth in this movie. Just take your girlfriend, hold hands and have a pleasant time. I did enjoy Eli Wallach as a octogenarian screenwriter although seeing him I was constantly reminded of his role as Calvera the bandit leader in \"The Magnificent Seven.\" There are some unbearably cutesy moments with Jude Law's \"sugar and spice and all things nice\" daughters (ugh). But the film provides enough light-hearted and heart-warming moments to last for the rest of the year.",
    "82": "I have my moments of wanting to rent a sweet nothing B-movie to crawl under the covers with and I was anxious about Nancy Meyer's new production since I sooo enjoyed 'Something's Gotta Give'. But... I found 'The Holiday' somewhat of a disappointment. Although it has some good lines (particularly Kate Winslet's ones), beautiful sets and - to me - astonishing(!!) similarities (from Iris' profession to the interior of her house up to the exact disastrously manipulative, lying and cheating ex-lover - like I have been secretly visited by some fly on the wall with a hidden camera) the corniness of the structure and annoying too-over-the-top acting of totally miscast Cameron Diaz drove me up the wall. Darn, what a pity... could have been such a cute film. And Nancy Meyers did so well with 'Something's Gotta Give'. Now why did she go só wrong here?... A shame. But a good enough watch for when you can't sleep but shouldn't watch anything too dramatic, I guess...",
    "83": "This is the perfect movie for holidays or date nights.It has a very good plot, dialogues & well written characters. I just loved how good some of the dialogues were and a perfect ending!",
    "84": "I love this movie. I'm not a fan of Cameron Diaz much at all but I loved her in this and I rooted for her. That never happens lol. Kate Winslet was great, of course. Jack Black funny as ever and Jude Law as handsome as ever. Overall just a great movie that will make you laugh and cheer for the characters.",
    "85": "Unfortunately the first 15 minutes or so of The Holiday were ruined by a group of punks who had sneaked into the movie to raise mayhem. However, after security came and removed them, I enjoyed the rest of the movie. The Holiday is a love movie...and sometimes love movies are cliché. Not with The Holiday. The Holiday was just a very touching, funny, and heartwarming movie that made me happy to be in love. It is entertaining. The acting is solid, and I have to give it to Jack Black especially...he really proved himself. Jude Law is Jude Law...one of the finest actors of our time. The movie makes you appreciate life. It is a great date movie.8/10.",
    "86": "The Holiday is a romantic-comedy that's immensely gushy, with a thick layer of cheese. But that's OK, because it works. Yes it envisages a love that's almost circumstantially impossible. It's absurdness that's at least sweet and warm. Two women, Cameron Diaz and Kate Winslet, decide to house-swap for two weeks over the Christmas period. One's in L.A., the other in Surrey (wow, what a comparison). There they meet their retrospective partners. The four main characters, including the charming Jack Black and Jude Law, are very well developed, making it easy to feel their emotions. Regardless of the outcome (and that's easy to grasp from the off), I want things to work out for them. If anything it was nice to see Jack Black in a completely different role to what he's comfortable with, which probably explains why he's so awkward throughout. The Holiday, as much as it's aimed at a certain gender type, can be for all if you just want it to be.",
    "87": "This is one of my favorite \"feel good\" movies, I must have watched this 5 or 6 times already, and every time i have the same feeling. With just an idea of Christmas flavor, this is more like a romantic movie in my eyes, which is why i watch this all year round. Nice characters (nothing very deep/complex, just nice & charming to the point that you actually care for them as if they are real people and you know them in person), even nicer performance from all, the music is really lovely and the whole atmosphere (the plot, the places...) makes you warm inside, you feel hopeful and kind of happier and remind you that we all need simple things in life. For me, it is just like when i watch the TV series \"Friends\"; it is not a movie to be nominated for Oscar, but in all simplicity and romance it actually is a sweet movie that you feel good every single time you watch it. Very much recommended",
    "88": "Great cast, great stories, multiple stories in one film and set at Christmas. Definitely in my top 10 of Christmas films to watch every year.",
    "89": "I just love it.. i watch it every year.. great actors, great story.. 🎄💗 very warm, beautiful and christmasy..",
    "90": "It delivers exactly what it promises, a film for the victims of unrequited love - and who, honestly, has never been there? the message is, get out of your rut and who knows, maybe, just maybe, you will find what you are looking for. Because many people move in circles that are just made for that sort of frustration, but there are many others where you can relate to people on a normal basis (remember Notting Hill?).\nThe process is set up quite quickly and evolves as one might expect, but what's wrong with that, especially in the sort of seasonal fare that is meant to make us feel cozy and snug?\nIt is perhaps a sad reflection of our times that the film has been criticised not only for what it is but also what it's not, revealing much determination to be cruel and vile.\nYes, it's predictable, which is the default position for this genre - and tell me how many films are not; Parasite wasn't as good as the moving Shoplifters, but won the Oscar for being full of surprises.\nNo, it's not 'clever', but it's quite intelligent enough. Leave 'clever' to the thriller genre where it's most appropriate.\nThis film gives one a warm, sympathetic feeling, and plenty of laughs along the way, many provided by Eli Wallach, in a superb performance that at 90 years of age had the director keep telling him to slow down. That along is worth the price of a ticket or DVD (yes, I'm old-fashioned that way :)",
    "91": "Do you like chocolate? Do you know that moment, even before you put it in your mouth? You can imagine that taste. You can feel that rich sweetness on your tongue, the smoothness going around your mouth . . .The Holiday is a romantic comedy. You know what that means. And if you don't like romantic comedies, don't go and see it. If you do, you will know what to expect. The mushy feelings creeping up on you. All those 'If Only . . .' emotions telling you there is a lovely place somewhere in which people fall in love and everything works out kinda perfect. If only for a while . . . say, for the holiday period over Christmas and New Year . . . or for the 138 minutes which this film lasts.Two Women on the Verge of Emotional Breakdown do holiday house swap. They escape lovelorn predicaments and find 'unexpected' love on their opposite sides of the Atlantic. Cue picturesque English country house just the way Americans imagine it (with sheep out the back). Cue enormous L.A. mansion with swimming pool (just the way Brits imagine it).Cameron Diaz is Amanda, owner of a movie-trailers editing firm. Since she's played the same comedy character several times, there are few surprises; but an excellent script, written directly for her and the other three leading stars, projects it rather better than average. Kate Winslet as Iris, a successful writer on The Telegraph, is more nuanced: an actor with considerable range, we cannot but help admire the way she does 'pathetic girl' rather beautifully in a role that she could manage with one hand counting the ways to have fun and get paid simultaneously.Formulaic it is (wonderful women with scoundrelly fellas eventually get The Real Men They Deserve - meeting puppy dogs, children, and falling snowflakes on the way of course). But, well-done within a narrow genre, it still stands out. No-brainers like this tend to have dumb scripts and dumber acting, but The Holiday contains warm, natural dialogue and heartfelt chemistry. If this was the 40's, you'd want Jude Law and Cameron Diaz to get married off-screen afterwards. Charismatic and entertaining, unless you find Diaz, Law or Winslet personally irritating (some people do), they are a joy to watch, filling their parts with love and light. Excellent production values keep the rather trite story flowing. Everything is picture-perfect, long lenses flattering the features of the already handsome stars, filters and soft-focuses carefully delineating the mood.There is an overall honesty to the performances. \"You look like my Barbie!\" delights a four-year-old excitedly to Diaz. Ironic? But said with so much affection it is self-deprecating rather than cutting. Jack Black struggles to get out of his music-and-silly-faces typecasting but just manages to look the part for an intellectual Iris who is not attracted to skin-deep. Jude Law, on the other hand, could be an advert for men's skin cream, and too rounded a character to be mere pin-up material.With more Christmas songs than you can shake a piece of tinsel at, The Holiday is a warm, snuggly romance to lose yourself in before coming firmly back down to planet earth. It might be shallow, but it's seasonal entertainment - and a Swiss chocolate of romantic comedies.",
    "92": "I think this film deserves a better rating than the current 6.9 on IMDb. I to expected it to be just like other rom com's but it was much better than i expected and very enjoyable.The story starts with Amanda (Cameron Diaz) and Iris (Kate Winslet) fed up with their love lives; Amanda's boyfriend has been cheating on her and the man Iris loves has just got engaged to someone else. They both decide to switch houses for Christmas for an escape from their complicated lives; so Iris jets off to Amanda's place in sunny L.A and Amanda goes to Iris' quaint cottage in snowy Surrey, England (if only it really did snow at Christmas!) Amanda soon meets Iris' handsome brother Graham (Brilliantly played by Jude Law) and Iris meets musician Miles (Jack Black) and you can guess the rest...The acting is strong and well handled. At first i found Cameron Diaz hugely annoying but as it went on i warmed to her character; she and Jude had lots of chemistry and their relationship was handled well and Graham's secret was a good twist.I thought Jack Black was great in this different role, he and Kate also had chemistry and he was totally believable. I wish their storyline had been a bit longer though as they spent way more time on Cameron and Jude's part.Kate Winslet as usual was funny and touching as Iris and maybe one of the best parts of the film was her relationship with the old man (Eli Wallach) they both seemed to have a connection and it was nice to hear his stories of when he was a writer in the good old Hollywood days when he knew Cary Grant and co! If you want beautiful scenery, escapism from the millions of horror and action films out there and good characterisation, than this is for you. It's not as soppy as other rom/com's and it's easy to identify with the characters, it's also very festive and my dad even liked it and he hates romantic films!",
    "93": "The Holiday (2006) is an out of the ballpark smash hit! I thought about it after seeing it and just seriously could find NO fault whatsoever. This is such a feel good, cute, romantic, and sweet film. And it's not one of those stupid run of the mill romance movies, it actually has depth and is well made. Kate Winslet and Cameron Diaz are two women recently out of relationships with men, and pretty fed up with life in general, so they decide to go on vacation. They switch houses, Cameron goes to stay in England in Kate's house, and Kate goes to Los Angeles to stay in Cameron's house. The plot in and of itself is interesting and draws you in to keep watching. The script is well written and original, with little sparks of comedy thrown in where needed. And then there are scenes where we get to know our characters, usually through deep conversations with them and other characters. There definitely are NOT cardboard cut out one dimensional characters here, they are characters with real life issues, true depth, and interesting backgrounds. The romance and chemistry between the couples is great! It's truly eclectic and comes so wonderfully natural. I also love the side plot between Kate Winslet and the older screenwriter next door neighbor, it's so undeniably cute and so sweet, it's just endearing, I actually cried during the scene where he is honored at that ceremony! 10/10 for The Holiday! It's so well deserved!",
    "94": "(Synopsis) Two beautiful women, Amanda Woods (Cameron Diaz) and Iris Simpkins (Kate Winslet) both find themselves at the end of failed relationships just before Christmas. Amanda decides to take a two week vacation and surfs the internet. She meets Iris online, and they agree to swap their homes for the holidays. Amanda lives in Los Angles and Iris lives in the countryside of Surrey, England. Even though they now have a change of scenery and want no contact with men, they are both still depressed and lonely. But things are about to change when Iris' brother Graham (Jude Law) drops by Iris' house and meets Amanda. On the other side of the world, Iris meets Miles (Jack Black) a film composer. Romance is in the air and sparks are about to fly.(My Comment) If you want to see a romantic comedy with real chemistry, especially between Cameron Diaz and Jude Law this is one chick flick you must see. This movie is a good date movie that is actually entertaining and sweet. You are actually seeing two love stories instead of one. There is a great subplot of the friendship between Kate Winslet and Eli Wallach's character that will touch your heart. Actually, I enjoyed that part of the movie the best. Overall, the movie was enjoyable to watch with touching and funny scenes throughout the movie. The ending is predictable, but what do you expect, it is a romantic comedy. You will leave the movie feeling good, and isn't that what movies are all about. (Columbia Pictures, Run time 2:18, Rated PG-13)(8/10)",
    "95": "This somewhat odd but distinctly likable film involves two women, one in L.A. and one in London, both unhappy in love, who switch homes to shake up their lives.The movie is often funny and sometimes touching, with solid performances from all. Perhaps the biggest issue is the absence of chemistry between Kate Winslet and Jack Black, which gives the movie a false note that could have been avoided if it wasn't so determined to follow the standard romantic comedy path. Winslet has much better chemistry with Eli Wallach, wonderful as an aged scriptwriter.One interesting thing to note is Jude Law, whose handsome, empathetic, nurturing, understanding character could best be described as lady porn, plays the sort of role usually played by a woman: the perfect person, wonderful in every way, whose main role in the story is to allow the main character to transition to a new phase in their life.It's not a great movie, and I don't love the structure, which simply involves cutting back and forth between two unrelated stories, but it's a nice feel-good chick flick thing that is perfect for days you don't want your brain to work too hard.",
    "96": "Iris (Kate Winslett), attractive, if somewhat dowdy, young English journalist (she works for that citadel of fogeyism, the \"Daily Telegraph\"), on the rebound from an affair with the shiftless Jasper (Rufus Sewell), one of the paper's columnists, decides she needs a Christmas holiday. She goes on-line and has soon swapped her Christmas-card pretty, but cramped, Surrey cottage with a mansion in Bel – Air owned by Amanda (Cameron Dias), the ebullient head of a company that makes movie trailers, who has just thrown out her latest useless partner. The girls swap places and in no time Amanda is romancing Iris's dishy brother Graham (Jude Law). Meanwhile in Hollywood Iris is getting to know Miles (Jack Black), a workmate of Amanda's, and a 90 year old neighbour, Arthur (Eli Wallach) who happens to be one of Hollywood's forgotten great writers.One can of course dismiss this sort of stuff as glossy fairy floss because basically, despite all the money and talent expended in making it, that is what it is - \"Love, Improbable.\" This film is rather long for its genre, over two hours, and it does drag a bit, as if the scriptwriters couldn't decide how to end it. However it must be admitted that Kate Winslett and Jude Law are always interesting to watch on screen and Cameron Diaz has a nice line in parodying some of her earlier performances. Rufus Sewell shows he can out-act Hugh Grant any day (not hard I guess). Jack Black on the other hand seemed strangely out of place as Ms W's love interest – romantic comedy doesn't seem to be his forte, he's more of your gross-out guy. It was nice though to see Eli Wallach, a great Hollywood tough guy of old, who at 90 seems to have the market for nice old buffers sewn up, as the neighbour.Perhaps I am setting my standard too high, but compared to \"Four Weddings and a Funeral\", \"Notting Hill\", \"Bedrooms and Hallways\" and even \"Love, Actually\", this was a pile of mush, far too sweet and sticky and nice. Good comedy needs a certain bite, a reality bite, a bit of astringency, whereas what we are given here is pure fairyland escapism. Writer/Director Nancy Myers has a record of light entertaining stuff (\"The Parent Trap\", \"Father of the Bride\") and she certainly is not trying to extend her range here.",
    "97": "Nancy Meyers's 'The Holiday' is a sweet, cute Romantic-Comedy, that charms you. Its A Lighthearted Joyride, with proficient performances.'The Holiday' Synopsis: Two women troubled with guy-problems swap homes in each other's countries, where they each meet a local guy and fall in love.'The Holiday' is funny & heartwarming. I enjoyed the characters & their journey, as different as it is, made me smile. The goings-on are consistently lighthearted & the result overall, is precious.Meyers's Screenplay is top-notch, with some of the dialogue oozing naturalness. Meyers's Direction, on the other-hand, is effective, as always. Cinematography is picture-perfect. Editing is rightly done. Hans Zimmer's Score is wonderful.Performance-Wise: Cameron Diaz is in terrific form. She delivers a genuinely lovable performance from start to end. Kate Winslet is splendid, yet again! Jude Law is efficient. Jack Black stands out. He's superb. The Late/Great Eli Wallach lends good support.On the whole, 'The Holiday' is a winner from Meyers.",
    "98": "While this movie is not going to be a masterpiece and held up in the future as an example of \"great\" film making, it was, in my opinion, a well made, albeit predictable, movie.I did appreciate the storyline was a bit of a formula, but it had enough in the sub plots to keep me interested all the way through.I got what I expected and a little more from the lead characters, but was a little disappointed in the performance of Jack Black. I am a fan of Jack, but am seeing a lot of the same from him in his facial contortions. Even so the character was \"lovable\"! The real surprise for me was the whole \"Arthur Abbott\" (Eli Wallach) sub plot. It was delightful and saved the show from the malaise that plagues the romantic comedy, that being predictability.I am not a romantic comedy type of guy, yet I was sucked into this movie well and truly.As I left, I felt like I had been treated as a human being. I had not been assaulted by the violence, overt sexual references, gunfire and the explosions that seem to be everywhere. (Not that I don't like a good \"shoot the baddies\" or \"indecent suggestive action\" type of movie). This was just good clean \"fun\"! And I would see it again (next year maybe!)",
    "99": "The stage curtains open ...Wow! I have put watching this movie off for far too long. What a wonderful film with inspired acting and a crowd pleasing story. I found \"The Holiday\" to be charming, heartwarming, and touching.Two women who are both going through a break-up, decide to get away from it all for a couple of weeks and find each other on the internet and swap homes. One going to England to a small cottage and the other to a posh Los Angeles neighborhood and estate. While there, they both rediscover themselves, the will to go beyond their own personal comfort zones and reach out for something new and exciting. Oh yes, and they both also fall in love - real love.I'm not going to write how improbable this is, or how it all just kind of neatly fell together for them ... etc. After watching this movie, who really cares? This is romantic fantasy, and light comedy. It touches on honest emotions we all have experienced at one time or another. It was such a fun movie to watch. You are taken away and you want to laugh and cheer, and in parts, cry. This is movie magic. It's why we go to movies - to drop the cares and concerns of our own worlds and lives and enjoy a couple of vicarious hours of entertaining film making. And this is very good film making. You really care for both main characters and want them to find love again.I loved \"The Holiday\". I just watched it for the first time today and it has already become a very fast favorite. A high recommend, and I can't wait to see it again.",
    "100": "If you are expecting an epic cinematic masterpiece, then \"The Holiday\" is not for you. However, if you are looking for a light, entertaining movie, I would definitely recommend this film. While the previews were intriguing, I was thrilled to find that not every plot element was revealed before I even entered the theater. I completely enjoyed Kate Winslet as hopelessly devoted Iris. She was neurotic, a bit spineless, and absolutely winning. Although I do wish that her story had been developed more thoroughly. I felt a bit like her relationship was rushed through and the film spent a majority of the time focusing on Amanda (Diaz), Graham (Law), and their developing relationship. Despite the fact that I am not a huge Cameron Diaz or Jude Law fan, I was pleasantly surprised with their part of the story! Jack Black kept his character to an energetic hum rather than an explosion of crazy antics. You've just got to love that eyebrow! The scenery was beautiful! The supporting cast was hugely entertaining. I laughed out loud. The ending is fairly predictable. This is a romantic comedy after all. However, \"The Holiday\" is a great film for those of us who would like to suspend reality for a while and just enjoy. Go see it!",
    "101": "Today is just one of those days, when you get tired from work and just want to chill a little, with a beer in one hand and remote control in the other. It's been a month or two maybe, since this movie passed on our cinemas, but I was not able to see it on the big screen and here I am - at home playing it on the DVD player. I like Jack Black - this is the reason I got the movie. Like Cameron Diaz, Jude and Kate too, but of all those four, Jack is my favorite and what I was expecting to see was something more like \"The School of Rock\" (2003) or \"Nacho Libre\" (2006) - I wanted something funny to release the Friday work stress. Well... I got something else. \"Different\" is the actual word. I remember I saw the trailer few times months ago, but as I now remember it was little misleading. Jack Black plus Cameron Diaz should be equal to who-knows-what, similar maybe to \"There's Something About Mary\" (1998), I though to myself and that's exactly what I need this Friday night! Today is one week since I work for another company, some more stress as You may guess and I prepared for a little fun. First of all to say - it was not funny. There were some amusing moments, but this movie for me was not funny at all and not a bad one at all either! It just was not \"comedy\", no matter how some label it. Surprisingly for me, this is one of those movies who really could make You think of the world around You and the way we live our lives. This is like ordering a sausage with fries and getting a fine fillet au champignons instead or however some would like to compare it, because in this movie, we see Jack and Cameron in very serious situations. It's not all credit for Jack and Cameron, of course - Jude and Kate did great too, as well as the director and writer did. I almost cried in few moments. It is a long movie - my player stopped at credits at 2h and few minutes, time now is 2:40am but I wanted to write this anyway. As my girlfriend sleeps next to me and I was watching the movie, it really made me thinking and recalling different moments of my life with her. I do not know - maybe I am just too emotional, please tell me Your opinion. Anyway I totally recommend the movie to everyone, really. In brief: story is not bad at all, actor play at the end is great, music is great, great level of originality, make you recall of movies like \"The Cable Guy\" (1996) a little. Great work guys! Now all of You, go and see it!",
    "102": "This is what it's all about. This is such a nice, heartwarming, emotional movie.I absolutely love this movie. So much stuff to love about it. I serioualy cannot understand why it has such a low rating here on IMDb.I overall, loved the message and the theme of this movie and probably even more importantly the execution of it and the way it was delivered. This movie is well made. It has great, complicated, 3-dimensional characters, who actually have a background and emotions, problems, feelings, insecutities, needs...etc. etc. etc. All this maeks them feel real and relatable and that results into us, the audience, to become invested and care, instead of counting down the minutes until the movie ends. This is such a basic concept in order for a movie to be succesful but ironically you rarely find it these days, especially in romantic comedies.As far as the story goes there are a few very pleasant surprises. When I first watched this movie I knew nothing about it. I hadn't seen any trailers or knew who plays in it so (if you've seen it) you probably know what I'm referring to. But anyway, the movie has a beginning, middle and end. And the journey is very enjoyable to watch. It starts... ok with not much going on and you kinda know where it's going but then the story starts to unravel and it slowldy gets bigger and bigger and it gets better as you see more while more characters enter the story.The cast is amazing as you'd expect from actors like Kate Winslet, Cameron Diaz, Jude Law and Jack Black. Likeable and charming they all do a great job and they convey emotion so masterfully and with such heart.The supporting characters were amazing as well. The supporting cast is very important as they make the world feel real, they can literally make or break such movies and the actors who portrayed them were great as well.Like I said, overall, I loved the message and the theme of the movie. It's essentially a story about 4 (2?) troubled adults who are lonely. They seek to find love, find themselves and find happiness. Something which I think the entire world can identify and relate with. And what I liked about it is that the movie and the characters don't pretend like love is something stupid or cheesy or childish. They don't play it tough and strong, they don't deny or try to block off their feelings in order not to open up and be vulnerable (Just like the while of society does today unfortunately). They ARE vulnerable and open and in love. These people need love and affection in their lives and the journey through which they find it in this movie I thought was very charming and heartwarming.This is a well thought out and put together movie with heart. Perfect for a cozy Christmas movie night if you ask me. Highly recommended if you like romantic comedies.",
    "103": "Writer-director Nancy Myers has created a modern masterpiece in the delightful romance The Holiday. Not only are there extremely likable characters, a storyline that belongs in a fairytale book, fun and fitting music, great performances, and relationships that make us believe in love again, but it takes place at Christmastime! Everything's better at Christmas—how many terrible movies have we all sat through just because they take place in December?—and you can now add a modern classic to your box of black-and-white films you watch every holiday season.Kate Winslet opens the film with a poignant narration about the different types of love, and a montage overlay introduces us to all the characters in the film. Then we see Kate at her office Christmas party, pining away for her former lover, Rufus Sewell. If there's a woman in the audience who doesn't swallow a lump in her throat inspired by their rapport together, that woman should turn off the film and only resume it after she's had her heart broken. The dialogue is so realistic it's painful, and Kate's expressions are absolutely perfect.Next, we meet Cameron Diaz, who's having a terrible fight with her boyfriend, Edward Burns. It's a wonderful introduction to her character as well, because even though she appears to be tough and not as sensitive as Kate Winslet, we see subtleties that indicate she has deep feelings in her she's been repressing for a long time.Without describing every single scene—which I could absolutely do, since I've seen this movie close to a hundred times—I'll get to the main plot. Kate and Cameron swap houses for the Christmas holiday, taking spontaneous vacations from their lives and getting a second chance when they need it the most. Kate is awed by Los Angeles and the sunshine, and she meets new friends Eli Wallach and Jack Black, both in the film industry. Cameron is a little frustrated by the snow and English countryside, but when Jude Law turns up on her doorstep—literally—she remembers what vacations are for.One remarkable thing about this movie is it manages to take three actors, whom I normally dislike so much so that I try to avoid their movies, and completely change my mind about them. With the exception of the film Carnage, which I hadn't seen until years later, I've usually found Kate Winslet's acting style irritating. At the time of its release, The Holiday was the best acting she'd ever done. She's the heart of the movie, and through her moving performance, women everywhere will believe they'll survive after their heart's been broken. I'm the first to admit that my animosity towards Cameron Diaz had everything to do with her similarity to a rival in high school, but when I watched The Holiday, I completely forgot about the teenager who tried to steal my sweetheart. Cameron shows off her acting chops in this film, and as her character grows, she helps the audience vicariously grow. Jude Law, while normally drawn to upsetting roles, plays a character who should have been named \"Every Woman's Fantasy.\" Everything you ever wanted in a man, but deep down know you'll never get, is represented by Jude in this film. If you don't develop a massive crush on him, you must have very bad taste. Plus, he's very believable when he speaks his unbelievable lines, which is a testament to his acting.I've always liked Jack Black, so while The Holiday didn't change my mind about him, it did show me another side to his acting. He's extremely convincing as an L.A. Hollywood type, and the mixture of his confidence and uncertainty adds another layer to his character. Eli Wallach, at ninety years old, still has a wonderful screen presence. His scenes are some of the most touching, and the film wouldn't be the same without him.The dual-settings of the film provide an ideal Christmas for everyone in the audience, so whether you like the sun or the snow, you'll be happy. Hans Zimmer's music, to quote Jack Black in the film, is \"very unexpected\", and it adds to the delight of the film, making it clear that someone should snatch up the rights and turn this into a Broadway musical! I absolutely love every part of this movie. It's funny, charming, sad, realistic, inspiring, heartwarming, and irresistible. It's simply wonderful, no matter what time of year you watch it.DLM warning: If you suffer from vertigo or dizzy spells, like my mom does, there's one tiny part of the movie in which the camera spins in a circle. After Jack Black and Kate Winslet sing \"Arthur is a doodle-y-doo\" on the piano, look away for about ten seconds. In other words, \"Don't Look, Mom!\"",
    "104": "This was a really good, light hearted movie, with GREAT characterization. There are points where the movie is a little slow, but not slow enough to loose your interest.All of the characters are wonderfully developed especially Jude Laws-the under-story of Jude's character adds an extra dimension to his character and really makes you love him all the more.Kate Winslet's character is another that was well worked out. She helps out this little old man . . . and the character development between her and this older gentleman is wonderful . . . it adds so much to her character, makes her more human, more real, someone very likable and someone you want to end up with a good ending.Jack Black's character was sweet, not corny . . . and you end up liking him very much. He was not a goober like he usually is in his movies.Over all, it was a wonderfully character driven movie, that was enjoyable and had you leaving the theater feeling good. I recommend it highly!",
    "105": "My girlfriend and I just saw The Holiday this afternoon on it's opening day and I have to say that honestly, I really did like The Holiday. It was a nice breath of fresh air for an all together feel good movie for the season. I think because in one way or another we can relate to the characters and their love lives, because they each had different situations. Like Cameron couldn't commit, Jude had a hard time opening up to his real life, Kate couldn't get out of love with someone who wasn't treating her right, and Jack was falling in love with the wrong women. This movie was a very special treat for the holidays.Iris and Amanda are two women who have just been horribly bashed around in relationships and need to get away for a while. Iris lives in Surrey, England, and Amanda lives in L.A. in the states, they look each other up on the internet for a house exchange to get away from their problems for a while and agree to do the arrangement. When both ladies arrive, they are excited and anxious about their new lifestyles and countries, they also both meet each other's brothers and while Grahm, Iris's brother, and Amanda hit it off immediately, it takes Jack's character and Iris a while to realize that it's time to move on from their unhealthy relationships, of course, it's difficult since they live on separate sides of the world from each other.The Holiday may be a bit hokey and cheesy to watch, but for a girl's afternoon, I think this was a great film that was honest and anyone could use for those broken hearts. I would highly recommend The Holiday, it did actually have good acting, a wonderful story, and lovable characters that weren't too over bearing or annoying. Please, don't listen to the critics on this one, it was a very touching and lovely story and I hope it is an honest success at the box office this weekend.9/10",
    "106": "Why do movies like this get made? Is there some sort of virus in Hollywood that disables the ability to differentiate between a well written script and a piece of drek so phony, so formulaic, so divorced from any human being's real life, that its mere existence insults intelligent filmgoers? Women and chick flick fans, arise and unite! Let's mount noisy protests outside movies like this. Let's demand that Hollywood hire people who can write.\"The Holiday\"'s cast is top notch, except for the terminally mediocre Jack Black, whose entire film career is some sort of cosmic joke.The very best thing about \"The Holiday\" is Eli Wallach's relatively large part as a great writer from Hollywood's Golden Era. Wallach is especially strong; being ninety years old does not diminish his charisma one whit.It's ironic that a movie with such a disaster of a script features a character playing a classic Hollywood writer, who makes repeated reference to well-written chick flicks from yesteryear.Jude Law is very winning here. He juggles his external beauty and inner complexity marvelously.Miffy Englefield and Emma Pritchard are adorable as moppet sisters too cute to live.Oh, but the script. It's drek. It's an insult. It's a random jumble of utterly bogus settings and complications that some cold heart in marketing stitched together, convinced that this would rake in some dough. You've got Christmas trees, poignant reunions, and tears that appear on cue.You know, I saw \"Apocalypto\" this weekend as well, and, of the two, \"Apocalypto\" was the feel good movie, and \"The Holiday\" filled me with rage. One had some integrity; the other was an empty exercise in marketing.How stupid do the folks who made this movie think women are? The answer is very grim.Save your bucks; stay home, and watch one of the classic chick flick films this movie keeps talking about.",
    "107": "THE HOLIDAY was one of the biggest surprises I've had at the movies in years. This fresh and funny comedy stars Cameron Diaz as Amanda, the owner of a company that makes movie trailers, who has just dumped her cheating boyfriend (Edward Burns)and decides she needs to get out of LA for awhile. She goes to a real estate website and chats with Iris (Kate Winslet), a lonely publishing employee who lives in England, who has just learned the man she's in love with is engaged. Amanda and Iris agree to exchange homes over the Christmas holiday. Iris arrives in LA and strikes up a friendship with Amanda's neighbor, a retired screenwriter (Eli Wallach) and Amanda's ex's best friend (Jack Black ). Amanda lands in London and finds herself in a whirlwind romance with Iris' bother (Jude Law), a sexy charmer with baggage. As silly and predictable as this film appears on the surface, it is just the opposite...cleverly written and performed with exuberance and sincerity. Diaz' performance is kind of all over the place and kind of hard to latch onto but Law has rarely been more appealing on screen and Jack Black shows solid leading man potential without losing that goofiness that we love about him, but it is the luminous performance of Kate Winslet that raises the bar on this one...Winslet's Iris is a delicious combination of vulnerability, sweetness, and silliness that makes this film well worth sitting through. Wallach is also a delight as the old gentleman brought out of his shell by Iris. A delight from start to finish.",
    "108": "Wonderful romantic comedy that will remind you of the comedies of the 1940s. Jude Law does a wonderful take-off of Cary Grant, who this picture certainly was made for.Two women- Hollywood's Cameron Diaz and England's Kate Winslet exchange their homes online for two weeks after experiencing major disappointments in their respective boyfriends. This is probably the best thing that could have happened to them. Both are literally swept off their feet in new endearing love affairs.This film deals with the ability to be daring and make a change during times of adversity.As Arthur Abbott, a retired screenwriter of Hollywood's golden years, Eli Wallach etched still another unforgettable character. He is just fabulous in the role as an elderly widower who with his Oscar and other accolades, refuses to be honored by his peers.This is just a grand film and I certainly recommend it for viewing.",
    "109": "OK, so it is a chick flick. That doesn't mean it's bad, or that it is not worth your time.In this case there was a lot more going on.Kate Winslet and Cameron Diaz were absolutely great as women trying to find themselves. I could not imagine better casting in these roles. I was impressed with both performances.I also though Jude Law was great, and I have a new found respect for Jack Black in what I consider the best performance of his career.I was thrilled to see Eli Wallach (King of the Corner) in an outstanding performance.Great music, great acting, superb script and direction by Nancy Meyers, and two of the cutest girls you have ever seen - Miffy Englefield and Emma Pritchard.A real treat.",
    "110": "I don't understand how a film of this nature could cost $85 million. Certainly no one expected to make money with it costing so much. At a normal budget of, say, 20 or 30 million, it would have made quite a bit.Cameron Diaz and Kate Winslet play two depressed, lovelorn women who switch homes for the Christmas holiday, Diaz leaving her Los Angeles mansion for a small fairy-tale like English house and Winslet trading the English chill for a big LA lifestyle. Diaz and her live-in boyfriend have just split, and Winslet is escaping from her great love, her boss, who just announced his engagement. Both are in for surprises.\"The Holiday\" has a lot of warmth, likable characters, and it's a lovely Christmas movie. That's about it. There's no real pacing. Winslet is by far the more interesting actress, and she's teamed up with Jack Black, as a potential love interest and Eli Wallach, as her Oscar-winning screen writing neighbor, for the L.A. adventure - and the L.A. segments are better than the British.Diaz meets Winslet's brother, played by handsome Jude Law, and it turns out he has a secret that we don't learn until later in the film. At one point she reminds him that she's leaving in nine days. I don't know. If Jude Law were after me, I doubt I'd be going anywhere in nine days.For me this film was mildly entertaining. I'm not the demographic it's geared to, though. And I still can't understand how it cost $85 million.",
    "111": "Nancy Meyers writes knowingly facile scripts, and then attempts to 'cute' them up with show-bizzy chatter and characters who can be described completely by their occupations: Newspaper Writer, Movie Advertising Boss, Book Editor, Film Composer. Meyers plugs in the gaps with nostalgic soundtrack choices and clean, glossy locations. She's living in a storybook. Kate Winslet's opening narration--a deduction of modern romance for the masses--is supposed to ring amusingly true (at least for the females in the audience); but instead, this montage of hit-or-miss romantic snippets is so sterile and Hollywoodized, it looks as though it were created by committee, by a TV group designing a commercial. Comedy about two women, a British writer and a show business denizen of Los Angeles, who switch houses over the Christmas holiday has nary a single joke that resonates with truth. It's about as real as a cartoon, and some of the performances (Cameron Diaz's in particular) are indeed cartoonish. Diaz gave some wonderful performances earlier in her career, but she seems to have lost touch with humanity (she and Meyers are living in the same neighborhood of La-La-Land). Only Kate Winslet's warmth and intrinsic intelligence manages to shine through, but her lovely presence cannot camouflage the fact this is artificial goods: phony, slack, unmoving, witless. *1/2 from ****",
    "112": "Sweet syrup is expected from romantic comedies but what makes them tick and likable, even if they are predictable is the charm factor. 'The Holiday' is a charming romantic comedy. It pretty much has all the ingredients of romantic comedies and I loved how Myers has used numerous references to old classics. The locations are marvelous. Amanda's luxurious condo contrasts well with Iris's cozy cottage but they both give exude a feeling of comfort and home. The soundtrack is a plus and cinematography is brilliant.'The Holiday' tells two simultaneous stories (which are interlinked of course) but I liked Iris's holiday story more than that of Amanda. Thankfully, the director does not overtly focus on contrasting the two and the dialogues are a nice inclusion. Most of the comedy is not overdone either as its genuinely funny.The Amanda and Graham love story is more or less the typical holiday romance one has witnessed earlier but it is still a fun watch mainly due to the two leads. Both Cameron Diaz and Jude Law share wonderful chemistry. The genre is not anything new to Diaz and she definitely has become quite skillful at it. In the beginning of the movie, she reminded me a little of Meg Ryan. Law holds his own proving that he is competent in this genre. Edward Burns has a small but hilarious scene which reminds one of the Romeo and Juliet balcony scene except this one is the reverse of that.Iris's holiday has the added charm of the endearing Kate Winslet - Eli Wallach track which was such a delight to watch. This story is more about Iris's growth into an independent self-sufficient woman. Winslet's chemistry with both Black and Wallach is beautifully displayed and the actress demonstrates a flair for comedy. Black too downplays his comedy making Miles different from the usual goofy characters he is normally associated with. Eli Wallach is simply superb.'The Holiday' is quite a warm and fluffy piece of entertainment and a good enough holiday movie that will entertain. One should not expect anything other than a rom-com but this one has an extra appeal of a stellar cast and a splendid subplot.",
    "113": "Sometimes I can be such a jerk when it comes to movies. I was so prepared to not like this because it is so glossy and so Hollywood. But it has Kate Winslet and I've never not liked her in any film, not to mention Jude Law who is about the most beautiful man on earth. Both are so natural in their delivery and such is the case here. Cameron Diaz is also a very good actress, why I gave her short shrift is on me, Cameron is fantastic. And then there is Nancy Meyers the director and writer of the film, Meyers knows what women want. We want to be entertained, we want our characters in gorgeous settings, but we want smart dialogue like a 1930s screwball comedy and Meyers always delivers on all counts. I am sorry I waited so long to enjoy \"The Holiday\" but glad I watched this delightful film! Great to see Eli Wallach, (who made it to 98) and was 91 when he played his role, a consummate actor, Bill Macy who played Walter, Beatrice Arthur's husband on \"Maude\" and Shelley Berman (who lived to be 92) all are treated with dignity and not as punchlines. Jack Black was also charming.I recommend this film without reservation. Curl up and bask in it.",
    "114": "THE HOLIDAY was one of the biggest surprises I've had at the movies in years. This fresh and funny comedy stars Cameron Diaz as Amanda, the owner of a company that makes movie trailers, who has just dumped her cheating boyfriend (Edward Burns)and decides she needs to get out of LA for awhile. She goes to a real estate website and chats with Iris (Kate Winslet), a lonely publishing employee who lives in England, who has just learned the man she's in love with is engaged. Amanda and Iris agree to exchange homes over the Christmas holiday. Iris arrives in LA and strikes up a friendship with Amanda's neighbor, a retired screenwriter (Eli Wallach) and Amanda's ex's best friend (Jack Black ). Amanda lands in London and finds herself in a whirlwind romance with Iris' bother (Jude Law), a sexy charmer with baggage. As silly and predictable as this film appears on the surface, it is just the opposite...cleverly written and performed with exuberance and sincerity. Diaz' performance is kind of all over the place and kind of hard to latch onto but Law has rarely been more appealing on screen and Jack Black shows solid leading man potential without losing that goofiness that we love about him, but it is the luminous performance of Kate Winslet that raises the bar on this one...Winslet's Iris is a delicious combination of vulnerability, sweetness, and silliness that makes this film well worth sitting through. Wallach is also a delight as the old gentleman brought out of his shell by Iris. A delight from start to finish.",
    "115": "Wonderful romantic comedy that will remind you of the comedies of the 1940s. Jude Law does a wonderful take-off of Cary Grant, who this picture certainly was made for.Two women- Hollywood's Cameron Diaz and England's Kate Winslet exchange their homes online for two weeks after experiencing major disappointments in their respective boyfriends. This is probably the best thing that could have happened to them. Both are literally swept off their feet in new endearing love affairs.This film deals with the ability to be daring and make a change during times of adversity.As Arthur Abbott, a retired screenwriter of Hollywood's golden years, Eli Wallach etched still another unforgettable character. He is just fabulous in the role as an elderly widower who with his Oscar and other accolades, refuses to be honored by his peers.This is just a grand film and I certainly recommend it for viewing.",
    "116": "OK, so it is a chick flick. That doesn't mean it's bad, or that it is not worth your time.In this case there was a lot more going on.Kate Winslet and Cameron Diaz were absolutely great as women trying to find themselves. I could not imagine better casting in these roles. I was impressed with both performances.I also though Jude Law was great, and I have a new found respect for Jack Black in what I consider the best performance of his career.I was thrilled to see Eli Wallach (King of the Corner) in an outstanding performance.Great music, great acting, superb script and direction by Nancy Meyers, and two of the cutest girls you have ever seen - Miffy Englefield and Emma Pritchard.A real treat.",
    "117": "I don't understand how a film of this nature could cost $85 million. Certainly no one expected to make money with it costing so much. At a normal budget of, say, 20 or 30 million, it would have made quite a bit.Cameron Diaz and Kate Winslet play two depressed, lovelorn women who switch homes for the Christmas holiday, Diaz leaving her Los Angeles mansion for a small fairy-tale like English house and Winslet trading the English chill for a big LA lifestyle. Diaz and her live-in boyfriend have just split, and Winslet is escaping from her great love, her boss, who just announced his engagement. Both are in for surprises.\"The Holiday\" has a lot of warmth, likable characters, and it's a lovely Christmas movie. That's about it. There's no real pacing. Winslet is by far the more interesting actress, and she's teamed up with Jack Black, as a potential love interest and Eli Wallach, as her Oscar-winning screen writing neighbor, for the L.A. adventure - and the L.A. segments are better than the British.Diaz meets Winslet's brother, played by handsome Jude Law, and it turns out he has a secret that we don't learn until later in the film. At one point she reminds him that she's leaving in nine days. I don't know. If Jude Law were after me, I doubt I'd be going anywhere in nine days.For me this film was mildly entertaining. I'm not the demographic it's geared to, though. And I still can't understand how it cost $85 million.",
    "118": "Nancy Meyers writes knowingly facile scripts, and then attempts to 'cute' them up with show-bizzy chatter and characters who can be described completely by their occupations: Newspaper Writer, Movie Advertising Boss, Book Editor, Film Composer. Meyers plugs in the gaps with nostalgic soundtrack choices and clean, glossy locations. She's living in a storybook. Kate Winslet's opening narration--a deduction of modern romance for the masses--is supposed to ring amusingly true (at least for the females in the audience); but instead, this montage of hit-or-miss romantic snippets is so sterile and Hollywoodized, it looks as though it were created by committee, by a TV group designing a commercial. Comedy about two women, a British writer and a show business denizen of Los Angeles, who switch houses over the Christmas holiday has nary a single joke that resonates with truth. It's about as real as a cartoon, and some of the performances (Cameron Diaz's in particular) are indeed cartoonish. Diaz gave some wonderful performances earlier in her career, but she seems to have lost touch with humanity (she and Meyers are living in the same neighborhood of La-La-Land). Only Kate Winslet's warmth and intrinsic intelligence manages to shine through, but her lovely presence cannot camouflage the fact this is artificial goods: phony, slack, unmoving, witless. *1/2 from ****",
    "119": "Sweet syrup is expected from romantic comedies but what makes them tick and likable, even if they are predictable is the charm factor. 'The Holiday' is a charming romantic comedy. It pretty much has all the ingredients of romantic comedies and I loved how Myers has used numerous references to old classics. The locations are marvelous. Amanda's luxurious condo contrasts well with Iris's cozy cottage but they both give exude a feeling of comfort and home. The soundtrack is a plus and cinematography is brilliant.'The Holiday' tells two simultaneous stories (which are interlinked of course) but I liked Iris's holiday story more than that of Amanda. Thankfully, the director does not overtly focus on contrasting the two and the dialogues are a nice inclusion. Most of the comedy is not overdone either as its genuinely funny.The Amanda and Graham love story is more or less the typical holiday romance one has witnessed earlier but it is still a fun watch mainly due to the two leads. Both Cameron Diaz and Jude Law share wonderful chemistry. The genre is not anything new to Diaz and she definitely has become quite skillful at it. In the beginning of the movie, she reminded me a little of Meg Ryan. Law holds his own proving that he is competent in this genre. Edward Burns has a small but hilarious scene which reminds one of the Romeo and Juliet balcony scene except this one is the reverse of that.Iris's holiday has the added charm of the endearing Kate Winslet - Eli Wallach track which was such a delight to watch. This story is more about Iris's growth into an independent self-sufficient woman. Winslet's chemistry with both Black and Wallach is beautifully displayed and the actress demonstrates a flair for comedy. Black too downplays his comedy making Miles different from the usual goofy characters he is normally associated with. Eli Wallach is simply superb.'The Holiday' is quite a warm and fluffy piece of entertainment and a good enough holiday movie that will entertain. One should not expect anything other than a rom-com but this one has an extra appeal of a stellar cast and a splendid subplot.",
    "120": "Sometimes I can be such a jerk when it comes to movies. I was so prepared to not like this because it is so glossy and so Hollywood. But it has Kate Winslet and I've never not liked her in any film, not to mention Jude Law who is about the most beautiful man on earth. Both are so natural in their delivery and such is the case here. Cameron Diaz is also a very good actress, why I gave her short shrift is on me, Cameron is fantastic. And then there is Nancy Meyers the director and writer of the film, Meyers knows what women want. We want to be entertained, we want our characters in gorgeous settings, but we want smart dialogue like a 1930s screwball comedy and Meyers always delivers on all counts. I am sorry I waited so long to enjoy \"The Holiday\" but glad I watched this delightful film! Great to see Eli Wallach, (who made it to 98) and was 91 when he played his role, a consummate actor, Bill Macy who played Walter, Beatrice Arthur's husband on \"Maude\" and Shelley Berman (who lived to be 92) all are treated with dignity and not as punchlines. Jack Black was also charming.I recommend this film without reservation. Curl up and bask in it.",
    "121": "I don't know how many times my wife and I have watched this movie over the years, but it's been a lot.1st time watch: (Two love stories in one here.)The first 15-20 minutes might put a guy off. Grin & bear it! It becomes a great movie.Black/Winslet: Opening scene: Kate Winslet wailing (bawling) over her rotten boyfriend's surprise announcement (at their Co. Party earlier), he's getting engaged to another. Save me!But, with her vacation to CA (from England), all that changed. Just loved Kate's natural look & her character. And what about Black. The pudgy son of a bitch is really charming with a pretty cool naivety about him. He needs to take more roles like this.The development of their relationship is much slower. So much so, they don't even venture a kiss until the end. Still well done. Kudos to Meyers.Law/Diaz: The speed of their relationship development is just the opposite of Black's & Winslet's. It's overnight, literally. Cameron & Jude do a great job. It is these two that get the lion's share of the screen time. (On the rebound) Diaz is dominant, wary, often the non-committal one here, but can't help going for the sweet, and great looking Jude Law.Their journey is MUCH fun as well.Jude's kids: Don't know who the young English girls were in this movie, but their so adorable, it's just unreal.The Wallach Bonus: So, Evelyn and I are watching this for the 1st time years ago. Kate's character decides to stop and help a really old man who looks lost. Suddenly I scream to my Wife Evie; \"Holy crap! Do you know who that old guy is? She says no. I declare; \"IT'S TUCO! (ELI WALLACH! FROM THE GOOD, BAD & THE UGLY!\" (We own it on blu ray since it's a fav of mine so Evie has been forced to see it several times.).Suddenly, Evelyn says \"OH MY GOD BOB! YOU'RE RIGHT! Didn't you say he was in his 50s, when he was Tuco in the GB&U back in 1966?Yes! He was.Turns out he was 91 in the Holiday. His character was so great, and added sooo much to this movie. OMG!It's simple, this movie may be a bit mushy starting out, but no modern romance movie holds a candle to 'Holiday'.Nancy Meyers writing was so fresh, so original & delightful, often hilarious, that others in this genre do not hold a candle to her. (Same thing with \"Something's gotta give\"; original / creative / funny WRITING!) Her direction is extremely good as well.Nancy Myers injected fresh, funny, feel-good elements into the (flailing) \"ROMCOM\" genre. And yes; it was badly needed. She's a real talent. Gotta love that lady.We've shown \"Holiday\" to friends (both guys and gals), to our adult kids and their mates; and others. When you get that many rave reviews, from such a diverse set of people, statistically alone, those collective independent corroborations, indicates a winner. (Based on the number of participants who have viewed this film as a 10, that calculates to a 'confidence level' of around 98.5% with less than 3° of freedom, statistically speaking of course:). Hence, objectively speaking, this movie is a 10.It's a blu ray in our collection. Nancy's best. And that's saying a lot since her other works are excellent.Thx.Bob R.",
    "122": "I took a date to see this film and halfway through it she turned to me and said 'This is torture for you, is it not?' I replied 'Yes, especially Cameron Diaz and Kate Winslet trying too hard to be funny and only making me more depressed.' There's a nauseating bit where Diaz's Amanda puts on The Killers' Hot Fuse album and dances her head off to the great band's Mr Brightside while slugging from a bottle of beer. Believe me, the cinema was full and no one was laughing.Oh Yes! The plot. Cameron Diaz (five miles OTT) is Amanda, an American cinema trailer editor with her own business. After dumping her man (Ed Burns) because he slept with his secretary she desires to get away from Los Angeles to a place where there are no males. After chatting on the computer with Iris (Kate Winslet) they agree to swap places for a few weeks or so. After arriving in England, Amanda finds herself falling in love with Iris's brother Graham (Jude Law) and Iris at Amanda's place, bonds with an old screenwriter veteran (the magnificent Eli Wallach) and slowly, SLOWLY falls for film composer and Amanda's work colleague Miles (Jack Black, on autopilot).This is one of those films that tries too hard to make you feel good and warm inside, like the Al Pacino film Frankie and Johnny. Anyone who is a bad egg gets their just deserts and anyone who is a good person triumphs in the end up. Not my cup of tea.However, Cameron Diaz is absolutely beautiful in every scene shes in. And the scene where Iris is telling Miles about her unrequited love for Jasper (Rufus Sewell) while he listens had me in tears of laughter when it reminded me of the scene in Airplane! when Ted Striker is boring the old woman passenger to death about his love for Elaine.If there are any witty scenes in this dross, its when Miles and Iris are in a DVD rental store and Dustin Hoffman has a five second cameo, when you see it you'll smirk. The rest is utter garbage.",
    "123": "So, our two protagonists: Amanda, and Iris are having personal issues in their lives. They switch houses for a while to get away from it all. Nice- charming.The chemistry (Amanda's side) is perfect. Completely perfect. There's also this amazing side plot main plot about Iris making an unusual friend.All in all, its a solid film. There's really just one issue with it: Jack Black. I don't mean to sound harsh- he's great. But his place in this movie is a little... weird?It's also his character. Sometimes its just Jack Black, and other times it's prince charming, drowning in a pit of self pity with Iris, who is doing the same.Nonetheless, 10/10 film. I'd recommend it to anyone who's into romantic comedy, and romance in general.",
    "124": "OKPrevious comments on this film have already said it as well as I can but I really want to save people from wasting time and money and try to persuade them to see something else instead. If you're convinced of this already but you're being dragged along by your girlfriend, stop her, because she'll dislike this movie too.The movie doesn't even live up to its genre. There is no romance in it - any sexual frisson having been replaced by awkward moments badly acted, and there is no comedy in it - just cringey moments delivered by (you guessed it) more bad acting. I could go on about the script being predictable and tired. Indeed most failed movies go back as far as script or storyline calibre; but not as far as the initial premise which, in this case is okay if not a little familiar to Hollywood punters.However the main thing you'll find is you don't care for the plight of the characters because they're badly drawn, do unrealistic things and we see neither enough of their back-story or their relationships developing with each other.I'm a real fan of the cast; top actors such as Law and Winslet, a great comedian in Black and, when well cast, a huge talent in Diaz. I really felt for the actors combined career low-point and hope they will recover. The movie business seems to be driven by money rather than story-telling and in this the movie will no doubt succeed. But there are many examples of strong RomCom scripts so I don't think we should excuse the producers. Meg Ryan or Hugh Grant is practically a seal of approval and then there's Bridget Jones, Forget Paris, If Lucy Fell to name a few.I was laughing in the wrong places, cringing at the (assumed) intended jokes, planning my week in my head during most of it and feeling utterly tortured and cheated out of 2 hours of my life afterwards.Sincerely hoping Meyers doesn't write any more screenplays. Failing that, sincerely hoping no more of Meyers screenplays are made into film. Craig",
    "125": "I can't think of one redeeming feature in this piece of schlock. Except, maybe, that it gave me a chance to get about 30 minutes sleep in a near deserted theater on New Year's Eve day. Apparently we must have missed the word that The Holiday is a total waste. But we had absolutely nothing else to do that afternoon..so we \"snuck\" into the theater under the senior rate. Just a couple of questions I'd like to pose...Does it really snow that much in suburban London? Did I miss a sex scene while I was napping? Does Cameron Diaz have a shape? Do all women wear bras during sex? Would any less than desperate woman, take back Jack Black after getting dumped in a restaurant for another woman? Is the over-acting, comic wannabe, Jack Black, miscast in this disaster movie? Would any sensible person let a total stranger stay alone in their multi-million dollar mansion without even meeting them first? Would you lend your home to someone, travel 6000 miles away and expect to find it in perfect shape when you return? AND..who can I write to to get my money back? So, as you can figure out, I would not recommend this movie to anybody.",
    "126": "Trust me to look deep into a typical chick flick dealing with love and romance, and actually buying into it. The Holiday, starring Cameron Diaz, Kate Winslet, Jude Law and Jack Black, carries itself through via the solid performance of its cast, predominantly eye-candy, save one charismatic Jack in a non-comedic, dramatic role.Being character and issue driven, The Holiday has its characters all suffering from and being out of favour with Love, and from there, begin the story of their struggle and development. Stories of unrequited love, being taken for a ride, doubts about long distance relationships, commitment, and of course, trust. You'll probably feel for the four primary characters, because if you're someone who have even been in a relationship, then you're more than likely to identify with them, at one point or another as they move along the story, dealing with different aspects of love, but ultimately, being afraid of being hurt by Love.I thought Cameron Diaz was back at her ditzy best, being someone unable to feel and connect emotionally, and being cheated upon by her boyfriend played by Edward Burns. Kate Winslet was very believable as someone suffering from unrequited love, and looked ultra vulnerable, pining for her supposed beau portrayed by Rufus Sewell (last seen in Tristan and Isolde). Jude Law doesn't do much except to turn on those charms when needed, while Jack Black was at his element when in the video store, with his character romancing Shannyn Sossamon, who more than faded away after her stint in A Knight's Tale opposite Heath Ledger.Much of the movie managed to unravel itself with quite a number of little surprises, as the trailer did not give away too much besides the fact that two out-of-love girls perform a home exchange during the holiday season, and found more than they bargained for with new opportunities in love. These little surprise elements are like presents being unwrapped during Christmas - you guess what's coming, get strong hints, and finally, while suspecting what the gift is, you'll still be pleasantly surprised at the outcome. Be they plot devices, elements or even characters, there are plenty of moments to warm your heart. I guess \"cute\" never ran out of fashion, not in this genre.What works is the pacing and editing. Running at 2 hours and 15 minutes, it will be rare if you find any moment a bit of a bore. While at the veneer there are tons of issues and problems about romance itself, and the trials and ghosts that each character had to exorcise, beneath the exterior are feel good, hopeful messages, those that you'd more or less expect a close friend to dispense, never mind if they sound cliché or obvious.Date movie, Christmas movie, romance and feel good drama all rolled into one, The Holiday is very much a been there done that trip down memory lane for those experienced, while at the same time giving plenty of hope to those who haven't or are holding out for that special someone. But only if you buy into its message. Feel the love, people, and peace and goodwill toward all men.",
    "127": "Don't we love Christmas movies? E.g. Movies that make us feel fuzzy and feel good inside? This is one such movie. This movie tells parallel stories of two women (Kate Winslet and Cameron Diaz) each both having freshly coming out of heartbroken relationships. Overcome with emotions, they impetuously decide to swap homes across the the globe to getaway and have a holiday. Unexpectedly for them, love and romance ensures. It is refreshing to see a story told from a woman's perspective. We see portrayed very sensitively the various emotions that women feel as they experience events in their life. E.g. The joys and the sorrows, the anguish and the excitement and everything in-between. Women are emotional beings more so than men.Moreover, this film explores the themes of romantic interpersonal relationships, dating and love. It is a movie for young adults who want to watch a movie about romantic love, heartbreak and finding new love. The winds of change is in the air for these heartbroken souls as their destiny of finding love unfolds. What I like about this movie is that universal themes of love and romance are explored in this movie, themes we all desire and can relate to. E.g. We see the flirting glances of budding new love, to dating and getting to know someone, how the guy makes a move and kisses her, how he makes her laugh, to boldly confessing feelings to one another. We also see how the movie explores the idea of long-distance relationships and potential complications that go with that.Also, it is interesting how we form mental pictures of people in our minds based on snap judgements on how they behave or act. Only for the mental picture to reverse and change once we get to know them better. E.g. We may think a guy is hitting on a girl when he is just saying hello. Or how a guy appears to be greeting his girlfriend when he is meeting his sister. This film touches on this play of perceptions.Having watched a few romantic movies, this movie reminds me slightly of the email correspondence in You've Got Mail as the women exchange emails with one another. There is a subtle homage to the film When Harry Met Sally when Cameron Diaz's character meets her love interest (I won't spoil it). The film also features a classic romantic scene where a person realizes the errors of their ways and starts running after their lover filled with passion.All in all, I recommend this as a solid romantic movie with a Christmas theme that will definitely put you into a feel-good romantic mood by the end of it. An enjoyable watch and highly recommended!",
    "128": "My wife and I caught The Holiday (2006) in theaters last night. The plot revolves around two recently single women seeking a vacation to reset their lives. They discover an app for home swaps and decide to exchange houses, embarking on a journey to kickstart their new lives, and surprisingly, it exceeds their expectations.Written and directed by Nancy Meyers (It's Complicated), the film stars Kate Winslet (Titanic), Cameron Diaz (The Mask), Jude Law (Sherlock Holmes), Jack Black (Nacho Libre), and Rufus Sewell (Dark City).The storyline is clever, featuring great settings, unique characters with interesting backstories, and entertaining circumstances. The cast is well-chosen, although Jack Black feels a bit out of place. The rest of the cast is excellent. The film's attire is top-notch, and everyone's outfits are particularly noteworthy. The movie delves into relatable emotions and mental hurdles as characters navigate important life decisions, creating realistic situations with a magical ending.In conclusion, The Holiday is a unique and worthwhile holiday romantic comedy that I strongly recommend. I would give it a score of 7/10 and suggest watching it at least once.",
    "129": "I went to see this film because some of it was filmed near where I live and I wanted to see what my town looked like when airbrushed to within an inch of its life and covered in fake snow. Also because generally I'm as much of a sucker for a rom-com as the next girl.Oh dear. Surely there is only so much twee, fluffy cuteness and cliché that one film can contain - well you'd think so, anyway - but this one goes for the all time record.The cinematic equivalent of eating a half-ton marshmallow sprinkled in artificial sweetener. Had I not been trapped in the middle of a row I would have walked out - very rare for me - as more and more sappy piffle, two-dimensional characters and paint-by-numbers acting were paraded before me.If you are someone who harbours any kind of suspicion that it might be possible to live some fragment of a fulfilling life whilst - dare I say it - single, then please learn from my mistake and do not waste two precious hours of your life on this film. Sticking your fingers down your throat is a cheaper and much more expeditious means of achieving the same effect without having your intelligence insulted.",
    "130": "Amanda in L.A (Cameron Diaz) is an emotionally retarded workaholic who has just kicked her boyfriend (Edward Burns) out for cheating on her with his secretary. Iris (Kate Winslet) in Surrey, England is a writer for a London newspaper and has just been delivered the biggest blow at an office Christmas party when it is announced that the ex-boyfriend (Rufus Sewell) who she is still madly in love with, has become engaged to the woman with whom he cheated on Iris with three years ago. Both women find themselves at an utter loss. Iris mopes about her little cottage, near suicidal, while Amanda desperately wants to prove something to herself and her ex  namely that she can relax, cry, and be happily alone. Amanda's solution? A holiday. She finds a website where people swap houses for 2 weeks and decides that Surrey is the perfect place for a vacation, choosing to swap her L.A mansion for Iris's quaint 'Rosehill Cottage'. In Surrey Amanda meets Iris's handsome, drunkard older brother, Graham (Jude Law) and Iris meets the best friend of Amanda's ex, music composer Miles (Jack Black) and you can most definitely guess the rest.This is an atrocious film. And what makes this film all the worse is the irony of a character called Arthur Abbott (Eli Wallach) who is Amanda's next door neighbor in L.A and fast becomes companion to Iris. What's funny is that Abbott plays a man who was a screen-writer during Tinsletwon's hey-day. Abbott prescribes fantastic classics for Iris to watch and appreciate and in one scene lets out a great long spiel about how awful today's cinema is; specifically that box-office and blockbusters hinder creativity. Was writer/director Nancy Meyers shooting herself in the foot or what!?It's not just that 'The Holiday' is predictable to the point of boredom. Chick-flicks are usually predictable, but that doesn't mean they can't still be good. Take 'Bridget Jones's Diary', for example. Everyone knew that book was based on Jane Austen's 'Pride and Prejudice' and therefore that Bridget wins Mr. Darcy in the end but it's still a bloody good chick-flick, even though the ending, and in fact the entire plot is some 194 years old. The film's plot leaves a lot to be desired. For one, it's not particularly encouraging to women, which is surprising since it was written by a woman (the same woman who wrote 'Something's Gotta Give', no less)  the whole story hinders on this idea that even though Amanda and Iris are both successful working women, they are lacking because they don't have a man in their lives. Amanda's boyfriend cheats on her and instead of rejecting his claims that it was her, who deliberately sabotaged the relationship (forcing him to cheat?) she privately agrees with his claims and unintentionally sets out to try and be the sort of woman he wished she was. No, 'The Holiday's' failure does not solely lie in its plot, a lot of the film's faults have to do with the cast. Cameron Diaz and Kate Winslet, both actresses who have proved in previous films that they do indeed have acting chops, both over-act. Diaz more than Winslet, but the over-acting is completely and utterly cringe-worthy. Honestly, watching Diaz jump around hysterically after punching her boyfriend in the face, I felt nauseous. And what really didn't help matters was the fact that these characters were specifically written by Nancy Meyers with Law, Diaz, Winslet and Black in mind. The result is a mixed caricature of each actor, compiled of previous film roles and media persona's. Cameron Diaz plays the breezy goof-ball slash every man's ideal woman; hints of her from 'There's something about Mary' and 'in her shoes' shine through. Iris seems more inspired by the real-life Winslet, as Iris is self-deprecating and entirely modest. Jude Law's Graham also seems to have been created with a great deal of influence from the actor's real life  as a womanizing drunkard in the beginning, but then becoming a sort of 'fantasy' of what his female fans wish the real Law was, a sexy wounded white knight with demons in his closet who just needs to be saved by a beautiful maiden. Jack Black of course plays the clown, though in this he seems to be going through the motions, and his 'comedy' is hollow for it. This is a really, really awful film. I thought, in the last half hour or so, some tragedy would befall one of the pretty couples: perhaps one of the relationships would be abandoned, or the old man would die. Nope. I won't be spoiling anything for you when I say that there is a happy ending (well, theoretically speaking Lord knows I didn't come out of this film 'happy'). Perhaps the film could have been salvaged with entirely different casting, or if the story was a bit more balanced  though it is meant to be about both women, we mainly follow Diaz & Law, who had the most banal storyline of the two. So, so bad  don't even bother hiring it on DVD when it comes out.",
    "131": "Since seeing this dreadful heap of muck last night as a favour to a young relative I have racked my brains for a reason this garbage was made. Thanks to IMDb I now know why: there are clearly enough utterly and completely stupid people in the world to make it some money. But: shame on all of you IMDb users who have boosted The Holiday right here: shame on you for being lame brained, feckless and dim. This movie is less intelligent than a Lassie movie, and I tell you this: far less entertaining.The word 'money' has also been revolving around my brain, as in this sentence: 'Why did these stars do it? They don't need the money, surely?' What in the name of all that is an actress with the talent of Kate Winslet (who I last saw in Extras, for goodness sake)doing in this dog-muck? And Jude Law also? Their careers deserve a couple of years of freefall after this. And Jack Black? The magnificent tyro of School of Rock? Your cred is in the shredder, baby (Mind you, he did, come to think of it, at times look embarrassed, so perhaps there is hope for him after all). Did someone threaten to kill their parents or children if they didn't do it? It must be that or something like that: there is no other rational explanation.I was in physical pain whilst watching it in Chesterfield last evening. If the extraordinary cynicism of its religious adherence to every immoral and unethical strand of formula-Hollywood drek in here isn't bad enough: if the fact that the script that could have been written by a 12 year old dewy-eyed girl weaned and educated on every piece of schlock Disney every produced, or some kind of parodist with nothing better to do, but was apparently written by an adult isn't bad enough; if the torrent of clichés isn't bad enough - including the intensely vomit-inducing, utterly laughable inclusion of olde-tyme Golden Age of Hollywood writer winning a lifetime achievement award scene - AND CAN I TELL ANY American READING THIS THAT IT HASN'T SNOWED IN THE COUNTY OF SURREY BEFORE AND AROUND Christmas FOR ABOUT 40 YEARS?; if the complete lack of verisimilitude to real life, like the fact that women of thirty-odd don't make love in bra-tops, isn't bad enough; if the fact that Jude Law's character begins as a woman-a-night beer-slugging rogue then by half way becomes a winsomely sincere widowed single Dad who adores his two girls (and one is called 'Miffy' in real life: for God's sake, what next?!)isn't bad enough; if the fact that Cameron Diaz's 'performance' was the most embarrassing I've ever seen isn't bad enough; if the woolly mammoth-esquire touch of the miserable, shoddy direction isn't bad enough; if the fact that the studio thinks this pathetic nonsense is so good they let it stretch on for over two hours isn't bad enough, then the fact that these film-makers actually gave this evil monster of a movie pretensions to intelligence and relationship-profundity most certainly is.I was going to say that The Holiday is an insult to anyone who ever went to school and earned a single GCSE pass or a 25-metre swimming certificate, until I logged on here and found that people presumably over the age of 12 actually liked it. Tell me again: you actually liked this film? And to pass off Cary Grant as coming from Surrey - \"I know!\" pipes Kate, ecstatically when the old geezer tells her this - is mind-numbing is what is tells us about the attitude of studio producers (and for good measure, this director and screenplay writer)to all of us: factual accuracy in movies: \"Forget it, it doesn't matter, because you numbskulls, chuckleheads, mimbos and bimbos chewing popcorn and sucking down Coke won't notice and don't matter.\" For the record, just in case no-one else has mentioned it in this review section - and do forgive me for not reading every single one because to me, suicide is immoral - Cary Grant was brought up (or 'raised' for you USA'ers) in Bristol, which is a port in Gloucestershire, which is in the west of England and therefore, nowhere near bloody Surrey.So The Holiday takes its place in my pantheon of the absolute and utter crap where it joins Orlando, The Piano and Cronenberg's Crash. It makes for a very strange bedfellow. I suppose this proves that if there's one thing worse than a supposedly intelligent art-house movie that stinks the place out from sheer badness and pretentiousness, it's a movie which by all that is sacred should be presented as being as dumb as it looks and which doesn't so much insult the intelligence and good nature of the audience as trample up and down on it with hobnail boots with sharp nails sticking out of the sole, pointy end down. I came home, switched on the TV and watched an hour of House. All, thankfully, is not lost. Yet.PS Since more and more people have logged on to the website to sing the praises - supposedly - of this film, I have become completely convinced that all of them, especially the one's saying, 'Phew, thank Heaven for romance', are kidding. No one intelligent enough to press the 'On' button on a computer can possibly like this movie: it is, simply, the worst movie ever made.",
    "132": "Screenwriter/director Nancy Meyers continues to defy all romantic comedy conventions by doing a few things that are often missed by screenwriters of the genre. Instead of focusing on incredulous romances and meet-cutes, Meyers is quick to focus on the characters involved in these on-screen relationships, developing them by closely following their mannerisms before they become involved in the film's core romances. Secondly, she places emphasis on the dialog of the characters while they are in these relationships, rather than their actions, and even if circumstantial incredulity comes into play, you almost miss it because Meyers crafts such likable on-screen presences that it isn't so blatantly obvious that they are saying and doing things that are a bit too playful with narrative conveniences. Finally, the emphasis on conversation and character relationships helps Meyers naturally include humor and wittiness to a screenplay that would otherwise try too hard to be funny or relevant.The end result is The Holiday, a very natural romantic comedy, with a quartet of strong performers and a story that takes its time to build over the course of two hours. Interestingly enough, most romantic comedies exhaust themselves past the one-hundred minute mark, but The Holiday defies convention by taking a liberal amount of time to illustrate two brewing romances on opposite sides of the world that all began because of adventurous feelings by two introverts.The film opens by introducing two characters, Iris Simpkins (Kate Winslet), a column editor for a newspaper in London and Amanda Woods (Cameron Diaz), a movie trailer producer in Los Angeles. Iris has been in love with her coworker Jasper Bloom (Rufus Sewell) for over three years, despite him cheating on her when they were dating and that her love has gone unrequited. Iris winds up becoming more upset when she learns Jasper is engaged and she, well into her thirties, is still single. Amanda, however, has been a workaholic since the startup of her company, and the result has taken a toll on her live-in boyfriend (Edward Burns), who packs up and moves out after he reveals she has been cheating on her.Both women are in need of a vacation, and upon discovering one another on a chat-room, they agree to a \"house swap,\" where Iris will go live in Amanda's spacious, Los Angeles mansion and Amanda will live in Iris' small London cottage over the course of the holiday season. During her stay in Los Angeles, Iris meets an elderly man named Arthur Abbott (Eli Wallach), who was once a screenwriter during the Golden Age of Hollywood, in addition to Miles (Jack Black), a charming employee of Amanda's who has an obsession with films scores. Meanwhile in London, after initially slugging away at wine and holiday snacks, a drunk Amanda winds up meeting Iris' brother Graham (Jude Law) when he, also drunk, knocks on her door one night expecting Iris. The two commit to having a one-night stand, but when they realize their dynamic and chemistry is something neither of them can deny, the morning after becomes that much more complicated, especially when Graham allows Amanda to meet his kids.The Holiday ostensibly sets itself up for immediate failure by focusing on two separate romances. That narrative structure is a constant problem with romance films because they struggle in trying to humanize and develop both relationships under a reasonable amount of time. For Meyers, time never seems to be a factor; she starts liberally, by revealing more about the characters through their mannerisms and their choices rather than by with whom they interact before inviting the love-interest into the picture. By including characters like Amanda's ex-boyfriend and Wallach's ex-screenwriter character, Meyers also shows that she has more on her mind than simply cranking out a dime-a-dozen love story. She wants to populate a film with characters that simultaneously mean something and fill a film with a great deal of entertainment value.The result is a film that's breezily paced, but never fluffed, remarkably charming, but never saccharine, and humbly emotional, and never manipulative. This is largely thanks to Meyers' screen writing, but also thanks to the talented cast of performers, specifically Winslet and Black who are trying to break out of their own character archetypes throughout the entire film. Consider Winslet's character, who could easily be a faceless, mopey spinster. Instead, Winslet is a deeply sympathetic character because she's not dysfunctional nor is she a comical trainwreck. Consider the scene where Iris is beside herself, talking with Miles about the perils and the unrelenting sadness of unrequited love and it how strips not just a piece, but several pieces, from your ability to love, trust, and sympathize with people. It's a truly sad monologue that Meyers wisely doesn't choose to milk for tears, but rather, pure, unadulterated honesty.Meanwhile, Black gives a performance that is perhaps his most delightful mixed of controlled chaos yet. While he is more restrained and casual here, his zealous, roly-poly tendencies sneak in on various occasions, particularly the video store scene where he brilliant recites harmonies and melodies of film scores. Cameron Diaz and Jude Law serve as the more predictable couple, though that's not a bad thing, for they are the narrative anchor that keeps the film from taking off into another world. You're bound to have a preferred couple watching The Holiday, and for me, the insights and the consistent charm of both Winslet and Black's characters was an instant winner for me.With all that in mind, The Holiday works as a very lovable piece of entertainment, and furthers Nancy Meyers' status as one of the smartest female directors working in the business today. Her careful craft when it comes to assembling a romantic comedy is shown with every character in the film, and rather than cluttering Holiday with useless caricatures or sticking to a basic love quartet, she surprises on multiple levels, effectively giving most audience members more than they expected.",
    "133": "Writer/director Nancy Meyers (What Women Want, Something's Gotta Give) obviously knows how to make movies for her female target audience. The trailer pretty much explains the plot: Amanda (Cameron Diaz) and Iris (Kate Winslet) swap homes over the holidays to get over their heartbreaks and end up in complicated situations, involving men of course, in their adopted getaways.Amanda has the amazing bod, wardrobe, dream home plus a fantastic job as a movie trailer maker, but suffers from a cheating boyfriend (Ed Burns). She meets Graham (Jude Law), a fiercely attractive and mysterious book editor. It's refreshing to see Law play a sensitive non-cad, for once; he is still incredibly charming. Sweet and thoughtful Iris works in publishing as well, but her kindness is abused by her ever ineligible ex (Rufus Sewell). She meets Miles (the always-fun Jack Black), who is also in the creative business, doing musical scores for films.The characters are all flawed, highly relatable and likable. Even the supporting cast and cameos are all welcome additions and don't appear as afterthoughts. The scenarios, despite the obvious tragedies, make you very willing to escape to this world for 2.5 hours, inordinately long for this genre.Ladies, watch this wonderful chick-flick with your closest amigas; men, see it for educational purposes. Anti-romcom (romantic comedy)? Go see it anyway for the pretty good soundtrack furnished by Imogen Heap, The Killers and Jet. Have a cup of steaming hot chocolate with you, for the full effect.",
    "134": "The Holiday tells the story of two women named Iris(Kate Winslet from Titanic)and Amanda(Cameron Diaz from Charlie Angels) are sick of there lives they decide to swap homes for 2 weeks. Iris goes to LA while Amanda goes to England. Along the way the two girls meet two different men one is called Graham(Jude Law the guy from Alfie)and Miles (Jack Black from Tropic Thunder)who is music composer.The film is suppose to be an American version of Tara Road that starred that one from Four Weddings & a Funneral with Hugh Grant(you know she used to be in a L'oreal Paris Ad yeah her)only it features 4 A-listers Cameron Diaz,Kate Winslet,Jude Law and Jack Black.If you are in the mood for a Christmas romantic comedy or if you like the actors that are in it then check it out.I actually found it OK a bit dull from time to time but still it was OK.",
    "135": "This movie sets the standard for house swap movies which have been popping up one or two every year on TV movies. Of course a lot of that is a first rate cast and quality in pretty much all aspects.The story has a predictable outcome and not really any surprises, but it's still a great story. The Arthur sub-plot makes it a little more than purely a rom/com giving the movie something sentimental. There is also plenty to laugh at.The leads in the two couples all have chemistry with their opposites. Joe Black and Cameron Diaz lend some of their usual craziness and even Kate Winslet gets into that a bit. Winslet manages to make Iris both pathetic and endearing. The two little girls are totally adorable.The movie is pretty \"clean\" even though the implied repeated shagging by Amanda and Graham probably means that the movie won't show up on the Hallmark channel at least for a few years yet.",
    "136": "The Holiday (2006) -I really liked this film. I had previously watched a made for TV film called 'Trading Christmas' (2010) that was very similar and enjoyed that, but I'd been reluctant to watch this one, despite being released earlier, feeling that the big stars might outshine the story and I'd never really been a Kate Winslet or Jack Black fan.However, when I finally did get to this one I found it incredibly entertaining and full of great moments, jokes and romantic loveliness, all wrapped up in a big Christmas bow.I also found Jack Black, playing the role of Miles, quite charming and more than a little bit amusing, which was a nice surprise. I particularly enjoyed his descriptions and quirky renditions of the greatest film soundtracks.Kate on the other hand, I have only recently come to appreciate in films like 'Steve Jobs' (2015), 'The Dressmaker' (2015) and the 'Divergent' (2014-5) series (It was obviously a good year for her) and I still found her a bit awkward in this film as Iris. Almost as awkward as the weird dance that she did with her onscreen brother Jude Law right at the end of the film. Look out for it, it's proper cringe.Jude, on another hand entirely, was absolutely adorable though and it was hard not to fall head over heels in love with his character Graham (Gram if you're American) for having the whole package (Except perhaps dancing abilities). He could turn up and threaten to p!ss on my doorstep whenever he wanted.I enjoyed the relationships that developed between them all, but the connection I appreciated the most was the one that Iris formed with her house-swap-mates neighbour, Arthur. A performance superbly delivered by Eli Wallach, mostly because Eli will always be a legend and was the epitome of the dear old man in this film, but with an extra interest about him too.One of the other bits I liked was the narration that went with Cameron Diaz' ups and downs throughout the film. As the character Amanda she played a film trailer producer, so that fun element really worked for her specifically and added a touch of something different too.My only criticism would be that the characters in this one weren't people that work at the local supermarket or fast food restaurant, none of them had ever even seen a job centre and had never really struggled much in life, although they had of course all seen their share of losses and break ups. It's a typical thing in a lot of these British films, especially the Richard Curtis ones and alike 'Four Weddings And A Funeral' (1994), 'Love Actually' (2003), 'Bridget Jones' (2001) and so on. And it is regularly a feature with the made for TV specials too.I found it a little bit hard to feel sorry for Jude with his nice house, great job, Etc, when my monthly payments from the government don't really cover the cost of food and the job centre can't or won't help me develop my career to actually become one of these successful people, but I may have digressed a tad.The film also features some kids who were a bit like artificial sweeteners, full of saccharine and they might have rotted your teeth or given you cancer if you had too much contact with them, but in a lot of ways they were very cute too.It was a film that showed what we all hope will happen when we swap our houses or use Airbnb, but I certainly have never been lucky enough to experience. However, this film always gives me hope that it might happen one day and that's what made it great.879.79/1000.",
    "137": "Despite being another 'rom-com', I got the feeling The Holiday didn't need to go down such a route in order to prove itself. It's a typical, all star cast, character relations drama that relies on easy humour thanks mainly to the fact Jack Black is in it but also allows a group of four characters in two different countries to bond in a satisfactory and sometimes meaningful manner. What The Holiday does to try and draw you in is that it sets up two women called Amanda (Diaz) and Iris (Winslet) in two very different situations. One is just coming out of a relationship after their boyfriend Ethan (An unfortunately underused Edward Burns) had an affair with his secretary and the other is coming to terms with a long time love, who never quite returned the same feelings, that is getting married - one woman is American and the other is British; so this gives at least the ladies of the audience two people to latch onto and relate to; pick your situation that you might have found yourself in and let it enthral you. For me, I related to Iris more but for reasons more to do with the fact I found her to be far more tolerable than Amanda.Regarding what I said in the opening paragraph, I feel the film didn't need to use some of the humour it did. I respect the fact that Amanda is working in the film trailer business but to have her life's situation narrated to her and more frustratingly; to us, on more than one occasion was tiresome and just stuck out in what was otherwise quite a charming and funny film. Twinned with this, most of the humour that revolved around Amanda wasn't that good and just felt gimmicky. These also include things like the whole 'trying to cry' scenario and the 'funny' online conversation she has with Iris, especially the way she gushes at the fact there are 'zilch' men in and around the area she lives yet contradicts herself a few hours into the visit. Onto the men of the film and Jude Law's Graham and Jack Black's Miles provide the intended laughs and love interest. Needless to say; both do well as both are so different when compared to one another and of course since we know them as actors, both have done very different films in the past to one another. Graham's introduction comes first and basically consists of him stumbling into a male wet dream. He knocks on the door expecting to see his sister let him stay the night after some heavy drinking but instead finds a blonde American woman who asks him to bed within about five minutes. So there he is: in a remote English cottage with heavy snowfall outside and all around him whilst a girl he barely knows comes onto him  although a complete contradiction of what we thought Amanda's character was, it still acted as a humorous introduction to Graham's character and he handled the situation well.What scrap of extreme credibility The Holiday does have comes in the form of Arthur; played by Eli Wallach, an old film writer from the classical Hollywood period. He not only acts as the anchor in terms of respectability but also manages to analyse the film as it happens. 'You're the star', he tells Iris regarding her lost love situation and I had to agree since Amanda was becoming too much of a cartoon. Each woman's story is cut back and forth to in a very pleasing and satisfying manner, not to mention well paced as certain events and twists become apparent. Iris' friendship with Arthur and Miles' own heartache as even they grow closer works well since we are lead to care for these people prior to the final third through good film-making. Even tiny things such as the scene involving Amanda, Graham and the 'other person at Graham's house' work well and are highly effective since it's near the end and we care.Although not normally one to recommend nor commend films like this, I found The Holiday rather enjoyable even if it had a few things I didn't like but it's possible to ignore these things as other themes and conventions work with other character to create something much more memorable.",
    "138": "Amanda is a movie trailer editor in LA.Iris is a society column editor for The Daily Telegraph in London.Amanda finds out that her boyfriend Ethan is cheating on her.Iris' on-off boyfriend Jasper announces his engagement at the office Christmas party.To make the long story short, Amanda comes to stay at Iris' home at the countryside in Surrey, and vice versa.Amanda finds Iris' brother Graham attractive.Iris finds her soul mate in movie composer Miles.The Holiday (2006) is a romantic comedy directed by Nancy Meyers.Cameron Diaz does great job as Amanda Woods.Kate Winslet is amazing as Iris Simpkins.Jude Law is terrific as Graham Simpkins.Jack Black gives a rather funny performance as Miles Dumont.Eli Wallach is brilliant as Amanda's aging screenwriter neighbor Arthur Abbott.Shannyn Sossamon is very good as Miles' girlfriend Maggie.Edward Burns is great as Ethan Ebbers.And so is Rufus Sewell as Jasper Bloom.You can see veteran stars like Bill Macy playing Ernie and Shelley Berman playing Norman.Kathryn Hahn is Bristol.John Krasinski plays Ben.Dustin Hoffman gives a cameo at the video rental store, while Black talks about The Graduate.There's pretty much what I liked about this movie.The chemistry thing works between the main stars.But I must say above all was Eli Wallach and his performance.Just look at this over 90- year old gentleman giving a speech at the auditorium.Reminds me of his lifetime achievement award he's going to receive at the Oscars next month.Way to go, Eli! The Holiday is a feel-good movie, that I recommend.",
    "139": "One of the most abused genres of commercial cinema, romantic comedies invariably end up looking all the same, and for a very simple reason: they follow old formulas as if they were enshrined in already dusty primers, leaving aside any and all opportunities for change or originality. It's always the poster couple meeting, falling in love, breaking up, and getting back together again at the end. What changes are the actors and the sets, and not much else. This time, the situation is not much different. What serves to attract - and justify - the attention of the most unsuspecting spectator is the talent of the protagonists, all of whom are very comfortable in the scene, seeming to be enjoying themselves as much as the characters they strive to defend. The result, therefore, turns out to be a little above average.The plot tells the story of two women who, after a decision, will have their lives transformed. Iris Simpkins (Kate Winslet) writes a well-known marriage column in London's Daily Telegraph. She is in love with Jasper (Rufus Sewell), from her work, but soon finds out that he is about to marry someone else. In Los Angeles, we meet Amanda Woods (Cameron Diaz), owner of a thriving advertising agency specializing in the production of movie trailers. After discovering that her boyfriend Ethan (Edward Burns) has not been faithful, Amanda finds a website specializing in home exchange. Seeing an opportunity to go far away to forget her love problems, she and Iris get in touch and arrange to exchange their homes, with Iris going to Amanda's luxurious home, and Amanda going to Iris's cabin in the English countryside. Soon the change will reflect in the love life of both. Iris meets a neighbor, Arthur Abbott (Eli Wallach), a man who was a very important screenwriter in Hollywood, and a composer of soundtracks, Miles (Jack Black), who is involved in a relationship destined to fail and who will be interested in Iris. Amanda becomes involved with Graham (Jude Law), Iris' brother.With this third feature, Nancy Meyers matures an issue already explored in \"What Women Want\" and \"Something's Gotta Give\": the lack of love in the lives of women well resolved in their professional lives. This search can often be synonymous with dependence, with contradictory and subjugating postures, as the meeting of the \"ideal\" pair is configured as a true salvation. By making this dependence visible and caricatured, she exposes a dilemma that, if it does not cover most women, at least touches on some of the questions experienced and thought by the person who writes to you: why do we put so much energy into a romantic ideal of happiness in which love is the main source? And, that's quite a dilemma: accepting the role of love in a woman's life, being one of several things to be conquered.What could be a kind of anti-feminism - why do these strong and productive women need a man so much? - points to a very interesting dilemma, if seen from another perspective. After all, if a woman only feels complete when next to a man it can be a sign of deplorable submission, the fact is that, despite so many achievements, women are still immersed in a deep romanticism - in fact strongly influenced by Hollywood films. Of course, in principle, there is already a caveat: which women and what kind of experience are we talking about? It is not a rule, it is not a question of considering that we will only have existence in front of the man who loves us, but of identifying a romantic ideal, very influenced by cinema, that surrounds our imagination. But, if this is certainly an extremely relative topic, if we stick to Nancy Meyers' women, they are totally consumed by the preoccupation with love and what it has in store for the cinema.Right at the beginning of the feature, you can see the style of Nancy Meyers for those who already know some other work by the director. The way to conduct the comedy in a more \"mature\" way is an asset that she demonstrates again in this film. In this way, the story ends up becoming closer to real life and more attractive to the viewer. Iris and Amanda show themselves, albeit in a somewhat exaggerated way, perfectly plausible characters to exist and, so to speak, charismatic. The dialogues of the feature also form a point to be commented, with good lines about love, although sometimes they can seem a little sugary for the less sentimental audience.The cast, formed by actors with a certain support, seems perfectly synchronized and with a chemistry that seems to work very well. In the role of Amanda, we have Cameron Diaz, who demonstrates to be comfortable in the character. Kate Winslet, more beautiful than ever, lives the passionate Iris, without falling into a stereotype. Jude Law, who has proven himself to be one of the most talented actors of his generation, proves again his versatility by playing Iris' sensitive brother Graham, who is torn between the tasks of a widowed father and a single man, and Jack Black completes the group of protagonists like Miles, a composer of soundtracks who also experiences some love conflicts in particular. The real surprise is when the charming girls Sophie (Miffy Englefield) and Olivia (Emma Pritchard) enter the scene, starring with Graham and Amanda in fun, sensitive and touching scenes, with special emphasis on the scene in which everyone is gathered under the tent set up in the girl's room.Nancy Meyers vaguely shows differences in the way of life, and at first she in fact shows well the fascination of Iris when she arrived at the mansion in the United States, living with all that technology and comfort that she now had at her disposal, while Amanda who has to brew her own coffee, and squeeze into Iris's little cabin. Evidently the film shows the differences in location and creates good moments. The parallel montage of the two women in their temporary homes helps the film's pacing, making the pacing never slow. And even showing the cultural and purchasing power differences between the two, Meyers prefers to bet on the similarity between the two from the beginning: having broken hearts, the two seek and find each other.Aside from this influence of cinema as a symbolic-psychological correlate, Meyers is well aware of the codes that govern a romantic comedy. Therefore, Hans Zimmer's soundtrack is fundamental, and the direction is very attentive to the exchange of looks as a crucial point of romantic comedies (also exposed by screenwriter Arthur), that moment when two strangers find themselves in love. Here the great work with the actors is latent, with the exception of Cameron Diaz (who doesn't give nuances to his somewhat neurotic character), perform this exchange of glances in a wonderful way. The dialogues are also accurate in the portrayal of love mishaps, in addition to being often funny, such as the caricature scene of the two women crying (which seems to come with the rubric \"Dedicated to women\").The metalanguage is also present in the film through the character of Jack Black and the veteran Eli Wallach, who plays a former Hollywood screenwriter. In several scenes where they are present, they make reference to great titles of the present and past. The artifice used with the character of Cameron Diaz also becomes something quite interesting: since Amanda is a film trailer producer, we constantly hear that classic voice that narrates the trailers talking about the situations that the character is living. This approach is very interesting.The clichés and idealizations abound, of course, but without them the romantic comedy would lose its raison d'etre. Narratives about love always bring a bit of chance and the cinematic magic of the encounter. After all, who hasn't dreamed of the arrival of their great love entering a bar in a totally cinematic way? Or a hit-and-run that would reveal your ideal match? Or a camera panning around the couple on their first kiss? As a female-centric director, Nancy Meyers, like her or not, once again portrays these women who, despite all their achievements, place enormous importance on love.",
    "140": "\"The Holiday\" (as the name implies) is that unique animal: the holiday film. You know, the one that comes out a few weeks before Christmas, intended to counter program against all of the serious (read \"depressing\") Oscar contenders. The one that takes not an ounce of concentration to follow, that goes down as smoothly as a cup of hot chocolate, and is as quickly forgotten.Well, there's a time and place for movies like that, and if December isn't exactly that time and place, I don't know where or when is. All I know is that my wife and I ended up at this on opening weekend because our other two choices for new movies were \"Apocalypto\" and \"Blood Diamond.\" 'Nuf said.As for the movie? Oh, what's the point. It's too long, the pacing is all over the place, it has some good moments and a lot of flat ones. But the cast is gorgeous, the settings are fun, the conclusion is warm and fuzzy. I could be a Scrooge and say \"bah humbug\" to the whole thing, or I could just sit back and enjoy it for what it is, which is what I did.And let's face it -- no movie with Kate Winslet, a superb actress who makes anything she's in better by virtue of her sheer talent alone -- can be entirely bad (well, except for maybe \"Titanic.\") Grade: B",
    "141": "The Holiday caught me in the right mood, right time and I loved it. Fully embracing my inner chick-flick I savoured the romance, the gorgeous scenery, the hugely entertaining supporting cast and even the wardrobe -Cameron Diaz wears some great coats here. Why I noticed this I'm not sure, I don't usually, it might have been the wine. Anyways the movie is also pretty funny, and while somewhat predictable I still found myself all caught up in the assorted story lines.This is along the lines of 'Love Actually' or 'Brigitte Jones Diary', with an ensemble cast telling the story of an American (Cameron Diaz) and a Brit (Kate Winslet) who swap houses after their love lives go awry and they decide they need a change of scenery. Diaz finds herself in an idyllic British cottage but quite out of element in the snow and solitude and wants to leave almost immediately, until she meets and hooks up with the absolutely charming (yet mysterious) Jude Law. Law is gorgeous both in character and looks here, he's hard not to fall for.Meanwhile Winslet is living it up in sunny LA where she hits it off with an elderly neighbour played by Eli Wallach -honestly this may have been my favourite storyline going. She also meets Jack Black who was a bit of a surprise in the romantic leading man role but he plays it straight for the most part and it works. The story focus more on Diaz and Law than Kate and Jack and yes it gets all wrapped up quick and tidy for the HEA, but its also totally enjoyable and even a bit magical if you can catch this in the right mood. 12/25",
    "142": "Multiple stories in one movie: Christmas time, completely different locales, people desperately trying to make sense of the tragic loves and mistakes in their lives, and finding new loves and adventures... and having just a wee bit of PG-13 sex (the always-missing spice in Hallmark movies).So an English country-girl woman finding herself in an L. A. mansion, and a SoCal exotic woman finally finding herself in an Olde England town (surrey), complete with a handsome widower and two charming moppets.And the English girl draws a curmudgeonly Hollywood icon (\"Tuco\") out of his shell and finding a new love, to boot.What's not to like about this movie? I give it an 8.5, but IMDB only allows (apparently) even integers.",
    "143": "I could write volumes on what is wrong with this movie. However, for the sake of brevity, I will keep it to this: 1.) Cameron Diaz is the personification of nails on a chalkboard in this movie.2.) The musical score (if it should even be called that) is pathetic, cloying and wantonly manipulative, which really could describe most of the movie in general, too.3.) Those who can act are given such tripe for dialogue that I was embarrassed for them--painfully so: I had to literally pull my coat over my eyes during the worst scenes.And last but perhaps most telling:4.) This film brought tears of sadness to the eyes of some one who saw it with me. We thought this film would be MERELY lame or predictable. However, it was BAD. Not even \"good bad\". Rarely is such a predictable movie so unpredictably this bad.",
    "144": "The Holiday is a sad excuse for a romantic comedy, with very little romance and even less comedy.The main plot of the movie revolves around Kate Winslet and Cameron Diaz's characters switching homes for the holiday, allowing each to meet their obvious love interests. The predictable plot would be far less painful if the actresses were given something to work with in the script. Sadly, the dialog is clunky and without wit, and while Winslett struggles to rise above the material, Diaz flounders. By the middle of the movie, her scenes are painful to watch, and one can only hope that the scene switches back to Winslet's character, whose scenes with the elderly screenwriter are genuine and sweet.The men exist only as romantic foils, and Jude Law plays this part well, managing to exude some charm and playing believably off of Diaz, despite their lack of chemistry. Jack Black, on the other hand, probably shouldn't have even bothered with this movie at all. His comedic lines are generally unfunny, and as a romantic partner, he is given essentially nothing to do. If you were hoping to see Jack Black branch out as a romantic lead, don't bother with The Holiday.In the end, The Holiday doesn't earn the title of romantic comedy, and ends up being another piece of cliché chick flick fluff. Lovers of the genre would be better off renting Love Actually, French Kiss, or His Girl Friday for their holiday entertainment.",
    "145": "THE HOLIDAY 2006 (KATE WINSLET, CAMERON DIAZ, JUDE LAW, JACK BLACK) DIRECTED BY: NANCY MEYERS ~ THE RUNDOWN: Nancy Meyers asked Santa for something special, instead he left the moron a pre-packaged cheese fest chocked full of enough sentiment to fill a baseball field. ~ Okay, just as a warning to like the four people who are actually going to read this review, it's a bit complicated, because within it, I'm not only going to try and sort out the mess that is this sickeningly bad romantic comedy, but also define 'Chick Flick' along the way. ~ First off, I might as well state the obvious - this movie was unnecessarily long, including some random subplot about an old man that Meyers apparently threw in there just to be a bitch, or maybe to just give all the idiots in the theatre something extra to cry about towards the end. I really don't know. Secondly, this is listed on IMDb.com as a comedy, yet the most that came out of me was a muffled chuckle at the hands of Hoffman's cameo in Blockbuster. And this fact that I didn't laugh was not my fault; I know what's funny...this isn't. If you are a man who saw this and laughed more than twice you were A) High on a bad dose of Holiday Cheer B) Drunk off of Egg Nog and whiskey, or C) Held at gunpoint. Simple as that. Thirdly, DIE CAMERON DIAZ!!! My God, she's not even hot anymore! Her face has turned as disgusting as her acting, which, by looking at her resume, has gone nowhere...unlike the careers of Jude Law (filling in for Hugh Grant's day off) and Kate Winslet which immediately took dives on the day this came out. Jack Black, on the other hand, was good, and served as the only charming thing about this movie, making up for his mediocre looks and going with the whole \"I'm full of energy\" thing again. ~ Often, this movie somehow manages to waiver in and out of Chick Flick territory instead of just staying there the whole time. It is, afterall, well shot, and its messages about love are true and relate to just about everyone. Yet, by the end, it had taken too many trips to this Chick Flick Land and ended up getting trapped there. But, what exactly constitutes a 'chick flick'? Well, I've put much thought into the matter and I've concluded that it's simply a term used to describe movies that are stupid - movies plagued by implausible, clichéd scripts usually founded upon the stereotypical viewpoint of relationships. Chick Flicks seem to, most of the time, fall into the Romantic Comedy genre, but can go elsewhere and can really be about anything, as long as they're composed of stupidity and made for the purpose of cute but ridiculous entertainment. Now, I'm really not sexist at all, and I don't believe women are somehow naturally prone to like stupid movies, especially since both women and men seem to agree on the all-time greats like The Godfather and The Shawshank Redemption. So, although the name is a fallacy, it seems women have been conditioned to prefer these films...but that's for you to think about because this is a movie review and not a lecture. My point, I guess, is that The Holiday is indeed a chick flick, basically saying its a predictable, extremely clichéd, sickeningly sentimental excursion about love created to entertain people that simply haven't seen enough good movies. ~~ NEXT REVIEW: 'BLACK XMAS'",
    "146": "I am a sucker for romantic comedies. I have always enjoyed watching them, no matter how cliché-ridden or awful they are. So when The Holiday was announced, I was immediately intrigued. Kate Winslet and Jack Black in a romantic comedy? Cameron Diaz doing a comedy that looked mature, and not raunchy or animated? It spoke to me as something that could have been different. And while it partially was, it still was inherently just as clichéd as romantic comedies always have been.Amanda (Diaz) and Iris (Winslet) are alone for the holidays. Having just gotten over some devastating news regarding the men in their lives, they meet by chance on an online house swapping website. The two instantly bond, and decide to swap their homes, despite Amanda living in Los Angeles and Iris living outside of London. And despite going on vacations to stay away from love, they end up developing romantic relationships anyway.Even without mentioning the Jude Law or Black in the synopsis, I am absolutely certain everyone can tell what is to come when they begin watching the movie. It is very much in tune with being a romantic comedy, and only vaguely pretends to not be at certain points. For some odd reason however, it runs over two hours. It easily could get chopped down a bit (leaving out a lot of the idiosyncratic tendencies of the two women), and would feel a bit tighter than it is (although I did enjoy the little trailer moments that show up from time to time).The story, as ridiculous as the set-up sounds, is sweet and packs in a few really great character moments. Unfortunately, it also adds in a lot of subplots that seem a little random. The entire friendship between Iris and the elderly screenwriter Arthur (Eli Wallach) feels more like filler than anything else. Hell, it does not even make for the entire reason she and Black's character Miles meet in the first place. So as tender and poignant some of the moments between Iris and Arthur are, they feel a bit out of place for what is supposed to be the main focus of her plot line (as convoluted as it is).But even with its problems, Winslet delivers a fine performance. Switching between being totally depressed and as happy as can be, she brings a certain authenticity to her role that is usually completely non-existent in female rom-com leads. Coming from a background of fairly dramatic roles, she truly blossoms as the haplessly confused Iris. The majority of genuine character moments are given by her, and the real likability of the film rests solely with her. I was really absorbed by her moments on screen, and I could only wish that she would make more movies like this (or was the main character in the story).Sadly, the lead is Diaz, and she fares quite badly. Until her and Law's characters are developed beyond the limits of what the trailer shows, she is basically playing a caricature of herself. Not showing any depth or wanton desire to excel in any of these early moments, Diaz just kind of wanders around, seemingly acting as if she was living her day-to-day life. Now, I know I do not know Ms. Diaz personally, but from anything anyone has ever read, seen or heard about her, this would probably be a spot-on re-enactment. Could it be that this role was written so well and so close to Diaz that it is easy to see no difference between her and the character she is playing? Maybe. But if your likability starts off low, I cannot imagine that is the intended reaction.When she finally does come out of her shell and begin to at least look like she is acting, she still does not hold a candle to Winslet. She just does not seem nearly as strong, and is overshadowed in every way by her. Yes, she does give a few intentional laughs and acts adequately, but when paired off against someone with such a more unique and eloquent thespian style, one can truly see how mismatched and ordinary her acting talent is. It is not that she is a bad actor, she just does not seem to have what it takes to overcome the pitfalls of a role like this. If she does not begin picking up soon, I can only imagine that this is going to be the standard film she will be acting in exclusively (like her Charlie's Angels pal Drew Barrymore).The guys fare about the same. Law seems a bit confused for much of the film, not giving his usual intense and charismatic all for this character. Like Diaz, he does rise to the occasion a handful of times, but he just does not seem to be all there. He is the most enigmatic of all of the characters, and it shows in how loose and unconcerned his character is most of the time. Black on the other hand, delivers in spades. I was impressed with his astonishing range in King Kong, and again, he does not disappoint here. He clearly does not have to grasp as far, but his usual zaniness is curbed to a minimum, and it allows for him to really pull off a good performance. This is the stuff of a guy who does not just want to be known just as a bizarre joker.Small turns from Edward Burns and Rufus Sewell come off as a bit forced (especially Sewell), but they add a bit of depth to the movie that is usually missing. Wallach, as random as his plot line is, does great for the limited role that he has.It may not be a monumentally original achievement, but The Holiday is an enjoyable romantic comedy. It is better than most, and is great for a light laugh or two.7/10.",
    "147": "The Holiday is an entertaining romantic comedy. It's about four affluent thirtysomethings who have been unlucky in love. The characters are charming and likable. It could have been made in the 1930s but the best comedies in those days had sharper dialog, better acting and a little more polish.Iris (Kate Winslet) is a reporter working for a London newspaper. She is in love with a fellow journalist (Rufus Sewell) and has conducted and on-off relationship. When Jasper announces his engagement to someone else she realizes she has been used. Amanda (Cameron Diaz) is a successful, workaholic movie-trailer producer who lives in LA. She discovers that her live-in lover (Edward Burns) has been unfaithful and she promptly kicks him out of the house. Iris and Amanda, who have never met, decide they need a change of country and exchange homes over Christmas. Iris moves into Amanda's luxurious mansion in LA as Amanda occupies Iris's tiny cottage in snowy England. Iris falls for Hollywood composer Miles (Jack Black). Amanda has a relationship with Iris's book editor brother Graham (Jude Law). The men are kind, sensitive and have the potential to be perfect movie husbands. It's a fairly predictable feel good movie, but I enjoyed it.",
    "148": "Maybe it's because I watched Jingle All the Way the other day, but I liked this. Sentimental movies, double for Christmas movies probably, package maybe the last fairytale into romance and holiday \"spirit\". The ones that are successful, I find, tend to play into it more. These people don't have communication problems and deep seated psychological issues, they just need a push to tell people how they feel and break a particular pattern.But that's why they're so appealing. Everyone has a pattern that needs breaking and so every character is simultaneously mythic beyond belief and relatable. Coupled with the spirit of the holiday, telling people how you feel and enjoying the company of others, and you have some harmless sentimentality that is divorced from real life and grounded in it, making it an enduring message.Of course it's unbelievable. What genre really is? It's all about messaging and trappings. And I really don't mind, as a very anxious person, the fantasy of things working out despite, primarily, miscommunication.",
    "149": "We start all of our reviews with the following information. My wife and I have seen nearly 100 movies per year for the past 15 years. Recently, we were honored by receiving lifetime movie passes to any movie any time at no cost! So we can see whatever we want whenever we want. The point of this is that CRITICS count for ZERO. Your local critics or the national critics like Ebert are really no different than you or me. The only difference is that they get to write about the movie and are forced to see hundreds of movies whether they want to or not.Therefore, it is our belief that if you get your monies worth for two hours of enjoyment that is good enough for us! We NEVER EVER listen or read the critics. We only care about our friends and those who we know like the same things as us. Well enough about that.Just a delicious movie! Just what you want for the holidays. Cameron, Kate, Jack and Jude having a great time.Everyone in the family (Over 10) will love it. Two hours of fun. Don't miss it."
}