{
    "0": "Good way to kill 40 minutes, it's a heartwarming story and is a good nod to the real Shepards, as acknowledged at the end.Few goofs spoilt it for me a little, but only because I served.We never salute when not wearing headgear, and Canadians salute the same as the Brit's in wwII.Beards were only allowed in the Royal Navy. Also there's a shot during the landing sequence that jumps to a USN F-14 Tomcat landing in smoke, which is not the correct country nor aircraft.Other than that, well worth a watch, great to see British aircraft in movies rather than the usual yeehaw American love fest.Recommend!",
    "1": "Beautiful short Christmas film, with impeccable production, direction, photography, effects and soundtrack, and great performance from the small cast.A slightly enigmatic story, based on a Christmas tale published by Frederick Forsyth in 1975, with a beautiful proposal of Christmas spirit, good Samaritanism and faith in God.Very well done production for a short film, with a beautiful message of faith and hope, and also a beautiful tribute to the shepherd pilots of World War II, as well as to anyone who works to save or help other people in difficulty or danger.I liked. If you enjoy the Christmas spirit and want to see something different within this theme, it's a great option.",
    "2": "Sticking closely to the source, resisting any urge to 'flesh out' Frederick Forsyth's lovely little Christmas ghost story this film is all the better for it. I'm sure it was done this way because Travolta had his own near death experience thanks to a total electrical failure in 1992, so he felt no need to explain to the hard of learning.An RAF pilot, having already phoned his mother to say that he won't be able to get home in time, unexpectedly gets the chance to fly home from Germany to England on Christmas Eve in 1957, heading out into the night sky just before the station shuts down for the night.As he crosses the Dutch coast his compass, and then all of his electrical systems, fail and he has no idea where he is and is unable to raise anyone on his radio. He begins flying a triangular pattern in the hope of being detected, but gradually comes to accept that he is lost and will have to ditch in the North Sea with absolutely no guarantee of being found and with nobody expecting him. He composes a note to his girlfriend and prepares to meet his fate.And then below him he sees, scudding along the cloud tops, a WWII era RAF Mosquito...To clear up a couple of misconceptions:* The Vampire had only been retired from front line fighter service by 1957 - and you can see its successor in the role, a Hawker Hunter, in the background as the Vampire is pushing back. Vampires were still in use as trainers;* But anyway a Vampire is what Frederick Forsyth flew in the RAF (you did notice that the pilot was called Freddie, yes?);* It's a ghost story - the wrong call signs are a *clue* that something is abnormal - Freddie was using NATO standard;* The \"bad CGI\" is nothing of the kind - all of the flying visuals are references to Chris Foss's illustrations of the original novella, which are beautiful and somewhat impressionistic;* He couldn't just turn back, he was over the sea and had lost his compass. Night flying over the sea is incredibly dangerous if a pilot loses situational awareness. Also, he would risk flying into East German airspace and being shot down (Cold War, innit?). So he followed established emergency procedure and flew triangles...which is also how his fuel was used up;* Oh yes, and a backup magnetic compass is no use if you don't know your position.Blimey, some people don't deserve nice stuff.",
    "3": "It is Christmas Eve, 1957, and there are cozier places to be than the cockpit of a de Havilland Vampire fighter plane. But for Freddy, the Royal Air Force pilot who has just taken off from West Germany, this single-seat jet is the only way to make it back to England for Christmas morning. His flight plan is simple; the fuel tank is full. In sixty-six minutes, he will be back in Blighty. But then the plane begins to fail. First the compass goes haywire, then the radio dies. Lost and alone above the icy North Sea, the pilot is searching for a landing strip when the East Anglican fog closes in, signaling certain death. He has given up hope when a second shadow appears-a Mosquito fighter-bomber of World War II vintage. The plane is a \"shepherd,\" guiding the Vampire to a safe landing, and its appearance is a gift from fate, a miracle out of time-but for one lonely pilot, the mystery has just begun.I've read the short story by Frederick Forsyth every Christmas for the last thirty years. This thirty-nine minute 'short' produced by John Travolta is a Winner. The Shepherd is a gripping, heartwarming tale for a cold winter's night. The reviewers finding this 'short' as boring have played too many video games and short-circuited a few synapses.",
    "4": "I had low expectations coming in. However, as the film continued, i was invested in the main character and his well being.I was putting myself in his situation and kept thinking what would I do. As his fuel became critical, I was thinking this guy is hasn't got a chance.This is a beautifully done short. Visually appealing and pretty well acted.I knew there was going to be supernatural elements, but I was assuming the main character would die and help others in his situation later in years.It was refreshing to see he was on the receiving end of being helped. This was a really uplifting ending and this brings Disney back to it's roots of feel good movies.",
    "5": "If you can get around the obvious issue of the pilot, who would have turned back immediately (even to an airfield that had closed for the night) with that amount of instrument and radio failure, and not keep flying out over the North Sea to certain oblivion ..just as he left the coastline!Maybe the point of the ghost story is that WW2 pilots had little choice but to head out into the North Sea away from enemy territory, many with casualties & serious battle damage! It does capture the spirit of an era set in the Cold War period in a British airfield in Germany at Christmas..looking back to a pilot Shepherd of WW2 with vintage charm!At around half hour+ it was too long for a short story, but was reminiscent of Jim Lovell's (Apollo 13) true story of losing his navigation systems while flying at night over the Sea of Japan, and how he managed to ..get home.",
    "6": "About the time I became a teenager, I began reading some of the books that was on the shelf in my childhood home. Among these were a lot of Alistair McLean, Arthur Hailey, James A. Mitchener and Frederick Forsyth.Having seen the film version of The Day of The Jackal, I read that book as well as The Odessa File and then came across this little book. Hyrden as it was called in danish, which is a direct translation of The Shepherd.Being an easily scared teen I put down the book with a shiver the first time I read it, but it grew on me. When realizing that a short film had come out based on the book, I just had to see it.Was I disappointed. No way! Even though John Travolta is the only actor on the credit list known to me, it was great work by all in the cast. And much more so, it was a faithful rendition of the book. As faithful as you could ask for.Both in the book and the film the revalation that this is a ghost encounter is first revealed at the very end, but now 40 years after I read it the first time, this first viewing was more like a christmas tale about hope and love and I ended watching it with a tear in my eye because of its moving potential.Whatever small goofs that occur in the film, they are only minute and bear no influx on the story. It should be watched by older children and grown-ups alike this christmas.",
    "7": "'The Shepherd' is a good example of what happens when you take a perfectly agreeable ghost story and allow celebrity vanity and lousy writing to bludgeon the charm and subtlety out of it.I don't propose to rehash the plot of the novella here and I haven't read it for a few years. Suffice to say (spoiler alert), there is no chrystal-clear, cockpit-to-cockpit eye or voice contact between the two pilots in the original. This is jammed in to give John Travolta the chance to play with someone else's aeroplane and grab some screen-time.The old geezer who welcomes our hero to RAF Minting is real in the original, rather than a spectre conjuring runway lights and coal fires out of the ether.The mystery is singular and is given room to breathe in the novella. In this adaptation, even the wordy, subtle-as-a-housebrick exposition comes from a second ghost. Wow.The script wouldn't cut the mustard on a daytime soap. It's saturated with clunky exposition and jarring anachronisms, and the writers clearly knew little about the subject matter.Final gripe: a postscript starts, 'in the Second World War hundreds of pilots from many countries lost their lives'. I assume they meant to say, '.... hundreds of thousands of aircrew....'.This production wears its ignorance on its sleeve.",
    "8": "It's not often you get to see a film where two of my favourite aircraft play starring roles. The 'Wooden Wonder' has appeared in quite a number of films, but not the beautiful little Vampire! Both were made by De Havilland so it was a nice touch having the older (Mossie) aircraft guiding home the young pup. I have not read the short story, but it was not difficult to predict what would happen, although the family (this is very much a family film) failed to spot the final twist at the end. Some of the CGI is a little amateurish, but this does not detract from the overall look and feel of the film. The sense of isolation and loneliness in the cockpit is beautifully captured as the pilot makes his way home. Great soundtrack too. Seeing the exquisite Vampire land brought a tear to my eye! Just a wonderful little Christmas film, with a clear message.",
    "9": "My best guess: anti-Disney people coming to gripe because they are told it is their identity. Interesting how essentially every 4 and below review has several egregious spelling mistakes, isn't it?Travolta is indeed meh, weird they couldn't get him to shave, but most of his acting is far away, in a cockpit, geared up, so no big deal.Everyone else is fine. Some of the talking to yourself is because it's a movie, hard to have internal monologues that don't seem sillier.Cockpit lighting is wrong, but it's a movie, I guess they couldn't persuade the producers people can get by with a dark film.I really really hate bad CGI, find the last 2 years of Marvel nearly unwatchable from that, but... no problems here. Not sure what anyone finds unbelievable, looked good to me and a delight to a Vampire on film!Vampires were prone to electrical failures even of instruments (and the author of the original tale flew them before his writing career) but he seems to have forgotten there's a plain old magnetic compass that should have worked. About the old real flaw here, and I suspect someone could have come up with a reason it fails also, but we can just handwave that for the story as the rest tracks nicely.While not authentic, the ghost story inside a ghost story worked well also. If you like the concept of a guardian spirit, easy to imagine that each individual ghost is in their own world and so former batsman ghost is doomed to his own life, not working in cahoots with his former master. Nice surprise.",
    "10": "Fredrick Forsythe wrote a masterful Christmas story that is on par with \"Its a Wonderful Life\". Every detail of the radio broadcast held audiences captivated for years when the BBC broadcast it in Europe. I was introduced to the story as a boy who loved audiobooks, and my mom got me a copy because it had an airplane on the jacket. Literally every part of the original was magic and perfectly done. Disney took it and added unnecessary characters (girlfriend), messed up scenes ( compass and electronics failure), butchered the dialog, omitted the alcoholic stores depot Officer and the endearing clerk in favor of a cheery \"ghost\" which further detracts from the Johnny Kavanaugh character. They leave out the phone calls and conversations with Mirriam St George Officers and those of the weather squadron command from Norrich that are vital to the story. Worst sin of all to this travesty of a screenplay, my guess is that Travolta wouldn't do a non speaking roll. So the ghost plane with a war hero pilot that died years before but comes back to save lost souls is given the ability to speak. This destroys the magic of Kavanaughs character completely. Basically if you are unfamiliar with the original story and radio broadcast, this show is a poorly done show with a reasonably boring story. If you have ever been that starry eyed boy, girl, man, woman, or military historian that sat in awe yearly during the airing of this absolute masterpiece of literature, this version is a complete travesty and a waste of your time to view. Disney.........you.........____!!!!!!!!!!",
    "11": "Walt Disney would be rolling over in his grave (or cryochamber) to see his name against this garbage! From the worst CGI I have seen to and incredibly ridiculous story line.An absolute piece of trash. If any pilot had instrument failure they'd turn back....but this guy keeps flying!Then John Travolta appears out of nowhere to guide him down.... I'm surprised they didn't have in his Qantas jet to make this even more unbelievable!This could have been a great story and movie but it's not.Did they hire an intern at Disney to write and film this absolute drivel!I was so looking forward to this and glad if only took away 40 minutes of my life!!!!",
    "12": "A short story that will warm your hearts for Christmas. This movie gave me so much hope and reminds that the end of the year and the holidays are all about hope, and love. It was merry, suspenseful, and had so many emotions that it brought tears to my eyes. I am so happy I got to start my holidays with this beautiful movie.For the plot, it is a story of a young flying officer who wants to go home for Christmas to his girlfriend whom he dearly loves, however mid air his flight suffers multiple technical failures and he gets stranded over the north sea. The rest, you better watch and find out.I remember a lie which really touched me, I guess it goes like \"Lizzie I am not scared but sad of all the things we would not be able to do together...\" Definitely lovely!",
    "13": "So a pilot who dies decades earlier is destined to return as a spirit and rescue lost pilots for all eternity? Wearing the same clothes when they died and same plane they flew - that never runs out of fuel but has communication problems? Sounds like aviation purgatory. Save enough pilots and you graduate to heaven.Heaven forbid that this was some poor plumber who died. Just imagine ending up in plumber's purgatory. You'll be tasked with rescuing people's toilets on Christmas Eve when all other plumbers are not available. You'll show up at someone's home who has a clogged toilet and spend time relieving it of all the crap that's built up. At the end of your movie, text will be displayed that reads:\"During the COVID pandemic, millions of people who hoarded toilet paper, were rescued by mysterious plumbers\".",
    "14": "Fredrick Forsyth is a fantastic writer, so perhaps the book is worth a read.Pros:Getting to see a de Havilland Comet.It mercifully ended after 40 minutes.Cons: Everything else:Much of the film was a closeup of the pilot in the cockpit.The casting was atrocious. Ben Radcliffe is wholly unbelievable as an RAF pilot. His character goes from happy-go-lucky to lost, defeated puppy dog in the blink of an eye.The acting was truly awful. I'm still trying to figure out which emotions Radcliffe was trying to convey. There was no tension whatsoever.The audio was horrid. The conversation between Radcliffe and his superior was inaudible.There we're so many aspects that were completely unbelievable:For example: The scheduled pilot injures his arm in a snowball fight? A snowball fight?!?Please avoid this film.",
    "15": "This is one of my favourite short stories by Frederick Forsyth.I was looking forward to this film -- the visuals were nothing short of superb, but some of the elements introduced by Disney were disconcerting, even jarring.It would appear that some of Disney's choices for acting talent were driven by political correctness. I very much doubt that there were that many black RAF personnel in 1957. The U. S. Air Force may have had many African-American personnel, but I doubt that the RAF had.What I really found jarring, even grating, was an air-traffic-controller with a noticeable African accent. Could they not at least have featured an actor with a prominent English accent?",
    "16": "The Shepherd is true to the Forsyth short story, and gets just about everything right.It a film is heavy on CGI but wears it lightly, the cast play their roles well, the Christmas movie could have been overplayed but isn't and the writers could have tried to answer the mystery but don't.The film gets median reviews probably because it doesn't confirm, it's not a light watch, it leaves questions un answered - but it is a classic book that deserves this film (I wrote a treatment for this 20 years ago as a student - it's a short linear story that lends it self well to film)It gets almost everything right apart from Travolta - I just don't get him being in this. Would like to see this team / these studios look for more overlooked materials.",
    "17": "The story of a perilous journey and the lost \"good soul\" who gets rescued by a brave ghost is not new. I've seen at least 4 similar movies; \"Saints and Soldiers\" is one of them. There is also the same twist in \"Gravity\".It's a well produced short-film; good acting and beautiful photography. But the tale itself is quite casual, since Dickens' \"Christmas Carol\". There are also unrealistic elements regarding the whole electrical systems failure sequence.However, it is quite emotional and touching, under the perspective of the myth of \"the shepherd\", especially during Christmas time, hence the point of this film. Yet it only stays this way - and maybe this is the scope of producing a short film, after all.In all, I liked the film. It seems, however, that it's only for a \"nice afternoon break\", rather than watching a movie. Sweet and romantic in its own right, including a good cast, very realistic shots and overall production. But still, I have to insist on wondering why the producers chose to film a novel, instead of just leaving the novel as it is, or maybe expand the concept further, adding plot, characters and a more easy-to-relate, modern aspect of the same old educative myth.",
    "18": "I read the story by Frederick Forsyth years ago and was really taken by it. Although I do not recall the details I am sure it was worked out in detail and all actions and dialogues made sense. After reading the story I hadn't the thought of \"this is stupid\". But this short movie is. The detailing is terrible, the mistakes are too much and the acting is below average. No moment I was captivated despite the constant music in the background to give it a dramatic effect. Although it was just 38 minutes, it wasn't a quick ride. Too many boring and out of context scenes. Time that could have been spent better on board of the plane while the pilot was handling the situation. No way a pilot would do a triangle pattern over the North sea. He would have used the moon or stars to keep a straight line to England and jump over land. Also why didn't the magnetic compass function? It would be part of the instrument panel. I am quite sure in the book it was all worked out to make it a logical series of events that could have ended in an catastrophy. I suppose most people will like it for what it is, but the people who know the story well will turn away from this movie. Can't do Disney anything right?",
    "19": "I have read the source material for this short which was charming enough. Why the need to make a short(ish) film about it I do not understand. Maybe it lost most of its charm during editing ? Acting is acceptable as are the cast. Something just felt off and why a pilot would fly out into open water with several technical issues when he could quickly return to base would baffle any viewer.If you are looking to fill half an hour or so at Christmas, take the dog out or wash the car, this would be a waste of your time. The sentiment of the film would be better felt if not so rushed and forced among other issues.",
    "20": "The way the movie was made really gits home for me. The way the CGI was done and how only in less than 45 minutes they had enough to make a solid plot. The whole premice of the movie is spectacular and thought prevocing. What was the most interesting is the props and places they shot these scenes at. Truly Breathtaking! The movie wasnt slow or boring, and the actors were giving there all! I would love to see if they could make a sequel or a full length movie becuase I think that this movie has great potentional! Im so glad that disney decided to make a movie like this and i hope they make more in the future!",
    "21": "I do not know the short story by Frederick Forsyth . I am not familiar with aviation details . And I liked this short film, first for message, second for the pleasant story status before christmas.No doubts , many motives to critic him, including for political correctness drops and for some unrealism in large slices. But I love Gothic stories - and, in this case, its elements are well present, I saw with sympathy the craft of tension and I was just happy discovering John Travolta in a role reminding his early ones.The sin ? Maybe predactibility. But it is a Disney film and Schedryk covers all defects .",
    "22": "Do you like Ghosts and planes, well you may or may not be in luck as this film has both, it's just a very ok experience, not awful just ok.Think of it as one of those films that is worth watching, but only if you don't have something better to watch.It's not a bad film, it's just a very mediocre film, decidedly average.So here it goes , the review.John Travolta plays a ghost Mosquito pilot from Canada with an American accent and a beard that you weren't allowed to have in the RAF until 2019 (maybe ghosts have started to grow beards) and he leads pilots home to a closed RAF base in low cloud cover and that's the film, you don't need to watch it, as that's the film minus 1 hour 30 minutes ( I've given you another 90 minutes to your life, say thanks).It you like planes there is a Mosquito and Vampire in this films from the days when we made incredible planes, so that was nice at least.It sad because it comes from a book written by the heavy weight of Fredrick Forsyth, so you would of expected something a bit special but sadly it was a missed moment.It's not bad, it's just very very average but I did appreciate the planes.Watch if you have nothing special to watch on Disney+",
    "23": "I have seen short movies before, and they were really great. I think they were able to convey their message in a short period of time, creating a great experience. Sadly, this movie is not one of them! It was really boring from the beginning and also predictable towards the end. I could see the finish line a mile away. The only good things I can say about this short play are the acting and the cinematic shooting; other than that, it was failing across the board on everything else. Whoever came up with the idea to make this short movie, what were they thinking?! Did they wake up one day and say, \"Oh! I have a great idea for a movie\"? Highly NOT RECOMMENDED!",
    "24": "There's already a lot of comments on things like saluting protocol and beards, but the other inaccuracy that hit me was ATC/Ops shutting down the second the aircraft took off - it would have at least waited to check that an immediate return wasn't necessary. I can forgive that as artistic licence though, given that this is a short and the necessary symbolism of the lights going out.However, the one thing that I wasn't too keen on was the 'double' ghost story; we'd already had the phantom pilot guiding our stricken Vampire home, so it seemed a bit unnecessary to also have the SNCO in the Officers' Mess to also turn out to be another ghost; I don't think that really brought anything new to the film - though I guess that's down to the original story. I just hope the two JNCOs that arrived to pick him up at the end didn't turn out to be even more entities from the other side. Or maybe - plot twist - he didn't make it after all!All in all though, an enjoyable, seasonal watch.",
    "25": "Don't give too much credence to the Disney paid shills who leave 9 and 10 point reviews based on the point form 'talking points' they are given: Its pretty bloody awful, especially if you know the story and have been listening to the Xmas eve readings for +40 years. The technical mistakes are numerous. The variations from the original story are pointless and in good Disney fashion, it suffers from 'diversity disease' by creating characters in races and genders who were not a part of the story.The animated sequences are average to poor with badly rendered star fields and unrealistic aircraft movements.Sadly Travolta is two generations too old for the role he is playing and the beard is unforgivably inaccurate. Though the book character is Irish, they at least had the decency to make Travolta Canadian and not an American in the RAF.Worst of all is that the strength of the story is dependent on the main character's internal dialogue and emotional struggle. Here we get none of it except for a few seconds of badly acted facial contortions. We also loose the backstory to the Travolta character entirely, the phone calls and speculations of the main character after he lands and sadly they opt for a cheesy one liner to explain the Travolta character's presence. Why they changed the Joe character from corporeal to illusory is without justification and changing the tone of the story to cheap and one dimensionalp.s. Dear poster artist: Vampires have two tail booms and two vertical stabilizers and rudders. Yuck.",
    "26": "Serious tripe. Worst part was the direction and lack of pacing. It was nearly 30 mintes long, this short, yet there's no story. So a guy does everything wrong and nevertheless underwent no trial whatsoever. Nothing pays off. I was reminded yet again that the British cannot make a movie to save their lives. You can tell from the beginning the direction is horrendous on top of the infuriatingly shoddy editing, Just stick to sitcoms where you talk each other to death with the only thing you understand, the British accent. Once again, this is proof that the British film industry is as decrepit as the nation itself.",
    "27": "It's as if they decided to take a Hallmark Christmas special and make it sillier. Five minutes in and the entire story was painfully obvious and being presented with nothing new or remotely endearing. The CGI was weak and flat and unfortunately, for me the only memorable thing was how silly I found the effort. I found myself wishing for some Jack Nicholson/bartender action to liven things up but alas...It seems Travolta still has his Battlefield Earth magic working for him. II'm sure they racked their heads in the writing trying to figure out how to include a puppy and red flannel..Do yourself a favour and avoid this stinker.",
    "28": "Worst ever Disney production . Budget CGI , lighting totally wrong for night flight, terrible acting, plot so obvious from beginning. Is this for 4 year olds?Obviously piece for Travolta who fancies himself the hero. How many stars does one need in a night sky. Seen more convincing video games in the eighties. . I wanted to like this film. How can you go wrong with night flights and ww2 heroes? Apparently quite a lot. This has been made by children who don't get that 100% on the colour stick isn't better. Please add your comments as this is not the way for films to go. I love films, especially about that era, but this is a travesty done by airhead.",
    "29": "The way the movie was made really gits home for me. The way the CGI was done and how only in less than 45 minutes they had enough to make a solid plot. The whole premice of the movie is spectacular and thought prevocing. What was the most interesting is the props and places they shot these scenes at. Truly Breathtaking! The movie wasnt slow or boring, and the actors were giving there all! I would love to see if they could make a sequel or a full length movie becuase I think that this movie has great potentional! Im so glad that disney decided to make a movie like this and i hope they make more in the future!",
    "30": "I do not know the short story by Frederick Forsyth . I am not familiar with aviation details . And I liked this short film, first for message, second for the pleasant story status before christmas.No doubts , many motives to critic him, including for political correctness drops and for some unrealism in large slices. But I love Gothic stories - and, in this case, its elements are well present, I saw with sympathy the craft of tension and I was just happy discovering John Travolta in a role reminding his early ones.The sin ? Maybe predactibility. But it is a Disney film and Schedryk covers all defects .",
    "31": "Do you like Ghosts and planes, well you may or may not be in luck as this film has both, it's just a very ok experience, not awful just ok.Think of it as one of those films that is worth watching, but only if you don't have something better to watch.It's not a bad film, it's just a very mediocre film, decidedly average.So here it goes , the review.John Travolta plays a ghost Mosquito pilot from Canada with an American accent and a beard that you weren't allowed to have in the RAF until 2019 (maybe ghosts have started to grow beards) and he leads pilots home to a closed RAF base in low cloud cover and that's the film, you don't need to watch it, as that's the film minus 1 hour 30 minutes ( I've given you another 90 minutes to your life, say thanks).It you like planes there is a Mosquito and Vampire in this films from the days when we made incredible planes, so that was nice at least.It sad because it comes from a book written by the heavy weight of Fredrick Forsyth, so you would of expected something a bit special but sadly it was a missed moment.It's not bad, it's just very very average but I did appreciate the planes.Watch if you have nothing special to watch on Disney+",
    "32": "I have seen short movies before, and they were really great. I think they were able to convey their message in a short period of time, creating a great experience. Sadly, this movie is not one of them! It was really boring from the beginning and also predictable towards the end. I could see the finish line a mile away. The only good things I can say about this short play are the acting and the cinematic shooting; other than that, it was failing across the board on everything else. Whoever came up with the idea to make this short movie, what were they thinking?! Did they wake up one day and say, \"Oh! I have a great idea for a movie\"? Highly NOT RECOMMENDED!",
    "33": "There's already a lot of comments on things like saluting protocol and beards, but the other inaccuracy that hit me was ATC/Ops shutting down the second the aircraft took off - it would have at least waited to check that an immediate return wasn't necessary. I can forgive that as artistic licence though, given that this is a short and the necessary symbolism of the lights going out.However, the one thing that I wasn't too keen on was the 'double' ghost story; we'd already had the phantom pilot guiding our stricken Vampire home, so it seemed a bit unnecessary to also have the SNCO in the Officers' Mess to also turn out to be another ghost; I don't think that really brought anything new to the film - though I guess that's down to the original story. I just hope the two JNCOs that arrived to pick him up at the end didn't turn out to be even more entities from the other side. Or maybe - plot twist - he didn't make it after all!All in all though, an enjoyable, seasonal watch.",
    "34": "Don't give too much credence to the Disney paid shills who leave 9 and 10 point reviews based on the point form 'talking points' they are given: Its pretty bloody awful, especially if you know the story and have been listening to the Xmas eve readings for +40 years. The technical mistakes are numerous. The variations from the original story are pointless and in good Disney fashion, it suffers from 'diversity disease' by creating characters in races and genders who were not a part of the story.The animated sequences are average to poor with badly rendered star fields and unrealistic aircraft movements.Sadly Travolta is two generations too old for the role he is playing and the beard is unforgivably inaccurate. Though the book character is Irish, they at least had the decency to make Travolta Canadian and not an American in the RAF.Worst of all is that the strength of the story is dependent on the main character's internal dialogue and emotional struggle. Here we get none of it except for a few seconds of badly acted facial contortions. We also loose the backstory to the Travolta character entirely, the phone calls and speculations of the main character after he lands and sadly they opt for a cheesy one liner to explain the Travolta character's presence. Why they changed the Joe character from corporeal to illusory is without justification and changing the tone of the story to cheap and one dimensionalp.s. Dear poster artist: Vampires have two tail booms and two vertical stabilizers and rudders. Yuck.",
    "35": "Serious tripe. Worst part was the direction and lack of pacing. It was nearly 30 mintes long, this short, yet there's no story. So a guy does everything wrong and nevertheless underwent no trial whatsoever. Nothing pays off. I was reminded yet again that the British cannot make a movie to save their lives. You can tell from the beginning the direction is horrendous on top of the infuriatingly shoddy editing, Just stick to sitcoms where you talk each other to death with the only thing you understand, the British accent. Once again, this is proof that the British film industry is as decrepit as the nation itself.",
    "36": "It's as if they decided to take a Hallmark Christmas special and make it sillier. Five minutes in and the entire story was painfully obvious and being presented with nothing new or remotely endearing. The CGI was weak and flat and unfortunately, for me the only memorable thing was how silly I found the effort. I found myself wishing for some Jack Nicholson/bartender action to liven things up but alas...It seems Travolta still has his Battlefield Earth magic working for him. II'm sure they racked their heads in the writing trying to figure out how to include a puppy and red flannel..Do yourself a favour and avoid this stinker.",
    "37": "Worst ever Disney production . Budget CGI , lighting totally wrong for night flight, terrible acting, plot so obvious from beginning. Is this for 4 year olds?Obviously piece for Travolta who fancies himself the hero. How many stars does one need in a night sky. Seen more convincing video games in the eighties. . I wanted to like this film. How can you go wrong with night flights and ww2 heroes? Apparently quite a lot. This has been made by children who don't get that 100% on the colour stick isn't better. Please add your comments as this is not the way for films to go. I love films, especially about that era, but this is a travesty done by airhead.",
    "38": "This is a great way to spend 40 minutes. An engaging tale that is short, sharp and well executed.There are a few flaws and the film isn't perfect but looking past a few inaccuracies, you have a great story set across a Christmas background which really gives this short and extra element, making this a good family watch.It's possibly the little kid in me, watching planes and the classic Military themes intertwined with a Christmas backdrop but this is has a real nostalgia piece that is visually fantastic!Lastly the casting is solid, Ben Radcliffe is charming in the lead role. While Travolta as Kavanagh is excellent, giving that feel of care and experience the role needed. This felt like a great role for Travolta in the twilight of his career.All in all, looking for a short good Christmas watch and something I look forward to showing to my kids when they're old enough. The 8/10 maybe be little high for this but this film just sung to me.",
    "39": "Found this while browsing Disney Plus and decided to give it a try, particularly as it's directed by Iain Softley who doesn't get nearly as much credit and recognition as he deserves (does anyone remember the excellent K-PAX for example?).The movie draws us steadily into the story and maintains a mostly quiet and thoughtful atmosphere yet with some tension when required.Not only did I enjoy the story but the visuals too - I am going to assume that the outside views of the aircraft when flying were CGI and not physical models with CGI 'enhancements', etc and, if so, they were very well created with a good sense of realism.In summary: I enjoyed it a lot - despite the relatively short running time it never felt rushed.Recommended.",
    "40": "I am an indian.Maybe because I had just finished watching mission raniganj before watching this short film that i found it visually so beautiful. The music was soothing. The acting from the lead character was above average, and really liked the parts of John and Steven. And I'd be happy to see John in more of such roles.It maybe is predictable but that doesn't make it any less enjoyable and i didn't find it boring at all. When the guide came i realized to some extent how it'd end and still thought that the whole interaction between the lead and the guide was marvelously done, even more so during the last scene with the captions.Some group may see it as too religious and downvote it and some maybe unhappy with the appearance of the lead and the guide.Movies from the other side don't get downvoted this badly and this points to an underlying problem in this platform and this is just sad.",
    "41": "How can a movie so short could be so boring and predictable?.This is one of those moments in life when usually a policeman tells : \" Nothing to see here\", well in this case it's the absolute truth.It's sad to grow older and see the decay of your idols, it happens when we see our parents get sicker as they age, a beloved pet, or even a withering plant. That's how I feel about Disney and if this is what is coming it's a clear indication that is giving the last few gaps for air.Leaving the metaphor aside, this sucks, but not a regular suck, it sucks big Epcot center's giant balls.Peeeee... Time of dead...",
    "42": "Ignore the negative reviews, someone with an axe to grind is trying to sink the ratings on this excellent short. My wife and I took a chance on this and loved every minute. Well acted, well directed, good story, not predictable, and best of all I was left feeling something inside, something good and uplifting. I would explain in more detail but I don't want to spoil the plot.If you want to watch something that inspires and intrigues without vulgar language and violence and explosions, this is it.I do have my own axe to grind with Disney in some ways-they have lost their way, and they insist of forcing people to watch the bad parts of some garbage they now distribute by denying access to VidAngel. BUT this short is beautiful and worth the watch. Make more of THIS, Disney.\"Stand with anyone who stands right. Stand with them while they are right, and walk away when they are wrong.\" - Abraham Lincoln.",
    "43": "The only thing I didn't like about this movie is it was too short.A little boring not gonna lie but it was better than most Christmas movies.The cinematography was incredible and Ben Radcliff was great in it.I wanna see him in better roles than this because I wanna see him further his acting skills.I see potential in him!! Especially because I remember watching him in Evermoor Chronicles. Hopefully he'll be casted more after this.Another thing, because apparently my review is too short. I honestly don't know what else to say.I only watched this Disney because I was bored and had nothing to do.",
    "44": "Adapted from Frederick Forsyth's novel of the same name, published in 1975, this film is produced by Alfonso Cuarón...Iain Softley, whom I love very much, served as the director and screenwriter.But; When Disney+ tried to make a 39-minute movie for a story that could be told in 10 minutes, all the weight of the work fell on Disney's staff director of photography John Mathieson and composer Anne Chmelewsky.Because we are watching a literally empty part of the movie for 20 minutes. If it weren't for these two names, it would be difficult for the audience to complete the first 10 minutes.Even John Travolta, who comes after all these beautiful CGI and compositions that serve no purpose, does not add excitement to the movie, and his entire scene is shorter than the time his name is written in the producer section at the end of the movie.Disney plus used to do things that people would be excited about during Christmas time...I miss those days.",
    "45": "I don't get this weak production. None of it felt grounded in reality. The cinematography is incredibly poor for someone so experienced. The production is so low rent that nothing feels tangible, like these people in this time and place could really exist. All the shots are close up, wooden, clunky continuity, really poor research etc etc. What was immediately jarring to me was white crisp light from all the light bulbs. Even as a child of the 80's the light bulbs had a warm yellow tint. Why are they so cold, white and lighting up entire corners of the rooms? There's no contrast in the hues. You should feel like he left the warmth of his base, with the warmth and messiness of a joyful Christmas party to go out into the cold night. He's in a cold plane in a winters night and you can't ever see his cold breath. There's a warning, 'may contain use of tobacco'. Frankly for the time they're in there should have been more smoke fill rooms. As for the story, if that's really how the original story goes then its lack of depth has been exposed and they really should have tried to add more to compensate, add more creative flair, any form of creativity really. That would have been nice.",
    "46": "From a common sense point of view, the movie doesn't make much sense to me.1. Secondary compass is a standard device for a pilot since forever.2. Electrical failure doesn't equate to conpass failure. Especially in the pre-digital era, the compas and altimeter would still work with the engine off and now power. Same with speed meter. They were purely mechanical devices based on earth's magnetic field, pitot tube (dynamic/static pressures), air density/pressure/temperature. Fuel gauge also used to by purely mechanical back then, and that one seemed to work till the very end.3. The behaviour of the pilot doesn't make any sense whatsoever. It's like he never went through any common sense training. If you have any sort of issues with the plane's controls early in your trip, you don't push forward for your destination, you get back and land.4. If you have compass and altimeter failure and see a cloud front, you avoid it at all costs.5. Basic training also covers (to this day) star and sun nativation. Yes, if you know the time and date, you can easily determine with good precision the cardinal points and navigate to land. It doesn't make any sense that he starts doing \"triangle formation\" over the see when he still had plenty of fuel. You find land at all costs and try to find an empty field or road or something. Given the full moon he had during that night, it should have been really easy. It absolutely doesn't make any sense to ditch over water with land km away.6. Also, the way he tried to \"save fuel\" didn't make much sense to me either. If you want to maximise endurance, you basically have to fly at minimum power which still keeps you in the air while gliding the plane. Each plane has a different maximum endurance envelope/settings and it's a combination of engine settings, flight controls settings, altitude and speed - no \"triangle formation\" required.7. Overall - absolute rubbish. The entire movie doesn't hold water from a technical point of view. The existence of ghosts is more believable to me than that pilots' behaviour.",
    "47": "The only thing I didn't like about this movie is it was too short.A little boring not gonna lie but it was better than most Christmas movies.The cinematography was incredible and Ben Radcliff was great in it.I wanna see him in better roles than this because I wanna see him further his acting skills.I see potential in him!! Especially because I remember watching him in Evermoor Chronicles. Hopefully he'll be casted more after this.Another thing, because apparently my review is too short. I honestly don't know what else to say.I only watched this Disney because I was bored and had nothing to do.",
    "48": "Adapted from Frederick Forsyth's novel of the same name, published in 1975, this film is produced by Alfonso Cuarón...Iain Softley, whom I love very much, served as the director and screenwriter.But; When Disney+ tried to make a 39-minute movie for a story that could be told in 10 minutes, all the weight of the work fell on Disney's staff director of photography John Mathieson and composer Anne Chmelewsky.Because we are watching a literally empty part of the movie for 20 minutes. If it weren't for these two names, it would be difficult for the audience to complete the first 10 minutes.Even John Travolta, who comes after all these beautiful CGI and compositions that serve no purpose, does not add excitement to the movie, and his entire scene is shorter than the time his name is written in the producer section at the end of the movie.Disney plus used to do things that people would be excited about during Christmas time...I miss those days.",
    "49": "I don't get this weak production. None of it felt grounded in reality. The cinematography is incredibly poor for someone so experienced. The production is so low rent that nothing feels tangible, like these people in this time and place could really exist. All the shots are close up, wooden, clunky continuity, really poor research etc etc. What was immediately jarring to me was white crisp light from all the light bulbs. Even as a child of the 80's the light bulbs had a warm yellow tint. Why are they so cold, white and lighting up entire corners of the rooms? There's no contrast in the hues. You should feel like he left the warmth of his base, with the warmth and messiness of a joyful Christmas party to go out into the cold night. He's in a cold plane in a winters night and you can't ever see his cold breath. There's a warning, 'may contain use of tobacco'. Frankly for the time they're in there should have been more smoke fill rooms. As for the story, if that's really how the original story goes then its lack of depth has been exposed and they really should have tried to add more to compensate, add more creative flair, any form of creativity really. That would have been nice.",
    "50": "From a common sense point of view, the movie doesn't make much sense to me.1. Secondary compass is a standard device for a pilot since forever.2. Electrical failure doesn't equate to conpass failure. Especially in the pre-digital era, the compas and altimeter would still work with the engine off and now power. Same with speed meter. They were purely mechanical devices based on earth's magnetic field, pitot tube (dynamic/static pressures), air density/pressure/temperature. Fuel gauge also used to by purely mechanical back then, and that one seemed to work till the very end.3. The behaviour of the pilot doesn't make any sense whatsoever. It's like he never went through any common sense training. If you have any sort of issues with the plane's controls early in your trip, you don't push forward for your destination, you get back and land.4. If you have compass and altimeter failure and see a cloud front, you avoid it at all costs.5. Basic training also covers (to this day) star and sun nativation. Yes, if you know the time and date, you can easily determine with good precision the cardinal points and navigate to land. It doesn't make any sense that he starts doing \"triangle formation\" over the see when he still had plenty of fuel. You find land at all costs and try to find an empty field or road or something. Given the full moon he had during that night, it should have been really easy. It absolutely doesn't make any sense to ditch over water with land km away.6. Also, the way he tried to \"save fuel\" didn't make much sense to me either. If you want to maximise endurance, you basically have to fly at minimum power which still keeps you in the air while gliding the plane. Each plane has a different maximum endurance envelope/settings and it's a combination of engine settings, flight controls settings, altitude and speed - no \"triangle formation\" required.7. Overall - absolute rubbish. The entire movie doesn't hold water from a technical point of view. The existence of ghosts is more believable to me than that pilots' behaviour."
}