{
    "0": "So the aunt was developing weapons. The daughter did not like that but wasn't the one running the company. Her dad designed those weapons and built his own, which she used. It didn't make sense. Besides, there is nothing wrong with building enhanced suits for soldiers, that will save lives, when your being invaded by alien armies every few years!The room with the alien tech in it, didn't have anyone guarding it. She pickpockets a pass and walks in, then walks out. Walking past the entrance to another corridor that did have a guard next to it. What was in that corridor that it warranted a guard? And this one with the advanced weapon in it did not? Then the scientist she stole the pass from, walks back into the room without his pass?The building it put in lockdown, but the boy just walks out. So much for lock down.The beetle suit (and OMAC) is never explained. It can seemingly do anything but how? Where do the bullets come from? How are they replenished? How is it charged?When they drain the suit for the code, they tell us repeatedly it will kill him. They drain the code, but he lives. So what a waste of time. A plot point that went nowhere.Blue Beetle doesn't want to kill. But the Uncle is willing to stab people with the bug mobile legs. Grandma machine guns down security guards just doing their job.The Uncle builds a localised signal jammer, and the building he uses it on with high-tech weapons inside doesn't hit the alarm when all their feeds go dead. Besides the fact that there was zero guards in the main lobby, and the blue beetle tech is in a display cabinet which can be picked with a paperclip?The uncle can pilot the bug mobile having never seen it before, just because he drives a truck. He knows where all the buttons are and how to do tight manoeuvres .",
    "1": "Interrupted kiss because someone arrives. CHECKVillain saying at the beginning \"your family makes you weak.\" CHECKWoman tripping and that's why she gets caught. CHECKMulti-million facilities where it's easier to steal something than in a Starbucks. CHECKPoor family, but with the perfect skills for the mission. CHECKChase ends because the protagonist turns right into a corridor and the villains don't even turn their heads, continuing to run straight ahead. CHECK\"Not so bad\" scientist who sacrifices himself for the hero. CHECKHero saying \"my family is what makes me strong\" at the end. CHECK.",
    "2": "It's sad, not unexpected, to say that it's a chore, as you've seen the story told here a thousand times before, no surprises or things new, this will really make you blue, all in all more than two hours, that will bore you through and through. The CGI is not that good, and it will not make you marvel, plus the story is predictable, and I might suggest - quite larval, the acting's amateur, so is the dialogue and score, it's a challenge after watching to applaud and not ignore.If we're really unlucky they'll make another one that will take us to places increasingly common in the world of Superhero desperation.",
    "3": "Let's get the positives out of the way first. The musical score is pretty good, although not up to the normal DC standards for music. There are a couple of cool action moments. Half of the comedic attempts made me laugh. And I loved the intro artwork/music, it got me excited.The bad... sigh. Blue Beetle is fairly boring and had difficulty getting me invested. The majority feels generic with nearly everything having been seen in other superhero movies. The one it seemed to copy the most is Shang-Chi. Numerous aspects are nearly identical. Like the zany sister who never stops talking and gets him into trouble. It's the same character that Awkwafina plays. They even steal jokes from it. I knew the joke was coming because I had already seen it in Shang-Chi.But the biggest problem with this movie is that the protagonist doesn't drive the plot. Things happen TO him, not BECAUSE of him. And he is saved by something or someone an absurd number of times. It becomes laughable and makes it difficult to root for him.To make it worse, we have the stock-est of all stock villains. She's played by veteran actress Susan Sarandon. Not only was this a terrible casting choice, she gives an atrocious performance. Her line delivery is cringe. It doesn't help that the dialogue is terrible.I mentioned that half the comedic attempts made me laugh. The other half are awful. They were either cheesy or fully predictable. I knew exactly what would happen or what the punch line would be.This movie is also extremely dumb. It's mostly small stuff that can be ignored if it happens once or twice. But it happens 100 times, no exaggeration. I'll give an example. The enemy starts shooting at his friends. Rather than stopping the enemy who is right next to him, he turns around and runs towards his friends. Why? To yell, \"you guys need to get out of here.\" It's just bad writing.I have no allegiance to DC or Marvel, but I truly feel sad for the die-hard DC fans. They continue to receive bad movies and have to watch as the once endless potential of the Snyderverse is thrown away.(1 viewing, opening Thursday IMAX 8/17/2023)",
    "4": "What you get are some okay action sequences and okay special effects. That's more or less the core of Blue Beetle. The story is one straight out of generic-not-so-wonderland, lacking any creativity and any juice (in my opinion, simply embedding a pretty standard story in another cultural context is not the work of a creative titan). At most, this flick will engage three or four of your brain cells. Moreover, most of the fun and comedy elements don't work too well either. These days, writers, directors, and producers seem to think that they can get away with anything because of the work of the special effects department - good storytelling seems an art mostly lost these days. Blue Beetle tastes like one of those chewing gums that have long lost all flavor. Unfortunately, there is no power of cheese to save this one with some decent high-octane schlock. My exact rate: 3.5.",
    "5": "What a load of childish nonsense, i had to turn this off after the first 30 minutes, the family constantly screaming and singing like they were ultra stupid or just very very immature, it got to the point of being nausiating.The special effects were good but apart from that i really dont know what else to say about this movie it was very unimaginitive. Mabay aimed at five year olds at best. Its getting harder and harder and harder to find a movie that isnt full of all the same immature and stupid stuff.Im noticing that all the superhero ones are the movies that are being ruined the most...",
    "6": "ORIGIN: I am writing this as I watch the movie. So far the first 40 minutes are basically the combination of Spiderman(Iron Spider cant control suit), Ironman(the suit mimics Ironman in looks, function and design) and Venom(alien symbiote attempting to work with human host) origin stories. There is nothing new, fresh or interesting here. It has all been done before, only better.FOCUS: I like the family focus here. However, George Lopez is exhausting and cringe throughout. Kind of like Thor Love and Thunder dragging out the screaming goats joke; that is George Lopez in this movie. Very forced. Otherwise, the family focus works.DESIGN: The Blue Beetle suit and design is probably the highlight and coolest part of the movie. Though, its nothing too different than what we have seen Ironman, Spiderman or Venom do.VILLAIN/PLOT: Extremely weak, predictable, cliché and underwhelming. We all knew exactly where everything was going.XOLO MARIDUENA: I was really rooting for him. And he wasn't bad. But his acting skills don't always work. Maybe give him some more time to develop before handing him such a large role?TONE: Like the trend of recent superhero movies. The tone is Chaos. Think more chaos=better movie. Only when done correctly.VISUALS: Better than The Flash but that's not saying much.Overall, this is just more of the same. Look at Shazam 2, Thor Love and Thunder, Flash, Antman 3. The trend of new superhero movies are trying too hard, cringe, not doing anything fresh and overall very average movies.As a side note. DC is dying, sadly. What is this, 7 flops in a row? Call me crazy but I don't think fans are too thrilled about the announced reboot. OR they'd be showing up to the box office? $24m opening weekend? Yikes.Its a shame. Blue Beetle has a ton of potential! Wish he could have been a stronger part of the Justice League down the road.",
    "7": "Blue Beetle isn't one of the well known DC characters. My only experience with him was from the Young Justice cartoons, which was positive. Blue Beetle is another DC superhero movie failure. A Latino superhero movie that was predictable, had uninspiring characters, a weak, boring villain, and a movie that played too much on Latino stereotypes. This could have been an inspiring Latino superhero movie that many could have related to and enjoyed instead it became a jumbled, boring, amateurish mess. No, even Nana couldn't save this mess of movie. The sad part is that the 2 leads seem to have amazing chemistry together based on their rounds of promotions. But have none in the actual movie. And based on the quality of the movie, it should have been direct to Max not worthy of a theatrical release. How many poorly made DC/WB movies can be made? All I can say is a wise man once said, \"That the definition of insanity is doing the same thing over and over again expecting a different result.\" Can James Gunn save the DC universe? Stay tuned!",
    "8": "It was so bad I couldn't stand to finish watching it and left the theatre. It's boring, and the jokes are plain awful - playing them over and over like the one for Maria la del barrio, or scatological jokes. I can't even fathom how the Mexican actors in there are okay with the simplistic, absurd, and ridiculous portrait of a family of immigrants depicted in this film. Xolo Maridueña's range of acting is clearly short. Are there really no better Mexican-descent actors in Hollywood? Disappointing. Having Susan Sarandon is not enough to save this disgrace of a film - her character is hollow and exaggerated. It's no surprise why DC's films performances are so low (in both the ticket office and quality) compared to those of Marvel. The love interest is predictable and forced. What a way to waste money and time this film is. I truly advise you not to watch it. It's not fun, like, at all. I had no expectations and either way, I was utterly disappointed.",
    "9": "I would honestly rate the movie lower but the sort of beautiful landscape of the movie was rather enjoyable to look at. I am not entirely sure why I was reading a news article before this movie came out where they said \"this movie is a win for Hispanic people\" thought I'm living in Romania, most of my friends live in Spain and not a single one of them felt like this movie was a win of any sorts. Anyways, the plot of the movie is bland and overdone, maybe if it came out in 2015 it might have been rather enjoyable since they hype was there, although I highly doubt it since the dialogue literally made me gag throughout the entire movie.I can't say I'm disappointed in this movies flop, but I'm not surprised either. Main stream media and entertainment has been nose diving in recent years, so I guess this movie decided to join the kamikaze.",
    "10": "When I watch a film I don't expect it to be historically accurate, scientifically correct or politically acceptable however I do except it to be enjoyable! This film is 127min long which is 90min too long. Bad acting all round poor, poor story line and mediocre graphics. This a film that reminds me of the 90's children science fiction like power rangers. What especially got on my nerves is the constant shouting and screaming by the actors/characters and the ridiculous jokes that are as funny as watching paint dry.WB clearly hedging their bets and trying to squeeze everything in to one film just in case there's no sequels. I HOPE THERE IS NO SEQUEL.",
    "11": "*SPOILERS*\nI generally don't walk out when I've paid to watch a movie the only other time was for miami vice but blue beetle was offensively bad I don't know what the director was thinking but the acting all round in this movie wasn't even fit for porn, the attempted jokes make your cringe so hard I think I actually had my eyes closed at one point, later when the blue beetles heavily overweight elderly grandmother started arming herself up for a fight with some space minigun I decided life was too short, don't see this movie not even for free.The one positive I took away from what I saw was the suit looked cool.",
    "12": "Blue Beetle is featured well in one of the Batman cartoons i think in the Brave and the Bold. In that he is a fun teenager trying to figure out his powers and how to help Bats. If you want to see a good representation of Blue Beetle i recommend finding this animated series. This movie kind of felt like Power Rangers on the CW network, albeit with a much higher budget. There was nothing to care about here. I think DC was stretching to find more characters to bring to big screen. He is a supporting character at best. It is a good comparison to Shazam 2 with all the focus on secondary characters. Both are a waste of money and a little on time. If you have nothing else to watch its ok.",
    "13": "Blue Beetle comes at a time where Multiverses are breaking and worlds are ending, but it stays in its own corner and maintains a strong, grounded story with family at the center. The entire main cast are the heart of this film and the hispanic family dynamic feels so real and distinct. I found myself deeply connected to their story and invested in their emotional moments as if I were joining them on the journey as well. While it can be said that the rest of the story feels very repetitive from previous superhero films, that would be the biggest fault of the film. The action, emotion, and unique style leave a very memorable mark on the current state of superhero film. Had this been released 15 years ago, it could've been as big of a hit as any MCU standalone film, as it shares the same quality of the likes of Black Panther, Doctor Strange, and Captain America. With the way superhero films have been, this is a breath of fresh air, even with the familiar taste.",
    "14": "Blue Beetle doesn't suffer from the ponderousness that weighs down so many other DC movies. It's lighter, more fun, and delivers the jokes, bright colors and nods to the ridiculousness that you want from a superhero movie, a slight improvement than recent DC movies.The movie has a big heart, ambitious references, and moments that make it an entertaining watch, but it can curdle thanks to the constraints of the superhero genre. The cultural specificity is also an asset but feels rushed in a format that, unlike the pacing of a series, creates a greater imperative to get to the next battle. Though it may have some novel elements, the franchise already feels tired, and isn't much more promising than recent DC efforts \"Black Adam\" and \"The Flash.My Rating: 5/10.",
    "15": "Let's start by just saying granny with a neon automatic gun. That says it all, 600 characters not needed. 4DX was pretty bad too. Bumps and shakes that just didn't make sense. Like a thud in the back when the door got kicked. Really, 4DX is trying to put me in the shoes of the door. Although as the characters were all wooden too, it probably wouldn't make much difference. I literally didn't care about any of the characters. They could have lived, or died and I wouldn't be bothered. Personalityless shells. Really silly film but also not funny, just lame. Usual poor Hollywood dialogue and unmemorable performances, with no story other than good guy has thing bad guy wants, bad guy chases good guy.",
    "16": "You've seen one, you've seen them all. Blue Beetle is about as cookie-cutter as the bombastic superhero mcmovie genre comes. This generic mishmash of the well and truly worn-out superhero template differs only in that it desperately tries to pander to demographic stereotypes and messaging. The origin story needs no description, you've already seen it a hundred times over in various films, tv shows or comics. Sarandon's mailed in performance as the villain was dull, wooden, and witless. As always, George Lopez played George Lopez as well as he knows how - with the voice of a badger and the personality of a telemarketer calling you on your personal cell at 9 o'clock at night. Some will say it's superhero fatigue. For myself, it's dumpster fire exhaustion. We need to get back to making great films for everyone. Great writing, acting and directing will always have universal appeal. Blue Beetle proves yet again that the Hollywood sludge factory is entirely incapable of providing it.",
    "17": "Yup that's how I knew the cringe movie was going to be as bad as it looked. This movie is just filled with cringe cliche stuff that they believe the Latino family is into. Blue Beatle needs his family to fight all his battles for him that's not surprising when you one these New Gen kids can't do anything without mommy and daddy holding thier hands and that's what this is all about. I was hoping this movie would do good too! Nope they had to ruin it with bad stereotypes. I guess that's fine stereotype it up man but BatMan is the Fascist.. I was wondering if they would take that out of the film cause they removed it from the trailers but nope they kept it in. They want to try a kill one of DCs best characters ever for a side character.. Go watch it if you love cringe cliches then this is the film for you.",
    "18": "There seems to be alot of these such movies lately where something incredible is chosen for someone to be great and the so called chosen recipient of the gift or blessing is so non deserving with highly irritating low self esteem that one starts to cheer for the bad guys instead to end the audiences' suffering. What happened to real super heroes like John Wick or Jack Ryan where they wear their battle amour with responsible conviction and honourable mission to do good without a second thought. This show comes off the lot to fill the ethnic diversity quota in Hollywood of recent push. Yes, by all means, but for goodness sake, arm such protagonist with more oomph and self pride and courage. All needs a dash of Bruce Lee to make this porridge perfect for all future Goldilocks.",
    "19": "Think this is the first ever Hispanic super hero. It's great to see different kind of super hero character. The CG is nicely done. The fighting scenes are exciting. The storyline is alright but I like the message behind the movie.... family is very important. And for sure there will be another sequence in the near future.I think this is the first ever Hispanic super hero. It's great to see different kind of super hero character. The CG is nicely done. The fighting scenes are exciting. The storyline is alright but I like the message behind the movie.... family is very important. And for sure there will be another sequence in the near future.",
    "20": "DC has not been having a good year with the films released in 2023. Blue Beetle is everything we've seen before, further reinforcing this tired and repetitive formula. This film again falls into the line of mediocrity, making it forgettable. The whole look of the film doesn't please me, it's sickening to see these extravagant lights and this soulless technology. The humor is forced in many moments and apparently the script doesn't realize this. They repeat the same jokes all the time trying to get at least one laugh, it seems like they try to make the joke stand out, but it's just unbearable every time it occurs. It's unbearable having to talk all the time about films like Blue Beetle. It doesn't deliver anything new or striking, not even striking in a bad way. The only thing that can be taken away from two hours of film is the Latin representation, which is indeed important, but at certain moments they manage to force even that, returning to stereotypes.",
    "21": "If this had come out in the early 2000s, this movie would have been better than it is today. The clichés are filled with a movie.There's literally nothing this movie does that other movies haven't done before. Oh the scene where the two love interests are on a bed talking, and they lean in for a kiss, and then just as they're about to kiss... Guess what happens, you're not going to guess it, right? Someone walked in on them and they acted like nothing happened. We haven't seen that one before, right?Oh and if the main character has a good relationship with the family, you probably don't know what will happen with them... Why you didn't even get close to guessing correctly! They get kidnapped by the bad guy! That's a new one, right?That's just two big points. It's just frustrating that writers haven't gotten past the 2000s when it comes to what makes the characters tick and stuff.Oh and Susan Sarandon... Boy oh boy. No.And also another oh, why does the fight scene at the end remind me of what a bad Transformers scene would be like?This was one of the superhero movies of all-time for sure. It was simply one of them.",
    "22": "Anyone who follows DC or even comics as a whole, knows how promising of a character Blue Beetle is in the comics-verse. Guy has been a featuring member of Teen Titans for decades, holding his own as one of the coolest drawn characters that has a very interesting backstory regarding an alien symbiote. The character had immense potential to be turned into a promising live-action film-series out of it. And frankly speaking, I think the cast choice was good as well - they could've pulled off the hype. The only thing that ruined this film, however, is the writing. It's terrible - felt so rushed and low-depth at some points that you'd feel like pausing to not continue watching anymore. CGI was bad for some parts too, but that can still be overlooked as most of it gets the job done quite well. But the writing, man, it's awful. DCU won't have much to build on if they continue doing such pathetic job at writing stories like this.",
    "23": "What was this movie actually about? Mexican immigrants and their sob story in the United States? I just could not grasp WB's plot here at all. Was I watching a superhero movie or a mash-up of Power Rangers mixed with Bollywood emotions among a group of Spanish-speaking immigrant people who think doing education brings you in debt ? I was completely alienated from the plot, story, and the general content. If immigration sob stories are what WB wants to delve into, they might as well make a documentary rather than enticing potential customers with this worthless content. My two hours, or whatever, lost into a worthless oblivion.",
    "24": "Blue Beetle is featured well in one of the Batman cartoons i think in the Brave and the Bold. In that he is a fun teenager trying to figure out his powers and how to help Bats. If you want to see a good representation of Blue Beetle i recommend finding this animated series. This movie kind of felt like Power Rangers on the CW network, albeit with a much higher budget. There was nothing to care about here. I think DC was stretching to find more characters to bring to big screen. He is a supporting character at best. It is a good comparison to Shazam 2 with all the focus on secondary characters. Both are a waste of money and a little on time. If you have nothing else to watch its ok.",
    "25": "Blue Beetle comes at a time where Multiverses are breaking and worlds are ending, but it stays in its own corner and maintains a strong, grounded story with family at the center. The entire main cast are the heart of this film and the hispanic family dynamic feels so real and distinct. I found myself deeply connected to their story and invested in their emotional moments as if I were joining them on the journey as well. While it can be said that the rest of the story feels very repetitive from previous superhero films, that would be the biggest fault of the film. The action, emotion, and unique style leave a very memorable mark on the current state of superhero film. Had this been released 15 years ago, it could've been as big of a hit as any MCU standalone film, as it shares the same quality of the likes of Black Panther, Doctor Strange, and Captain America. With the way superhero films have been, this is a breath of fresh air, even with the familiar taste.",
    "26": "Blue Beetle doesn't suffer from the ponderousness that weighs down so many other DC movies. It's lighter, more fun, and delivers the jokes, bright colors and nods to the ridiculousness that you want from a superhero movie, a slight improvement than recent DC movies.The movie has a big heart, ambitious references, and moments that make it an entertaining watch, but it can curdle thanks to the constraints of the superhero genre. The cultural specificity is also an asset but feels rushed in a format that, unlike the pacing of a series, creates a greater imperative to get to the next battle. Though it may have some novel elements, the franchise already feels tired, and isn't much more promising than recent DC efforts \"Black Adam\" and \"The Flash.My Rating: 5/10.",
    "27": "Let's start by just saying granny with a neon automatic gun. That says it all, 600 characters not needed. 4DX was pretty bad too. Bumps and shakes that just didn't make sense. Like a thud in the back when the door got kicked. Really, 4DX is trying to put me in the shoes of the door. Although as the characters were all wooden too, it probably wouldn't make much difference. I literally didn't care about any of the characters. They could have lived, or died and I wouldn't be bothered. Personalityless shells. Really silly film but also not funny, just lame. Usual poor Hollywood dialogue and unmemorable performances, with no story other than good guy has thing bad guy wants, bad guy chases good guy.",
    "28": "You've seen one, you've seen them all. Blue Beetle is about as cookie-cutter as the bombastic superhero mcmovie genre comes. This generic mishmash of the well and truly worn-out superhero template differs only in that it desperately tries to pander to demographic stereotypes and messaging. The origin story needs no description, you've already seen it a hundred times over in various films, tv shows or comics. Sarandon's mailed in performance as the villain was dull, wooden, and witless. As always, George Lopez played George Lopez as well as he knows how - with the voice of a badger and the personality of a telemarketer calling you on your personal cell at 9 o'clock at night. Some will say it's superhero fatigue. For myself, it's dumpster fire exhaustion. We need to get back to making great films for everyone. Great writing, acting and directing will always have universal appeal. Blue Beetle proves yet again that the Hollywood sludge factory is entirely incapable of providing it.",
    "29": "Yup that's how I knew the cringe movie was going to be as bad as it looked. This movie is just filled with cringe cliche stuff that they believe the Latino family is into. Blue Beatle needs his family to fight all his battles for him that's not surprising when you one these New Gen kids can't do anything without mommy and daddy holding thier hands and that's what this is all about. I was hoping this movie would do good too! Nope they had to ruin it with bad stereotypes. I guess that's fine stereotype it up man but BatMan is the Fascist.. I was wondering if they would take that out of the film cause they removed it from the trailers but nope they kept it in. They want to try a kill one of DCs best characters ever for a side character.. Go watch it if you love cringe cliches then this is the film for you.",
    "30": "There seems to be alot of these such movies lately where something incredible is chosen for someone to be great and the so called chosen recipient of the gift or blessing is so non deserving with highly irritating low self esteem that one starts to cheer for the bad guys instead to end the audiences' suffering. What happened to real super heroes like John Wick or Jack Ryan where they wear their battle amour with responsible conviction and honourable mission to do good without a second thought. This show comes off the lot to fill the ethnic diversity quota in Hollywood of recent push. Yes, by all means, but for goodness sake, arm such protagonist with more oomph and self pride and courage. All needs a dash of Bruce Lee to make this porridge perfect for all future Goldilocks.",
    "31": "Think this is the first ever Hispanic super hero. It's great to see different kind of super hero character. The CG is nicely done. The fighting scenes are exciting. The storyline is alright but I like the message behind the movie.... family is very important. And for sure there will be another sequence in the near future.I think this is the first ever Hispanic super hero. It's great to see different kind of super hero character. The CG is nicely done. The fighting scenes are exciting. The storyline is alright but I like the message behind the movie.... family is very important. And for sure there will be another sequence in the near future.",
    "32": "DC has not been having a good year with the films released in 2023. Blue Beetle is everything we've seen before, further reinforcing this tired and repetitive formula. This film again falls into the line of mediocrity, making it forgettable. The whole look of the film doesn't please me, it's sickening to see these extravagant lights and this soulless technology. The humor is forced in many moments and apparently the script doesn't realize this. They repeat the same jokes all the time trying to get at least one laugh, it seems like they try to make the joke stand out, but it's just unbearable every time it occurs. It's unbearable having to talk all the time about films like Blue Beetle. It doesn't deliver anything new or striking, not even striking in a bad way. The only thing that can be taken away from two hours of film is the Latin representation, which is indeed important, but at certain moments they manage to force even that, returning to stereotypes.",
    "33": "If this had come out in the early 2000s, this movie would have been better than it is today. The clichés are filled with a movie.There's literally nothing this movie does that other movies haven't done before. Oh the scene where the two love interests are on a bed talking, and they lean in for a kiss, and then just as they're about to kiss... Guess what happens, you're not going to guess it, right? Someone walked in on them and they acted like nothing happened. We haven't seen that one before, right?Oh and if the main character has a good relationship with the family, you probably don't know what will happen with them... Why you didn't even get close to guessing correctly! They get kidnapped by the bad guy! That's a new one, right?That's just two big points. It's just frustrating that writers haven't gotten past the 2000s when it comes to what makes the characters tick and stuff.Oh and Susan Sarandon... Boy oh boy. No.And also another oh, why does the fight scene at the end remind me of what a bad Transformers scene would be like?This was one of the superhero movies of all-time for sure. It was simply one of them.",
    "34": "Anyone who follows DC or even comics as a whole, knows how promising of a character Blue Beetle is in the comics-verse. Guy has been a featuring member of Teen Titans for decades, holding his own as one of the coolest drawn characters that has a very interesting backstory regarding an alien symbiote. The character had immense potential to be turned into a promising live-action film-series out of it. And frankly speaking, I think the cast choice was good as well - they could've pulled off the hype. The only thing that ruined this film, however, is the writing. It's terrible - felt so rushed and low-depth at some points that you'd feel like pausing to not continue watching anymore. CGI was bad for some parts too, but that can still be overlooked as most of it gets the job done quite well. But the writing, man, it's awful. DCU won't have much to build on if they continue doing such pathetic job at writing stories like this.",
    "35": "What was this movie actually about? Mexican immigrants and their sob story in the United States? I just could not grasp WB's plot here at all. Was I watching a superhero movie or a mash-up of Power Rangers mixed with Bollywood emotions among a group of Spanish-speaking immigrant people who think doing education brings you in debt ? I was completely alienated from the plot, story, and the general content. If immigration sob stories are what WB wants to delve into, they might as well make a documentary rather than enticing potential customers with this worthless content. My two hours, or whatever, lost into a worthless oblivion.",
    "36": "A kiddy, kiddy, semi entertaining movie with \"great\" visual effects and computer generated imagery, very good family interactions and with a lovely bada^^ super-pulimiot nana.Aside that, Susan Sarandon who still looks great and herself even after 35 years, some campy, cliche, a little predictable plots and sub-plots straight to kindergarten.It is entertaining though with basically bullet-proof everything and not one ounce of blood!Screenplay/storyline: 6Development: 7.5Realism: 6Entertainment: 6Acting: 6.5Filming/photography/cinematography: 7.5VFX/CGI: 8.5Music/score: 7Depth: 5.5Logic: 3.5Flow: 6.5Action/adventure/sci-fi: 6.5Ending: 6.",
    "37": "This is a great way to start off Blue Beetle (2023)! The first impression is that it had good jokes that I laughed along with. The whole movie revolves around a comedy-action movie so there was plenty of jokes to go around with. The acting was great with everyone especially Jamie Reyes/Blue Beetle (Xolo Mariduena) making him a likable protagonist. George Lopez playing as Uncle Rudy was my favorite character because he was basically the comedian of the movie. It was glad to see him back on the big screen. The cinematography with the special effects and CGI was good of Blue Beetle himself and there was a lot of blue and purple color schemes going on. It was fresh to see an old DC character getting his own movie. Director Angel Manuel Soto does a great job of portraying Blue Beetle's origin story off to the world. Overall, Blue Beetle is great with its acting, jokes, and action. I would recommend watching it in theaters because I am going for a second viewing!",
    "38": "I had low expectations of this film.I don't ask for much with movies, just for them to be mildly entertaining at minimum and have some heart. All the talk about bad CGI in the likes of The Flash I don't care about so much. I thought that particular movie was fine. Fun, had decent heart and some likeable characters scattered about who are at least trying to do things to move the story forwards.Blue Beetle however, is as bad as things can become I think when it comes to superhero movies. We have seen some terrible entries in the Marvel space recently as well with Thor 4, Dr Strange 2 and Black Panther 2 being very poor. Strange story choices, terrible villains and bad resolutions. In all 3 of those films the main super heroes are almost just background characters and no longer the focus.Blue Beetle is on that terrible level and this film makes even less sense I have to say and again the main superhero is relegated to be less important than he ought to be for some reason.Every character seems so unlikeable, except for the father. The sister talks about taking a big dump at her cleaning job after we first hear how the family struggles financially. Charming. The grandma ends up with a higher kill count than the super hero. The uncle is a computer wizard who drives a big truck but still can't help the family keep their home.This whole family, who can't make end's meet but who can do everything else when it suits the story just doesn't work in a superhero film. It is not convincing. Story wise I think it is fine/good if they can be there for support and guidance. But to physically take over I think is a crazy approach that doesn't land well at all, especially when the best person out of that bunch is the one who dies before all that takes off.After the father's death the family straight away uses all the abandoned (supposedly) Blue Beetle related gear as in a sort of kitted out ready to go endless Batcave supply. But then we also find out the original Blue Beetle host who that all belong to is still alive in the mid credits scene? Why are we doing any of this? It is all so dumb and never focuses on what the current Blue Beetle superhero could do for humanity.Susan Sarandon, as the baddie, phones in her performance to make things worse. An utterly pointless villain who has some vague mission to make her robot army more of a robot army with the Blue Beetle scarab thing.Furthermore, early on, we find out that the Blue Beetle suit / scarab that gets fused with our hero's body can actually run on auto pilot. So what is the reason to keep the host conscious in that case? The suit seems to make better decisions early on whilst the host succeeds in convincing it to stop it from killing baddies, who then when still alive cause his father's heart attack and death.Compare that badly thought out drivel to the excellent story in the original Superman movie where Superman can't save his father from a heart attack death. He has all these powers but couldn't do that. Reality sinks in and it makes him more determined. There is no such character arc here at all.I didn't like any of what was presented in Blue Beetle story wise or character wise. There isn't 1 thing I can tell you I liked.There have been far better small budget movies this year that should have enjoyed more popularity over this endless superhero nonsense in which we constantly have to put up with lower quality story telling and horrible characters. Some good films I saw recently this year that may have gone unnoticed are: Talk to Me & Sisu. If you're after a big movie go see Gran Turismo.Look for those and give this tripe a miss.It has not been a bad year for movies I think and this hopefully is as low as it can go cinema wise.",
    "39": "This might have been marginally toleranle in the 1980's, but is a complete waste of time now.The family is far too loud, pointlessly obnoxious, and far too stupid. In fact, everyone is just too stupid. Combined IQ of all the characters apoears to be 80.Cheezy bad guys, really dumb dialog, uninspired fight scenes. So-so cgi. Just utter drivel. All mportant (and potentially interesting) points ignored entirely or glossed over without follow-up in favor of more obnoxious family stupidity, and more excessive and pointless noise (screaming, yelling, everyone talking at the same time so any conversation is just meaningless noise) Honestly, don't waste your time.",
    "40": "This might be the worst Superhero film I've ever seen, extremely cheesy, action is low budget and actors did an okay job. Definitely geared towards children (like the fart scene).This is supposed to be the 1st film of the new DC/James Gunn universe, which is really disappointing.I noticed a ton of action/sequences that were ripped off from other movies too (Man of Steel, Spider-Man, etc), humor felt very dated and acting felt forced. I had high hopes, trailer looked kind of fun, but the movie went down hill from the start and just got worse and worse.I hope things turn around for DC, I really do.",
    "41": "Blue Beetle works well for what it is trying to be, a fun time a the movies that you won't be thinking about once you leave but during the time you're watching it, it'll keep you engaged and entertained for its runtime. The family dynamic works wonderfully and while a few moments can be a bit on the \"childish humour\", most of it came off as charming to me. In tone, it's the closest to the first Shazam film and a similar degree in quality as well. The suit looks great, the fight scenes are cool and the story is unfortunately, generic. The niche fanbase of Blue Beetle will definitely enjoy this one as it is one of the better DC heroes debut and a much big screen debut than a certain other, much popular hero dressed in red who runs fast. If you'd have told me a few years earlier that I'd have a significant better time with this than a Flash film, I would have called you crazy but here we are...",
    "42": "DC Execs to writers : Just take the original Iron Man story and mix in a bit of Ant man and sprinkle a bit of Spiderman and let's call it a day or in this case Blue Beetle.Blue beetle is just a very poor implementation of some of the biggest blockbusters Marvel has given us over the years. There is really nothing good to say about about this movie. Neither the story is good nor the characters. Story as I mentioned is a bad mixture of the marvel movies and so are the characters and the actors. They tried to make the lead actor as close to Peter Parker as possible but he fails to deliver and the same goes for Luis from ant man and wasp character from Ant man.Do yourself a favor and save your time and money and skip this one.",
    "43": "A very generic superhero movie because of how many of these have been coming out and yet it manages to be a fun one with some nice touches in it. The Mexican-American culture feels properly ingrained into it and the comedy works out well because of the heart in it. The lead actor was pretty charming and his family was also really lovely in their roles. The Blue Beetle suit looks incredible because it's mostly an actual suit rather than complete CGI and the hand-to-hand action looks really nifty. The director knows how to properly compose scenes, with proper length in drama and action without chopping them up. But still, the movie is a pretty straightforward superhero origin story with only a few bits and pieces of freshness in it and some tried and tired cliches. Overall, this is only for those who really enjoy superhero films in general. With the superhero fatigue, it's no wonder there were only like 10 people in the theater.",
    "44": "Everything about this movie is so clichéd and generic.And for a 2023 movie, it looks so average. And I can't believe Oppenheimer's production budget was less than this trash by 20m!.Mediocre acting , awful writing , laughable villain. Couldn't you try something different for the villain's motive?I think the end for the superhero movies becomes more clear with every new installment.I'm not asking for you to make a masterpiece but atleast show me that you are trying to provide a work that stands the test of time, I went to watch The Dark Knight just after I finished watching this trash and the difference is absolutely laughable tdk has better visuals and it came out 15 years ago! ( and the marketing of dc claims that their movies are the best since tdk with every movie they release)From this stage I will stop watching any new dc project until I hear something good about it.",
    "45": "A real disappointment. The creators had a \"message\" they wanted to hammer home, and there was this mildly interesting story they decided to hide the propaganda in.The execution had promise, especially with the excellent reactions of the lead actor to being the unwitting/unwilling recipient of a forced integration with the alien life form (think...a nicer version of \"Venom\").Lots of laughs there, but they kept hammering the propaganda into any gap in the CGI action. You know, all the evul white peoples keeping the saintly People of Color down. Because all the people of color were either unappreciated (and unexplained) geniuses, Saints-in-Training, or the Oppressed with Hearts of Gold. Meanwhile the forces of Darkness were part of the white power structure that owned the courts and the police, and were even (SURPRISE SPOILER!) responsible for creating the villain's henchmen.Who could have seen that coming?Man, it was stupid. To say nothing of how the dipshit uncle character (a fitfully funny George Lopez, when the script allowed it) could control an aging superhero's all purposed vehicle just because he was another one of the story's \"Magical Latinos\" and the writers/director were too stupid or lazy to come up with even a minimally logical reason to explain why.Also, the Hero/villian CGI designs owed a LOT to Transformers...they should really cut Michael Bay a check for his stolen creative input.",
    "46": "Blue Beetle a DC super-hero - seriously? Unless you're a comic book geek (like I once was), you probably never even heard of the character. Believe it or not, the original Blue Beetle was created in 1939!, appearing in Fox Comics, later owned by Charlton Comics. The character, along with all the other Charlton super-heroes were sold to DC in 1983. Which doesn't clarify much if you're not into that whole scene.So, it's not surprising that this flick is already streaming on MAX, just a short time after its theatrical release a little over three months ago (as I write this). I don't know if that's a record or not, but it does say something about the quality of the picture. Quite honestly, this can be a fun film for young teens, sort of a Spider-Man knockoff if you consider the number of 'legs' the character has when it transforms into the Blue Beetle. It's got that kid from 'Cobra Kai', Xolo Maridueña as the title character, so this could be a nice career bump for the young man with his talent and good looks. He's backed up by an almost entirely Hispanic cast, with an unrecognizable George Lopez portraying Jaime Reyes's (Maridueña) Uncle Rudy supplying the story's humorous moments. Adriana Barraza is a trip in the role of Jaime's Nana, though I did have to groan when she took up with that monstrous machine gun going up against the army of baddies.Although the post-credits scene suggests a sequel, I can't see filmmakers delving any further into the DC Comics B list of super-heroes, when even \"Shazam! Fury of the Gods\" and \"The Flash\" failed to set the box office on fire. Films like this one test even my patience in trying to be a super-hero movie completist, a sentiment that extends to the Marvel Cinematic Universe as well as DC.",
    "47": "This has the usual good guy versus bad guy formula. In this case it's a Hispanic hero, which is OK except why they make him such a weenie. Lots of nice CGI, gadgetry and imagery and the acting cast is OK George Lopez is funny and does an excellent job as the uncle but he's really the only bright spot. It's getting to be a little trite that all these endowed characters who have superpowers are just lovers and babies at heart no sense of self preservation no sense of duty and not much honor. It would be nice to have this kind of superhero who understands there are things you have to do in order to protect those who love and care about. All in all just a waste of time.",
    "48": "The Blue Beetle movie redefines the word \"cringe.\" From its painfully cliché dialogue to its cringe-worthy attempts at humor, every scene makes you want to crawl under your seat. The wooden acting and lackluster special effects further cement its status as a cringe fest. The plot, if you can call it that, is a mishmash of tired superhero tropes and predictable twists. The forced romantic subplot is cringe incarnate, with zero chemistry between the leads. Even the costume design seems like a bad cosplay. In a sea of superhero hits, Blue Beetle manages to stand out as a cringe masterpiece that's more likely to induce eye rolls than applause.Dont even go to the movies wait for the digital release\nSuch cringe !!!",
    "49": "WORST SUPERHERO MOVIE EVERI honestly want to meet people who gave it a 5 star rating.Forbes, Rotten Tomatos all are giving fake ratings and reviews.Only box office tells you the truth.About the movie:\nChildish, not at all a superhero movie, it should be called a \"super family\" movie.Grand Ma was shooting with big gun\nUncle was a genius tech guy\nUncle and Mom both were able to fly an Alien Tech plane, not only that they seemed to know each and everything about the plane.Yet their home was on morgage and no one was earning lol.Everyone was superhero in the family except the hero who supposed to be superhero.No heroic moment whatsoever.DARREN CROSS (ANT MAN VILLAIN) SUIT\nIRON MAN 3 VILLAIN ROPE AND SUIT + IRON HEART SUIT + ENDGAME IRONMAN SHEILD\nCUTTING BUS IN HALF LIKE DR STRANGE.Etc etc.",
    "50": "Doesn't mean the director is Mexican she is needed for the job. The director has just made 1 movie and that's it! What is DC thinking???All about the family but really unnecessary! Aiding him to battle is a no no! Especially that grandma oh my goodness! Plus having Ted's daughter introduced when she is non-existent in the comics is a bad move too. They should rather have Ted instead to mentor Jaime. And maybe, just maybe we get to see a Blue & Gold movie which will suck coz Gunn is running the show.Khaji-da is not a female TF! Also, that scarab at his back is waaaaay to BIG! Don't get me started on OMAC! Isn't he a hero? And got his powers from Brother Eye made by Bruce Wayne? And he's a cyborg too not a human transforming into a war machine!It was an ok movie. It does not deserve a higher ranking above 6. Maybe a flat 6. Or 5!",
    "51": "Generic movieBad acting\nBad supporting cast\nChildish comedy\nThe final fight was pretty entertainingno idea why the story was based around the annoying family, hardly anything to do with blue beetle himselfhe just gets kidnapped and his mum and grandma and sister save him!??Character deaths meant nothing because they were annoying and you didn't careCliche villainRipped off key moments fromBlack panther\nSpider-Man\netcNothing original in the story, it became about girl power instead of blue beetle learning to use his powers??His uncle or cousin \"Rudy\" is absolutely awful as a character and actorThe sister is equally as annoying and tries to be \"edgy\"",
    "52": "I can not recall ever seeing a film with a predominant cast of an ethic origin, with a script that is inclusive of said ethnic origin, with a director (who is supposedly of the same ethnicity) completely make a mockery out everyone.This was awful on all levels. I stopped watching after about 35 minutes in. I'm not even Mexican and I was extremely offended and embarrassed by the stereotypes portrayed here. Let me get this straight Warner Bros-you dopes ran away Zack Snyder and pretty much everyone else involved with his vision of the DCEU that had a more mature tone but you guys were gitty over this nonsense???!!!Good god...",
    "53": "This script was about trying REALLY hard.Lots of silly joking and over acting, even by Susan Suranden (so?).The idea and concept was great. But it got political when it talked about the plight of the poor and Hispanic opposition which was a bit frustrating.Spoilers ahead...They talked about losing their house when Uncle Rudy drove a $60,000.00 truck and had some high tech toys. Ummm could have made bills. Mom, grandma and daughter could have been working? I found that off. I mean, they could have even moved. I was annoyed by that plot narrative.They could have done without the patriarch dying in the plot. He could have been in the hospital recovering and that's where they decided to get Jaime.The dream sequence could have Jaime meeting Ted and Ted saying take care my daughter and done tricks about defeating his sister. That would have been better and nicer.Overall, as an adult, I was bored. But my kids enjoyed it a lot. But they were at the same understanding as me about the whole losing the house thing. They didn't get it either. My family understands hustle to make bills so they though the sister was being lazy.",
    "54": "#bluebeetle #MovieReview Typical superhero movie. There is nothing new that this movie brings to the table. It is similar to other superhero films but now with a Latin flavor. It is pretty funny though and there are alot of Latino/Hispanic references. The film is for everyone but the word \"pendejo\" is used alot, so a small warning if you don't want little kids hearing that. The best part of the film was the family. The movie shines whenever they were together. Villains were not memorable or interesting. The love interest feels forced and not natural. The acting was good. Overall it was\n7.5/10.",
    "55": "If you go in expecting a fun light hearted superhero movie that is what you are going to get. Only complaints are the tonal shifts. His transformation feels like a horror movie transformation and the hero of course doesn't kill people (rolls eyes) but that rule doesn't apply to all the other good guys. They violently kill and make jokes about it. One of its biggest issues is how it is supposed to connect to the DC universe going forward. It doesn't do anything to answer any of those questions. Then there is the racial undertones that seem unnecessary and hurt the movie and again push the us vs them issue instead of trying to unite people. At least it was sort of subtle and could be missed.",
    "56": "Just saw \"Blue Beetle,\" and it was fantastic! I was pleasantly surprised. Coming in a little skeptical because DC has a few clunkers and feeling a little jaded from superhero movies, I have to say I really enjoyed this movie. \"Blue Beetle\" did what the best superhero movies do: focused on character development and people to root for. I LOVED the cast, from the kind-hearted dad, to the sarcastic sister, to the spunky grandma. The actor who plays the protagonist (love him in Cobra Kai) did such a great job in the lead role. Step aside, Fast and Furious franchise; THIS is how you incorporate a \"family\" theme into your movie. I laughed and I cried several times throughout. While some of the superhero elements have been done before, the blue beetle suit was pretty cool. The soundtrack was good, and Susan Sarandon did a great job as the villain. I have to say that this DC movie is by far better than many of its predecessors.",
    "57": "Blue Beetle could be the worst DCEU movie ever in par with The Flash. It's like two movies smashed together. One movie tries to show the new Blue Beetle origin while the second movie is based on George Lopez annoying comedy performance which gets old really quick. The whole movie makes a mockery of the Hispanic family portrayed as annoying and insufferable. I finished watching the whole movie in hopes of a positive spin but that never happened. Stay away from this movie. If interested in watching wait a few weeks, it will probably be on MAX soon enough.The villain in this movie is just there to fill the spot. Nothing special about it nor should you care for it since it has no effect in this movie.Nothing about this Blue Beetle movie is worth to talk about, celebrate or remember. STAY AWAY!",
    "58": "My Reaction / Review for Blue Beetle (2023): So Jaime's family is about to lose the house? That sucks. Jaime looks like a very humble guy, I like that. Wait so it was that easy to steal the scarab? Wow, the first time that the scarab connects to Jaime it looks like a freaking horror movie. Why did he have to cut that bus in half, the scarab could easily avoid it, that's very dangerous with so many people in it. The scenes where the scarab gets activated for the first time were pretty fun. Rudy is a bit too much, its like he is screaming for some reason in every scene. So the uncle has some super tech that messes with the electronics and cameras? How convenient.Also they go to Kord industries and there is no serucity or anything? That's dumb. Wait so Carapax has a scarab too or some other technology? First hour is decent, a 6.8/10 I would say, let's see if it gets better or worse. Wow there is no way to get rid of the scarab, its for life, that's kinda cool but at the same time it sucks. The dad is dead? Now its personal. Damn the dad's death made me emotional. Many times they talk in spanish, I would really appreciate some english subtitles but there are none... So now Rudy knows how to fly a spaceship? That's ridiculouus, this man can do anything the plot wants.So now the grandma joins the fight? Cant take this seriously. And now the grandma shot three soldiers, so cringey and ridiculous. The 2nd half is so bad so far. The villain(s) in this movie are so not interesting. OK here is my conclusion. The movie is not bad but it is not great. The whole family thing was too much at some point, the humor is mostly bad, the dialogue could be better, the action scenes mediocre. The only thing I liked was Jaime's character. Overall a mediocre movie, its also like you've seen everything before and very predictable. My final rating is a 6/10.",
    "59": "Mc doesnt even act like he does in the comic. The sister, mc, and jenny cords acting was pretty bad. I think the movie would have been better without the sister in it. It hurt to watch the mc make so many wrong decisions like how he drops his guard eVERY sINGLE time. I cant.Aside from plot and acting the graphics are great. The suit was rendered nicely, lighting was always good, action sequences, scenery was always exciting to watch. Feel like thats what a movie should be like, uk the bare minimum.The script hurt my ears. I dont know what they were going for? But majority was corny and cringey...all the urk feeling stuff.",
    "60": "Yawn. Is it over yet? This yet another of Warner Brothers DC Universe movies that just keeps dragging on and on. The movie is an origin movie that isn't quite an origin story. It tries to be overly fun. At times it works. Other times it just falls flat. The acting is reason le but the script is lacking. Action sequences range from decent to subpar. It has become the standard for both DCU and MCU movies to achieve at best mediocrity in recent years. As with other movies this brings nothing new to the table. It relies on its special effects rather than a great storyline and script. Unfortunately for DC you just keep missing the mark.",
    "61": "It's getting worse and worse since the conclusion of Nolan's Dark Knight trilogy... this was so bad I had a tough time telling if it was another lousy MCU filler. I actually had to double check if it was actually DC's doings even though there were a few quips about the Flash and Superman.Not joking when I say this script is almost a dead ringer for Venom... just swap out the black booger for a blue roach.Can we PLEASE get back to quality writing, directing and acting? Actually I'm not even going to say the acting was bad. The script was so bad there was just nothing they could do about it.",
    "62": "Tons of heart with predictable action/story beats. Interesting set design/locations. The visually effects were on point, and usually you can notice blue screen etc. The family dynamic makes this film worth watching. The superhero tropes are a bonus. Not sure I enjoyed the lore surrounding the scarab. It was very minimal in that regard. Xolo as Jaime Reyes was awesome. He was fantastic. It's too bad this movie will be caught up in this reboot storm that is the current DC Universe. Susan Surandon was hilarious as the villain. I would like to see a follow up of some kind just exploring Jaime, and the scarab.",
    "63": "I knew nothing about this superhero. He's very old. I went to the cinema without even watching the trailer of this movie. It was so fun. It handled the family theme very well. A Hispanic family is similar to the general concept of family in the country where I live. This movie was fun, I had a lot of fun at the cinema. The jokes weren't bad. There were a lot of cliché scenes and themes, but recent superhero movies have been duplicates, but this movie just didn't feel like that to me. Acting was ok. The family was very good and funny. The CGIs were sometimes ok, sometimes bad, but overall I really liked the movie. I really want to watch the second movie of this character.",
    "64": "Empty, full of cliches, you cannot tolerate it. It is one of the worst productions I have seen in my whole life. What a waste of time. Keep away! The cast is bad, the script is worse.. The characters are joke and intolerable.. I have not written a comment in IMDb for more than five years but I should write this for anyone who thinks watching this thing. Sorry but I cannot call it a movie.. I will not be fair for good ones produced with hardwork. I do not recommend anyone to spend their time watching it. You can do anything else and believe me it will be spending quality time compared to watching this movie.",
    "65": "Not so super. If it wasn't for the Rudy and Nana characters I don't know if I would have made it through the whole two+ hours. I like gritty superheroes. That was not the case with this. Most of the acting was over the top and annoying. The comic relief was cause for painful grimacing. I think DC should just stop making movies, because frankly, they suck at it. Only Aquaman & Wonder Woman had any depth and angst and protagonists that made me care. That's the crux of it all isn't it? Investing and caring about the characters. If you can't pull that off then why bother making the movies because they will just be hollow.",
    "66": "Every demographic now has its own superhero film. Regardless of how frequently certain elements have been recycled, they can be reshuffled and infused with cultural motifs. If you're a fan of leisurely-paced, lighthearted action intertwined with strong familial themes, you might appreciate this emotional blend. Personally, I found it overwhelming.Every demographic now has its own superhero film. Regardless of how frequently certain elements have been recycled, they can be reshuffled and infused with cultural motifs. If you're a fan of leisurely-paced, lighthearted action intertwined with strong familial themes, you might appreciate this emotional blend. Personally, I found it overwhelming.",
    "67": "A Spanish language version of the Spider-Man, this movie would've been old back in the 80s. Not much of a plot line. Doesn't get bit by spider, No. You're only attacked by a blue beetle mechanism. This movie also takes a little bit from Iron Man, the first movie. This is more like a Disney afterschool special in the 80's. It only grossed around 100 million and that as much as it cost to produce. If you seen this movie once, I can guarantee you wouldn't be interested in seeing the sequel, but if it was produced, well, if a sequel did come out it'll be the first sequel that will be better than the original original.",
    "68": "This movie was an absolute disappointing pile of crap. Hollyweird at its finest shoving PC garbage down our throats. The plot is so simular to all other super hero films. It drags allt, the comedy is just plain and simple BLAH. George Lopez is just not funny. If this is part of Gunn's new DC reboot, then his other reboots will probably fail. The worst start to a reboot group of films. My wife, who is a native Spanish speaker thought this film was really really bad. I hope to hell there isn't a sequel. I don't have a problem with the actor choices, but even the dialog and acting was really bad.",
    "69": "We've already had a fantastic Blue Beetle in the Young Justice series with so much character development and world development, neither of which were present in this film. What we did get as a lot of fancy CGI, lazy writing, and what should be an offensive quantity of stereotypes.One of the things that made Blue Beetle so interesting in Young Justice was both how overpowered/lethal the scarab was, and how fundamentally peaceful Jaime was. It's a fine line that this film thoroughly muddled at every opportunity. Cutting a bus in half that just so happens to result in no casualties before this dynamic is even set up? A \"systems check\" that needlessly endangers the host, just because it's fun to film? Magically rubber weapon to knock down soldiers at rocket speed? Mass effect weapons that happen to be completely non-lethal? A scarab that internalizes the importance of non-lethality just in time to stop Jaime from making a good kill?While there's nothing wrong with including cultural elements, it was blatantly obvious they were not only jam packing as many tropes as they could, but forcing them where they don't fit. For instance, it's perfectly reasonable to accidentally mispronounce \"Jaime\" when it's written, but does anyone ever repeat back \"Jamie\" when they're hearing the name for the first time? Does anyone in a suit ever get dismissed as a delivery driver for the color of their skin?How was Jaime becoming Blue Beetle something so crazy and foreign in one scene, and then cut to the lore of the previous Blue Beetle? Might we have introduced this backstory some other way than lazy dialogue walking through a room of old props?This movie is a complete waste of time and should not be watched by anyone for any reason. Feel free to reboot Blue Beetle immediately.",
    "70": "This movie is waaaay below the expectations. Worse than Black Adam or Flash. The target audience is like boys between 8-11.Characters are boring, the main character/actor has zero charisma. Story is something that a beginner writer writes on an afternoon. Jokes are lame. The armor looks too much like Ironman, and the awkward reactions/interactions were borrowed from Spider-man/Deadpool. Warner management (after many failures) still thinks they can save money on writing the story, because it's super hero era in the cinema, and people automatically likes everything about super heroes.It's truly the time to say goodbye to the DCEU.Let's hope James Gunn and the AI will adapt the characters better, and write enjoyable stories in the next years.",
    "71": "I really enjoyed the movie and the realistic depiction of a Hispanic family. I thought the jokes were funny and well done, the Villain could've been better but I also liked the action and realism in the fact that it took him time to figure stuff out and he wasn't just awesome right out the gate it had a good range of emotions too.The script was decent, a little more character development would've helped but overall it was enjoyable and I think it makes for a great family movie night. Also the soundtrack was excellent and versatile. They put together an eclectic mix of Hispanic tunes new and old.",
    "72": "Blue Beetle is amazing! I went to the premiere and I had really low expectations, I admit that. When the movie started, I started laughing a lot and thinking the movie was really good.The actors are amazing such as the action scenes! I am not a great DC fan, but this movie made me like her more. It's a great film with great action and great CGI. Really entertaining and it's going to captivate you and your attention.The story is a great story, I think it's a great adaptation from the comics...\nBlue Beetle is one of the best super-hero movies ever, and one of the DC bests.. go watch it, because it deserves you attention.",
    "73": "Thank you DC, you have finally made a film that makes Green Lantern look quite good, which is saying something given how poorly served the character was in it, just the plot and general story telling, not the acting. Blue Beetle however has everything, terrible acting, almost a plot, almost but not quite, sub standard effects, a swing and a miss in every department. Who knew that super heroes (I use the term very lightly) did a \"Take your family to work day\" tragic in every meaning of the word. Too many histrionics from all concerned, if squealing, screaming and shouting were super powers these guys would be the tops. Not sure who this is aimed at, someone who has never seen a film before maybe, it wouldn't encourage them to watch another. Luckily it still isn't the worst film in the genre, that honour goes to Wakanda Forever, awful acting, stinking CGI, and worst of all the bastardization of what should have been an homage to one of Marvels original characters, Namor, The Submariner, shame on them.",
    "74": "At some point, maybe Ragnarok, studios decided that humor had to play a major part in superhero movies. There were some fine actors in this film, a few of them had decent performances, but it's like a script was written and entire characters, their sole purpose being comic relief, were written in. Blue Beetle's sister actively took away from the plot with every scene she was in. George \"Batman is a fascist\" (an actual line he said in this movie) Lopez wasn't far off.It's a real shame too. Lately super hero movies have devolved from a heroes journey involving a chosen one, someone with special qualities, or someone who earned their superpowers into meh, this person will do, and this is no exception. The suit just kind of chose him because it wanted to.The actors deserved better.",
    "75": "I still had high hopes when people were complaining and screaming to put an end to superhero movies a couple of years ago. This genre seems to be the new trend just like zombie movies about a decade ago. Now, after so many disappointments, I believe this is it for me.. Blue bettle is all of the following: weak plot, boring, predictable, horrible acting, crappy writing, and much more... Another thing that bothered me about the movie was the constant screaming and chaos that is supposed to be representative of a Latino family perhaps? To me it was just a way to mask the lack of solid acting and a solid plot. I'll never understand when writers, directors don't even attempt to convince us to believe in what we're watching.. The movie isn't a comedy, at least not to me so grandmas kicking special military units ' butts isn't going to fly with me. I thought Black Adam was mediocre, this is just plain bad. Last point.. I don't understand why it's even pg13? Just because they felt the need to throw a few curse words around? Urgh..",
    "76": "I can usually enjoy movies that others may pick apart. This one made it very hard to keep watching. It fails so badly on so many levels. I don't mind a Hispanic hero but the way they portrayed the entire Hispanic portion of the cast was to take every stereotype you can think of and max them out. I can't believe the actors were not offended and did not quit. That is just one of many horrible things about this movie. The writing, the not scary at all villian lady, the way the writers had the characters constantly act and do incredibly stupid things, etc. I would say this is campy but it doesn't come across as a good campy.Thankfully I didn't pay for it, watched it free on max.",
    "77": "Another DC failure. Thought I was hoodwinked into believing it was for adults when really the audience aimed at were 10-12 years of age. Childish, utterly child-like in its storyline.Stereo-typed Mexicans made out to be annoying and stupid. Maybe while the US doesn't want them to be citizens if we go by this story. And having a 70+ years grannie wielding a modern sub-machine gun is old fashioned and cartoonish. Nothing new, original or funny in the movie.There are way too many 'cartoon-hero' movies being released today and eventually they begin to repeat storylines and themes, as is the case here. Watch if you're a sci-fi addict. Bored with nothing else to do or forced to view, but can't see any real reason why anyone would want to waste 2 hours watching Blue Beetle.",
    "78": "This is a new low for the genre. This movie has zero original thought and they try to hide it in a near offensive level of Hispanic stereotypes.Not all Hispanics are poor, nor do we somehow resent white people if we are. I don't constantly sing and dancin. I don't have a crazy uncle with a truck named \"Taco\".Get it!!! Taco Truck!!! That hysterical, said nobody...Seriously the only stereotype missing is the 4ft crucifix on the wall. A joke perfectly pulled off by the late Matthey Perry in the movie Fool's Rush In.And unfortunately there is Race Baiting. Intentionally mispronouncing of Jamie's name. A baddie (Susan Sarandon) who intentionally calls her Hispanic worker by the wrong names. A reference to a grandmother being a guerilla rebel fighting white imperialists for no reason except to explain her being able to use a belt fed cannon like Jesse Ventura in Predator...Nothing but pieced together but of other superhero movies. Leaning heavily on Iron Man and Spiderman.I almost want to cheer the inclusion of O. M. A. C., an obscure comic that I used to read. Untill I saw that what was a living breathing character wast turned into yet another cybernetic soilder suit.Iron Man 3 anyone???Then the made the OMAC suit a inexcusable copy of Maximilian from The Black Hole. An obscure act of plagiarism, but a blatant one.",
    "79": "Couldn't this money have been spent in a better way?If I was mexican I would resent the way the way the family are portrayed. Yes with love But simpletons and basic.Too much CGI, terrible villain as mentioned in other reivews and doesn't expand the scope of the DCEU so you just feel like it doesn't matter and there are no real stakes. Some nice.visuals but it just feels like a cheap Spiderman meets iron man film that panders to an emerging Latino market.Go and see the Barbie movie again instead and just don't waste your time with a film about s nobody superhero who does nothing. Thank god for James. Gunb.",
    "80": "Everyone knows this is yet another dud by dc by now. But after hearing some positive buzz i thought i'd give it a chance. But nope. Its just another superhero movie.What it really is is just Ironman meets Spiderman. No one really cares about this character so they would have had to do something special to make the movie great. But they haven't. Cobra Kai's Xolo Maridueña is likeable enough as the hero. But everyone in this (except Susan Sarandon) is the hero. Either that or they're an annoying \"comedy\" sidekick.At least the action starts overshadowing the lame jokes at the half way mark. As before that its just the character getting thrown around as he discovers his powers. But even later its just robots fighting. This is something we've seen a hundred times at this point. But at least the hero doesn't fight Susan Sarandon in the finale.So i guess it could have been worse. Its not completely awful. There's just too many superheros now to care about this familiar feeling one.",
    "81": "I understand this film was made for US Hispanic folk. And it is specifically adapted for that market. But it is an English language film. It is a DC film. You'd expect it to be accessible for all. You'd expect it to be good? It's not. The original Blade movies were a good example of a minority lead, but, accessible to all.It's not a kick in the shirt tail away from being a toddler's film. It's very simple minded. If you're over 8 years old you may find yourself bored. It's poorly put together and the acting is terrible. I mean, bad.It's just really unimaginative & simplistic.There's not much more to say. When I say accessible, I mean to the majority. Basic working class folk who care about food on the table & a roof over their heads. Give them something good. Something to escape into. Something relatable. But don't be condescending.",
    "82": "I found Blue Beetle as the most basic teenage superhero origins story that are no longer special, and it leaves me no impress whatsoever because we all already way too familiar with this type of story, it's predictable and literally nothing new, it's bland and the action was boring, my face was literally straight the whole time, and the villain was also meh, what i like about Blue Beetle was the family dynamic that's definitely there, and the family itself as their own was good enough, Bruna Markuezine was good, including Xolo Maridueña himself was good and just if his story wasn't the same like most of teenage superhero origins story, Blue Beetle would've been something else because what i do like again was some of the cinematography, editing, the Blue Beetle suit was amazing and i really love it, and the special effects for the most part was good, but again overall i just can't found something new in terms of story, and it would've been just an ok movie but it's too bad that the action was boring and the comedy also didn't work, the villain wasn't that good, so it is what it is unfortunately, Blue Beetle is not a bad movie, it's a basic teenage superhero origins that fills with ok performances but a predictable and unoriginal story and also boring action and uninteresting villain.",
    "83": "College Graduate Jaime Reyes is chosen by a powerful Alien scarab beetle to be its host, bestowing him some amazing powers.I honestly started to question whether or not superhero films were no longer something of appeal to me, but I see from several reviews, that some people have a few similar problems thay I had, it felt like a Spiderman knock off, a not too successful one.I'm actually surprised that it was given a theatrical release, it seems more like one of those films that would silently make it's way onto a streaming platform, then just vanish into obscurity.I had no issues with the acting, Xolo Maridueña was pretty good, and it was great to see Susan Sarandon.The story was the major problem, we've seen it all before, it's a formula that's simply been done to death, and so much better, it offered nothing original.As a character, they might as well have done Wind Man or Giraffe girl, they'd have been so much more interesting.4/10.",
    "84": "This is the worst thing I have ever seen. I'm not into the cancellation system kids have nowadays when there is prejudice or when it just looks like there is prejudice at stake but I think who wrote this doesn't mean it, maybe it was really written by a 10 year old.The stereotypical Latino family thing that reminds me of a Fast and Furious surrogate scenario but with clowns instead of braindead glorified criminals.I just want to regurgitate after watching this. My eight year old was bored like hell. She is way smarter that the guys who thought this was a good idea. The portrayal of the Latin community showed here isn't very serious. Off course there are happy positive resilient people in those communities but taking every stereotype and put it all at once in a family and making them look like the jesters is really annoying. This wasn't a fun movie, it's forgettable, it's the same old story again, it's meek, it has no villain , it's meh...\nI wish superhero's could be treated more seriously than what they are getting this days. If you looked to South Korean show \"Moving\" you could learn a thing or two but no: the american paternalistic media society will only take that show and do a remake just because in their deranged conceptions Americans can't read and a foreign language is too annoying and capable of brain damage or creating communists or democrats as they call it there(Lol). Anyway, having a Batman (after Nolan) isn't enough. DC is way more childish and the CGI is always the worst but Marvel movies ,although better like their comics always were, are getting seriously damaged by the idea every hero needs to be Deadpool or Spider-Man copycats.Once again ,DC has shot itself in the foot, wait...it blew both feet with a single shot.",
    "85": "The dialog in the very first scene was so bad that I couldn't help but laugh out loud. I hoped it would get better, but it didn't. Every line Susan Sarandon's character says is some of the worst written dialog, and not even her acting chops could salvage it. But it's not just her character, the entire movie is full of terrible exposition presented in what seems like the laziest manner possible.The plot is paper thin, too. The only thing the main character wants is money to save his parent's home. Everything that happens to him is caused by happenstance, serendipity, or a ridiculously hard to believe contrivance. I was given no reason to root for any of these characters.I did like how they tried to develop the family dynamic, and I was hoping I could rally around that, but even that was clunky, at best. I had the urge to walk out from the very opening scene, but I forced myself to stay for nearly an hour. Eventually, the urge became too strong and I could no longer overcome it, and left the theater about halfway through.I'll give this a 3/10 because the actors were trying their best with what they were given, and it really showed in their performances. I especially enjoyed George Lopez's performance, but it wasn't enough to save this film. I also thought the CGI was pretty good (except for the shot looking up inside the Kord building, that shot looked rough).",
    "86": "\"Blue Beetle\" is simply B or even C grade super hero movie with some charm along the way. I don't think it will be realistic to expect something else to be honest. The trailers showed that pretty well in my opinion.The tone of the movie is close to that of \"Shazam!\", given the fact that the family got bigger role in it again, that said the story is not all that good. Not that \"Shazam!\" got some epic story, but I think it was one idea better.The cast is fine, maybe the best part of the movie is the family dynamic, except when they lean too much to the melodrama side. Xolo Maridueña as Jaime/Blue Beetle and George Lopez are the standouts no doubt.The villain is everything you ca expect from B grade super hero movie, from the introduction, through his motivation, the fights and the conclusion is nothing particularly memorable.I must say the suit looks great when is practical and not CGI all over the place. There are some cool fight scenes with our protagonist, most of which are shown in the trailers, which is kinda of a shame.There are plenty of jokes in the movie, but for me, most of them doesn't land. I mean they are too childish. I guess the younger auditory will laugh out hard, but me and my cinema crowd were silent most of the time. Of course there were funny moments, but don't expect \"Deadpool\" level laughs if you are a bit older.The movie is not bad, but it's kinda cringe, predictable and given the fact that the audience know this genre already, they expect something more clever, which sadly to report \"Blue Beetle\" is not.There are already enough talks about the future of this character, is it part of the DCEU or DCU, will there be a sequel, or the character will transfer in the newly formed universe? If you ask me, there will not be a second movie, because this one will bomb hard, also, I'm not sure how you can do clean slate without the bagage of the previous universe, when you always lean to what was, not what it can be. In other words there is always a chance to see Blue Beetle again, but who will portray it and will the origin story be 1:1 identical is something I'm not sure about and I don't hold my breath for it.In conclusion the movie is \"okay\", got its moments, but there is nothing really memorable, also there are two credit scenes, which are fine I guess.",
    "87": "I'm a big fan of superhero movies and especially DC. I really loved the style of Man of steel. I love that DC takes the time to make action and movies more intense in their fight sequences and also does a great job at setting up characters and making you care about them.Well this movie literally just had me bored and I don't know what else to say. The only good part was the family dynamic in the movie which was nice to see but I really found myself caring very little about the characters and the villain is extremely average and uninspired.The fight scenes I just very bland and it seems like there's a lot that happens but they were just boring and very average even though they try not to be. This movie really made me contemplate why I even watch movies anymore and how predictable cinema has become instead of being something that should ignite the senses and the imagination and this was the complete opposite of that and has made me not go and watch random superhero movies anymore.I've never given any marble or DC movie of 4 out of 10 and this is the first because it just felt like a waste of my time and at no point was I excited and in fact I actually walked out in the middle of a fight scene with 25 minutes left to go in the movie.",
    "88": "For a movie being heralded as one of the least-white superhero films, Blue Beetle is white in one respect: it's as bland as plain white bread.Starting with a couple positive remarks, newcomer director Ángel Manuel Soto has a keen eye for action. There's a rough-and-tumble quality to his camerawork that makes the fast action intermittently fun. The performances are also quite fine, with George Lopez being the primary standout and the one bright spot of personality in the film.That's about all in terms of positives. This script has the intelligence of an actual beetle, the tact of a jackhammer, and the consistency of a pandering politician.Characters? Bland. Jaime, our protagonist, complains and is cowardly until the film's last 20 minutes when a character arc is rushed upon him with no skill or feeling.Plot? Perhaps the most predictable I've ever seen in the genre. Every single moment of the movie plays out exactly as you think it would. I predicted the end of literally every single scene. Not an ounce of creativity is present in this piece of writing.Dialogue? Inane. It's always contrived, corny, and shows blatant disregard for its audience's reasoning capabilities.In short, it's a sometimes flashy piece of total redundancy that's a complete bore from start to drawn-out finish.",
    "89": "Welcome to yet another hot garbage by WB studios. This cannot be a movie written by humans. The dialogue is just beyond gut wrenching puke. No way this was written by a sanely functioning human. Has WB lost its mind completely? From Immigration to name mispronounciation, poverty and other such blatant in-your face tropes about the latin american genpop. What were they trying to achieve here? Score ESG points for appeasing the ethnic minorties ?Susan Sarandon is completely wasted and reduced to a script reader with a monotone voice. The physical thrreat aka bad guy has to be the THE worst character ever produced in the history of movies. With a singular expression on his face and no character development he was punching bag for the protagonist. The supporting cast is headache inducing with non-stop conversing in their own colloquial terms much of which is left to be deciphered. Horrendous doesn't even begin to cover this movie. Steer clear and wait for streaming after all this movie was meant to be a streaming release initially, so that just tells about its quality. A bloated telenovela garbage with sprinkles of fortnite battles aimed at 10 year olds.",
    "90": "Someone said \"this is what you get when you don't use ChatAI premium\"Let me say it again, like I've said it before about American production in trying to accommodate \"old discrimination\" into new age cinematography.Look if you're going to cast a different race, like an African, please go to Africa & find Africans to do it.Don't use black Americans who don't have a clue about being African, or American Mexicans to portray stereotype mexican.At least with gay people you're nailing it coz now most productions use actual lgbtq+ people.I don't know how the script was chosen in the 1st place coz I swear to zeus, this script was bananas.The people in this piece of garbage had no emotional logic, someone could be dying of severe burns & everyone will be doing a goofy dance like a bunch of teletubbies.Child goes missing, no one is affected, things break, no one cares, there is zero sense of public worry, no public safety response.It's like the Spanish society, is on another frequency of understanding & their counterpart Americans are NPc's adding life to the Spanish world.This family has genius typical mexican family affected by unfair migrant crisis in their own Spanish utopia, guess the writer forgot its not America\nWriter decided to have an American villain as a woman of power, who exposed her power & didn't realise it made her vulnerable, you even wonder what's the point of this movie honestly.Couldn't help feeling like I was watching remakes of iron man, spiderman 3, venom & of coz antman.I swear a million bucks this script was generated from a free chatAI app with ads.",
    "91": "Why can't DC have decent hero. The acting was terrible, storyline shocking and double standards typical.In some instances, the actors sounded like they were in a pantomine, the dialog was so bass.Oh no! I can't kill you, even if it saves the lives of everyone I love.... It is fine for the uncle to stomp and kill dozens of bad guys, but the beetle just punches people.Typical problem for both good and bad guys (especially one who is trained)... never leave the enemy at your back. So frustrating and ruins so many movies because EVERYONE knows what happens down the track.Please do not waste your valuable time.",
    "92": "If James Gunn thinks this is a good film, then I think DC needs to go back to being an animation only studio.All of the worst Marvel tropes are ripped out and sewn together in this wonderfully cast wreck of a film.If DC plans on making this the standard formula for their various 'bring to live action' properties, then they should just hire a guy to come out during each scene change to tell the audience \"Ok, this person you need to hate for the movie to work. Now feel sad. Now you should feel a romance between the only two characters. Now you should be rooting for the reluctant heroes who suddenly used alien technology like experts and just killed all of the $25 an hour hired security guards.\" etc.There's a reason no one goes to see DC films anymore... and it's because we are tired of seeing Marvel do it better.Do yourself a favor, and go watch Ahsoka instead.",
    "93": "For what it's worth, this is not an origin story yet is designed to be one, atleast for the main lead. After graduation, Jaime Reyes returns back to his family who are near bankrupt and on the verge to lose their home. Desperate to save the house, he looks for a job and lands at Kord Tower, after an invitation from Jenny Kord. Meanwhile, Kord Industries CEO Victoria Kord, is a greedy woman who wants to control an alien species Scarab for it's technological power, to create a deadly weapon. Jenny's attempt to steal this Scarab leads to Jaime getting hold of it and eventually becoming the host. What follows is, Jaime realizing his purpose and acknowledging his connection with Scarab.Blue Beetle clearly has arrived a decade late, which is also what works in it's favour. There is no pressure of building in/adding on to the DC universe. All it aims for, is to be a simple silly fun entertainer, going over the top at every opportunity and yet succeed in entertaining. This is simply not the kind of film one should take seriously. The humor is hit and miss, thankfully the emotions work well. The Latino superhero does leave a lasting impression. There is not much about the Scarabs so the film directly focuses on Reyes becoming the new Blue Beetle while casually dropping the fact that there were others before.Susan Sarandon's Victoria isn't evil enough whereas her own weapon Carapax isn't menacing enough and are barely serviceable. What does work is the goofiness of the Reyes family and right dose of father-son dynamic, because what's a DC superhero without that? The action set pieces are generic and like I said, the film still delivers on providing basic harmless entertainment. The post credit scene does set it up for a standalone sequel without burdening itself from being part of DCU's planned future.",
    "94": "One of the biggest surprises of the year. It's also one of the funniest superhero movies ever with a very distinctive identity.There are some typical exposition dumps for the genre, and the emotional moments don't always hit the mark with a familiar structure, but it's a film with a huge heart, incredibly good humor, and excellent characters. All the \"good side\" characters are very well crafted and distinct, each of them having moments to shine.In technical terms, it has some surprises and tricks up its sleeve, with good editing, well-choreographed and entertaining fast-paced action, and a strong score and soundtrack. What's even better is the way it incorporates Latin culture to show us the true sense of community and family, elevating the film's message and contributing to most of the arcs.All the performances are outstanding. Madridueña has what it takes to be the star of this film and all of them deserve praises, but the best is the crazy uncle portrayed by George Lopez. Good movie even if you are tired of superhero movies.",
    "95": "DCEU's 2023 has been at a dipping point. With the disappointment of Shazam! Fury of the Gods, in which the first one I really loved, and the somewhat decent of a Flash movie, it seems like the way the franchise is ending doesn't seem like a bang. Fortunately, Blue Beetle has already come out oh boy did it not disappoint.Now let me preface this: it is by no means a classic nor is it groundbreaking in the superhero genre. At the end of the day, I just want to have a good time in the theaters and, for the most part, it succeeds in what I'm aiming for: a fun time.Xolo Maridueña as the titular young Iron Man-like superhero, alter-ego Jaime Reyes, was really good. He brings a lot of energy to his performance filled with charisma, awkwardness and relatability because of his love for his family.Speaking of family, everyone was really good playing in their respective roles but George Lopez was easily the standout because of how funny his lines and reactions are towards Jaime.And the theme of the family is really at the center of Blue Beetle, it's really hard not to ignore it which is similar to Shazam. But as the film moves on, it does feel like everything that was done to make this possible was filled with heart by the filmmakers and knew just to be simply entertaining, hitting at all the right beats to make you laugh and cry.The pacing was surprisingly good as to how they were able to fill in the runtime which doesn't make it feel like two hours at all as you are watching it. It's like it took two to three days in the story, if you look at the second to the third act. That was really impressive.Visuals are great and the action sequences are really good to look at. Props to the director of photography, who by the way did Hereditary and Midsommar - yeah, let that sink in.Of course, the film is not without its faults. It is cheesy at times, does feel generic and doesn't seem like it wants to outshine the rest of the films not just in DC but everything superhero in general. But my personal issue would have to be how they handled Susan Sarandoncs character and the nemesis of Jaime. While I get where they are going, it felt like it needed to be more compelling and not just some cartoony villains.But by the end, I walked out of Blue Beetle thinking how good it was to see an enjoyable film with the message of family that hit me emotionally. Would I recommend the movie? Yes.",
    "96": "Blue Beetle has the unique angle of bringing a Latin superhero character to the screen in a leading role for the first time, but outside of that nothing about this film is unique or original.The story is a formulaic superhero origin story. It's fine and it does the job but isn't particularly inspiring or overly engaging. There's an attempt to inject some emotion into the piece but it feels a little half-hearted. Susan Sarandon feels under-developed as a villain which makes the stakes feel quite low.For the most part the action is pretty bland. The final set piece is a CG blur that is a bit of a snooze and considering the skill set of Blue Beetle the action could have been a lot better.Despite all this, the performance from Xolo Mariduena is strong and he creates a likeable and engaging character, as do all his family members. There's some good humour throughout, and the film does look quite good in parts, with some decent enough direction.Overall, this film is a perfectly average superhero film. It's formulaic and uninspired, but it is a fun enough watch.",
    "97": "I remember loving blue beetle in cartoons growing up so I was excited for this. I feel like people, generally speaking, aren't as hyped up for this. I enjoyed it but it was a mixed bag, there's nothing really adventurous attempted and for the most part, just felt good or okay enough. Too many things could've been done better.The family's dynamic was fine, yet the emotional connection between Jaime and Jenny was notably nonexistent- their attempt to forge it even prompted some to audibly scream no in the theatre. The actors' portrayal felt unconvincing, and the writing felt contrived, unimaginatively executed too. The familial bond is likely to resonate with fans later in the future, as evident in their concerted effort to show Blue Beetle is a family guy, along with the Perez family ethos. They really wanted to push that narrative and hammer it home. While I do know that in my brain, but I also wanted to feel that in my heart. James Gunn is a master at this, adept at bridging the gap between what I know and what I feel about a group of characters. They had too many family talks in my opinion, tried too hard. As for Blue Beetle himself, he's a character we'll love more the more we see him(I think), making his debut a respectable foundation for the future DC Universe. However, the ongoing controversy between DCU/DCEU and James Gunn's new vision might contribute to a diverse range of reviews.Pretty good comedic timing and the jokes didn't feel contrived. The suit had a cool design, and despite not having watched Blue Beetle cartoons in over a decade, it had familiarity. The transformation into Blue Beetle was strikingly done with a hint of horror, which I found compelling. I appreciated the mix of cartoonish yet realistic action sequences. There were still some 'fast and furious' ludicrous level action scenes.Some animations looked like video games with their 3D-like quality, and a few scenes lacked the grandeur suited for IMAX screens. The density of the visuals didn't match up, perhaps I'm influenced by the standards set by \"Oppenheimer,\" which was what I saw last in IMAX. Initially planned to watch in standard 2D, I went for the earliest available viewing instead.The story was a generic but it had a lot of interesting stuff in. Beyond the superhero himself, DC's attempt to bring some novelty into the genre was lacking. Some plot reveals didn't have the impact they should've. Improved character background execution, particularly for Nana and the main villain, was needed; their histories felt like it was mentioned only for plot convenience, notably the grandmother's history just because of how it was revealed. Some dialogue and plot towards the end was very predictable.Fighting scenes were mostly cool, although apart from the final one, they didn't reach their maximum climactic potential; only the last battle drew me in. The high personal stakes were great, clearly showing what was at risk and effectively following through on those stakes.A more serious and slightly darker tone would have heightened the emotional impact of the events in the third act. The movie seemed caught between taking itself very seriously and/or embracing a fun, lighthearted vibe, leaving an uncertain feel. It lacked a distinct impact or identity, floating in a sort of no man's land. If you didn't know Blue Beetle already or indifferent towards him, the film struggled to convincingly make you fall in love with the character or feel a connection. On the positive side, the movie showcased significant Latino representation. In terms of cultural blending, I'd rank Shang-Chi, Black Panther 2, Blue Beetle, Ms. Marvel, and then the first Black Panther.The movie excels in certain parts, while its shortcomings aren't overwhelmingly bad, but they could be better. Sadly, seemed to be more of the latter. The quick post-credit scenes were nice, sparing us from what often feels like a long wait usually. Loved that they included the previous versions of blue beetle, it's also quite rare for a superhero film to have a sense of standalone authenticity, rather than just serving as a vehicle to introduce new characters or set up future movies.I typically avoid badmouthing actors, but I believe acting could've been better. As previously mentioned, my earlier comment about the love interests still stands. The chemistry between the actors, the portrayal of emotions in their eyes-whether it was excitement, agony, or loss-and the conviction of the main villain didn't resonate with me. The lack of connection and genuine emotion felt like a first draft, and felt like a mid-2000s Disney show. This contributes to the feeling of a medley mixed bag, the dialogue, story, and acting all fell short of being amazing individually. While nothing was too bad, when combined, they accentuated each other, drawing attention to each.While far from flawless, I still left with a smile. The story was somewhat straightforward, and considering Blue Beetle's unique, I half-expected the movie to reinvent the wheel, though my hopes weren't too high. There were a lot of elements of a potentially mind blowing fantastic movie, It just doesn't feel like they were pieced together the best that they could've, but definitely still enjoyable. I know it's an origin story but it just feels like DC just played it super safe; and at a time when \"superhero burnout\" is a thing, playing it safe ain't too safe.",
    "98": "The marketing is letting this movie down! This film is so much more than just a origin story for a new superhero! This film has a lot of heart, with the directors love and care for this character being evident throughout the film! The character was introduced perfectly, and I hope it gets enough love to get a sequel because it deserves one! Also, so many touchy and difficult societal issues are brought up and tackled in respectful and nuanced ways. Their inclusion doesn't pull you out of the movie whatsoever! You aren't hit over the head with anything and these issues actually end up aiding the story and character greatly and give the film that much more of an emotional punch!The acting was phanominal as well! All of the actors gave amazing performances and really were able to convey each of the characters emotions beautifully in every scene!The action was by far the best part of the film! The camera angles and movements made you feel as if you were experiencing the fights irl! They were awesome!The comedy was also fantastic and handled perfectly! I found myself laughing every other minute at some points because the jokes were just so good! George Lopez was AMAZING throughout the film and really brought life to every scene he was in! Perfect casting!!Overall, I had a fun time with this movie and I highly recommend watching it!",
    "99": "Blue Beetle does little to impress as far as superhero movies go. Now, we might decide to \"not take it seriously\" and just enjoy the film as a feel-good super-powered adventure, but we've gotten better movies of that nature.For example, DC's very own \"Shazam!\" Interestingly, both films make family a prominent theme in their plot and it proves to be a bankable choice once again. There is a beautiful family dynamic on display here that is hard to deny.The movie falls back on the protagonist's family for most of its comedic content too. However, more often than not, the jokes unfortunately don't land for me. They might come in the form of harmless antics and cheesy lines, but I don't think they really cater to a more mature audience due to their simplicity and lack of originality.The events in the film are equally unimpressive to me because of how recycled everything feels. We've seen too many elements of this story in other superhero movies, and so Blue Beetle's character starts to lose his uniqueness besides the suit (which we learn too little about). It makes me begin to question the point of telling this story.Thankfully, the visual and special effects in this film are one of its positives. The suits and tech on display are deliciously detailed and the fight scenes are choreographed quite well. It makes the action scenes really engaging.Summarily, I think Blue Beetle had the potential to be better. I don't know what the vision for the film was, but what we get is a bit underwhelming.",
    "100": "It became increasingly obvious that Blue Beetle was designed to be a fun family film with maybe the younger members of the family in mind. It's not quite a Spy Kids movie but it's close. A young adult version if you will. Don't get me wrong I love the Spy Kids movies for what they are and this movie made me think of them, but a grown-up version. Blue Beetle has heart, the emotion - I teared up a few times, - and the family dynamic is...great. It's a joyous movie that celebrates Latin culture well, but it falters when it comes to the superhero side of things, mainly the villain's goal and that he's fighting another version of himself.The violence and the softened but still gory on-screen deaths would be the things that make this Spy kids-like movie - to keep the previous example - more adult but it's the performances that make it so, except for one. Uncle Rudy was too much, he was in a low-budget Spy Kids movie, while the others weren't. It was so jarring. He was so grating for me that I was tensed whenever he was on screen, which was a lot. It's like he's trying to be the main character in this movie instead of the supporting. Not everything he says or does is cringe but enough to be worrying once the pattern was identified and there's two third of the movie to go. I don't know if it's the casting, the direction, or the script, maybe all three but Uncle Rudy was not it, not the secret sauce. He really brought this movie down for me. This role could have been played differently. He's being a caricature when the others are desperately trying not to be. I'm not hating on him but him being the main thing that doesn't quite work in the movie is pretty good in my book.Xolo, Bellissa, and Bruna really shine in this movie as do most of the Reyes family cast, they made me care about the family and what happens. Xolo is a great Jaime, I'm most familiar with the character from Young Justice but I recognized him in Xolo. Belissa as Jaime's sister was amazing, she seamlessly brought the dry humor and the sadness, she didn't lose me once. Bruna is a great find and this is probably the role that I'll recognize her from.Blue Beetle is entertaining and fun, a good time at the cinema, yet just shy of being great.@garcwrites.",
    "101": "After the midly amusing The Flash, this is the final DCEU movie. The trailer looked bad already, but the final film is a boring mess. Blue beetle is generic, unoriginal paint by numbers superhero filmmaking, the 100% regurgitation of the same old tired formula. The story is basically \"Spiderman, but boring\".The hero is boring, the villain even more so, so they decided to make this some kind of ensemble movie with a quirky sitcom family. It doesn't work. Everyone tries to hard to be funny and likeable, that it feels faker than politicians smiling.In many ways, this is the filmic equivalent to the scene in Joker where he gets up on a comedy stage and tries in vain to make people laugh. It's sad. It's a waste of everyone's efforts and talents.Just let the superhero genre die already. Batman and Spiderman have some great story potential, but the rest is just played out. There's nothing more to be squeezed out of the genre.",
    "102": "When a teenager goes through a Cronenbergian symbiosis with a space scarab, he is targeted by the corporation that discovered it.I watch almost all of these comic book adaptations, and it's rare that I see one with this much heart, and one that wears it on its sleeve at that. The empathy is overflowing. There is such celebration of the indomitable spirit of the Latin American immigrant, their success despite hardship. The Reyes family are supportive, sweet, loving and unashamed of their specific cultural identity. Apparently James Gunn did not have a huge amount of input on this, but this does work well as a lead in to his handling, aka the DCU: it cares deeply about its characters and ensures you do as well, there are great needle drops, and it really makes you care about someone that a lot of people currently do not.I would say about a third of the quick fire jokes should have been trimmed out. There are times where it really feels like they're jingling keys in your face. The fairly frequent, fun if not always the most creative action features a lot of CG, and though it's definitely better than the Flash and Ant-Man 3, it's especially helped by the fact that this was clearly shot on actual locations and physical sets, not surrounded by green screen screens or on the volume. They actually did toss a stunt person through the air, that car was actually knocked over, etc.Some of the violence in this really pushes the PG-13, and though there's not a huge amount of moderate to strong language in English, note that anyone speaking Spanish will pick up on some swearing there. I recommend this to any fan of comic books and the films adapting them. 7/10.",
    "103": "I really love the film Blue Beetle! One thing I enjoy is the strong cultural theme at its center. It is a great sci-fi film, with a great tone and some pretty fun comedic scenes and characters, which is different for a DC movie.The storyline is set in Palmera City where Jamie Reyes (Xolo Maridueña), a Gotham pre-law graduate, is trying to get a job. When he meets Jenny Kord (Bruna Marqueszine), she gives him a piece of alien technology called the \"Scarab\" that gives him superpowers. The plot thickens when a woman named Victoria Kord (Susan Sarandon) tries to steal the Scarab back from Jamie, putting his entire family in danger.The storyline is great. What this story does differently than other superhero movies is make the main character's family a big part of the action. There are a lot of other unique things about this film, too. I love the way the director and writers bring representation of Latino culture into the film through the characters and the sets. Palmera City, Jamie's house and Jamie's family all feel very realistic. The costumes are incredible as well, especially the Blue Beetle suit-it's slick and has a personality of its own. Of all the characters, my favorite is Rudy (George Lopez), who brings a lot of fun into his scenes. He is the 'tech support' for Jamie, but is also a conspiracy theorist, and there are a lot of jokes based on his quirky personality. The makeup effects are great too; for example the scene where Jamie transforms into the Blue Beetle.The film's message is that family makes you stronger, not weaker, which is a theme I love. Be forewarned that the film has a few violent scenes, a lot of action, some profanity and sexual references.I give Blue Beetle 5 out of 5 stars and recommend it for ages 12 to 18, plus adults. The film releases in theaters on August 18, 2023. By Connor S., KIDS FIRST!",
    "104": "So Blue Beetle is definitely fun, I'm not sure if it's as amazing as people are making it out to be but it's a fun movie and a solid introduction.The story is about Jaime ( Hi May ) who comes in contact with the Scarab and turns him into the Blue Beetle. His family are under threat as Cord Industries want the Scarab back, He must become one with the Blue Beetle and fight for his family and his freedom.The family element is really good, usually they say it's family oriented and there a joke or 2 but family is at the heart of the movie and the stand outs for me is NANNA the goat, a caring figure and a bada$$, the uncle is also great, he has some funny likes but his overall character works.Blue Beetle himself is really enjoyable, the movie is fine to be honest it's an origin story. Not man of those are AMAZING but his personality and likeness pulls the movie. Good action scenes and I love the suit, overall a good movie definitely worth watching and I'm looking forward to more Jamie. 2 post credits, the end one not worth it, it's a joke hahah 7.5/10.",
    "105": "I REALLY wanted to like this movie, despite hearing a lot of people say it's mid or bad, and constantly hearing it's gunna bomb at the box office. Despite hearing all that constantly, I still tried to go in with a clear open-mind, and I was still disappointed.It's been said a million times before because it's true, but this is an EXTREMELY cliched super hero origin movie. The super cliched plot wouldn't be as bad if the characters and humor hit better, but that sadly isn't the case either.The humor for me just didn't hit whatsoever for me like 90percent of the time. Some of the humor is SUPER corny, and I generally don't mind corny humor, but the corny humor in this movie just takes it to a WHOLE Nother LEVEL! There's good corny and there's bad corny, this is bad corny, which doesn't even bring a little smirk on my face. The suspension of disbelief they pull just for a cheap unfunny joke is lowkey insulting.Xolo Mariduena is the best part of the movie, He's my second favorite character on Cobra Kai, the first being William Zabka. It's too bad Xolo was given a bad movie to work with, he's very charismatic and see great acting potential in him, but he just isn't given enough material to show that with this movie, could've made him funnier or at least give him a real arc. Jamie Reyes/Blue Beetle doesn't even have a real character arc. I guess his arc is he loves his family, then by the end, he still loves his family? Huh? I guess he has this super random thing that he's against killing, but I thought that was so dumb and unnecessary to include in the movie. Obviously killing innocent people is wrong, but killing people who are trying to kill innocent people isn't that bad. Plus after his anti-killing scene, it's barely ever mentioned again and this message really goes nowhere, so why was it ever mentioned in the first place? The movie would've been better if the \"no killing thing\" was just never bought up. And the no-killing thing just makes Xolo look like an idiot. The \"no killing\" message made sense in a movie like Terminator 2 for example because it's a huge part of the overall narrative of the movie, but here, it doesn't really do anything, so why is it here?The two main villains are super cliche,\" Your family is what makes you weak!\" Give me a break, seems like this movie was made for 10-year-olds. It's just SO BASIC and cliche that it's corny. Susan Sarandon completely phones in her role too, but I don't blame her because she is given nothing to work with. We all know Susan Saradon is a seasoned actor and clearly knows how to act, so she obviously chose not to even try in this movie, because she knows there is nothing to work with.The \"girlfriend\" is probably the worst actor in the movie. I supposed she's supposed to be the \"love interest?\" But huge quotations on that because she's really bland and has zero chemistry with Xolo. She's more like an AI exposition dump, and that's it.The action was overall just decent. I wouldn't call it bad, but it's barely just good either. It could've been way better, and Xolo barely used any cool stuff with the powers he has. This is not a spoiler because it's in the trailer, but he makes a Final Fantasy sword, this was kinda cool, but it seems random in the context of the movie. It would've been cooler and made more sense if the movie showed he was a big gamer or Final Fantasy fan earlier in the movie, and could've used other video-game weapons. And would've been kinda a cool, unique, and relatable thing for a young adult to do. But this movie only shows Mexicans liking stereotypical Mexican stuff, can't be more unique and show Mexicans liking other things like Final Fantasy, anime, or video-games in general.I'm just sad because we don't get a lot of Mexican superheroes, so they should've put way more effort into this movie if they wanted it to be successful, but they didn't. The lack of quality in the movie shows it. You just can't be super pro-diversity, then when finally get a chance to make a big-budget Hispanic movie, you made a below-mediocre mess of a movie. Whoever wrote and directed this movie just ruined it for more diversity movies in the future. And I know the writer and director of this movie are both Hispanic, so I don't get why didn't they try harder??!?!!?! They should've tried harder or the main studio should've hired writers and directors with more talent and/or cared more.I just wiki'd who directed and wrote this movie, and the director only has 2 movies before this I never heard of. They should've hired a way more experienced director. As for the writer, he DOESN'T even have a wiki page!!! WOW! So your telling me the studios hired some guy to write this movie has no prior movie writing experience or even show writing experience in his whole life?!?!?! Why was he hired?!?!? No wonder the writing is so bad, and I know there can still be studio inference as well, but we still deserved at least a competent writer for this movie.This was my last hope for the DC cuz 90percent of their movies are awful, and they recently keep just making flop after flop and it's easy to see why. It BLOWS MY MIND how one of the richest studios struggles to make a single good movie when they have WAY MORE resources than 90% of other movie companies. They can't even decide if this movie is part of the rebooted DCU or not. How about this, you'd never have to worry about rebooting your series in the first place if you just consistently made good movies like youre supposed to! Making good movies should ALWAYS be at the top of your list.",
    "106": "For what it's worth, this is not an origin story yet is designed to be one, atleast for the main lead. After graduation, Jaime Reyes returns back to his family who are near bankrupt and on the verge to lose their home. Desperate to save the house, he looks for a job and lands at Kord Tower, after an invitation from Jenny Kord. Meanwhile, Kord Industries CEO Victoria Kord, is a greedy woman who wants to control an alien species Scarab for it's technological power, to create a deadly weapon. Jenny's attempt to steal this Scarab leads to Jaime getting hold of it and eventually becoming the host. What follows is, Jaime realizing his purpose and acknowledging his connection with Scarab.Blue Beetle clearly has arrived a decade late, which is also what works in it's favour. There is no pressure of building in/adding on to the DC universe. All it aims for, is to be a simple silly fun entertainer, going over the top at every opportunity and yet succeed in entertaining. This is simply not the kind of film one should take seriously. The humor is hit and miss, thankfully the emotions work well. The Latino superhero does leave a lasting impression. There is not much about the Scarabs so the film directly focuses on Reyes becoming the new Blue Beetle while casually dropping the fact that there were others before.Susan Sarandon's Victoria isn't evil enough whereas her own weapon Carapax isn't menacing enough and are barely serviceable. What does work is the goofiness of the Reyes family and right dose of father-son dynamic, because what's a DC superhero without that? The action set pieces are generic and like I said, the film still delivers on providing basic harmless entertainment. The post credit scene does set it up for a standalone sequel without burdening itself from being part of DCU's planned future.",
    "107": "One of the biggest surprises of the year. It's also one of the funniest superhero movies ever with a very distinctive identity.There are some typical exposition dumps for the genre, and the emotional moments don't always hit the mark with a familiar structure, but it's a film with a huge heart, incredibly good humor, and excellent characters. All the \"good side\" characters are very well crafted and distinct, each of them having moments to shine.In technical terms, it has some surprises and tricks up its sleeve, with good editing, well-choreographed and entertaining fast-paced action, and a strong score and soundtrack. What's even better is the way it incorporates Latin culture to show us the true sense of community and family, elevating the film's message and contributing to most of the arcs.All the performances are outstanding. Madridueña has what it takes to be the star of this film and all of them deserve praises, but the best is the crazy uncle portrayed by George Lopez. Good movie even if you are tired of superhero movies.",
    "108": "DCEU's 2023 has been at a dipping point. With the disappointment of Shazam! Fury of the Gods, in which the first one I really loved, and the somewhat decent of a Flash movie, it seems like the way the franchise is ending doesn't seem like a bang. Fortunately, Blue Beetle has already come out oh boy did it not disappoint.Now let me preface this: it is by no means a classic nor is it groundbreaking in the superhero genre. At the end of the day, I just want to have a good time in the theaters and, for the most part, it succeeds in what I'm aiming for: a fun time.Xolo Maridueña as the titular young Iron Man-like superhero, alter-ego Jaime Reyes, was really good. He brings a lot of energy to his performance filled with charisma, awkwardness and relatability because of his love for his family.Speaking of family, everyone was really good playing in their respective roles but George Lopez was easily the standout because of how funny his lines and reactions are towards Jaime.And the theme of the family is really at the center of Blue Beetle, it's really hard not to ignore it which is similar to Shazam. But as the film moves on, it does feel like everything that was done to make this possible was filled with heart by the filmmakers and knew just to be simply entertaining, hitting at all the right beats to make you laugh and cry.The pacing was surprisingly good as to how they were able to fill in the runtime which doesn't make it feel like two hours at all as you are watching it. It's like it took two to three days in the story, if you look at the second to the third act. That was really impressive.Visuals are great and the action sequences are really good to look at. Props to the director of photography, who by the way did Hereditary and Midsommar - yeah, let that sink in.Of course, the film is not without its faults. It is cheesy at times, does feel generic and doesn't seem like it wants to outshine the rest of the films not just in DC but everything superhero in general. But my personal issue would have to be how they handled Susan Sarandoncs character and the nemesis of Jaime. While I get where they are going, it felt like it needed to be more compelling and not just some cartoony villains.But by the end, I walked out of Blue Beetle thinking how good it was to see an enjoyable film with the message of family that hit me emotionally. Would I recommend the movie? Yes.",
    "109": "Blue Beetle has the unique angle of bringing a Latin superhero character to the screen in a leading role for the first time, but outside of that nothing about this film is unique or original.The story is a formulaic superhero origin story. It's fine and it does the job but isn't particularly inspiring or overly engaging. There's an attempt to inject some emotion into the piece but it feels a little half-hearted. Susan Sarandon feels under-developed as a villain which makes the stakes feel quite low.For the most part the action is pretty bland. The final set piece is a CG blur that is a bit of a snooze and considering the skill set of Blue Beetle the action could have been a lot better.Despite all this, the performance from Xolo Mariduena is strong and he creates a likeable and engaging character, as do all his family members. There's some good humour throughout, and the film does look quite good in parts, with some decent enough direction.Overall, this film is a perfectly average superhero film. It's formulaic and uninspired, but it is a fun enough watch.",
    "110": "I remember loving blue beetle in cartoons growing up so I was excited for this. I feel like people, generally speaking, aren't as hyped up for this. I enjoyed it but it was a mixed bag, there's nothing really adventurous attempted and for the most part, just felt good or okay enough. Too many things could've been done better.The family's dynamic was fine, yet the emotional connection between Jaime and Jenny was notably nonexistent- their attempt to forge it even prompted some to audibly scream no in the theatre. The actors' portrayal felt unconvincing, and the writing felt contrived, unimaginatively executed too. The familial bond is likely to resonate with fans later in the future, as evident in their concerted effort to show Blue Beetle is a family guy, along with the Perez family ethos. They really wanted to push that narrative and hammer it home. While I do know that in my brain, but I also wanted to feel that in my heart. James Gunn is a master at this, adept at bridging the gap between what I know and what I feel about a group of characters. They had too many family talks in my opinion, tried too hard. As for Blue Beetle himself, he's a character we'll love more the more we see him(I think), making his debut a respectable foundation for the future DC Universe. However, the ongoing controversy between DCU/DCEU and James Gunn's new vision might contribute to a diverse range of reviews.Pretty good comedic timing and the jokes didn't feel contrived. The suit had a cool design, and despite not having watched Blue Beetle cartoons in over a decade, it had familiarity. The transformation into Blue Beetle was strikingly done with a hint of horror, which I found compelling. I appreciated the mix of cartoonish yet realistic action sequences. There were still some 'fast and furious' ludicrous level action scenes.Some animations looked like video games with their 3D-like quality, and a few scenes lacked the grandeur suited for IMAX screens. The density of the visuals didn't match up, perhaps I'm influenced by the standards set by \"Oppenheimer,\" which was what I saw last in IMAX. Initially planned to watch in standard 2D, I went for the earliest available viewing instead.The story was a generic but it had a lot of interesting stuff in. Beyond the superhero himself, DC's attempt to bring some novelty into the genre was lacking. Some plot reveals didn't have the impact they should've. Improved character background execution, particularly for Nana and the main villain, was needed; their histories felt like it was mentioned only for plot convenience, notably the grandmother's history just because of how it was revealed. Some dialogue and plot towards the end was very predictable.Fighting scenes were mostly cool, although apart from the final one, they didn't reach their maximum climactic potential; only the last battle drew me in. The high personal stakes were great, clearly showing what was at risk and effectively following through on those stakes.A more serious and slightly darker tone would have heightened the emotional impact of the events in the third act. The movie seemed caught between taking itself very seriously and/or embracing a fun, lighthearted vibe, leaving an uncertain feel. It lacked a distinct impact or identity, floating in a sort of no man's land. If you didn't know Blue Beetle already or indifferent towards him, the film struggled to convincingly make you fall in love with the character or feel a connection. On the positive side, the movie showcased significant Latino representation. In terms of cultural blending, I'd rank Shang-Chi, Black Panther 2, Blue Beetle, Ms. Marvel, and then the first Black Panther.The movie excels in certain parts, while its shortcomings aren't overwhelmingly bad, but they could be better. Sadly, seemed to be more of the latter. The quick post-credit scenes were nice, sparing us from what often feels like a long wait usually. Loved that they included the previous versions of blue beetle, it's also quite rare for a superhero film to have a sense of standalone authenticity, rather than just serving as a vehicle to introduce new characters or set up future movies.I typically avoid badmouthing actors, but I believe acting could've been better. As previously mentioned, my earlier comment about the love interests still stands. The chemistry between the actors, the portrayal of emotions in their eyes-whether it was excitement, agony, or loss-and the conviction of the main villain didn't resonate with me. The lack of connection and genuine emotion felt like a first draft, and felt like a mid-2000s Disney show. This contributes to the feeling of a medley mixed bag, the dialogue, story, and acting all fell short of being amazing individually. While nothing was too bad, when combined, they accentuated each other, drawing attention to each.While far from flawless, I still left with a smile. The story was somewhat straightforward, and considering Blue Beetle's unique, I half-expected the movie to reinvent the wheel, though my hopes weren't too high. There were a lot of elements of a potentially mind blowing fantastic movie, It just doesn't feel like they were pieced together the best that they could've, but definitely still enjoyable. I know it's an origin story but it just feels like DC just played it super safe; and at a time when \"superhero burnout\" is a thing, playing it safe ain't too safe.",
    "111": "The marketing is letting this movie down! This film is so much more than just a origin story for a new superhero! This film has a lot of heart, with the directors love and care for this character being evident throughout the film! The character was introduced perfectly, and I hope it gets enough love to get a sequel because it deserves one! Also, so many touchy and difficult societal issues are brought up and tackled in respectful and nuanced ways. Their inclusion doesn't pull you out of the movie whatsoever! You aren't hit over the head with anything and these issues actually end up aiding the story and character greatly and give the film that much more of an emotional punch!The acting was phanominal as well! All of the actors gave amazing performances and really were able to convey each of the characters emotions beautifully in every scene!The action was by far the best part of the film! The camera angles and movements made you feel as if you were experiencing the fights irl! They were awesome!The comedy was also fantastic and handled perfectly! I found myself laughing every other minute at some points because the jokes were just so good! George Lopez was AMAZING throughout the film and really brought life to every scene he was in! Perfect casting!!Overall, I had a fun time with this movie and I highly recommend watching it!",
    "112": "Blue Beetle does little to impress as far as superhero movies go. Now, we might decide to \"not take it seriously\" and just enjoy the film as a feel-good super-powered adventure, but we've gotten better movies of that nature.For example, DC's very own \"Shazam!\" Interestingly, both films make family a prominent theme in their plot and it proves to be a bankable choice once again. There is a beautiful family dynamic on display here that is hard to deny.The movie falls back on the protagonist's family for most of its comedic content too. However, more often than not, the jokes unfortunately don't land for me. They might come in the form of harmless antics and cheesy lines, but I don't think they really cater to a more mature audience due to their simplicity and lack of originality.The events in the film are equally unimpressive to me because of how recycled everything feels. We've seen too many elements of this story in other superhero movies, and so Blue Beetle's character starts to lose his uniqueness besides the suit (which we learn too little about). It makes me begin to question the point of telling this story.Thankfully, the visual and special effects in this film are one of its positives. The suits and tech on display are deliciously detailed and the fight scenes are choreographed quite well. It makes the action scenes really engaging.Summarily, I think Blue Beetle had the potential to be better. I don't know what the vision for the film was, but what we get is a bit underwhelming.",
    "113": "It became increasingly obvious that Blue Beetle was designed to be a fun family film with maybe the younger members of the family in mind. It's not quite a Spy Kids movie but it's close. A young adult version if you will. Don't get me wrong I love the Spy Kids movies for what they are and this movie made me think of them, but a grown-up version. Blue Beetle has heart, the emotion - I teared up a few times, - and the family dynamic is...great. It's a joyous movie that celebrates Latin culture well, but it falters when it comes to the superhero side of things, mainly the villain's goal and that he's fighting another version of himself.The violence and the softened but still gory on-screen deaths would be the things that make this Spy kids-like movie - to keep the previous example - more adult but it's the performances that make it so, except for one. Uncle Rudy was too much, he was in a low-budget Spy Kids movie, while the others weren't. It was so jarring. He was so grating for me that I was tensed whenever he was on screen, which was a lot. It's like he's trying to be the main character in this movie instead of the supporting. Not everything he says or does is cringe but enough to be worrying once the pattern was identified and there's two third of the movie to go. I don't know if it's the casting, the direction, or the script, maybe all three but Uncle Rudy was not it, not the secret sauce. He really brought this movie down for me. This role could have been played differently. He's being a caricature when the others are desperately trying not to be. I'm not hating on him but him being the main thing that doesn't quite work in the movie is pretty good in my book.Xolo, Bellissa, and Bruna really shine in this movie as do most of the Reyes family cast, they made me care about the family and what happens. Xolo is a great Jaime, I'm most familiar with the character from Young Justice but I recognized him in Xolo. Belissa as Jaime's sister was amazing, she seamlessly brought the dry humor and the sadness, she didn't lose me once. Bruna is a great find and this is probably the role that I'll recognize her from.Blue Beetle is entertaining and fun, a good time at the cinema, yet just shy of being great.@garcwrites.",
    "114": "After the midly amusing The Flash, this is the final DCEU movie. The trailer looked bad already, but the final film is a boring mess. Blue beetle is generic, unoriginal paint by numbers superhero filmmaking, the 100% regurgitation of the same old tired formula. The story is basically \"Spiderman, but boring\".The hero is boring, the villain even more so, so they decided to make this some kind of ensemble movie with a quirky sitcom family. It doesn't work. Everyone tries to hard to be funny and likeable, that it feels faker than politicians smiling.In many ways, this is the filmic equivalent to the scene in Joker where he gets up on a comedy stage and tries in vain to make people laugh. It's sad. It's a waste of everyone's efforts and talents.Just let the superhero genre die already. Batman and Spiderman have some great story potential, but the rest is just played out. There's nothing more to be squeezed out of the genre.",
    "115": "When a teenager goes through a Cronenbergian symbiosis with a space scarab, he is targeted by the corporation that discovered it.I watch almost all of these comic book adaptations, and it's rare that I see one with this much heart, and one that wears it on its sleeve at that. The empathy is overflowing. There is such celebration of the indomitable spirit of the Latin American immigrant, their success despite hardship. The Reyes family are supportive, sweet, loving and unashamed of their specific cultural identity. Apparently James Gunn did not have a huge amount of input on this, but this does work well as a lead in to his handling, aka the DCU: it cares deeply about its characters and ensures you do as well, there are great needle drops, and it really makes you care about someone that a lot of people currently do not.I would say about a third of the quick fire jokes should have been trimmed out. There are times where it really feels like they're jingling keys in your face. The fairly frequent, fun if not always the most creative action features a lot of CG, and though it's definitely better than the Flash and Ant-Man 3, it's especially helped by the fact that this was clearly shot on actual locations and physical sets, not surrounded by green screen screens or on the volume. They actually did toss a stunt person through the air, that car was actually knocked over, etc.Some of the violence in this really pushes the PG-13, and though there's not a huge amount of moderate to strong language in English, note that anyone speaking Spanish will pick up on some swearing there. I recommend this to any fan of comic books and the films adapting them. 7/10.",
    "116": "I really love the film Blue Beetle! One thing I enjoy is the strong cultural theme at its center. It is a great sci-fi film, with a great tone and some pretty fun comedic scenes and characters, which is different for a DC movie.The storyline is set in Palmera City where Jamie Reyes (Xolo Maridueña), a Gotham pre-law graduate, is trying to get a job. When he meets Jenny Kord (Bruna Marqueszine), she gives him a piece of alien technology called the \"Scarab\" that gives him superpowers. The plot thickens when a woman named Victoria Kord (Susan Sarandon) tries to steal the Scarab back from Jamie, putting his entire family in danger.The storyline is great. What this story does differently than other superhero movies is make the main character's family a big part of the action. There are a lot of other unique things about this film, too. I love the way the director and writers bring representation of Latino culture into the film through the characters and the sets. Palmera City, Jamie's house and Jamie's family all feel very realistic. The costumes are incredible as well, especially the Blue Beetle suit-it's slick and has a personality of its own. Of all the characters, my favorite is Rudy (George Lopez), who brings a lot of fun into his scenes. He is the 'tech support' for Jamie, but is also a conspiracy theorist, and there are a lot of jokes based on his quirky personality. The makeup effects are great too; for example the scene where Jamie transforms into the Blue Beetle.The film's message is that family makes you stronger, not weaker, which is a theme I love. Be forewarned that the film has a few violent scenes, a lot of action, some profanity and sexual references.I give Blue Beetle 5 out of 5 stars and recommend it for ages 12 to 18, plus adults. The film releases in theaters on August 18, 2023. By Connor S., KIDS FIRST!",
    "117": "So Blue Beetle is definitely fun, I'm not sure if it's as amazing as people are making it out to be but it's a fun movie and a solid introduction.The story is about Jaime ( Hi May ) who comes in contact with the Scarab and turns him into the Blue Beetle. His family are under threat as Cord Industries want the Scarab back, He must become one with the Blue Beetle and fight for his family and his freedom.The family element is really good, usually they say it's family oriented and there a joke or 2 but family is at the heart of the movie and the stand outs for me is NANNA the goat, a caring figure and a bada$$, the uncle is also great, he has some funny likes but his overall character works.Blue Beetle himself is really enjoyable, the movie is fine to be honest it's an origin story. Not man of those are AMAZING but his personality and likeness pulls the movie. Good action scenes and I love the suit, overall a good movie definitely worth watching and I'm looking forward to more Jamie. 2 post credits, the end one not worth it, it's a joke hahah 7.5/10.",
    "118": "I REALLY wanted to like this movie, despite hearing a lot of people say it's mid or bad, and constantly hearing it's gunna bomb at the box office. Despite hearing all that constantly, I still tried to go in with a clear open-mind, and I was still disappointed.It's been said a million times before because it's true, but this is an EXTREMELY cliched super hero origin movie. The super cliched plot wouldn't be as bad if the characters and humor hit better, but that sadly isn't the case either.The humor for me just didn't hit whatsoever for me like 90percent of the time. Some of the humor is SUPER corny, and I generally don't mind corny humor, but the corny humor in this movie just takes it to a WHOLE Nother LEVEL! There's good corny and there's bad corny, this is bad corny, which doesn't even bring a little smirk on my face. The suspension of disbelief they pull just for a cheap unfunny joke is lowkey insulting.Xolo Mariduena is the best part of the movie, He's my second favorite character on Cobra Kai, the first being William Zabka. It's too bad Xolo was given a bad movie to work with, he's very charismatic and see great acting potential in him, but he just isn't given enough material to show that with this movie, could've made him funnier or at least give him a real arc. Jamie Reyes/Blue Beetle doesn't even have a real character arc. I guess his arc is he loves his family, then by the end, he still loves his family? Huh? I guess he has this super random thing that he's against killing, but I thought that was so dumb and unnecessary to include in the movie. Obviously killing innocent people is wrong, but killing people who are trying to kill innocent people isn't that bad. Plus after his anti-killing scene, it's barely ever mentioned again and this message really goes nowhere, so why was it ever mentioned in the first place? The movie would've been better if the \"no killing thing\" was just never bought up. And the no-killing thing just makes Xolo look like an idiot. The \"no killing\" message made sense in a movie like Terminator 2 for example because it's a huge part of the overall narrative of the movie, but here, it doesn't really do anything, so why is it here?The two main villains are super cliche,\" Your family is what makes you weak!\" Give me a break, seems like this movie was made for 10-year-olds. It's just SO BASIC and cliche that it's corny. Susan Sarandon completely phones in her role too, but I don't blame her because she is given nothing to work with. We all know Susan Saradon is a seasoned actor and clearly knows how to act, so she obviously chose not to even try in this movie, because she knows there is nothing to work with.The \"girlfriend\" is probably the worst actor in the movie. I supposed she's supposed to be the \"love interest?\" But huge quotations on that because she's really bland and has zero chemistry with Xolo. She's more like an AI exposition dump, and that's it.The action was overall just decent. I wouldn't call it bad, but it's barely just good either. It could've been way better, and Xolo barely used any cool stuff with the powers he has. This is not a spoiler because it's in the trailer, but he makes a Final Fantasy sword, this was kinda cool, but it seems random in the context of the movie. It would've been cooler and made more sense if the movie showed he was a big gamer or Final Fantasy fan earlier in the movie, and could've used other video-game weapons. And would've been kinda a cool, unique, and relatable thing for a young adult to do. But this movie only shows Mexicans liking stereotypical Mexican stuff, can't be more unique and show Mexicans liking other things like Final Fantasy, anime, or video-games in general.I'm just sad because we don't get a lot of Mexican superheroes, so they should've put way more effort into this movie if they wanted it to be successful, but they didn't. The lack of quality in the movie shows it. You just can't be super pro-diversity, then when finally get a chance to make a big-budget Hispanic movie, you made a below-mediocre mess of a movie. Whoever wrote and directed this movie just ruined it for more diversity movies in the future. And I know the writer and director of this movie are both Hispanic, so I don't get why didn't they try harder??!?!!?! They should've tried harder or the main studio should've hired writers and directors with more talent and/or cared more.I just wiki'd who directed and wrote this movie, and the director only has 2 movies before this I never heard of. They should've hired a way more experienced director. As for the writer, he DOESN'T even have a wiki page!!! WOW! So your telling me the studios hired some guy to write this movie has no prior movie writing experience or even show writing experience in his whole life?!?!?! Why was he hired?!?!? No wonder the writing is so bad, and I know there can still be studio inference as well, but we still deserved at least a competent writer for this movie.This was my last hope for the DC cuz 90percent of their movies are awful, and they recently keep just making flop after flop and it's easy to see why. It BLOWS MY MIND how one of the richest studios struggles to make a single good movie when they have WAY MORE resources than 90% of other movie companies. They can't even decide if this movie is part of the rebooted DCU or not. How about this, you'd never have to worry about rebooting your series in the first place if you just consistently made good movies like youre supposed to! Making good movies should ALWAYS be at the top of your list.",
    "119": "There's no other way to put this but this movie has no business being in the cinema. An absolute waste of 2hrs with a storyline that would make B-rated movies look top tier. The dialogues appear forced and cliche. I can see why it went through development hell for years and I believe it should've remained so.The script felt like it was made for Nickelodeon but somehow managed to find its way to Warner Bros and don't get me started on the action scenes.What a joke.In all, Blue Beetle was set to flop from the beginning - From the cast to the scriptwriting to the obvious CGI, it stood no chance.I'd not recommend this unless you've got time to burn.",
    "120": "OK Hollywood, just stop it, really, just stop it.......\nAre you people so hard up for DEI & Woke points that this is what you are making for 'Super Hero' movies????I am a moderate super hero/ comic book person and had never heard of Blue Beetle before this, why did you think you were going to get enough customers that would want to see this???Next, I know Blue Beetle is hispanic, but sorry, I don't know Spanish and too often they would be speaking in Spanish as if everyone in America speaks Spanish and WE DON'T... so either do it in English OR PUT IN SUBTITLES so we know that they are saying.Lastly, WOW... great job stereotyping hispanic people as if they are all loud and corny. This was one movie I was tempted to turn off most of the movie, but I was basically reading the news while watching the movie waiting for it to get good.... yea 3 out of 10. If you are really needing a super hero fix, I guess this could work for you.... but I would simply watch one of the Spiderman, Superman or Batman movies over again.",
    "121": "It is like those \"artistic\" movies that are that slow, you fall asleep, but without being artistic. Like stinky cheese without the cheese.Character building is so bad that it passes through all phases. They're funny, serious, genius, dumb,... all together!Plot holes? Numerus. No, not numerus, too many to count!Logic holes are expected in a \"super hero\" movie. I am not talking about logic holes but about plot holes. Can't explain more without making a spoiler.Special effects? Perfect.Acting? No problem.Direction? ...Oh boy! There are so many directing mistakes that even a student woudln't make.Just stay away.",
    "122": "Another day and another superhero film graces the big screen. This time it's DC with a film that feels like a cheap spider-man rip off without any of the interesting bits.Xolo Mariduena plays a young Mexican guy who's just returning home to his family after becoming the first of his family to graduate from college. Like many of us he finds himself jobless and it debt and now the pressures on as the rent for the family home is about to be tripled. What follows is a story about how a guy who's down on his luck mistakenly unleashes the power of the blue beetle and as we all know with great power comes great responsibility which is a quote that maybe Hollywood execs need to start putting into practice with how they treat their writers.The film is about as formulaic as it could be with every single Mexican stereotype forced in there often in the form of jokes that rarely land. I appreciate seeing diversity in my films but Mexican please let me know are you happy with how you're being represented because I wouldn't be if I were you?The films tone doesn't even feel like that of a DC film it's strangely light hearted to the point where it at times feels like a parody of a superhero film. This becomes an even bigger issue when the film throws in some emotional scenes as they have no affect on an audience as they feel so out of place with the light hearted nature of the rest of the film.I tried to stick with this one for as long as I could and there was a scene in the middle between the main character and his uncle (who by the way is by far the best character) where I felt the film may be about to pick up. This wasn't however the case and for the last 45 minutes I found myself on my phone and I can't say I've been this bored with a film since Ant Man Quantumania. Whilst I know this film isn't apart of the new phase of DC I do worry what may happen to the state of their productions in the hands of James Gunn who has publicly defended this film.For me it's the worst film of the year so far.",
    "123": "As a far of Blue Beetle from Young Justice we were excited to see this movie. For the most part this is a success and the movie has a good heart and cast. If you have \"super hero fatigue\" this movie won't help but it does change things up a little.First the weak points: Not the best villain, but at least a believable one. The pacing of the movie could also be a little tighter. There are a few scenes which probably should be been DVD extras.The strong points: A decent cast who all get meaningful things to do. The core messages are good, but perhaps not original. Still, well-done tropes are still enjoyable. The SPX are very good. Most of the suit is practical effects so they look real and there isn't CGI overload.This is definitely an \"upper tier\" DC superhero movie. I hope they make a sequel.",
    "124": "\"Blue Beetle\" is a new DC movie that follows the box office success of \"Shazam!\" and \"The Flash.\" The film stars Xolo Maridueña as a young superhero and is rated PG-13. The film is inspired by Latin culture and follows the story of a 22-year-old Mexican college grad with a cool family. Director Ángel Manuel Soto's fantasy adventure is familiar to fans of \"Spider-Man: Homecoming,\" \"Black Panther,\" and \"Iron Man,\" but features a main character's superteam instead of Batman and Wonder Woman. Jaime Reyes returns to Palmera City after graduating with a degree but faces a difficult situation as his parents, Rocio and Alberto, have shut down their auto shop and are about to lose their house in a gentrified area. Jaime meets Jenny Kord, who volunteers to help him find a job. However, things take a strange turn when Jenny gives Jaime a blue scarab, a valuable piece of alien biotechnology. Jaime takes the bug out of its box, and the otherworldly entity chooses him as a host, giving him a supersuit and cool abilities. \"Blue Beetle\" takes a Spider-Man comic playbook approach, putting Jaime through the wringer with his new powers, accidentally cutting a bus full of people in half, and even going to space. Maridueña's performance in the learning-to-be-a-superhero scenes is likable, allowing viewers to understand Jaime's strengths and insecurities. The world begins to fall apart as Victoria seeks Jaime to remove alien tech from his body. Jaime's openness to love adds humor and young-adult hormones. DC has had some crummy supervillains in recent years, and Sarandon's antagonist is one of the better examples. Victoria wants the scarab to help her create a One Man Army Corps of souped-up soldiers, including Carapax, a character tied to the controversial real-life School of the Americas. Jaime takes Victoria on with the help of his family, including his Nana, sister Milagro, and Uncle Rudy. Jaime's loving relatives ground his story and add a key sense of representation. The film's plot is grounded in the love and loyalty of Jaime's family, making it a relatable and entertaining story. \"Blue Beetle\" is a comic book series that features Jaime's transformation into a body horror character, blending lively personalities with a deep comic book mythology. The story revolves around Jenny's missing dad Ted Kord, the previous Blue Beetle. As the DC universe undergoes changes, fans can expect more of Jaime in the upcoming reset, highlighting the ongoing flux in the character. \"Blue Beetle\" is a politically spry film that explores the ills of white-American imperialism through the love and loyalty of its characters. The villain, Victoria, is a metaphor for the past and present, while the hero, Love, triumphs over self-discovery. The film's comedy focuses on how these characters mesh, rather than low-hanging memeification, and the family-bound narrative is pure and pure. \"Blue Beetle\" is a superhero film by Soto that despite its unremarkable action sequences, it still maintains vigor due to an entertaining ensemble. Adriana Barraza delivers punchlines, while George Lopez as Uncle Rudy delivers animated pratfalls and one-liners. The film's strength comes from its family, making it an enriching experience at the movies. Although it may not break the mold, it does break expectations. \"Blue Beetle\" is a film directed by Gareth Dunnet-Alcocer, which focuses on convenience and convenience. The story revolves around Jenny stealing a blue scarab, which Victoria uses to develop super-soldiers. Jenny then smuggles it into Jaime's hands, who is unaware of the scarab. Jaime becomes symbiotically linked to the scarab and gets a blue suit. The film's weakest components are the inarticulate composition of the characters, with the villain Victoria being portrayed as a stoic henchman. The film also lacks chemistry between Jenny and Jaime, partly due to Marquezine's overacting and overacting. The film's plot is a mix of nonsensical events and smart beats, but it ultimately fails to deliver a compelling story.",
    "125": "If I take a shot everytime something stupid happens on screen, I will be dead drunk already by one hour.Our protagonists can easily steal important stuffs from the headquarter building of a multi billion company. A weapon manufacturing company! Should I mention that these protagonists are commoners without any thieving or robbery experience?Next, a dead beat uncle who's unmarried, unemployed, and lives in his brother's living room, is somehow very tech savvy, being able to many incredible stuffs, and drives like Vin Diesel does.Next, the father figure has just died hours ago, but his family members, which are supposed to love him very much, have all forgotten about him. They are being happy riding in some high tech bee robot and wield cool guns.Next, a bit overweight scientist guy somehow decides to sacrifice his own life for some young man he has just met. Even if his guilty conscience makes him unwilling to take the man's life, he has zero reason to sacrifice his own life. I will simply watch on the sideline.",
    "126": "One of the best from DC and kinda endearing. This is cute-ish, and if this movie had came out 25 years ago we would probably be pretty happy with it. But this is a C-movie, and it does not cut it today, and being cute is not enough to win over viewers.I have not liked a single one of the DC movies. Not even one. A couple of them have been watchable if you have had a few, and this is in that same general area of \"entertainment\". If you'd been gobbling down a 6-pack and a couple of shots, and you have a soft spot for cheesy cliche 1990s superhero movies than you might enjoy this. If you want quality, originality, good writing, good CGi and other things that make a good movie than this is not for you.There are a few cool moments, a few laughs, a couple of scenes which is good, and the music score is pretty nice. But other than that this is simple, perhaps something cute, something old-timey flashback but also so cliche so you know what is going to happen from start to finish, but yea, so what? You have seen this a million times, why not a million and one time? You could actually do worse. So if you are a big fan of the character, you might even find this to be good or great.I give this a very generous 4/10. Which I believe is the second highest I have given to the DC movies. And the reason is I do not think I wasted my money. Despite the score this is endearing and cute and sort of fun. But anyone claiming this is a good movie is delusional. This does not suck, but it does stink and you should be aware.",
    "127": "Blue Beetle is a very generic comic book movie that doesn't do much that's new however thanks to a core focus on family and groundbreaking representation that informs and enhances every decision made it remains a really good comic book movie and definitely one of DC's better films from their recent output.Xolo Mariduena is charisma incarnate here, Jaime is so loveable and leads the film effortlessly. Adriana Barraza, Damián Alcázar, Elpida Carrillo, Belissa Escobedo and especially George Lopez are a great supporting cast with a believable heartwarming family dynamic.Susan Sarandon could've been a delightfully evil, scenery chewing villain but unfortunately she isn't given much and ends up being completely forgettable. Raoul Max Trujillo isn't much better until some very last minute flashbacks that do actually completely change the character for the better.Ángel Manuel Soto doesn't do a lot to bring his own style to this genre but any and all flourishes of blue neon are greatly appreciated and the hand to hand combat is really fun. The music by Bobby Krlic is one of the most unique superhero scores thanks to its synth style which works well for this character.",
    "128": "I watched the trailer and thought it told the whole movie; corny and cookie cutter, nothing spectacular. I know there is a ton of bias going into this with people assuming DC this and Gunn that, but this movie was so much more enjoyable to watch than expected and I was pretty happy with it.Yes, there are a few phrases that feel forced and would fit into the cookie cutter superhero flick. However, that only really happened 2-3 times. The tech shown in the movie was so incredibly fun and the suit - AMAZING. The quality of that suit is what got me in the theatre in the first place and it did not disappoint.It was a really fun movie (without spoiling it), it was not a replication of another, it had some fun characters (and one or two I wasn't a fan of, some moments of not great acting, but it wasn't a massive budget to begin with). Actually teared up at one point (okay, maybe 2).The best way to enjoy this movie is to get out of your own head with the expectations and inter-connectivity of the films and weird sensitivities. I saw another review mentioning the \"fascist\" comment - as a big fan of the character referenced, I still laughed out loud hearing it because it fits the wild energy of the character that said it (clearly intended as a joke). There's no secret agenda, it's a fun movie for a more obscure character, and I had a blast watching it. Went in thinking it wasn't going to be worth the money, but was pleasantly surprised and look forward to watching it again.",
    "129": "Here we are the first movie in Gunns supposed Reboot and DCU and in fine fashion just like his The Suicide Squad Movie its flopping and sinking faster than the titanic.I tried to give this movie a shot I really did but its terrible and generic to the point they even tried to play the ethnic card and it has completely fallen flat on its face.On the good side atleast the special fx were an improvement.....atleast compared to the flash but come on the DC property since 2017 from its managment and choices has been low par.The movies since 2017 Josstice League onwards have floundered and completely imploded, but hey thats what happens when a studio decided to listen to critics and haters and then started making the movies for those types of people, you get a mess, you get flops, you get mediocre, you get generic and pointless movies.I have no interest in Gunns DCU because if its anything like this then it is over before its started, think I will download his movies because I sure aint going to pay to see them after how the studio treated the actors, directors and its fans for almost a decade.James Gunn good luck with Superman Legacy because even that sounds like another retread of the flop Superman Returns 2006 all over again, gunn your going to very much and seriously need it.",
    "130": "Directed by Angel Manuel Soto, the story follows Jaime Reyes (Xolo Maridueña) as he searches to find purpose in the world after just graduated from college, but suddenly life throws a curve ball when he unexpectedly finds himself in possession of an ancient relic of alien biotechnology: the Scarab. When the Scarab chooses Jaime to be its host, he is bestowed with an incredible range of superpowers and weaponry.I get it, resetting what is already a risky and messy cinematic universe is a risky move, especially since opening it by introducing a quite unpopular character for the wider audience. But man I'd be lying to myself if I said I didn't enjoy this one, it's a fresh and solid start if not a great one. It's slick, fun, and packed with emotions, while this type of origin story isn't new in the superhero genre but there's something special about Blue Beetle's central plotline. It's about the power of family's love and support also acceptance of what destiny has given to us, sometimes it doesn't meet our expectations, and sometimes it's exceeded it more than we can imagine. We can see it from Jamie's character developed throughout the story, actually not just him but also his family. Life after college isn't what he's imagined, Jamie even said he failed the family and it just gets worse when the scarab chooses him. He couldn't grasp the reality of it at first, but he slowly embraced it, Jamie is destined to be their hero, to be bigger than he had hoped for.I never see Maridueña's prior work, but he's certainly the right guy for the role. He delivers a joyful and honest performance, not to mention the rest of the cast who played the family, their chemistry natural and strong. George Lopez' Uncle Rudy is probably my second favorite, The dude is literally a comic relief. I'm not a big fan of the villains in this movie, there's nothing really special other than they play an important part in the story, obviously. I think they are sort of merely a threat, Susan Sarandon's performance isn't bad though. It's crazy that the CGI is way better and cleaner than The Flash, which has more budget than this movie. Both of the suits are practical but, once again, the Blue Beetle is definitely superior. The first suit-up looks terrifyingly awesome.Blue Beetle is a promising start for the DCU.",
    "131": "The original DCEU utters it's last wheeze with Blue Beetle, a film with just about enough character to avoid being the most generic superhero movie of all time. Emphasis on just about.It really should be better than it is since it has plenty of elements that ought to add up to a fun super hero caper. The focus is on a whole family rather than yet another lone outsider, it puts a different culture front and centre and it leans (or at least tries to) into the bright and silly side of the genre. Unfortunately so many parts of the movie feel like they've been given the absolute minimal effort.The story sees Jamie Reyes return to his home city after graduating law school to find out his family are facing eviction. He takes a job with his sister at the mansion of an industrial CEO and promptly gets them both fired but ends up in possession of \"The Scarab\", an alien super weapon that is basically a sentient Iron Man suit. Naturally the evil corporation the suit was liberated from want it back and conflict ensues.Pretty much every part of the plot is as by the numbers as you can imagine. Evil corporation treading all over the little guy? Check. Said corporation's villainous goal is create an army of super soldiers? Check. Bad guy that's a colour swapped version of the main character? Check. Day saved by the power of family/friendship? Check. Its all here and not delivered with anywhere near enough finesse to excuse the cookie cutter nature of proceedings. The same \"it'll do\" approach is applied to dialogue and even the special effects, with jokes that pretty much never land and wildly inconsistent CGI.The acting ranges from not bad to, well, bad. At one end of the scale is Xolo Mariduena who despite having crumbs to work with in terms of character development manages to inject enough likability into Jamie that you don't want to see him get smeared across the floor, even with the insipid dialogue between him and the B-tech Friday AI that powers the Beetle suit. On the other end of the scale is a career low performance from Susan Sarandon as Victoria Kord. I'm not sure if she was asked to chew scenery but decided to try and play it more sinister or was told to be intimidating but decided to camp it up. Either way she falls completely flat somewhere between the two. Maybe she read the final script and simply couldn't be bothered. It's a pity since, with a bit fleshing out, her character could have been interesting given she has every right to feel scorned. As it stands the message from her character arc seems to be patriarchy is...good?The only thing saving Blue Beetle from the absolute dregs of the genre is the Reyes family. None of them are particularly complex but they are all enjoyable and give off a genuine sense of family togetherness that adds some heart to proceedings. They mostly all get a moment to shine but you feel the best version of this film would have found a way to put them more front and centre. There is one joke/twist involving the grandmother that just doesn't work at all. I can imagine the film makers pictured the audience rolling in the aisles but staring in bemusement is the more likely outcome.It really feels like Blue Beetle needed taking back to drawing board and rebuilt one more time but the studio just wanted to toss it out there so they could get on with starting their whole universe afresh.4 successful revolutions started by geriatric matriarchs out of 10.",
    "132": "LIKES:The Music:\n-A simple like for some, the music has a bit of a mixture that is fun, toe tapping, and representative of the moment.-Hispanic raps and ballads have melodrama and that spice at moments with their catchy beats and vocals.-Other songs are that hip hop attitude that comes at the perfect moment to go with the impressive action and training moments. Really pushing the boundaries\n-And the symphony songs are quite impressive when they come out in key moments.The Comedy:\n-A big selling point, Blue Beetle is a lot of slapstick and jokes that might get excessive for some.-If you are Hispanic and have the relevance, it makes the comedy even better, as the cultural references are a deck of cards lined to be a winning hand.-While others are less specific, with great execution, timing, and quirkiness that I had fun with when it all came together.-And those who like uncoordinated tripping, stumbling, and accident prone comedy work to help raise the torch.-While not the most unique, it works for a comic book movie and has a place with a lot of other elements in this movie.The Story:\n-The movie works to add elements that are good for an origin movie trying to reset a big universe.-We have a character arc, some tragic events to put pressure to meet them, a few representable villains, and the growing pains coming with the new power.-It has enough of these elements to blend mostly well, and I enjoyed a lot of the building this movie did with elements that have emotion, growth, and fire that I want in these movies.-And throw everything together within two hours to give you a concise story that is not too convoluted or thought provoking.The Acting:\n-It's a comic book movie, and though we have seen monuments to the acting trade in some other films worthy of pedestal raising.-This movie is not bad, in fact good, for what I call the standard way of comic book movies, with a cast that is likeable, feels like a family, and has a bit more realistic feel.-Becky G's voice is not so much singing, and her new interaction as the Beetle's brain is funny, robotic, and near the end shows elements similar to Jarvis.-Bruna Marquezine has a commanding prowess to her. A balanced array of strength and vulnerability, matched with a real character that works well with the various groups she has to be with.-And Xolo Mariduena the lead is sensational. He's funny, charming, delivers his awkward young adult lines well, but grows into some more engaging moments that match the early days of Marvel and D. C. movies.-And George Lopez is... well Lopez. He works as both comedic relief and a good plot device, which might be annoying and old cad to some, but again holds merit in this movie and build up.The Effects... to some degree:\n-The effects are what you expect in this movie, and DC continues to put out some impressive moments that worked for me.-Seeing the Blue Beetle fly, alongside his fighting mechanics was good for CGI to most degrees.-Fluid animation, good shifting changes using hard light technology, and a few other things that made the currently impossible, possible.-And with explosions and fires having some practical effects helps further blending of the worlds make it a little easier on the fakeness.The Action:\n-It's a little meager to start with as the suit gets time to adjust, but once it does... I was happy.-Blue Beetle has several varieties of action to it, utilizing the start of the abilities and adding a little strategy to the mix up.-Impressive blasting, some good choreography, and helping add a little physical combat offered some mix up to the moments, and with the other things mentioned work to craft a comic worthy battle.-Good cinema alongside adding story elements to it only further enhanced the experience for me, and made most of the fighting in the small time.DISLIKES:The Comedy a Tad Excessive:\n-If you have a high tolerance or an attitude of never enough comedy, you'll have no beef with this category.-For me, there are times where the emotional moments and developments are overtaken by another Spanish driven rant, or another screaming bout.-It gets a little tiresome to hear Lopez cry and scream at every other word of his, but it's not the worst compared to some of the other movies I've seen with overutilization.Predictable Story:\n-I know that originality is tough to acquire these days, but this movie was very easy to guess what was happening.-Foreshadowing paints an obvious direction this film is going and it takes some of the twists and surprise that you might want in a film like this and an edge.-It all ties up about as I expected, and I think could be part of the boring part that people talk about in their reviews.The Visuals Dip Into Mediocre At Times\n-I know this isn't meant to be the most realistic of movies, but Blue Beetle does things well for the most part.-However, there are times that the movie sort of dips in the frame rates and smoothness and gets lost in the hokey fake tones.-Blue Beetle has some polishing to do if they get the okay for a second movie. Maybe a little more blending of the real and the CGI to help blend things. Alongside some better depth and details.-Again, it's not as big for me for most of the movie, but there are some times where post editing was a tad too inconsistent.More Action At The End With Other Characters:\n-There is a part where the movie is about planning out the final battle well and using the players.-They kind of do this, but it's underwhelming and used more comedically than that cool finesse to the grand finale.-Blue Beetle picks up the slack, but everyone else is kind of a waste when the potential was there to soar or fly like the character.-Given some of the fun aspects they were going to look at, but then just dropped or ran out of time or creativity.-This happens a lot at the end with a lot of characters, and this might be the biggest dislike for me that I hope will expand in the next attempt at the DC universe.The VERDICT:\nBlue Beetle is the supposed start to the Gunn universe, and I had a lot of fun with the movie. It's nothing spectacular, mind blowing, earth shattering, or really sand out like they were int eh past, but that doesn't mean it's a throw away movie for me. The film works well with comedy, origin story, and characters, to make an entertaining build of the world and just focusing on the movie itself. While there are hints at what is to come, the movie is trying to just be a comic book come to life, and bring the punches that comics can only do with a good imagination. And the way they utilize references, technology, and action that I really enjoyed and would have liked a little more of. Yet, the movie is indeed predictable in story terms, a tad excessive at times, and needs some polishing to really hit a consistent B and A gam. Blue Beetle may not be the redefining piece many are still looking for, but it was still a fun incursion with enough gusto to dip into the movie theater. My scores for this piece are:Action/Adventure/Sci-Fi: 8.0\nMovie Overall: 7.0.",
    "133": "I'm fed-up with the \"pseudo\" problem people in movies get to have superpower and don't want to fight, or use them, that's all BS.Screaming...\nIn the thrall of the Scarab, Jaime starts screaming. And screaming. And screaming. Screaming as it rockets him through the roof of his house into the stratosphere. Screaming through city streets. Screaming as he cuts a bus in half in a ground-level flyby.Screaming too at his transformation are the members of his family. Much, much screaming.Screaming while fighting, screaming that he does not want to fight, screaming family, this movie should have been called \"The Screamers\"...And I don't even get to the many non sense, like Blue Beetle doesn't want to kill. But the Uncle is willing to stab people with the bug mobile legs. Grandma machine guns down security guards just doing their job.",
    "134": "Blue Beetle is said to be one of the best DC Family film this year. This movie has everything store for the audience. From Superhero fans to the general family audience all can enjoy this film with a happy face. Movie tells us about the Blue Beetle origin of how a boy from a middle class family gets consulted by a scarab and what situation does he face after getting that scarab into his life.The best thing about this film is it does not focus only on one character and the situation what he face but the whole family gets stucked into it and how they deal with that situation. Family Reunion and the way director has shown the Reyes family was one of the highlight of the film. The origin story doesn't hit you very much as it has same old vibe of origin superhero movies and sometimes you'll also remind some of the comic origin movies that are similar to this film.CGI & Action Sequences are top notch and specially the suit design looks cool and Whenever the suit uses it's different techs while fighting is a treat to watch with perfect cgi elements. XOLO has shined throughout the film and gave the character full justice so as the rest of the cast with acting performance too. Villain is one of the major problem of the superhero films and this film also faces the same issues because it doesn't show or the story justifies the strong villain character and at the end movie becomes average with old typical ending.All n all it's a fresh origin story with amazing cgi shots and action sequences plus a family drama with good acting performances which you can definitely enjoy and give this film a One time watch...",
    "135": "Boring. That's all.Full of cliche and typical dialogue.They thought bringing in Mexican jokes and MIHOMIHO is gonna be funny. I don't know spanish and them keep saying stuff in spanish was just frustrating.Cringe at most actually.For about an hour I tried, but it just felt like PG movie made for kids.Power Ranger movie would look like this. Evil vs Good. Power Ranger pew pew stuff.You'd thought DC would show something different, even if it fails DC typically tried something new.Well it ain't. They are going for cash grab, but if they know Marvel, the end is not always good. They are going for downhill now.",
    "136": "Blue Beetle (2023) is a movie that my wife and I saw in theaters this afternoon. The storyline follows a young man who is returning home from college to find his family struggling. He hopes to use his degree to make enough money to bail out his family. He bumps into a millionaire board member while in the process of losing his job and continues discussions after the interaction. They decide to meet up; and in doing sow, the lady hands him a scarab she doesn't trust her company with. The scarab turns him into a super hero and this is the Blue Beetle Origin Story.This is directed by Angel Manuel Soto (Charm City King) and stars Xolo Maridueña (Cobra Kai), Bruna Marquezine (God Save the King), George Lopez (Balls of Fury), Susan Sarandon (Thelma & Luis), Damián Alcázar (Chronicles of Narnia: Prince Caspian) and Belissa Escobedo (Hocus Pocus 2).This is a fantastic origin movie. The writing and storyline makes you care about every character in the family...and this movie is really about family at its heart. You genuinely are very invested in what happens to whom. The CGI is top notch and the action scenes are fantastic. Blue Beetle's super powers are well depicted and fun to watch in action. A few scenes reminded me of the video games Soul Caliber and Mortal Kombat. The ending is sad, triumphant and does bring hope. George Lopez is absolutely awesome in this picture and keeps a fun pace to the film with his brand of comedy. Susan Sarandon was also a solid villain.Overall, this is an entertaining origin story and worthwhile addition to the super hero genre. I would score this a 7.5/10 and strongly recommend it.",
    "137": "After graduating in the law school, Jaime Reyes (Xolo Maridueña) returns to Palmera City to meet his family, and soon he learns that they are broken and evicted from their home. His sister Milagro (Belissa Escobedo) gets a cleaning job for him at the mansion of the wealthy Victoria Kord (Susan Sarandon). However, they are both fired by Victoria when Jaime interferes in a discussion between Victoria and her niece Jenny Kord (Bruna Marquezine). When Jaime is leaving the house, Jenny asks him to look for her in the Kord Tower for a job opportunity. On the next morning, Jenny learns that her aunt is using an ancient alien Scarab to develop powerful weapons and she steals the artifact. Meanwhile, Jaime is looking for her to get a job, and she uses him to leave the Tower with the scarab hidden in a burger to-go box. His curious Mexican family opens the box and Jaime becomes the host of the alien scarab and they fuse in a powerful weapon. Jaime looks for Jenny to have explanations but he turns into the Blue Beetle. She tells him that they have to remove the device as soon as possible; otherwise, the fusion will be permanent.I had expectations to see \"Blue Beatle\" mainly because of the Brazilian actress Bruna Marquezine in a lead role. However, the film is a great disappointment, with a terrible and long screenplay about another unknown superhero. The silly and ridiculous Mexican family spoils the whole movie with their foolish behavior. It is annoying to hear and see them, and it seems to be a critic to the behavior of Mexican families in particular, and Latin families in general, in a prejudicial view of the author. The humor does not work and it is unfunny actually. And based on the cliffhanger in the credits, it seems that the productors intend to make a sequel. My vote is four.Title (Brazil): \"Besouro Azul\" (\"Blue Beetle\")",
    "138": "Dull, boring and derivative. In short, Blue Beetle sucks. While it's great to have the world's first Hispanic super-hero, it's a shame it has to arrive via this s#!t film.From charmless characters to a convoluted storyline, the whole film just drags.The lead actor - Xolo - is completely uninspiring. Bruna completely lacks a personality. The sister comes across as a complete jerk. The others have the standard Hollywood superhero nothingness, just one dimensional fillers. Presumably they thought that the heavy emphasis on family etc would fill in the gaps, but yeah nah. Didn't at all.The director tries to infuse lots of synth music, but the film never pulls it off right. The plot is both standard and completely sucks. There's nothing new here, folks.Superhero movies saturate the cinemas, and while Marvel has a good run, the DCEU is trying to get started a decade too late. James Gunn might make okay movies, but I doubt he's up to the challenge that rebooting the DCEU will take.Skip it. You won't regret it.",
    "139": "Blue Beetle was directed by Angel Manuel Soto and written by Gareth Dunnet-Alcocer. I expected this film to be focused on the family side and overall drama of Jaime Reyes' life, mostly because of the film Soto directed, Charm City Kings which was a film I loved. This is a superhero film for the entire family, with themes focusing on family but especially displacement, colonialism, and gentrification in terms of what the director said about the film's themes.For this film and Superhero, I don't have vast amount of knowledge of Blue Beetle except for some comics and especially the Young Justice show and Injustice 2, but this film made a great job at showing the character and hero for a new audience, hopefully even making him into a well known one.An alien scarab chooses college graduate Jaime Reyes to be its symbiotic host, bestowing the teenager with a suit of armor that's capable of extraordinary and unpredictable powers, forever changing his destiny as he becomes the superhero known as Blue Beetle.The film stars Xolo Maridueña as Jaime Reyes / Blue Beetle alongside Bruna Marquezine, Adriana Barraza, Damián Alcázar, Raoul Max Trujillo, Susan Sarandon, and George Lopez. Having seen Xolo Maridueña in Cobra Kai, I've seen both his capabilities of a dramatic actor and in action sequences, when he was cast in this role I was behind it 100%. Having now seen the film I think he's what makes it decent to good. The costume design was on point, especially the Blue Beetle costume. It's inspired by Young Justice and Injustice 2 along with other versions of the costume. Filming was done mainly at location and with heavy use of practical effects, such as the Blue Beetle suit. The director felt that the use of real-life locations allowed for the practical effects to be better integrated into the movie. Thus making it rely less on CGI and instead of what is best, practical effects. I really liked the action sequences, both how it was shot and edited. I think the film looks really good, great cinematography. I really liked the characters and actors playing them; Bruna Marquezine as Jenny Kord, Susan Sarandon as Victoria Kord and Damián Alcázar as Alberto Reyes being three who impressed me.What Blue Beetle does extremely well is how they keep it family-focused and embraces the lore preceding this Blue Beetle, I'm of course talking about Ted Kord and Dan Garrett, the film also have a lot of heart. Critics found it to have plenty of humor and yes it does, but I felt most of the jokes fell flat because of how childish they were then again the majority of the audience was children when I saw it at the cinema. The highlight for me is Xolo Maridueña's magnetic performance in the title role, he's just terrific and does such a good job bringing the comic book character to life. The writer and director does too, a very fine bringing the story and origin to life. Blue Beetle is a fun little movie, using each million of its budget to good use, you kind of see why it was supposed to go straight to streaming as it looks quite cheap at times (mostly the antagonist and the visual effects to him, Raoul Max Trujillo as Ignacio Carapax / OMAC). But it's a good film, a good superhero film and worth your time.",
    "140": "That's the more appropriate title for this movie, cause apparently the Blue Beetle isn't the Scarab. The one which crawled up Jaime's ass wasn't Blue Beetle. Blue Beetle was Jenny's Dad in his superhero form. False title if you ask me. The background story was uninteresting enough to pull the audience in. They should've shown more background on the Scarab. Where does it come from, what it actually is, what's its purpose. It'll give the audience more depth to tune in. The villain has created the bare minimum of threat to anyone to show any significance to be dealt with. So there's one more less reason to watch this movie. Usually Susan Sarandon delivers awesome performance either as an antagonist or protagonist. But in this movie, she kinda hovers around. But I understand that it wasn't her fault. She can only do so much with the script that's given to her. I feel bad for her. But alas, even with the negative reviews I've written, I still can't give it less than 6 stars. Cause at least it's more interesting than Black Widow. And I think the real Blue Beetle is coming in the next installment of this movie. I hope they'll do better next time. I'm giving it another star to give the writers some encouragement.",
    "141": "5 out of 5 stars.Blue Beetle is an awesome superhero film which introduces DC first latino hero. The film has its sense of style and direction. It has plenty of heart, emotions, and action to make this a great film.The plot is great with Jaime (Xolo Mariduena) coming home from college. Only to come across a technology bug that imbedded in him with a suit and powers. While a corporation is after him.Great cast ensemble and a performance lead by Xolo Mariduena. The action sequences are awesome. The visual effects are also good. The humor may be overboard. It is a great Dc film which i loved way more than the Flash. Or if its a start in James Gunns dc universe. The film is off to a great start.",
    "142": "So much wasted potential in this movie.The first 45 minutes are incredibly slow and filled with disjointed plot/character development. The theme of \"family values\" is crowbarred into nearly every scene, but the script does a poor job connecting the audience to the characters.Susan Sarandon gives a wooden performance as a one-dimensional baddie. George Lopez falls flat as the zany tech-wizard uncle. Xolo Maridueña and\nBruna Marquezine are capable actors and fun to watch, but lack chemistry.Even in the thick of the action, pace is erratic. Bad Hollywood action cliches abound. Rather than overcome obstacles through strength of character, the good guys seem fated to win as teenage girls are able to fight professional mercenaries as equals.Overall, Blue Beetle comes across as a money grab. It copies elements of family superhero films (e.g., Antman) but fails to capture the heart. It takes itself too seriously at all the wrong times. It's just bad entertainment - I literally could not watch it all in one sitting because it was so painful to sit through.",
    "143": "Very few, except for older diehard Super Hero comics fans actually know who Blue Beetle is. He is not \"the melding of Ironman and Ant Man\" nor is he a smart mouth Gen Z. Blue Bettle is Ted Cord, an industrialist along the lines of Bruce Wayne, more than Tony Stark. He predates DC and was bought by DC from. Charlton Comics. Anyone who goes back to read the originals or his 1980s participation in Justice League will recognize the Watchmen character Owl who was based on Blue Beetle.Sadly, the trend in comics today is to present flawed people with powers rather than Heroes a reader can aspire to. This trend is given a nitro-burst in Hollywood where many supers are actually criminals such as Deadpool, Venom, Black Adam, Joker, Ant Man. It is part of the culture that wants to redefine (read obliterate) the notion of Hero under the guise of \"humanizing\" the character. To paraphrase The Incredibles (a truly underrated story), if no one is special, then everyone is.So it comes as no surprise that this version of Blue Beetle fails, because it offers nothing to lift the spirit of the viewer, nothing they can take with them as they leave the theater. Bruce Wayne comes out of the theater with his parents, having just seen Zorro, only to have them murdered. He idolizes the HERO he saw in Zorro and dedicates his life to fighting crime so no other child has to lose his parents. He is the Dark Knight who does not kill...until the 1980s when. Tim Burton gets his hands on him and devolves the character.You will probably enjoy Blue Beetle as the empty shell, devoid of any human value other than mindless entertainment. Sadly, we could do so much more.",
    "144": "Acting: 3\nCamera work: 6\nEditing: 5\nBudget: 7\nStory: 3\nTheme: 2\nPure entertainment factor: 4\nVideo quality: 7\nSpecial effects: 5\nPacing: 6\nSuspension of disbelief: 2\nNon-cringe factor: 2\nLack of flashbacks: 7This movie is a giant mess and doesn't understand what it is trying to be or tell.The hero has a sister who constantly whines about how South American people have in hard in this city and how other people, likely White rich people, have it all and take it all no matter how hard these Mexican immigrants work so she doesn't even want to get an education or a proper job as it won't matter in her eyes. Yet the movie shows exactly why she is working low-paid jobs with no job prospects and her brother is working his way up. She uses a private bathroom then instead of trying to sneak herself out brags about her business while strolling out the stall catching the house owner, the evil lady, staring at her and firing her on the spot for being this dull headed. Anyone would have fired her here. She clearly shows she can't even follow basic rules or act civilized. And this type of behavior is constant from her so this one event just illustrated how she acts regularly. She's a racist hateful and extremely lazy uneducated worker. Her brother meanwhile just got this low-skill job and basically in what seems to be their first day gets a giant opportunity for getting a much better job in the company after being fired because of his sister. So a lead character got to explain her worldview with no one budding in and yet if you look at what is actually on screen it's the complete opposite. Yet there is never anyone to dispute any of the claims because the only White person here is the evil lady. They could have made this into some thematic debate yet she is just pure evil with no depth whatsoever.There is also a plot about how the giant tech company didn't make the evil lady CEO and instead made her brother CEO even though she ran it. The movie calls it out as sexist and tells this small story several times over. Yet from the very first scene she is made out to be an evil maniac who doesn't mind killing innocent people to get her way. She's nasty and evil to the bone and extremely open about this threatening people to their face just for fun. Apparently she turned evil after her brother got her job and then took over the job later on. But this is a hard sell. She was a great CEO then by not getting to keep her job turned into an extremely coldhearted murderer? This is an experience millions of people have in real life where they don't get their fair share. You get turned down or lose your job for unfair reasons all the time. Maybe even once every 5 years if you work in a competitive industry. If all those people turned into psychopaths we would have a huge problem. A more logical explanation would be that she was always pure evil and just hid this as she was gifted power from a young age because of nepotism and didn't need to step on toes. People saw this and replaced her and she clawed her way back. Actually, this would be a BETTER story. Instead everything is sexist or racist here. She experienced sexism and she is apparently racist. There is nothing deeper here.We also have the love interest literally cause a main death. An act that would make her hated forever in any real setting. Yet here they don't even mention it. Because obviously she's part of the good guys so her actions are therefore positive like in all other superhero movies. The movie doesn't care about what actually happens. It just forces a storyline into events that don't support this storyline whatsoever. It's like the writers didn't understand their own story which seems extremely common in modern movies that are largely produced. This trope scene is here, that trope scene is here. Step by step. Except they don't really create a storyline combined. Producers just selected them ahead of making the movie and forced a progressive immigrant theme onto everything and the writers just had to follow suit. Yet the themes are utter nonsense just forced into the movie via dialogue. It removes all depth and clearly this is why all actors phones it in.Everything here is extreme cringe. The acting is horrible and all dialogue is extremely on the nose in a way where even kids would notice this. Which is extra offensive as this is made for Latin Americans and other DC movies weren't this childish and silly. So they investigated the main market for this movie and figured out they had to make all characters constantly say what they were doing as they figured viewers wouldn't get it otherwise. Superhero movie viewers are not the smartest group of people overall, but this is made for people who don't even understand basic movie stories and have never seen a superhero movie before. So are Latin Americans in USA this clueless about basic superhero stuff? They have never seen a single superhero movie before?It's also extremely irritating how the lead does nothing. Everyone just pushes him around, but he's not even kind or smart. He's not even a clear weakling trying to stay safe. He's just nothing. He doesn't make any decisions and doesn't react or change things. His sister is bullying him because she's hateful and bigoted yet while they share parents he's completely different. They could at least have made him try to hide or avoid danger or responsibility like with Spiderman. Or made him into a regular guy trying to keep his life normal like with Clark Kent. Just some motivation in some direction even if it's something negative.The story overall is also nonsense even if we ignore the extremely cringe moral stuff. In one scene they need to break into a building and randomly we learn that a family member has made an extremely advanced system to shut down any security system anywhere even though this is an extremely advanced building with a room full of security guards controlling the IT security. We never learn why he knew all this extremely advanced IT stuff as an old guy or why he acts like a poor clown living with his brother when he is actually a genius. In another scene regular characters pick up weapons and become superheroes right away. Zero training. This is what modern movies do wrong. They always want to have some young girl also be a superhero and then create superheroes out of whole families. Which could work in some cases if they received training first and could die. If they are just like the main character superhero then obviously it means nothing. In another scene the main character has something extremely wrong with his body and needs to seek help right away. Yet his family is afraid of cops as they are illegal aliens. So they forbid him to seek help and freak out when he does. Again, this makes zero sense. He's 22. Why would they let him suffer and potentially die just to remain hidden? Are they psychopaths? He's an American citizen who just got his diploma yet suddenly he's not allowed to talk to doctors or people who may help? What?The movie looks and feels like a long episode of a dirt cheap TV show. But unfortunately TV shows have way better writing today. So besides the CGI being cheap and acting clearly all one-takes with no depth it doesn't even live up to a B tier TV show. Though I must admit some of the superhero TV shows are quite terrible. This is not just bad, this is unwatchable. And I am truly shocked that reviewers didn't notice the horrible acting and pathetic writing. Just watch the first 5 minutes. It's extremely clear this is not a good movie so how did people miss this?",
    "145": "Why, why is everybody yelling all the time? The dialogue so cheesy, the plot so flimsy. Never was I so annoyed watching a movie I actively wished all the characters to die a painful death. Perhaps except the father and Jenny. Oops. Heck, the mystery of Jenny's dad, who was never shown on screen, was more enticing than the premise of the whole movie.Dude, your boss at a weapon's tech company gave you an important box when the company was entering lockdown, told you explicitly not to open it, not to touch it. You opened it, understood that it was indeed something important despite the box's unassuming appearance, and went ahead to play around with it anyway. What the heck?And so much for insisting \"no killing\" in the first half of the movie, which led to the protagonist annoyingly becoming a punch bag who won't even defend himself. The movie ended with a massacre of the \"bad guys\" while his family was visibly enjoying themselves while doing do. Oh yeah, and there's one last \"no killing\" at the end, which led to the whole island blowing up. What even is the point of all these?I started out giving this a 5/10. Then progressively downgrade it to 4 then 3 and then 2. What a load of dung.You get it? Dung beetle?Still more relevant a joke than the beetle fart gag in the movie.",
    "146": "Blue Beetle tells the story of Jaime Reyes(Xolo Mariduena). An extraterrestrial scarab chooses Jaime to be its symbiotic host, giving him superpowers that alters his life forever. Jaime becomes the superhero, known as Blue Beetle.Blue Beetle is a mind-blowing film. Director Angel Manuel Soto has given us a superhero movie that shines the spotlight on the titular character's family, while also giving us unlimited humor & heart. The action set pieces are phenomenal. The visual effects are perfect. The background score by Bobby Krlic is electrifying & unique, compared to the usual superhero movie background music. The performances are the standout of the film. Xolo Mariduena knocks it out of the park, as Jaime Reyes. Mariduena gives us another spectacular performance after his starring role in fan-favorite, Cobra Kai(2018-). Bruna Marquezine is outstanding as Jenny Kord. Becky G is effective as the voice of Khaji-Da. Susan Sarandon is fantastic as Victoria Kord. Belissa Escobedo is amazing as Milagro Reyes. George Lopez is hysterical as Rudy Reyes. Raoul Max Trujillo is awesome as Carapax. Damian Alcazar, Adriana Barraza & Elpidia Carrillo are excellent as Alberto Reyes, Nana Reyes & Rocio Reyes, respectively. Harvey Guillen is brilliant as Dr. Sanchez. Blue Beetle is a must watch (preferably in IMAX), for Blue Beetle & Xolo Mariduena fans. I'm so glad that James Gunn has decided to include Jaime, in his new DC Universe. Can't wait for future team-ups & sequels!",
    "147": "Blue Beetle is a superhero action movie from Angel Manuel Soto, director of Twelve and La granja.Jaime Reyes (Xolo Maridueña) returns home to his family, but learns that a lot has changed during his college years at home and his family has deteriorated financially. To help his family, he looks for a job, which he tries to find at the wealthy company Kord Industries. Here he comes into contact with Jenny Kord (Bruna Marquezine), who asks him to help her smuggle something out of the company.What Jaime smuggles out turns out to be an alien scarab, which Jaime chooses as a symbiotic host. This is how Jaime turns into the Blue Beetle. Now he must fight Victoria Kord (Susan Sarandon), the boss of Ford Industries, who wanted to use the scarab for her own purpose. To counter the scarab, they try to threaten Jaime and his family, so Jaime as Blue Beetle now has to try to protect his family.This movie was first going to be released on the HBO Max streaming service, but they later decided to release the movie in cinemas anyway. It was also unclear whether this film still belongs to the old DC Extended Universe film series, or at least as the start of the new DC Universe film series, this film series would start. James Gunn, the new CEO of the DC film series, was also growing past this himself at first, but eventually decided that the film would meet as the first film of his new DC film series, because he still wanted to use the character of Blue Beetle at the front of this film series. Despite meeting then anyway for this new movie series, the movie remains much of a standalone with no real further references to other DC movies to come in the future. James Gunn can still remember that.Despite the uncertainty of which film series the film belongs to, the film itself remains a standard, standard superhero film, which does not bring much uniqueness. The movie is good about a Latino superhero, who carries this culture with him. This is something unique for a superhero movie.Furthermore, the film seems to copy more superhero moments from other superhero films. For connoisseurs of this kind of film, the film can come across as a bit unoriginal and it remains on a predictable side without creating real tension.The visual effects are also on the mediocre side with more of the quality you expect to see on a streaming service, which was also the idea for this film. For example, some of the effects appear less spread out.Xolo Maridueña tries to be the main character for as many days as possible, but this is sometimes made difficult for him by the standard quality of the film. Still, just as if he meets the early seasons of the TV series Cobra Kai, he knows how to portray a character that you as a viewer care about. Just like with Cobra Kai when the focus shifts to several different characters, he falls more into the background. Together with the castles, which his other relatives play, they still come across as a family with a Latino culture. Sometimes they just often try to do unnecessary things, while this is not always necessary. The villains in the film also come across as a bit standard as cliché villains from a superhero movie, who have no real good reasons for their evil plans.",
    "148": "Trying to be optimistic about the new DCU going into Blue Beetle I was hoping to see something a bit more fresh come from DC as whenever I saw this trailer come up in the theater it looked a bit basic but I kept thinking to myself there must be more to this if they're using this as the first film of the new universe. Boy oh boy, was I wrong, I seriously hope going forward that this is not the new baseline going forward. Blue Beetle felt possibly the closest thing I have seen to a slightly higher budget CW show but instead of evenly spreading its budget to everything equally they just spent most of it on the suit. I would easily rate this movie a star but the two extras are for the suit and Xolo, whom with a better script would definitely have been better. The jokes do not land whatsoever, in fact I swear I heard some of them done in other movies before, to call the story basic is too kind - it is literally the same story audiences have seen a hundred times, within the first 15 minutes you can practically predict where the entire plot is going to end up and somehow this movie makes it feel even more cheap. Not a great start to all of this, hope they keep the actor but do something completely different going forward.",
    "149": "This movie is just awful. It copies all the aspects of the worst superhero movies of the last 25 years and it's not even meant to be a spoof. The copying is so exact that the uncles van even plays the same song as the friend in Ant man.For some reason the shots look like early 2000 movies. All the scenes look quite tacky and just overall little effort is put into it. The acting all around is weak and it makes it difficult to connect to the characters.As much as Marvel has struggled since endgame, DC has made some of Marvels recent films like Christopher Nolan pieces.This is one of those movies where you can hardly remember the plot even a couple of days later.James Gunn has a huge project ahead in cleaning up the franchise."
}