{
    "0": "He can't do it. He's now had four chances, and none of them have worked. Stop him, please.I'd say for the first 40 minutes of so of Believer, I was on board. Green's direction was shockingly restrained; the plot, while nothing spectacular, was methodically introduced; and the editing was quite effectively unnerving.Then the film takes a nose dive into generic bilge and doesn't stop spiralling downward for the remaining hour. The only good thing I can say about this latter half is that the performances remained earnest throughout.Ellen Burstyn as Chris MacNeil is brought back 50 years later only to have her character eviscerated, forgetting every lesson she learned in the original film. Then she gets pushed aside halfway through the movie and has zero bearing on the plot. She's only present for an insultingly inane attempt at fan service.None of the characters have the complex compassion, flawed priorities, or stunning courage that was present among the cast of the 1973 classic. This film is full of nothing characters and it becomes more apparent as the story progresses and the writers had no idea what to do with any of the people populating their script.The generic plot builds up to a climax that's incoherent in every conceivable way: thematically, tonally, and narratively, it's all over the place, earning none of the feeling that it attempts to evoke with its heavy-handed musical cues.Given the solid first act, this movie's nowhere near as bad as Exorcist II or Exorcist: The Beginning. But I'm still appalled.I'm appalled that the same filmmaker has now made four movies stemming from classic horror cinema, and all of them have been haphazardly thrown together with no thought given to coherent storytelling.David Gordon Green, I'm begging you: stop.",
    "1": "I tried to like it, but after some 10 minutes into the movie I began to fear that this was a complete and utter dud. And it turned out I was right.The bad: it is suppose to be horror, but it isnt horrifying for one minute. A bit freaky and strange, but definitely not scary. And I wanna get scared watching such a movie. That is the whole point of making horror movies.More bad: besides a wonderful performance by the ever great Ellen Burstyn, none of the other actors impressed me. The 2 kids, who were possessed were okay, but not terrific either. But the other actors were plain average or even below average.Defnitely an insult to the classic original from 1973, which was an absolute shocker of a classic!",
    "2": "The original The Exorcist was awarded an 'X' certificate in 1973 on account of its shocking content and graphic imagery, which had audiences reeling in horror. David Gordon Green's The Exorcist: Believer is a 15 certificate on account of its tepid scares which will have viewers questioning their life choices.Having given us three of the worst Halloween movies, Green now takes a dump on another much-loved horror franchise, proving once and for all that he has zero understanding of the genre. The first half of Believer will have you thinking that you've somehow seated yourself in front of the wrong cinema screen: it feels nothing like a horror film, focusing on the hunt for two teenage girls who go missing while walking through some woods.The second half is where the possession stuff starts to happen and is so bad that it will have you wishing that you HAD seated yourself in front of the wrong cinema screen. All the expected tropes are present, but executed in a predictable, lifeless and inoffensive fashion. Ellen Burstyn's supposedly poignant monologue about joining forces to beat the devil, delivered shortly after her character has had both eyes poked out, is particularly cringe-worthy.Green saves the worst for last, the long awaited exorcism ritual carried out by the local Neighbourhood Possession Watch, the only real priest on hand being no help whatsoever. In the end, the devil gives those present the chance to choose which girl lives and which girl dies-and I still can't believe that they took the route they did...2/10. Not as execrable as Halloween Kills or Halloween Ends, but it's close.",
    "3": "In Exorcist Believer, director David Gordon Green seems to be stuck in a deja vu loop, recycling the same formula that worked for him in \"Halloween.\" Unfortunately, this deja vu doesn't bring nostalgic chills, but rather a sense of disappointment. While Chris, a character from the original Exorcist, is dragged into this lackluster sequel, the rest of the plot veers into its own abyss of a weak and disconnected narrative. This movie really has zero connection to the original Exorcist. Green takes a strong character like Chris and, instead of adding depth, blindsides her with a disrespectful twist that feels like a disservice to the original film. The writing is terrible, leaving the story merely okay, but its blatant lack of connection to the iconic Exorcist makes it feel like a missed opportunity. The movie is not suspenseful, it's not scary, it's not shocking, it's nothing that the original Exorcist is and doesn't even come close. Perhaps, it would have been better marketed as a standalone movie with a fresh title, sparing itself comparison to one of cinema's horror gems. David Gordon Green NEEDS to stay away from making horror movies.",
    "4": "To be honest, I didn't expect much from this movie, but I just went as a big time Horror fan and even then I was disappointed.The plot is messy. It makes no sense at all.there was no reference to the original demon itself or its name Pazuzu (except it mentioning it's the same one to Chris McNeil)Chris McNeil's part in the movie is a forgettable cameo which made no sense and added nothing to the story or movie. Not her fault and she didn't even want to do it but this is on the directors.the whole exorcism was also underwhelming and lame with nothing to offer.the worst part was the ending. 2 people are dead and law enforcement is walking around as if nothing happened. No questions to the parents and also not much shown about the dead girl's parents afterwards. It was just stupid.What a waste of time and such an insult to the original 1973 film.",
    "5": "Which is the obvious conclusion to trying to make a waaay past its due date sequel to one of the greatest horror movies of all time; and still the best one based on exorcism and possession. My favorite part was literally the last 15 seconds into the credits and (finally) original sounding Tubular Bells. The writing was thin. The acting was flat. The storyline left nothing to unfold and, like other reviews said, rushed from two girls acting weird after getting lost in the woods to two girls being exorcised by a hodge podge of underdeveloped family members and random undeveloped religious healers in a ceremony that was based on various not fully fleshed out religious beliefs, which are still unclear to me. Why were any of those people really there? Wow. Getting Ellen Burstin to say those shoddy lines, probably playing that character for the last time in our lives, they didn't even put her in the actual exorcism scene. I'm glad she got the funds for her non profit which was why she said she did it in the first place. Cuz there's no way she read that script and was like \"I'm in!\" Anyway go see it for fun but after the first 45 minutes you'll wish you had a fast forward button to skip to the last five minutes. You will leave wondering why everyone at the scene of this exorcism wasn't immediately arrested for child neglect considering there were next to no scenes in this film that helped us understand how we got from scared in the woods acting weird to strapped to chairs in a dining room. It was just like... they are acting weird, they must be possessed! Go get Regan's mom and let's cast out these demons. Mike Flanagan would be a considering choice for this demon possession remake but not David Green not him.",
    "6": "So, first off, I must say that I'm an enormous fan of The Exorcist (1973). It's in my Top 3 Horror films of all time. Quite literally one of the quintessential titles in tbe genre, so, I was honestly very terrified about this new movie coming out, especially after David Gordon Green's downfall with Halloween Ends. Having seen the movie now, I'm not sure how the general public will feel about this film, and responses I've been seeing have been pretty divisive. With that being said, I thought this movie was very good and was not at all offensive to the original 1973 classic. Specifically, the final 10 minutes of the film were filled with so much adrenaline, and they so something very ballsy in the end!! The movie obviously isn't as good as the original Exorcist, and it was never going to be, but for what the film is, I was genuinely surprised by it. If you have time later this weekend, check out the movie and decide for yourself on what you thought.",
    "7": "Horror movies just aren't made like they used to be. How these \"horror\" movies like Five Nights at Freddy's, Scream 2023, Megan, There's Something Wrong with the Children, and soooo many more like this receive an IMDb rating of 7 stars, yet this movie is rated in the 4's is mind boggling to me.Exorcist: The Believer is not a new concept. It's not a unique storyline that's never been done before, but it is a good movie. It's a possession film with plenty of jump scares, moments that creep you out, and moments that make you want to turn the lights on. To me, THAT'S what makes a good scary movie! The acting was great, the storyline (although done before) was a good one that kept you on your toes and entertained. Trust me, in comparison to the \"horror movies\" being advertised today, this one is worth the watch.",
    "8": "It's so obvious that the 10 star reviews on here are fake/paid for, considering they all have very similar wording. I'm a huge horror fan and try to watch every new horror movie that releases, so believe me when I tell you this movie sucks. David Gordon Green destroys yet another beloved horror franchise, but i'm sure we all saw that coming after what he did to Halloween. Don't waste your money going to see this movie in the theater, maybe then David Gordon Green will get the message that no one wants to endure his garbage storylines anymore. No one expected this to be anywhere near as good as the original, but it still managed to be a massive let down.",
    "9": "John Boorman can sleep a little easier tonight; he is no longer responsible for directing the worst film in The Exorcist franchise. Why, in the name of God, does DGG bring back Ellen Burstyn just to treat the character of Chris McNeil with such contempt? Watching this movie I started to wonder if DGG hates William Friedkin. That's the level of disrespect on display. This is the worst film I've seen in some time, and in this day and age, that's saying something. It's one of those movies in which a character, or in this case 3 or 4 characters, stop to tell the audience exactly... What. Is. Happening. On. Screen. More than a bad film, it's an enraging one. The option should exist to award zero stars. It's existence is a blasphemy.",
    "10": "Ellen Burstyn is given the line \"They didn't let me watch my daughter's exorcism because of the patriarchy\". Really? Is this the best writing ya'll can do? Keep the strike going if that's the case. We're expected to believe that Ms. McNeil would be anything less than grateful to the two men who literally died to save her daughter? This is ridiculous and this line alone should tell you everything you need to know about the current state of Hollywood. A place where the new motto is \"We piss on our former heroes to elevate our new inferior ones\". This movie is a sham and on top of all that it's not even a good enough film to pry open the coffin of this dead franchise for one more cash grab reincarnation. Wait until this hits Netflix or Hulu. It's not worth a matinee ticket.",
    "11": "You'll never out-exorcise \"The Exorcist\", as much as fans and average theater patrons might want to. \"Believer\" does neither and I thank David Gordon Green for that.We all know the abomination as \"Halloween Kills\" and \"Ends\" (although I enjoyed \"Ends\") and we were all expecting that when it was announced that Blumhouse was going to be making an \"Exorcist\" trilogy. However, DGG put together a well written and executed story that leads up to a pretty good ending and sets us up for the sequels.I could go on and on about script issues and how everyone pulls it together at the end to \"defeat\" evil, but what's the point in that!? See the flick! I guarantee you'll have fun!",
    "12": "This film has a very strong first half. So much so I was confused by how bad the reviews are. Then the second hour comes. While it doesn't quite fall off a cliff, the payoff isn't as good as the set up.The movie seems to be very ideologically confused, and as the title suggests believing is how to conquer evil. Believe in what though? Not sure.I'm not sure this movie will appeal much to fans of the original Exorcist. It does not have the same vibes. That's probably ok, as it's hardly a sequel at all. Ellen Burstyn is criminally underused.The Exorcist as a modern day studio horror film was never that great of an idea. But hey, I'll show up the The Exorcist: Deceiver.",
    "13": "I'm not giving it any stars.Honestly must be the worse film I watched. No storyline and as for a \"horror\" I get more scared looking in the mirror and seeing myself. I paid £15 to watch it odeon Lux and it was a shambles.I understand that it's nothing like the original but you don't see how these kids get possessed they just turn up from the forest they get lost in. I honestly have nothing else to say other than do not waste your money or time in going out of your way to see this.I am honestly gutted was really looking forward to it!!Please do not watch this film. It's honestly god dam terrible. The film is so bad I've gone out of my way to write this review.",
    "14": "THE EXORCIST: BELIEVER (2023) ** Leslie Odom, Jr., Lidya Jewett, Olivia O'Neill, Jennifer Nettles, Norbert Leo Butz, Ann Dowd, Raphael Sbarge,\n(Cameo: Linda Blair) Unnecessary chapter in the fledgling franchise this time with a double tap possession of two young girls (Jewett and O'Neill getting in touch with their inner Linda Blairs) and their parents' attempts to cast the demons out while enlisting legacy character Chris MacNeil (Burstyn, in little more than a glorified cameo shot, still brings the brittle and steadfast spirit of her iconic character at the age of 90!)to help their dire circumstances. While the affectionate salute to the late, great make-up wizard Dick Smith the practical f/x/prosthetics do mirror eerily his scary good creations, the film checks off all the boxes of a run-of-the-mill sequel. Filmmaker David Gordon Green once again plunders a beloved horror classic and essentially grave robs it of its spirit in spite of a wink and a nod to 'Tubular Bells' and Spoiler Alert: Blair's anticipated one shot.",
    "15": "The Exorcist: Believer words from the original It tells you lies The trailer tells you lies! Masquerading as a horror movie the true horror is actually watching this rubbish. There is a slow start to this rubbish and I thought a slow burn movie all right give it some time. Just lingered and lingered. The Exorcist: Believer turns into Hollywood's woke all people coming together etc etc etc story drag collage of gobble goo! The ending tries to be moving, but what message came to me is leave exorcisms to the professionals. Humans can not understand evil, or debate with evil the confusion of the character is the only accurate part of the movie. Skip this one. 3 stars.",
    "16": "I knew this was never going to surpass the original, but the trailers looked decent, so what the heck, right? The first red flag was the director. He did a pretty good job on the 2018 Halloween. Then the other two came out and oh my, talk about how to ruin a good thing. Now he decides to take the driver seat to one of the most iconic horror movies ever made. The two child actors do a good job, they do have some creepy scenes and the movie has some decent parts to it, but overall, I left the theater just feeling like things could have been executed better. Now I hear that this will be a trilogy now too? Yeah, no thanks.",
    "17": "Watching this movie is like undergoing a two-hour exorcism through boredom. What started out as mildly intriguing albeit unimaginative premise devolves into a silly, hollow variation on the original. Throw in a generous serving of detritus and effluvia, a touch of CGI, and a disorganized multi-faith ritual, and you're done! I started looking at my watch after about thirty minutes to calculate how much more tedium remained.Even the demon Pazuzu was nowhere nearly as entertaining as the original. Yes, there is the requisite foul language, but Pazuzu was also snide and sarcastic... there's nothing like \"Your mother's in here with us, Karras. Would you like to leave a message? I'll see that she gets it.\" I was patiently waiting for some equally as clever and rude demonic quips, but there were none to be had.The Exorcist is a masterpiece of cinema, horror or otherwise. It's been done. Move on.",
    "18": "When The Exorcist first came out in 1973 it was considered one of the most graphic and shocking movies ever made. There were stories of people getting sick and becoming hysterical watching it and one woman even claimed it made her miscarry! I think it says a lot about callous we have become that THIS movie was just as gross and scary and no one in the theatre seemed to be overemoting that I noticed. David Gordon Green (who revived the Halloween franchise and brought it to its conclusion) co wrote and directed this and did a fine job. In this case there are TWO possessed girls and only one gets to live which I didn't think was right. Ellen Burstyn (still going strong in her nineties) is back as Chris who is called on to help but ends up getting her eyes gouged out by a crucifix (a horrifying scene). She deserved so much better then that. Linda Blair has a cameo at the very last as Regan. This is a good movie just not as good as the first.",
    "19": "PROS: Strong performances from most of the cast. A solid set up in the first block of the film that makes us empathize with the characters.CONS: After the set up and possessions, the film flatlines. There seem to be too many ideas floating around that never get handled properly. The creepy factor was null and void. A couple of jump scares are thrown in. Perhaps the film's biggest mistake is having the legacy character, Chris (Ellen Burstyn), wasted here as the studio's cliche cash grab for nostalgic fans. An overall weak script, cringe dialogue, and plenty of corny group exorcism moments to go around. The film really treats its audience like they're stupid. Skip this and watch the original instead.",
    "20": "There's only one word to describe this movie: \"Bad.\" The original Exorcist was one of the best horror movies ever made. It has everything, while the new movie lacks everything. For one, it lacks too many aspects that made the original such a great movie. In the original movie, there were many memorable scenes like the vomiting, the levitating, the neck twisting, etc. I know the filmmaker probably didnt want to be accused of recycling the same material, but they could have been more creative. There's no memorable or scary scene at all. And the worst thing is, despite the title, there's no exorcist here. The people attempting to perform it are basically useless, and the devil won in the end. I honestly can't think of a single positive thing about this film. And to think they have to make a trilogy of this movie?",
    "21": "I think we were all fooled by Halloween 2018 and thought David Gordon Green was going to be somewhat of a saviour for horror... we were wrong. Instead of making these below average horror sequels/requels, whatever they're called these days, go make a sequel to Pineapple Express!!This movie was so boring for 3/4 of it and then the other 1/4 of it was just disappointing. Cheap jump scares were below average. And the atmosphere and tension that made the original so amazing was nowhere to be seen!Saw X and The Nun II are also in cinemas at the moment, go and see them instead because at least they're somewhat enjoyable!",
    "22": "Sometimes it's ok to just let these classic movies live on as their own thing. I don't know who thought it was a good idea to give the director a shot at this franchise because... those 3 new Halloween movies are atrocious. Not funny, not scary, did not need to be made.I was bored to tears with this film and kept looking at my watch to see how close it was to being over. The characters were forgettable, the story is nothing new, and I had to stop myself from laughing out loud at the acting quite a number of times.Just watch the original and then if you want a follow up, watch the director's cut that has some extra scenes.",
    "23": "95 minutes of plot building for a 10 minutes exorcist that was literally the lamest and most boring I've ever seen. And there wasn't even any plot. Nothing was explained about the demon, it's intentions or where it came from. There were no meaningful conversations with the possessed, no head spinning, no vomiting... The trailer was false advertising. No jump scares, no tension building, 1 death... just utter droll. The popes exorcist was better than this and it was lame too compared to Emily Rose and the original. I'm not sure what they were writing here but it wasn't a horror movie. Had me reaching for my phone a dozen times I was so bored.",
    "24": "It's a \"horror\" film that fails to deliver what it fundamentally should: the showdown between the demon and the priest. Reduces main elements and fails to deliver the scares. The ending was very contrived and had no point.Synopsis:\nSince the death of his pregnant wife in a Haitian earthquake 12 years ago, Victor Fielding (Tony winner and Oscar® nominee Leslie Odom, Jr.; One Night in Miami, Hamilton) has raised their daughter, Angela (Lidya Jewett, Good Girls) on his own. But when Angela and her friend Katherine (newcomer Olivia Marcum), disappear in the woods, only to return three days later with no memory of what happened to them, it unleashes a chain of events that will force Victor to confront the nadir of evil and, in his terror and desperation, seek out the only person alive who has witnessed anything like it before: Chris MacNeil.",
    "25": "There is nothing scary about this movie. There is no sense of dread. It is all a lot of tropes made by someone who is a film fan and NOT a filmmaker. The story structure was so simple and may have kept with it. Had it been filtered down to one girl and not two.Yes, you would be treading over old territory. BUT, the it was simple.A single Dad who makes the ultimate sacrifice was plenty. Instead, they added a second one...for some odd reason. The difference between 1972 director William Friedkin and 2023 David Gordon Green is that he was willing to go to the awful depths that the devil does bring.Unfortunately, he may have been tied down by the nature of today's society which prohibits the lengths of which devil possession would require. Specifically as it pertains to teenage girls.The focus should have been developed more through the relationship between the girl and her school chums. Then have scenes in school and so forth. A slow burn is fine, but maybe have it slowly come out as the girl becomes possessed.The performances are awful. I blame direction here. There are two competing ideas here. One where a man has to come to terms with a terrible decision he had to make years ago. Yes, that is perfect. The other is a couple who seems to have shaken faith. That could be the sequel. Duh. There was also a failed nun which is a great addition. The murders are also dismissed. The priest is nothing but cannon fodder.This was a lazy lazy project and aggravating to watch.",
    "26": "I couldn't quite grasp the storyline here. It seemed like a mix of three different movies, involving earthquakes, two missing children, and possession. There were also some unexpected cameos and an exorcism. The characters attempted to connect with God, but now we have two individuals who can't even connect with each other. The screenplay was messy, and the pacing was painfully slow. Some actors performed well, while others, like doctors, nurses, preachers, police, and firefighters, seemed out of their element. Everything revolved around the father, who suddenly became the central character despite being an atheist and displaying carelessness in searching for his daughter. Overall, it feels like this movie was a disaster right from the beginning.",
    "27": "I went into this film with high hopes, expecting it to be a worthy continuation of the original \"Exorcist\" from 1973. Unfortunately, \"The Exorcist: Believer\" left me feeling utterly disappointed.The movie starts off promisingly, instilling genuine fear and dread, but much of this initial tension is undermined by cheap jump scares and my lofty expectations. After about an hour, the story takes a turn for the implausible and becomes rather dull.The appearance of Ellen Burstyn in the film feels gratuitous and primarily serves as a marketing gimmick, rather than contributing significantly to the plot.In essence, \"The Exorcist: Believer\" fails to live up to its predecessor's legacy. While it initially generates fear, it ultimately succumbs to clichéd horror tropes and an unconvincing narrative, leaving a true horror aficionado feeling unsatisfied.",
    "28": "I would've liked to have given it an 8.5 but IMDB doesn't do that- lol. I liked the special effects, of course, I always wondered if they remade the Exorcist would they screw it up by making it a special effects movie with no story, but Blumhouse did this one and it was a good story, as well. The one knock I had on it, and I get Hollywood has to include pretty much everyone in everything, but having a Catholic Priest & Nun was enough, Exorcism is pretty much a Catholic ritual, but Hollywood of course had to have them accompanied by a Baptist Pastor (who didn't perform any part of the ritual, they just offered prayers of support to the children, so that was ok- lol), and a voodoo priestess? Lol. It got a little confusing with 4 people talking at the same time, each giving their own brand of assistance- lol. But I still enjoyed it, and having Chris McNeil and yes, Reagan back was cool- lol. Oh, and the two girls were great when they were doing their own thing, but a couple of times it felt like they were trying to channel Reagan- lol. It's not the original, but was a good modern day version of it. I would say go see it if you're a fan of the series.",
    "29": "Well most of the high budgets thrillers that people hype about ? I find them bad ,talk about the Nun 2 etc I didn't wanna hear the bad reviews..The Exorcist remake ? Sequel? Actually looked good in the trailer Well? That's it the best parts are on the trailer haha I don't believe this movie is actually worst than the reviews Some of them said the first half is the best lol An hour passes and nothing happens.... It hurts your mind Praise on the acting of the girls 🙏 But still ,I mean really It's actually worst from Halloween Kills 😭\nThe best part is the Cameo of the legendary Characters Could just been a half an hour short. And they would make a trilogy? Lol.",
    "30": "So much better than expected. After reading all the bad reviews I was hesitant to go for it, but watching it in IMAX theater was a roller coaster with all those mind blowing visual and sound effects. The story was descent too, somehow paying homage to the original in a good way. Some people pointed that out against the film but I was totally ok with that. My only complaints is about the last 10 seconds of the film. It was truly unnecessary. Just cut it out and it would be complete. And finally, a very clever use of Mike Oldfield's timeless tune, right time, right amount. It poses as a great sequel to me and worth a watch.",
    "31": "I decided to ignore the critics and go to see this movie to judge for myself. For once, I should have listened to the critics. The movie is definitely underwhelming with little to no suspense. Direction by David Gordon Green is sub-optimal at best. The acting by the majority of the cast is unexceptional, although I did like the performance of Ann Dowd as the nurse who believes in demonic possession. And I was disappointed that Ellen Burstyn is wasted in a thankless role - she doesn't have enough screen time to rescue this lame effort at a sequel to the original Exorcist. So, save your money and skip this one. 4/10.",
    "32": "David Gordon Green continues his holy crusade of destroying classic horror franchises for no other reason than the name of profit. First Halloween and now the exorcist Green does it again following much the same formula; link it to the original source material and then bring back major character, this time Ellen Burstyn and watch in horror as the memory is tarnished. In all fairness the first hour was positive with a slow dramatic build with strong acting from Odom Jr. Which explores his relationship with his daughter. Little is done to explore the relationship between the other girl and her family which weakens the character investment and plot. The last half of the movie is a rushed possession piece which incorporates mound bangs and antics which you will see in any other possession movie over the last couple decades to go along with a complete disgrace of Burstyn's character. I hate to see what the rest of this rumoured trilogy will bring but given Greens track record it's easy to predict. Overall disappointed but not surprised.",
    "33": "This was infuriatingly bad. They had everything in front of them to make a solid movie, they just failed spectacularly. Spoilers ahead.Why does this director keep getting work? He blew it with the Halloween movies so why does Blumhouse give him another franchise to ruin? David Gordon Green is the Uwe Boll of horror reboots.This movie so slow. The original had such tight pacing and gets to the point quickly. Every scene in the original had something memorable or iconic about it. Everything about this movie was generic. Even the references and callbacks to the original was watered down.The only decent thing about the movie was that the young actors went hard in their roles. The issue is that they were given weak material. The characters were poor rehashes of Regan. I understand that some of the stuff they had Regan do would not work in today's climate, but they still could have done so much more than what was depicted. I wanted more vulgarity, more obscenity. I wanted to be shocked, damn it. I wasn't expecting this movie to be as good as the original, but I at least wanted it to be half as good. And this wasn't even that.There were so many characters. But where was the actual exorcist? This movie lacked a Father Merrin-type character. The priest in this movie was a pansy. The closest thing we had to an exorcist was the nurse/nun character and the spiritual healer, but both fizzled out. I feel like this movie was trying to diversify and include different faiths and rituals, but it just didn't work. You could remove the pastor, the annoying neighbor, and the spiritual healer completely and the plot would be the exact same. The \"exorcism\" scene was bloated with too many loud characters who did not know what they're doing.They got freaking Ellen Burstyn to feature in the film and they completely wasted her character. She didn't add anything to the plot either. I feel like they only violently blinded MacNeil to set up that short Linda Blair cameo. What they did with her character just seemed disrespectful and I can't believe Burstyn agreed to do this.I honestly hope Deceiver gets canceled or is at the very least done by a different director. This movie was an insult. If I could have done it differently, I would have kept the core cast smaller, and include an ACTUAL exorcist and exorcism. I would have made the nurse/nun character stronger to play similar to Karras. I would have included stronger scenes with the girls. And I'd allow Chris MacNeil to take part in the exorcism, and instead of BLINDING HER, I would have just had her be injured so the Linda Blair cameo can play out the exact same.",
    "34": "I thought I was immune to horror by now, but once again an exorcism movie makes me believe otherwise pun intended). Maybe it's because I saw it in IMAX, or maybe it's because I was raised Catholic, but this movie does not hold back. The child actresses were fantastic. I jumped within the first 20 seconds of the movie (no joke). Was white knuckled the entire time, literally was tearing up, my heart beat was the through the roof, I was sweating. This movie is SCARY. The callbacks to The Exorcist I and 3 were so subtly done and twisted just enough that this felt like a whole new take on the franchise with perfect nostalgia. This has it all. Deeply unsettling psychological horror. Terrifying imagery. Awesome jump scares. And the return of iconic characters. And the ending? I am severely depressed and disturbed. Can't believe we have 2 more of these coming out.",
    "35": "Generally I don't like to write reviews, but seeing this new installment of the Exorcist it seems to me that it is a service to the community to write it. Please, don't go see it in the cinema, wait to see it on a streaming platform or on cable TV, it's not worth the price of a movie ticket. The original 1973 Exorcist, both the book and the eponymous film by the late director William Friedkin, is a masterpiece of horror and psychological terror. It was one of the first Hollywood films, along with Rosemary's Baby, that dealt with the subject of the existence of the devil in a serious and almost documentary way. This supposed direct sequel to the original film, more than a new chapter, seems more like one of the dozens of imitations of the Exorcist that are wandering around. Hollywood's insistence that its films be as inclusive as possible ruins already successfully established franchises like this one. Does this movie really not have the guts to carry out a confrontation with the devil using the Judeo-Christian rites that in the final exorcism involve an atheist, a nun, a Voodoo's practitioner? Absolutely meaningless and a disgrace for such a revered saga.",
    "36": "I don't know why they needed to give us another exorcist film but I was kinda excited for it, more fool me because I let the trailer give me hope.It started out really well, I loved the atmosphere and the way it built up the story, it drew me in pretty good but then it somehow fell flat as soon as it should have started getting good. They spent too much time focusing on the parents than they did on the actual possessed children which makes no sense since there was no big revelation from any of them that altered the story in anyway.They decided to totally skip over the hauntings and possessed activity and give us absolutely nothing. If it was a standalone film I wouldn't be too bothered by it but I'm sick of these new sequels being so bad that it totally disrespects the classic. They even threw in an OG cast member that added nothing to plot and disrespected her which was really annoying.",
    "37": "The Exorcist: Believer is a nonsensical jumbled mess of a film that feels more like a corporate product being printed out to proudly disrespect the legacy and impact of its legendary predecessor. Devoid of any interesting ideas or scares, The Exorcist: Believer tries desperately to match the atmosphere and haunting tone of the original film but falls flat at every turn. Not only is the film not scary at all, its biggest sin is that it is horrendously boring.David Gordon Green's take on the Exorcist that acts like a \"direct sequel\" to William Friedkin's 1973 masterpiece feels rushed and soulless as it desperately tries way too hard to match the perfection and suspense of that film without any creativity or actual suspense put into the final product. Although the film starts out strong, it completely goes downhill from its forced connection to the original film to its comical climax. Shoehorning in other religions and messages that don't fit in the Exorcist universe. Although the film contains solid performances, decent makeup effects and stunning cinematography, it is ruined by awkward moments, frightless \"scares\" and overused tropes.The Exorcist: Believer feels more like a ripoff of the original film by forcing in the old characters as stand ins and rushing itself through the narrative without having any time to properly develop the new characters. Bringing back Ellen Burstyn felt completely unnecessary and pointless, her role as Chris MacNeil was just there to deliver exposition and to get attacked and completely written out in the final act. What was the point of bringing her back in the first place?!Believer falls apart with a poorly structured screenplay, underdeveloped characters, sluggish pacing and no actual scares, instead it relies on cheap jump scares and boring exposition to pad out the runtime. It just does not work as a direct follow-up to a cinematic treasure. It's obvious that the ending is trying to set up its next two sequels in a planned trilogy but it doesn't make any sense. But if the sequels are improvements in the future, this trilogy has potential to give a satisfying conclusion to this story.",
    "38": "The first exorcist was pretty good not scary but good the 2nd one no so much and the thrid was boring as hell and now they have made another they need to stop-this is not that scary at all non of the characters are likeable and it just feels like a cash grab like the god father 3 which i fell asleep to most of the modern movies today just dont have when your broad at the movie pr shellacking your phone or people walk out your know the movie is bad the studios need to put more effort in the script if they want to make something good and 2023 and 2022 didn't really have very many decent movies i think we need to stop watching or going tot he cinema so they will learn.",
    "39": "\"The Exorcist: Believer\" has some positive aspects, including an initially interesting plot with mystery and suspense surrounding the disappearance and possession of the protagonists. It effectively utilizes jump scares without overdoing them, and the child actors portraying the possessed children deliver strong performances with unsettling characterizations. However, it fails to match the impact of the original classic \"The Exorcist\" and loses its momentum in the second half. The involvement of the character Cris McNeil, played by Ellen Burstyn, is disappointing and lacks respect for the original film. The third act lacks impact and becomes formulaic and uninspired, with questionable decisions. Director David Gordon Green, once again, struggles and fails to handle a respected horror franchise, as seen previously with \"Halloween.\"",
    "40": "So, I got back from seeing a latye showing of this film tonight & given how average I found the original films, & of course, how so-so the trailers looked, I wasn't expecting much.The film follows a single father & his daughter who find their world turned upsidedown when his daughter & her friend summon a demon in the woods & become possessed by after being missing for 3 days. What follows is strange goings on & the threat of the 2 girls being comitted to a mental asylum unless the families & local church can come together to preform an exorcism to rid the 2 girls of the demonic forces that possess them.I found the film to be ok, but no more. The runtime for starters is long at 1 hour & 43 minutes & has sluggish pacing. The film story is not bad, but not great & the characters are pretty thin, weak & lack anything interesting to distinuish them apart.The scares & visuals were good, but too few & far between, again, this is down to the sluggish pacing & bloated runtime of story & dialogue. Aside from some questionable dialogue & an anti climatic ending which wasn't all that, the film wasn't too bad, but the orginal (even though I found it average in itself) is better than this.Overall, it's not the greatest & is pretty tame & uninspiring. The runtime is overly long at 103 minutes with poor pacing, paper thin characters & an anti climatic ending. Despitre some good effects & some scares (which were too few & far between) this film was overall not great & even the original which I thought wasn't great either was better than this. I saw the original last week for the 50th anniversary, it was a directors cut version & it was definetly better than this film.4/10.",
    "41": "I enjoyed it way more than I thought that I would. I had low expectations and didn't walk into the theater expecting anything near the original. The plot was good and a bit different from a lot of other exorcists movies, but the very little part of the plot that had a connection with the original could easily be removed and it wouldn't make a difference.The effects were good, but I think that scenes where someone throws up dark stuff looks better in IMAX than it would at home. It is a horror film and apart from a few jump-scares it wasn't scary, but the movie gave a creepy vibe and that was my expectation.Shout out to the cast, especially the girs that made a great job.",
    "42": "The first The Exorcist movie is still a suspenseful horror flick with some iconic scenes and a top cast, making it a groundbreaking piece ahead of its time and rightfully a classic of the horror genre. If you are a fan of that movie, you should spare yourself the experience of watching The Exorcist: Believer - it's soulless, it's boring, it's redundant, only spiced up with some modern special effects gimmicks. All in all a forgettable movie that will most likely not be remembered by many in a few months from now on. Sadly, this movie is one of many, too many, that depend on old material due to a lack of creativity in the industry to produce something truly original or new these days. But besides that lack of creativity there is also a lack in skill and craft in the industry observable, that's at least my opinion.",
    "43": "I think the main problem with the story was there were too many characters so no real attachment or development of characters. I can see the idea of two girls being possessed comes across as exciting but unfortunately it lost the plot as there were too many view points and the girls story kind of got swept to the side. If they had of stuck with Angela and her dad it may have been a more cohesive and interesting story. Not enough scare factor, I was a little bored towards the end. The idea of people are the power of exorcisms was also a great idea but again too many in the final exorcism, a nun that never was, a preacher, a voodoo priestess and a Catholic priest (still not enough apparently).The flashes of the demons in the end climax however were great and I would love to see some still images of them, so I will be looking for those. Also when K got taken down the flash of the demon then also caught my attention.I think there were too many hands trying to stir the pot in this movie and the result was a bloated cast and a bloated story. See how Blumhouse goes with the next two movies as they are contracted to a trilogy.",
    "44": "A new sequel to the 1973 original (celebrating its 50th anniversary this month I believe). Not much to say here about this inevitable cinematic trainwreck w/a plot involving a pair of girls (Olivia O'Neill & Lidya Jewett) now possessed whose parents, Jewett's dad Oscar nominee Leslie Odom Jr. & O'Neill's Jennifer Nettles & Norbert Leo Butz (recently seen on Justified: City Primeval) must have to deal with w/religious leaders from different straits (one played by Ann Dowd & another by prolific character actor Raphael Sbarge) to come in & save the day w/poor Oscar winner Ellen Burstyn reprising her role to remind people she was in it? The worst that can be said of co-writer/director David Gordon Green's effort is how perfunctory it is w/stakes feebly voiced & executed as if they were reheating the last slice of pizza for the night before closing. I consider the original one of my top 10 faves & what's missing in a lot of these retreads & remakes is character since all the head spinning, vile spewing shenanigans comes along w/the package regardless.",
    "45": "The exorcist believer is part one and a three-part trilogy currently in production.... It is well acted beautifully shot and has a lot of surprises as well as a lot of nostalgic touches..... the movie special effects, which are plentiful are very well..,, and Lydia and Olivia perform very well as the possessed little girls..... while I preferred the heretic to the first movie, mainly because of the ideas which it offered..., this is a moderately entertaining movie, and contains scenes of horror.. But has a slow burn aspect to it... please friends don't listen to critics judge the movie for what it is... as it does have aspects... of all the sequels and prequel's in it....",
    "46": "This guy needs to get into a different genre of film. He butchers every horror franchise that he touches. Utterly useless. I usually don't have high expectations for reboots but I at least go into it expecting something watchable. There are some really good moments but not enough to watch the whole film without feeling anger and regret when it's over. The film lacks intelligent writing and character development. Just like the other sequels, this one fails also. DGG horror films are cringeworthy and hard to take seriously. I really hope someone comes to their senses and stops this guy from making anymore films in this genre.",
    "47": "It's absolutely awful ! It's made by people who misunderstood the original, poor Ann Dowd has an awful script but does her best , eye rolling and tounge lolling straight out of French and Saunders sketch and \" sound bites \" better suited to a film like The Meg!Its dull and a struggle to get through to be honest .They should have dropped the Exorcist name out of it , cut Ellen Burstyn from it , cut 20mins out of it and made it a possession movie about two girls . It would have then been a passable 5/10 Blumhouse horror !The only thing going for this film is the cinematography. It's beautifully shot , however the director really tries too hard to mimic the original .",
    "48": "One of the worst horror movie, poor writing ,non sense direction. Wasted 20 minutes of starting and meaning less earth quake scene, don't know who was the evil why they possessed two Girls. Who doing exorcism. Movie full of meaningless scene no horror at all. Wasted my time I could have watched \"Purani Haveli \" or Jani Dusman far better than this.People's don't waste and money your time on this non sense . Better watch old horror movies I will never gonna watch DGG movie again in my life time .Still in Trauma after this . Dangerous than covid 19 . Feel like I should look my self in room for few days isolation.",
    "49": "I just finished watching this movie and I have quite a bit of mixed emotions. Let's be clear about one thing, this or any other horror movie will never come close to The Exorcist. The Exorcist was way ahead of its time when it came out in 1973. It's pretty sad when a movie that came out in 1973 out does a 2023 movie in vulgar and shock value when it's more acceptable today. There's so much more that could've been done with this movie to make it more appealing to the avid horror movie fan. Perhaps when they make movies like this, they should have the true fans have a say in how it's made. I feel Ellen Burstyn made sure her eyes were gauged out so she couldn't witness the travesty that took place and I now know why she demanded twice her fee to make it. The ending wasn't too bad, it took my original 5 star review, to a 6 star. I'm available if any producer wants my advice on how to make a real good Exorcist movie.",
    "50": "I doubt very much that the director or producer will ever look at IMDB and read what people are saying about this new, unfaithful, horrible, film that they just unleashed onto the public. I doubt very much that read the book or watched the original film. There was nothing shocking, nothing new, nothing imaginative, and nothing that really ties this film to the original. Even the use of any of the original stars fall flat here making it a total mess. Plus they plan to make two more films? I am so sorry that I spent the money to go and watch this. I should have learned my lesson about David Gordon Green after trying to watch what he did to Halloween. That one was bad too. So, in short, don't waste your time, go watch the 1973 film and stay away from this. And hey, if you do like this film, well, more power to you.",
    "51": "I saw in IMAX which was awesome! I would say the acting in a couple scenes is the only flaw otherwise I didn't mind a lot of it. I even enjoy most everything David Gordon Green has done maybe Halloween Kills is the meh film of his to me, he's masterful at comedy that's for sure. The possession terror is done brilliantly, the parents are great, most of it flows well, and I just purely enjoyed more than I expected to there's worse movies especially about demons. Ellen Burnstyn is still a legend it's wonderful she continued her character and I'm not sure why this got so much hate it's mostly awesome.",
    "52": ". . . lies entirely in being raised as and remaining a life-long fully committed staunch Atheist, THE EXORCIST: BELIEVER reveals. On the other hand, immersion in the Roman sects cult's Satanic Superstition Mumble Jumbo all but guarantees that one or more members of every family will begin guttural cursing in dead languages, crab-walking across the ceiling, twisting into pretzel shapes, projectile vomiting, swirling their heads in mad rotations, bleeding from inexplicable wounds and blabbing out all of their relative's dirty secrets for the whole world to hear. It's no wonder that many if not most churches are being bulldozed to build casinos, taverns and parking ramps in Modern America.",
    "53": "In this movie - because it's not good at all. It's from the same writing team and director of the rebooted halloween trilogy (which for the most part of awful). However, I had high hopes because the trailer for this movie at least looked interesting. Especially with the black and white poster. However, I had a sneaking suspicion that it wouldn't turn out good when I saw the mom from the original was returning. I was right.The Good:\nThe first 40 minutes of the movie is pretty exciting. It has a solid set up, with us getting to know the main family pretty well. It's shot well, written well, and there were times I was pretty scared. The rest of the movie - not so much. I also really liked the two performances from the demonic girls. They did REALLY good, and their makeup was quite scary and disturbing. This movie scared me quite a few times, but it doesn't make up for the poor story, too many characters and goofy dialogue.The Bad:\nFirstly, bringing back the original mother \"Chris' ' did not work at ALL. She speaks in movie quotes, lacking any characterization whatsoever - looking like a modern hollywood silhouette of the character before. I wish I could spoil what happens with her character because it's so funny the way they sideline her for the rest of the movie. She is in it for about 10 minutes, then rarely ever seen again. There are also too many characters that the writers have no clue what to do with. There is the priest, the parents, the other priest, the woman who does special medicine, and the neighbor who knew the woman who does special medicine. Guess what, they are ALL in the last act which I bet you can guess - is an exorcism. That many people in a small space and the writers have no clue how they want to take the story. Not to mention the bad dialogue and acting from some of the supporting cast, especially the catholic priest. They just bring in a bunch of half baked concepts and never execute them. It also gets less scary along the way since it's mainly cheap jumpscares and loud screams - oh also some creepy faces.Rant and Conclusion:\nTake away ANY horror franchises from David Gordon Green and his writing team. Mr. Green is pretty solid at directing, but they are just not good at writing anything substantial and moving. There is a monologue at the very end explaining all that we should learn from the movie and to come together. Wtf. The original movies message didn't have to be said in a montage monologue, it was in every second of the movie. This sucks because it had so much promise, but just couldn't pull it off. I would not recommend unless you want some cheap scares on a friday night.",
    "54": "Why was the word \"Exorcist\" used in the title? Answer = To generate sales. This mess of a film has really nothing to do with the original Exorcist except for ripping off and reproducing some of the ideas and scenes, which were done more poorly than in the original. Whereas the original had some spine chilling moments that were unexpected and consequently shocking, this failed to produce any shock at all. It merely recycled some stuff from the past, but did it badly. The most captivating part of the film was in comparing it to the original, and it failed at just about every level. Without the hype of the word \"Exorcist\" this film would have sunk without trace.",
    "55": "\"The Exorcist: Believer\" offers a polished, easy viewing experience with a pleasant atmosphere. However, its striking simplicity and lack of genuine scares or thrilling moments leave it feeling oddly underwhelming. While it hints at a promising plot, the movie fails to capitalize on its potential, culminating in a disappointingly basic conclusion. For fans anticipating a gripping successor to the iconic franchise, \"Believer\" regrettably falls short, lacking the demonic impact that defined its predecessor.While the calm atmosphere might work for some, for aficionados of the horror genre, the absence of any significant scares or spine-tingling moments feels like an opportunity squandered. The simplicity of the plot, combined with the lack of adrenaline-inducing sequences, makes one wonder why the filmmakers chose to dilute the very essence of what made \"The Exorcist\" a household name.",
    "56": "I saw The Exorcist: Believer, starring Leslie Odom Jr.-Glass Onion, Murder on the Orient Express_2017; Ann Dowd-The Handmaid's Tale_tv, Hereditary; Lidya Jewett-the Ivy + Bean movies, Black Panther; Ellen Burstyn-Law & Order: Organized Crime_tv, Interstellar and Olivia O'neill-this is her first movie.This is the first of three new Exorcist movies that are direct sequels to the 1973 original-all other sequels are just ignored. They are directed by David Gordon Green, who did the same thing with the Halloween movies from 2018 through 2022. I read that Ellen Burstyn turned down her role at first but was offered double her salary and changed her mind-she donated her money to a charity. Anyway, Leslie is the single father to teenaged Lidya-her mother died during childbirth. Lidya and her school friend Olivia go into the woods and go missing for three days. When they are found, they have no memory of what happened-they thought they were only gone for a couple of hours-but then, they slowly start acting as if they have been possessed. Ann plays the neighbor that tells Leslie about Ellen and her experience with demonic possession 50 years earlier, and they call Ellen to help out. Ellen doesn't have a big role, more of a cameo and Linda Blair has an even smaller cameo. Overall, it's a little slow in parts and not as good as the original.It's rated R for violence, disturbing images, language and sexual content-no nudity-and has a running time of 1 hour & 51 minutes.It's not one that I'd buy on DVD but if you really want to see it, it would be alright to stream.",
    "57": "The Exorcist celebrated its 50th anniversary in 2023 (coincidentally its director William Friedkin sadly died as well), it seemed almost inevitable that there would be a requel, so came this one from director David Gordon Green (Pineapple Express, Stronger) who gave us the Halloween reboot trilogy. Basically, photographer Victor Fielding (Leslie Odom Jr.) and his pregnant wife Sorenne (Tracey Graves) are on their honeymoon in Haiti. They visit a voodoo practitioner who blesses them, but as they are leaving, a massive earthquake occurs; Victor escapes the collapsing building but Sorenne is gravely injured. In the hospital, paramedics tell Victor that they cannot save both Sorenne and the unborn baby and he must choose to save one of them. Thirteen years later, Victor has lost his faith in God since Sorenne's death and is raising their daughter, Angela (Lidya Jewett), on his own in Georgia. One day after school, Angela ventures into the woods with her Baptist best friend Katherine (Olivia O'Neill) to perform a séance, hoping to communicate with Sorenne. They enter an underground area but experience something strange during their séance. Victor realises his daughter has not returned home and contacts Katherine's parents, Miranda (Jennifer Nettles) and Tony (Norbert Leo Butz). The children are reported missing to the police and a manhunt ensues. The girls are found in a barn three days later, they are traumatised with no memory of what happened. They go through medical tests and they seem relatively fine, only suffering burns to their feet, and they are taken home. The next day, Angela suddenly attacks Victor and begins convulsing. Katherine meanwhile experiences a bizarre outburst during a church service, becoming possessed by an evil presence during Holy Communion. Victor takes Angela to the hospital where their nurse neighbour Ann (The Handmaid's Tale's Ann Dowd) attends to her. Miranda, being a devout Born-Again Christian, theorises that the girls travelled to Hell and brought a demon back with them, hence the burns to their feet. The girls' condition worsens as their burns become more severe. Ann is freaked out by Angela speaking with a hideous voice who knows Ann's experiences becoming a nun which ended after a pregnancy that resulted in an abortion. Ann is convinced Angela is possessed by a demon. Ann gives Victor a book written by Chris MacNeil (Ellen Burstyn) (this is completely out of character because she never wanted media exposure in the original film), who experienced the traumatic possession of her daughter Regan (Linda Blair) in 1973. Since then, Chris has spent her life researching exorcisms in every culture and her studies have become world-renowned. Victor meets with Chris who talks about her past experiences and reveals that her daughter has become distant from her since the release of the book, they have not spoken in years. Chris agrees to come with Victor to see Angela before going to Katherine's home. While Victor meets with Miranda and Tony, Chris goes upstairs and begins to perform her own deliverance ritual on Katherine. But the possessed Katherine grabs a crucifix and violently stabs Chris multiple times in the eyes, blinding her, and she is rushed to the hospital. Victor, Miranda, Tony, and Ann reach out to the Church for an exorcism. Chris advises Victor to use methods from all different cultures. The parents seek the help of Katherine's family's Baptist pastor Don Revans (Raphael Sbarge), Pentecostal preacher Stuart (Danny McCarthy), and rootwork healer Dr. Beehibe (Okwui Okpokwasili). The group plans an ecumenical exorcism, but the local Catholic diocese believes the children are suffering from a psychiatric disorder and forbids Father Maddox (E. J. Bonilla) from participating. The girls are tied to chairs as the group proceeds with the exorcism. Ann uses a crucifix with the Saint Benedict Medal engraved on it to battle the demon. The demon reveals that Victor did not choose to keep Angela alive thirteen years ago; he chose Sorenne but she died from her injuries. As Ann reads from the Bible while holy water is poured on the children, the demon begins to shriek. The demon says that Victor must choose which of the girls gets to live and which one will die, and if a choice is not made, they will both die. While Miranda and Victor both refuse to forsake each other's child, Maddox has had a change of heart and joins the group to assist in the exorcism. Maddox reads his Bible, but he is killed during the chaos when the demon snaps his neck. Victor regains his faith and recites the Lord's Prayer, which he learned as a child. As Victor apologises to Angela and uses Sorenne's scarf to help her to regain consciousness and fight against the demon. Tony shouts that he chooses Katherine, and Angela flatlines. Suddenly, the demon reveals the one that was chosen would be the one who died. Katherine screams for her parents as the demon drags her to Hell, while Angela comes back to life. Police arrive as Miranda and Tony fail to resuscitate Katherine and Victor tearfully reunites with his daughter. In the aftermath, Victor visits Sorenne's grave, Miranda and Tony mourn the loss of Katherine, and Angela returns to school. In the hospital, Chris is reunited with Regan, who forgives her mother, and they emotionally embrace. Also starring Antoni Corone as Father Phillips, Celeste Oliva as Detective Konik, Linda Boston as Principal, and Lize Johnston as the voice of Lamashtu (The Demon). The reasonable performances of Odom Jr as the single father, youngsters Jewett and O'Neill, and Dowd are pretty wasted, while the returns of Burstyn and a short cameo from Blair are almost pointless. The script is predictable, it just repeats a lot of what we've seen before, the attempts at shocks are naff, even the (perhaps unnecessary) over-the-top bloody blinding sequence, this is not the worst sequel (that'll be The Heretic and prequel The Beginning) but it is certainly one of the dullest, I don't have high hopes for the follow-up, Deceiver, just stick with the original groundbreaking masterpiece, this is a silly supernatural horror. Adequate!",
    "58": "After watching 'The Nun II,' 'It Lives Inside,' and 'Five Nights at Freddy's' this year, 'The Nun II' has consistently been my recommended horror special effects film. As for the latest one, 'The Exorcist Believer,' it's my top pick for the best horror drama film of 2023.Yes, the entire movie revolves around the harrowing plot of two girls deeply affected and exhibiting self-harm due to demonic forces. Medical interventions leave parents helpless, leading them to seek the last resort of religious exorcism rituals. At this point, I must say that supernatural films always find the universal theme of religion to be a versatile plot, allowing people to relate it to their lives while maintaining an enigmatic layer that is hard to decipher. Because while some people strive to be good, there are always those who prey on others. The true horror lies in human nature. This statement encapsulates the brilliance of the movie, making it a must-watch for those seeking thrills. Head to the theaters and enjoy!",
    "59": "The story taking place 50 years later after regan was posed by the devil from the exorcist 1973 . Now two girls are taking over the devil again . The story taking place in Georgia was the perfect story . The churches and schools and the hospitals were by far the best place to film since the original movie was filmed in Washington DC 50 years ago . Angela and Katherine were the second generation to be posed by the devil himself after regan was posed by the devil . They're parents , Ann , Chris MacNeil who had experience with the exorcist herself, Ann and father Maddox tried to save the girls but only one child could be saved . With Katherine still in hell something has to be done to bring her back and face to demon itself before I finds regan and possibly her own children or grandchildren in the next exorcist movie .",
    "60": "6.5/10\nThe Exorcist: Believer could be a really really good direct sequel if just the pacing and the storytelling done better, because there is some impressive things about The Exorcist: Believer, which is the unique style of the film itself which was the film editing that i really like, the performances that was mostly good, the cinematography was great, and when they do scary things it works, the makeup, the voice editing was great, the problem here like i mention earlier was the pacing and the storytelling of the movie that i was not really a fan of, takes too many slow scenes and less the scary terrifying moments which what The Exorcist movie should be, and when the final climax of the film happens, i'm already tired and bored because of the slow build up fills with again too many slow scene and less scary terrifying moments, and it's not even bad and i still try to appreciate what happen on the screen specifically the climax of the film, the whole movie overall was not terrible and i just realized how i still pretty much invested to the story while still acknowledge all the flawed and lackness of it, there is also this random male priest in the movie that just have no personality and just terrible but (SPOILER!) the way he died was worth it, there is this clever twist at the end which i like, i don't like one character decision, the story overall could've been better, overall The Exorcist: Believer have potential to be a good direct sequel, have some impressive things in it, but it also lacking and flawed in terms of pacing and storytelling, it wasn't terrible, it wasn't great either.",
    "61": "How does DGG keep getting the drivers seat with trilogies to destroy classics?! The only thing that linked this to the original was Ellen, who is now some kind of non clergy exorcist who tries to expel a demon from these girls with a voodoo priestess..yep. So glad I waited for it to be available to stream. I don't see the next two being greenlit, but who knows. This is currently at a 4.6 stars on IMDB, and is still a little high for what it \"delivered\". You also get completely taken out of the story once the practical and realistic effects start taking a back seat to mid level cgi. Someone needs to blacklist this man.",
    "62": "Bill Friedkin. The Exorcist was not only a legendary horror movie but also a brilliantly directed one. Think about the first 20 minutes alone, how masterfully the scene is being set. I still remember those two nuns with their clothes moving in the wind. This what they did not understand here unfortunately. It could have been something special, with ,uch more focus on Burstyn's and Blair's characters, but once again its not. Blair for example could have become a nun herself, without knowing why. And Burstyn could have been more ambiguous in how to handle this situation. What they really tried to do here was making the topic more accessible for millennials, and they failed. Ok, and Bill Patty's script of course is missing as well...so two ingredients.",
    "63": "To start with, this movie is overhated as hell, it isn't great but it's definetly not bad. First of all the acting of the two possesed girls was amazing. I really liked it that they bringed Chris back. I just wish that there were more scenes of the girls doing weird stuff like eating glass, stabbing themselfes... i'm also a huge fan of jumpscares and i wish that there were more in this movie, there were some good ones but also some bad ones. The special effects were very good and the cinematography was pretty good too. I don't know why people hate this movie, maybe because they're comparing this one with the original? I mean the original is a masterpiece, so don't compare it with that. Overall i had a good movie experience so i give it a 7/10. I recommend it to others.",
    "64": "As a fan of the original film (its actually my favorite film of all time), this film really doesn't do the name justice. It was nice to see Ellen Burstyn make a return to the franchise, along with a few other surprises, but it didn't quite do the film justice. Hey, I think it's better than the Exorcist II, but I can't say it's a gem and will hold up to the name long term. My biggest issue with the film was that by the end it turned incredibly preachy which was a huge turn-off. While partially the message was a \"we need to join together\" sentiment, it ended up being some sort of conversion therapy to me. I never took that away from the original film which simply told the story. For that, it gets a 5.",
    "65": "The original book 'The Exorcist' by William Peter Blatty is one of the finest pieces of literature ever written. It does for the rather dark and (for some) the untouchable subject of 'demonic possession' and 'exorcism'; what Mario Puzo's 'The Godfather' did for both Italian culture and crime gangs during the 1920's, by helping the readers understand gang politics, the acceptance of the mafia as folk heroes and 'men of honour' by ordinary people and the often complex norms of the mafia traditions. For anyone interested in audiobooks, I would recommend the version narrated by William Peter Blatty himself, which is read in a dark, melancholic yet calm tone by Blatty's voice throughout. A great listen for long car journeys, as I have had the pleasure of taking over the years. But above all, both highly informative and disturbing. I only read both books in my mid-twenties and on hindsight do wish that I was introduced to them in my school years or in my teens instead. One does not need to be religious to understand or even sympathise with what the characters are going through and I think that this was the genius of WPB.Before explaining what I thought of the latest film from 'The Exorcist' franchise, let me provide a bit of a retrospect for those unfamiliar with the series. Apart from the original and the third film (the latter, which resulted in George C Scott becoming one of my favourite actors of all time), all the sequels have been diabolically poor. The original exorcist film, directed by William Friedkin was great because it explored the human condition. The scariest parts of that film were not really related to the main story arc of demonic posession of a young girl, which was merely a set piece to build the film around and to gain notoriety; but rather the character side stories that touched on real issues that could be faced by any individual, such as any parents genuine fear and worry when their child becomes seriously ill; the story of Father Karras (played brilliantly by Jason Miller) who is worried about his elderly mothers health, the guilt he faces because he cannot care for her, the regret that he has when she is placed in a care home, the fact that he is losing faith in the very religion that he is preaching to other worshippers and the sorrow that we all have to face following the death of a loved one, something many of us including myself can relate to; and the psychological processes that Reagan (the possessed girl) has to go through during an era when we now know regular abuses and failures were taking place in psychiatric hospitals around the world; and the fact that psychiatrists gave psuedo-scientific opinions that were totally unrealistic that some parents would have rightfully been skeptical about and angrily argued against (remember that though the book was released in 1971 and the film was released in 1973, the procedure of lobotomy was still widely used in the west throughout the 1960's and there is no doubt that before suggesting an exorcism as is the case in this work of fiction, such a method would no doubt have been recommended and carried out). Similarly, the Exorcist 3, (though not quiet a horror film and would probably have been suited being a detective film) was a superb mixture of dark satire and a detective movie with elements of horror thrown in and despite poor reviews when it was released in 1990, it has become a cult classic and one of my favourite films of all time in recent years. Since the original was released there have been many cheap copies of them film made all around the world, some were good (believe it or not, I recorded 'Amityville 2 - Possesion' on VHS as an 11 year old and thought it was very well made for its time) and some were just plain abysmal, however most of these were aimed at the B movie market, trying to and failed to capitalise what the original did very well. This being letting the audience decide, understand and feel the story for themselves without explaining huge narrative plots throughout.Which leads me onto the latest outing of the franchise, titled 'The Exorcist: Believer', which was so boring that the planned sequel should be named 'The Exorcist: A Sleeper' as Mark Kermode aptly suggested recently in his latest film review. Even better would have been to call the latest film 'The Exorcist: Far Weaker' (as most of the sequels have been getting), the next one as 'The Exorcist: Even Bleaker' and the final one to put the viewer and the franchise to sleep, the latter hopefully permenantly. What better way to market this terrible new trilogy of sequels as the 'Weaker, Bleaker and Sleeper' trilogy. They could even release a directors cut of all three of them in 30 years time, with minor 'improvements' (that are not really improvements rather just dropped scenes from the cutting room) as the 'The Exorcist Appeaser - Trilogy'.I like the veteran actress Ellen Bustyn and it is well documented that at age 90, she only came out of retirement to play her character Chrissy (the mother of Reagan who was possessed in the original film) and did this film purely because she was given a good financial incentive. I wish her all the best for her achievements and am sure she will do well. However, my problem with her casting, is that she does nothing at all in this film, is only really in it for ten minutes whereby she is given a terrible script and only reads explanatory dialogues giving us insights into the entire plot. Remember too that in the original film Chrissy was a famous actress who had servants working for her and was far richer than many of us could possibly be. She was not 'oppressed' at all as many women in the 70's probably were. Therefore, for me the most offensive part in the film that was totally unnecessary and irrelevant, was a line she delivered was when she is asked whether she was in the room for the original exorcism. She suggests that 'there was a hierarchy', not the fact that she was an athiest at the time and instead takes a totally unnecessary swipe at the Catholic Church for being sexist. Not once in the original did she ask or demand to be in the room whilst the exorcism was taking place. It is therefore rather ironic then that her character, this symbol of 'female equality', who had never performed an exorcism in her life and was actually an athiest in the first film; decides to throw caution to the wind just 'have a go' and subsequently gets humiliatingly defeated in a gorefest consisting of a mixture of the most notorious scenes from the first film and lots and lots of projectile vomiting; thereby showing that the filmmakers had no interest in helping to show women in a positive light at all. I though that the parents of the possessed girls in the film were ridiculously naive and stupid for allowing a complete novice to just 'have a go' at performing a serious and highly risky procedure.Readers at this point of the review are probably thinking what I thought at this stage of the film apart from wishing I as watching highlight from the Cricket World Cup. Well, I am afraid to say that just like Father Karras in the first film, I found myself losing faith. Not in the almighty or in religion for that matter, both of which require a strong degree of intellectual competence, personal reasoning and debate before making a decision to do so; but rather in the Hollywood machine and decided to root for Satan (incidentally the last time I started rooting for the villian in a film was when I watched 'Matrix Revolutions', the plot for which was so unsatisfying that I ended up just wishing that the machines would just put humanity out of their misery). Because in the end, instead of summoning an experienced priest or religious authority, who could potentially resolve what is a life-or-death situation, that lets face it could cause some severe harm to the mental health of the girls; they furthered Chrisy's stupidity by mustering up all the woke courage that they could, do the 'Avengers Assemble' routine and all 'have a go'.If there was a symbol for just how bad Hollywood has become and why I now increasingly take interest in original material from Japan and Korea (both of which Hollywood unashamedly plagiarise anyway) or even independent cinema; then 'The Exorcist: Believer' acts as the perfect metaphor. An utterly dreadful film that will no doubt do well in the box office due to the various publicity spots and 'making of' documentaries that have been already been released by the Hollywood machine to promote it.",
    "66": "The plot bothered me. They cheated us. In the 73 version, Pazuzu was not actually out to claim Regan's soul. A random little girl wasn't ever its prize. She was just the bait to ultimately lure in and claim a holy man's soul as an insult to the Christian God, in which it was successful. The guts of that story hinged on Karras's loss of faith in his God and humanity, his journey to find it within himself, and then the deception of the demon to claim that now nourished soul in order to corrupt it (explored further in the 1990 follow up). This modern version had no such truth or stakes at its heart. The cheat comes in because one of the two girls was always doomed to hell from the beginning, and regardless of the outcome of the exorcism, Pazuzu was always going to win, making the story pointless. It renders the exorcism itself void and all of it just felt like a game that was rigged from the start (unless that was the point, but that wasn't made clear). And in this version, apparently Pazuzu is now interested in the souls of random girls for reasons that are never explained thematically or in the plot. In addition, they continued this terrible tradition, when it comes to the rules of reboots, by getting the trademark oldie, used her for 10 minutes of screen time, and then disposed of her in a very unsentimental and unjust way. Ellen Burstyn deserved so much better than this. The horror elements pushed no boundaries and it all felt like it lacked the brand of dread that makes The Exorcist 1 & 3 as infamous as they are. Wasted opportunity, or perhaps did not need to be made at all.",
    "67": "As a fan of The Exorcist (1973), I can be honest when I say I wasn't expecting much from this sequel going into the theatre. The first act pleasantly subverted my expectations, but that's where the pleasantries end.The saving grace in the first half of The Exorcist: Believer are the performances given by the likes of Leslie Odom Jr. (playing Victor, a widower thrust into the possibility of losing his only daughter) who delivers with authentic stoicism and unspoken desperation. Lidya Jewett and Olivia Marcum (demon-afflicted Angela and her equally forsaken friend, Katherine) are also impressive in a complex and sensitive role for a child actor to undertake. However, these actors can only do so much with the script they were given, which is, admittedly, not much to go on.The allure of Regan's (Linda Blair) decline into demonic possession in 1973's The Exorcist lies within the slow, creeping realisation that something is lurking, waiting- revelling in your despair. In fact, the demonic possession is not the central theme at all, but instead a priest's battle with faith in a world that is losing it.The Exorcist: Believer seems to completely miss capturing the essence of what made the original so terrifying. Instead, it relies on the return of the brilliant Ellen Burstyn (Chris MacNeil) to give the film some air of intelligence. This strategy may have worked if Burstyn's role was considered with depth and intricacy, instead her whole ten minutes of screen time belongs to a fickle stand-off between a demon with a fifty year grudge that only serves for a quick splash of stage blood. David Gordon Green's direction of a core character in this shallow way simply enforces the idea that his background of stoner comedy and campy slashers is where he should gravitate back toward.Although the plot has some interesting ideas to avoid rehashing its source material, such as synchronised possession, unprocessed mourning, and Hoodoo rituals, they are never fully explored. The Catholic process of exorcism is also rushed and left unfulfilled, and suffers from the creative team's inability to just pick one theology and stick with it. The film's climax holds so little shock value that it half-heartedly relies on body horror and hokey new additions to the demon's repertoire of tricks (demon vapour and telekinetic murder, anyone?). The \"twist\" reveals that the parents of the possessed children must choose only one girl to live, a gambit with so little stakes that even the writers surely understood that any rational parent would choose their own child.Ultimately, The Exorcist: Believer had a plethora of potential, but very little conviction. Despite strong performances and modernised ideas, the film struggles to anchor itself in the dread and repulsion that made audiences flock to its 1973 predecessor. With one of the strongest horror films ever made as David Gordon Green's source material, one has to wonder if this would still be the outcome in the hands of another. What a shame.",
    "68": "I wish I would have looked at the critic's reviews ( most are spot on) prior to seeing the movie, but it was spur of the moment, myself and wife saw it was playing ( first night in theaters) and decided to see it since we are horror movie fans and don't see them much anymore because of our daughter. If you're a horror movie fan especially an Exorcist fan you will be disappointed. It seems like a generic low budget film. They try and carryover things from the original film but it's done in a corny way. We knew something was off when there were only 20 people in the theater on the first night, even on a Thursday that's low especially on the first night.",
    "69": "The exorcist is my favorite horror movie of all time, a favorite movie in general, so i was incredibly excited BUT...then i saw green was the director :/ the man that did the last 3 halloween films.Along with those, i cringed throughout & was very unimpressed. They were a few neat things however most are going to go see because it's a classic, and for linda & ann(you won't see em much)a lot of classics are being turned into messy creations which is disheartening. I saw plenty of potential to take this in several different directions but as i said, it left me unimpressed.Leave the past alone.",
    "70": "Not that bad - I don't get those bad reviews\nIt wasn't the film of the year but I appreciated the effort of Making a good film.Vibes of CARRIE 2: the revenge and Halloweens, it was ok to watch. 2 things was expected and obvious, I knew something would happening to one character and i also guessed well of the very ending part.The girls plays well. I'm hard to get with films and tv shows. Yes some part were a bit meh, but it's nothing surprising or innovative with those hunted movies, as we all know so at least this one better.Maybe it's good if you watch it at home yah but it's October, so why not at the movies 🙌🏼😎",
    "71": "I can't believe how shallow has become writing a good story. This movie has very disconnected parts in ways there is no meaning at all. The original version has an understandable sequence of events, plot and conclusion. This one is a mix of unrelated horror elements making the combination total waste of money, time and destruction of the illusion of something new for the fans of the original movie.What I don't understand is how come the production studio allow this guy to keep writing and directing this genre, he should go back to comedy. He already destroy to big franchises. Maybe that's the goal. It's that the case he should continue with Alien, or maybe Terminator possessed by Lucifer. This movie doesn't worth a penny friends. In fact I'm very angry of watched this garbage.",
    "72": "Blumhouse ruins yet another horror franchise with David Gordon Green at the helm. The acting is fine, the writing is awful. This studio is scared of its own shadow, for a horror production company, they seem unaware of how to use silence. This movie is all sound design. The music tells us how to feel in every moment, there is no room for imagination or suspense. Chris MacNeil mine as well not be in this. She plays no significant role and is only there because this studio thinks for some reason, that's fan service. I left this movie literally angry. The people responsible for this should be ashamed of themselves. What a waste of time and money and such a lack of respect for the filmmakers they are standing on the shoulders of. Horrendous. Avoid at all costs.",
    "73": "When two girls disappear and return three days later seemingly possessed, the father of one girl seeks out Chris MacNeil, whose daughter went through a similar ordeal fifty years ago.Director-writer David Gordon Green faces an uphill struggle and makes sone of the same mistake as the prequels. The Exorcist has been parodied and copied so much that the monster makeup, replaced voices, head-turning, familiar dialogue, and effects lose their impact and chills. It needed real-world delicacy and precision. A documentary gorilla film style would have lent the film a sense of realism, but Green, along with writers Peter Sattler, Scott Teems and Danny McBride deliver more of the same Conjuring-like style instead of offering the backbone of the source material: the inconsequential subtlety, and imagery that was. What you get is another spectacle-driven film, with drama and world-building overshadowed by the elaborate possession scenes.It may lack '70s grit and the chills of the third, but Michael Simmonds' moody cinematography and Amman Abbasi & David Wingo music score give it some weight. Nods to the original, eerie flashy images and sound design also help. It's solid enough, even if meandering, if you've never seen another film about exorcisms or possessions. Thankfully, Leslie Odom Jr. As Victor Fielding gives a great performance. Ellen Burstyn is on her usual fine form in her short-lived extended cameo return (with no mention of her acting past) as Chris MacNeil, which is a highlight, even if somewhat a missed opportunity. Photos and mentions of Regan MacNeil is a great bit of fan service along with Linda Blairs heart warming and fitting appearance. This emotional reunion redeems it somewhat.Possession films are a ten to a penny; a dime a dozen; and sometimes less is more. Believer is pure overkill, which is surprising given Green's more violent but grounded approach to the Halloween offerings.Overall, what you get is simply another well produced possession film. It's a pitty it wasn't a character driven chiller piece with Chris and Regan MacNeil front and centre.",
    "74": "I just finished seeing it in the cinema and here are my opinions on it:It's a very good movie about demonic possession but a terrible movie in the Exorcist franchise, and why? Because they sell it to you as a sequel to the original 1973 film bringing back Ellen Burstyn and this is exactly the problem, her participation in the film is insignificant, it has no weight in the main story and is only there to deceive the audience and what they do with her character is unforgivable, despite the partially surprising nature of the final scene. With or without her presence, the plot still can carry on.Now back to what's important, there are many excellent things to highlight such as the makeup, the performances of the two possessed girls who actually turn out to be very scary, the soundtrack and the enormous conviction of the cast in general are worth highlighting. Something else that caught my attention is how the issue of religious beliefs and skepticism is treated in parallel to the events that occur since the family of one of the girls is faithful to their religion and the church but the father of the girl Another girl is completely atheist, which initially leads them to a total disconnection until everything gets worse and thanks to the power of the script, the ideal conspiracy to work as a team is achieved.The scares are very few but effective, the girls character development is there but separately, that is, we are shown their lives in their respective families, but we never see them interact much like the friends they are, so it is almost impossible to give a care about.The exorcism scene, although a little rushed, is brilliantly constructed and very intense in my opinion, by far the best thing of the entire film.Despite how bittersweet the ending is, there were several loose ends that were more than obviously left there for the next film.Many people will hate it and they have every right to do so, don't expect to see a great movie on par with The Exorcist from 1973 because the disappointment will be huge, I just expected to see a movie that surpasses its infamous sequels and I was satisfied.It surpasses The Heretic and the prequels from the first minute, but just barely over The Exorcist III.I don't like movies about possessions because they are all the very same but i enjoyed this one even though selling it as a sequel is a scam.Nice horror film despite having a very lousy script.7 out of 10.",
    "75": "We live in a world where a new Saw film and a new Exorcist film came out in the last 2 weeks, and somehow the Saw film is better. A lot better.The first 45ish minutes weren't bad and had me wondering why so many people were bashing the flick. Then the rest of it happened. It's an overly preachy CGI heavy mess of a movie. I won't mention anything specific not seen in the trailers, and with that said, everything with Chris McNeil is forced in there just to give this ties to the first. There's no real reason behind her being there and they didn't know how to make her presence organic. I don't honestly feel there was a way to make her being there make sense... The girls were good but didn't get to do much. They were in no way given the heavy lifting Linda Blair was given in the original. And the CGI.... Jesus, the CGI... why is it there?",
    "76": "For the first installment of a trilogy....didn't have the same effect of injecting fear into the audience. Hoping the next installment delivers a newer level of fear to the audience. These producers must have forgotten that the original had the audience vomiting and passing out. They knew they had competition to keep their audience thirsty for more! Except...they left the audience hopeful that the next installment delivers. A few good scenes and the effects of possession was good. Hoping that Regan makes another appearance! To see the demise of her mother was a lousy segment and should have not happened. Took away from the ending of the original that the \"good\" won and that the evil lost.",
    "77": "If I thought the second Exorcist movie was bad this was even worse. Deserves a Razzy Award for the worst movie ever. Was a bore fest. Story line was weak and so drawn out. Action only happened near the very end. What a waste of money going to see this movie. We were the only 3 people in the theatre watching it on the second day the movie premiered here in Australia. Now I know why. Boringgggggg. Terribly lazy writing by the screen writers did they run out of ideas. Have they no imagination. Wasn't scary at all. Doesn't even compare or come anywhere near the original Exorcist which was brilliant all round from its actors to the story line cinematography director. But this 3rd coming absolute disaster.",
    "78": "I love horror films. This was a pretty decent season for them at the box office starting with Talk to me, The Nun, and It Lives Inside, but I was most excited for The Exorcist. However, the director managed to take an iconic original film and turn it into a massive mess. So many holes in the plot that never got answered. Where were the girls for 3 days? How exactly did they get possessed? Why were both of them possessed? Then the Catholic Church declines the exorcism and it becomes a \"unity\" of all races and religions to eradicate the demon. Oops! The softy man chose wrong by \"picking\" his daughter and was tricked. Awe man. You lose. Your daughter is dead. Next scene: Angela returns to school like nothing happened. Just complete garbage. I found myself wanting it to be over with about 20 minutes of run time left. The best parts of the film were in the preview.",
    "79": "Felt like when Ellen's eyes were gouged out, it should have happened to all of us watching. We were promised the return of Chris McNeil and what we got was a 10 min cameo then they locked her away in a hospital room! Had nothing to do with the exorcist and this was insulting to fans.What we were shown in the trailer was misleading. Felt like a bait and switch. And let's not even get started on Linda's 30 second cameo. Wow!Waited 50 years and the fox series was better than this garbage.It's pretty sad when your film in 2023 is less scary, less impactful, and less powerful than the film in 1973.",
    "80": "Fifty years after the original EoXORCIST, the franchise gets a reboot in this schlocky tale of two 12-year-old girls who come back possessed by demons after disappearing for three days. Exactly how and why this happens is never fully explained; the script is full of holes, one of several areas in which it falls short of the earlier version.Linda Blair gets a credit and a brief reappearance as middle-aged Regan. Her elderly mother Chris MacNeil (Ellen Burstyn) has a key role: she is now an exorcist herself and together with dropout-nun Ann Dowd takes a lead role in de-possessing the girls; in this movie the priest gets to play third fiddle.BELIEVER is a bit better (not much) than I've made it sound. The build-up is good, but the actual exorcism is inevitably a rehash and the CGI is less terrifying than the original's use of stunts and make-up. The acting teeters on the edge of parody. Ann Dowd, rigid as a drumskin and \"fruity\" as ever, is the best thing in it.",
    "81": "When it comes to horror film franchises, why not revive this one, which mixes ghosts and beards, allopathic medicine and superstition, believers and non-believers. The film is a sequel to William Friedkin's The Exorcist (1973). This sixth in the franchise (after the first, two sequels and two prequels in the 2000s) helps to relaunch the franchise, and, moreover, opens up multiple possibilities for a new trilogy...\nThe framework is standard: exposure, an event, one or more possessed children (girls, if possible), medical analyses, psychiatric problems, then beliefs and superstitions, followed by one or more dispossession ceremonies. On this last point, David Gordon Green's film renews the franchise, inviting voodoo, Catholics, Protestants, deacons (or similar) and non-believers. In short, multiple possibilities open up for this new trilogy.The film is gripping in its climate, its tension that we as viewers anticipate, with scenes that regularly startle us, then a little (very light) gore, then the possessions and ceremonies, with fine work on the possessed women's make-up.The film has a pleasing \"old-fashioned\" feel to it, and doesn't seem to rely on all-digital technology. The technical credits are top-notch, underpinning the tension.",
    "82": "Beginning was fine, later gets a little better but after about half movie becomes too much predictable and like low budget movie. As for horror movie I saw only 1 a bit scary scene and expected to see some more scary scenes but movie just becomes unrealistic in trying make adults believe in real life demons.If, you want to add another watchable movie to your +1000 movie list. It's not a bad choice.Better horror movies: The Grudge, Mirrors 2008, the Possession 2012, Carriers 2009, Carrier 2013.In addition, try watch Extinction 2015 and after Exorcist Believer. You will see a huge difference in how good each movie.",
    "83": "This new Exorcist movie was an absolute disaster! I can't believe I wasted my money on this train wreck of a film. It's so infuriating how they ended it on a so-called 'happy' note while one character got dragged to hell just to set up two more movies. Are they trying to ruin the legacy of The Exorcist?And what was up with that boxing scene with the black father? It felt like a pathetic attempt to cash in on the original film's iconic moments, and it failed miserably. Don't even get me started on that pointless, fat guy who got 20 seconds of screen time.I could go on and on about the countless things that went wrong in this movie, but it's clear that David Gordon Green is on a mission to destroy the Exorcist legacy with his trilogy. Someone needs to put a stop to this madness before it's too late.",
    "84": "Just Got out of Dolby Cinema. What a Shocking End! 😰1. Choose Angela to Live or Choose Angela to Die?Or2. Choose Katherine to Live or Choose Katherine to Die?But they didn't ask Satan what it Ment by \"Choose\"Man, what a Watch!Slow build up to that Final 3rd and then Whoosh! ⚡It Got so intense in that Last Half Hour, that the time literally Flew by. I thought I was in the theatre for 90 minutes.Elements -1. The Plotline, I really liked it. You have the Mainline of Standard Possession of the 2 Girls and then you have the 2 intricate Moments during the Final Act. \"YOU DON'T BELIEVE\" 👌 & \"YOU NEVER WANTED ME\" 👌. One of the Main Points of this Film is that lead up to that Brilliant Blitzkrieg in the Final Act.What a Couple of Moments in Time! The Director Nailed those Moments in Time.Its so hard to Nail \"Moments in Time\" like that In Cinema across all Genres. Those \"Moments through Realisation and Experiencing Them\" as I like to call them.2. The Characters - the Characters were Solid Enough to Service the Plot. I hear some people say that the 2 Daughters didn't have enough Character Development.............but.......thats the Whole Point. The Majority of the Film, the 2 Daughters are Possessed.3. The Sound Design was so good and in Dolby Cinema, it was in Full Force.4. The Score was So Good at Times and added to that Intensity in that Final Act.5. There were some creepy as hell scenes and Jump Scares in that 1st & 2nd Act.6. The Decision - what a Moment! \"I choose ****\" - and then the Result.Overall, What a Watch, and that lead up to that Brilliant Blitzkrieg in the Final Act. 😰",
    "85": "If harrowing, disturbing and terrifying is your jam have I got a movie for you?When \"Victor\" (Leslie Odom Jnr) daughter, \"Angela\" (Lidya Jewett), and her friend \"Katherine\" (Olivia O'Neil) emerge from the woods after 3 days and show signs of demonic possession, it unleashes a chain of events that forces single father \"Victor Fielding\" to confront the nadir of evil.Terrified and desperate, he seeks out author and mother of the original \"Regan\" Chris MacNeil\" (Ellen Burstyn now in her 90's) the only person alive who's witnessed anything like it before.Although she admits she never witnessed the exorcism of her offspring she was familiar with process.Personally as a father of two I can't imagine what would possess (pardon the pun) you to let your child act in a horror movie, especially anything connected to \"The Exorcist\" franchise that had its roots 50 years ago when the average house price in Australia was around $25,000.At least Linda Blair (\"Regan\") is as an advisor to the young actresses playing the possessed girls.God knows she's been to hell and back in real life and on the silver screen.Like all the sequels in this franchise, The Exorcist: Believer falls well short of the original, but it still offers enough atmospheric horror to turn heads (literally).Directed and written by David Gordon Green is a style above substance supernatural horror thriller that's a real slow burn.In fact, it's not until the third act that we see the exorcism.Even so this movie is way better than Greens attempts at Michael Myers reboots with \"Halloween\", \"Halloween Kills\" and \"Halloween Ends\".This is a much more mature movie from someone who is yet to show us their Coup de gras.Comic actor Danny McBride shares the screenplay credits with Green, Peter Sattler and Scott Teems and while the script has moments it's also a bit silly, especially during the tag team WWF style exorcism...where even failed Nuns have a rack at releasing the demon from the girls.They stole a lot from silver lining of Blattys playbook, but don't really own it.The original concept of course was sourced from author William Peter Blatty's terrifying, but brief novel of the same name.To fully appreciate what the Blumhouse boys have created a half a century later it might be best to watch the original, which is streaming as a rental.Watch out for: Norbert Leo Butz who does a very \"Kevin Rayburn\" (Bloodline) thing to save his child \"Katherine\" from demonic possession.Stay for the last scene, because it brings this series full circle.\"The Exorcist: Believer\" is not recommended viewing for anyone 15 and under no matter how desensitised they might be to horror and violence.Apparently Batty on his death bed threatened to possess Green and make his life a living hell if he made a sequel to \"The Exorcist\".Can you blame him?Why would you trust the man who made the dope smoking, slacker movie \"Pineapple Express\" with your baby?You know what's really scary?Thanks to Blumhouse securing filming rights to this movie for 400 million dollars they have to make a trilogy, even if this one bombs at the box office.",
    "86": "There are so many things wrong with this film...no need for two people to be possessed. Totally distracting.-really poor story of how the girls become possessed, unlike the original.the father was too weak of an actor to convey any complex emotions. Seemed totally unbothered and calm the whole time.the actual exorcism wasn't scary or made any real sense.completely wasted returning characters. Reduced to meaningless bit partsno build up or suspense, mostly lloud noises and cheap scares.no real endingThe original is a horror classic. This film will go down as a missed opportunity. Massive shame.",
    "87": "\"The Exorcist: Believer\" is a film whose trailer was better and which promised an old school style story but adding new elements, the result was not terrible but it was bad. The script starts without much interest, the scenes of the first symptoms of demonic possession were quite simple and did not create tension, the exorcism scenes fail to stand out and feel illogical, during this part of the film it manages to have a couple of good scenes. Using characters from the original film makes no sense, their participation is almost irrelevant but it is nice to see them again. Within the aforementioned script, an attempt was made to give it a new perspective with the theme of religions and a union with a common good, but it completely fails to innovate and they treat it in a simple way. The performances are average, the two possessed girls do not achieve the masterful performance that Linda Blair achieved in 1973. David Gordon Green fails miserably in his work as a director, the cinematography is decent, on the soundtrack it is appreciated to hear the legendary \"Tubular Bells\" although with certain changes that are not poorly achieved and the makeup effects look gloomy. The positive points are few and the negative ones are more, a soulless sequel.",
    "88": "Wow, this was really bad.The original \"The Exorcist\" was a great horror movie with many intense and horrific moments and great memorable characters. I haven't personally seen the sequels and other installments so I really can't talk too much about them. The Exorcist: Believer is considered a direct sequel to the first Exorcist, I kind of expected this one wasn't going to be great but I didn't expect it to be this bad.The production and the costumes were pretty standard which made it feel, at times, a television movie setting and the camerawork was mostly generic despite having a few shot compositions that looked pretty good. Even with some good camerawork, the messy narrative and direction and the use of horror cliches and annoying jump scares just drags the movie down and ends up making things eye-rolling. Director and Writer David Gordon Green has made a few movies I liked like \"George Washington (2000), Snow Angels, and Joe\" and Green tries to create something different for the installment. Unfortunately his writing and directing doesn't really offer much because the writing is all over the place with moments that are quite laughable alongside the bland direction.Honestly, the performances from the cast members are not really good as the performances felt poor, dry, and not very convincing. Leslie Odom Jr. And Ann Dowd are actors I like and they seem to be trying their best but unfortunately they aren't able to keep hold on their roles. Ellen Burstyn is absolutely wasted in this movie. As mentioned, the narrative tries to explore some new characters and territories but the narrative isn't good and none of the characters were interesting to the point that it was really boring at certain points of the movie.The soundtrack was pretty generic. The dialogue is really bad with certain monologue moments being poor and sometimes laughable. Certain lighting moments were bad, the make-up and costumes looked alright but there were certain moments that made them look cheap. Also, the movie has some of the worst editing I have seen in awhile which makes Bohemian Rhapsody's editing look like a masterpiece.Overall, I don't understand why it's necessary to have a new installment of the Exorcist. At this point, as much as I like some of Green's early work, I'm convinced his future works aren't going to be really good anymore.",
    "89": "After defiling the Halloween saga with his insipid sequel trilogy, David Gordon Green brings his desecrating vision to yet another beloved horror classic and leaves no stone unturned to insult its unparalleled legacy. Nothing less than an eyesore, The Exorcist: Believer is one of the worst films to surface this year and makes for a wretched, unholy & sacrilegious mess that itself is in desperate need of an exorcism.Also co-written by Gordon Green (Halloween Kills & Halloween Ends), the story never is able to create any sense of intrigue throughout its runtime and only gets worse as it progresses. There is no emotional weight to its setup, it is severely lacking in atmosphere, is downright ineffective in the scary department with its tired tropes & clichéd attempts. And characters remain distant as well. There isn't one aspect that's executed well.Where the original was pioneering in its use of horror set pieces, practical effects, sound design & storytelling, this follow-up chapter has got nothing to capture our attention. Everything it tries fails to work out, its attempts to scare the viewers only ends up being hilarious and what it does with Chris MacNeil is not only facepalm-inducing but also mind-numbingly moronic. Acting from all is forgettable and the finale is a neutered, dumbed-down version.Overall, The Exorcist: Believer is an incompetently directed, shoddily scripted and awfully acted sequel that has no understanding of what makes The Exorcist such an enduring masterpiece of its genre. Much worse than what the negative reception will have you thinking, the film has zero redeemable qualities, offers more laughs than scares by playing out like a parody than a proper sequel and is horror filmmaking at its most bland & uninteresting. In a word, cringeworthy.",
    "90": "I was a huge fan of the original and best 1973 film of the exorcist.That was really a scarry horror film which made a huge impact 50 years ago.The original sequel part 2 the heretic was a welcomed addition and then we got a different story for part 3.Part 3 was weird entry. Others liked it others didn't but it tried to be something different.Then the prequels arrived around 2005 but they were average at best.I preffered the begining over dominion.And we are here at 2023 with a brand new exorcist sequel which use the halloween 2018 and the saw X formula.Problem is....the 1973 magic is gone.We will never get those magic days back.Sadly the film is too predictable and uses the same formula over and over again.Maybe we got too much similar films all those years and we got tired but anyhow this new entry is nowhere near the 1973 film.There are a few good things like the return of a few original 1973 cast members and the exorcisms were done right but at some point u may get bored.Anyhow this is better than nothing and u can check it out but don't expect to witness what u witnessed back in 1973. That's 4 sure.Grade B-",
    "91": "Ouch....This was a terrible film, when will they realise that trashy followups such as this are just pointless and unnecessary. The original is a classic, a movie that lived on in the minds of people for decades, this one, you'll forget about within just a few days.It was only about an hour and a half long, but it felt painfully long, nothing happens until the final ten minutes or so, but even that bit of excitement was underwhelming.I was genuinely excited by the trailer, and seeing Ellen Burstyn added extra excitement, but the trailer flattered the film, credit to whomever put that together, sadly the film was drab, slow and totally uninteresting.I know I'd mentally zoned out about two thirds through, but there seemed to be no explanation, who the demon was, what its purpose was, the story was just so disjointed, dare I say badly realised.It should have been a Halloween chiller, it remained tepid from start to finish.4/10.",
    "92": "What a whatever of a movie. The Exorcist: Believer is another entry in this series that honestly, beyond the 1973 original, is not very good. I know Exorcist III has its fans, and there were parts of that one I liked, but it's still got nothing on the first one. Every other movie in the series falls somewhere between interesting failure and absolute disaster.The scariest part of this was hoping a very frail-looking Ellen Burstyn wouldn't fall over (she's in her 90s!). I felt bad for her being in this - they don't give her much to do, but she still gives the closest thing to a decent performance in this. There are other cast members here like Leslie Odom Jr. And Ann Dowd who I know have been good in other movies, but don't turn in great performances here.It plays things as safe as an Exorcist movie can. There are still things in that original film that are shocking to see and think about to this day. And yet with the first movie, it's essentially a compelling drama that also happens to be scary. Whenever The Exorcist: Believer tries to get you to care from a dramatic perspective, it falls flat. I also didn't find much of the intended horror scary. It delivers nothing any number of demonic possession movies haven't already done, and the jump scares (they're pretty common in the first half) are even pretty lazy and failed to make me jump.This movie is boring and predictable, badly paced, not very scary, poorly shot and edited at times, and fails to have much by way of good acting. I dislike it the more I think about it. Yeah right this is going to be the start of a new trilogy - get out of here!",
    "93": "Another possession movie that does the same thing every other possession movie has done since the original Exorcist. The fact that the exorcist title was used for this movie is a shame.There wasn't anything frightening about this at all. The build up felt like it took too long and the ending felt rushed. Everything else in between was boring. There were moments I laughed at the dialogue, I'm sure it wasn't intentional humor. There isn't any creativity as to the demon that possessed the girls, the film basically wants you to believe it's the same evil from the original. It's the same recycled idea of someone trying to get in contact with a dead relative and summons an evil spirit.The whole idea of two girls being possessed at the same time didn't add anything to the film.There are many more things about this film that didn't work, just think of a cliche possession movie and add the exorcist title and you have this film. Do not waste your time.",
    "94": "LIKES:The Acting:\n-A strong cast to get a movie like this to come to life is essential, and I felt many did their jobs quite well and brought the demons out to play.-Burstyn does well in her role when she arrives back to take on the Devil again. She's strong, has this commanding presence and gives inspiring speeches that work with the theme of this movie.-Nettles is fine as the worried mom and there are times she kills her performance, but there was more that could have been done with the character to pull her full effect out.-As for Odom Jr, my favorite of the bunch. He's tough, he's got great delivery, and I love the question of faith role he has with this direction and how much I believed the struggle.The Setting/Cinematography:\n-The movie's chilling atmosphere comes from the setting that this film takes place in... home and how even here you might not be safe.-While we have plenty of movies that use this same setting, what this movie did was really use effects and the camera to make the horror come to life.-Believer's camera work finds all the right filters and angles for me to help add that extra oomph to help make the discomfort come out even more.-Those shadows are haunting, and just big enough to be unsettling. Then you find them hitting the right movement, the close ups, and the dynamic movement to get just that perfect shot for the horrors coming with it.-It's one of my favorite aspects about it, and having that dynamic movement helps mix things up and add just that pop of spook factor you want.The Sound Editing/Voice Work:\n-Most possession movies are about adding that haunting noise and effects to help make the demon's work come to life.-Believer did this for me well, the underlying musical gestures the start of the magic that they brought with the sound.-Then the growling, creaking, and background noises come in next and those things add that undertone of terror that something lurks in the realm.-Still not enough, then get set for the louder things to come. The demon's voice really has a great use, a mixing of two adolescent voices with the familiar throaty deep tone work as the demon plays it's game.-The writing of the movie comes out the best with the delivery and the voices, finding just the right tone, pitch, and throaty texture and switching them in and out.-It adds character to the victims and the scenes, and I really felt this part was sort of the character of the movie.-The finish is the screaming, done by everyone, but all conveying the terror and horror as the torturing continues and the girls convey that terror of being in the hands of this monster.Movement Acting:\n-Nothing can be more chilling than watching a body writhe and wiggle in torture conveying the unnatural forces at play.-Believer accomplished this, the girls talented in how they bend, twitch, move, and roll about as their internal fight for their soul continues.-Their control was impressive, the coordination and direction to really make the girls give you skin crawling angle and actions that convey that demonic control.-Head jerking to painful degrees, slow tweaks of the head and smiles of sinister grinning and hunger, and the powerful lunges that are a bit too realistic.-The best part of the acting for me and worthy of praise for what they accomplished.The makeup:\n-The original did it well, and this one has fantastic prosthetic work to make the gross factor awaken.-Believer's looks are sinister, disgusting, and pulsing with that horrific detail that made me grit my teeth and shudder.-Flaking skin, body scars, blood, and decaying nails are some of the things that await you, assisting with the decay that demon possession has on people.-While the eyes, lips, and more supernatural elements really come out in that movie glory, with pale clammy skin, those unholy yellow eyes, and black residue oozing out of every crevice.-Certainly my favorite part of the movie, the familiar designs really come to life and hold well in this movie, and computer assistance does not make it too fake or off putting to not be able to handle.DISLIKES:Not Scary:\n-Unsettling, sure. I mean possession is not something to mess around with and that was the part that made me feel the most scared.-The movie for seasoned pros of the movie though are going to be bored as the scares are really drowned out by the preachiness of the movie.-Believer's direction ifs familiar enough, but the movie just can't get back to the roots and storytelling when lost to the more moral and divine playing.-Throw in less scare tactics, some jump scares that went wrong, and simplifying the actual story horror and I see the complaints that most have.Burstyn's Cameo needed more:\n-This is in no way a spoiler, but when you go out of your way to play up a big involvement of the franchise favorite and don't utilize it, you get disappointment.-The times she is on screen she rocks with her delivery, but there was so much more to use the queen on, and we just exorcised it without a second thought.-The new cast has potential, but they weren't enough to offset the bait and switch with a character who made more speeches than added to the story, including the special moments that were meant to have more gusto.Where were the thrills?-Another boring element is feeling nothing in regards to the suspense and thrills that the first one had.-This does have to do with the fact that movies have done everything to death, but still, a little more challenge, dive, and testing of characters, building into the story like the others could have gone a long way.-But that wasn't the case. Believer takes a lot of side stories and tries to give this a religious kick that feels party Sunday school lesson.-While the heart of those lessons is there and important in terms of execution it was sloppy, to the side, and feels quite superficial for what these movies have done better in the past.-And even more so, it just felt like there was too much in one film and everyone was trying to pull equal pieces to have everything in one movie.-This just led to a diluted movie that started baring its fangs then put them away.The Character/Acting/Story/Writing Is Messy\n-I mentioned this earlier, but because of everything being jammed into one movie... you can guess it gets sloppy at times and this too I felt with time in the movie.-Character development is inconsistent, sometimes starting to go deep, and other times a flicker before we get into preachy/overdramatic moments.-Some of the acting is top notch, and delivers character moments that I'll remember, like Odom and the girls, but forgettable for Nettles and several other people that feel lost to editing.-The lines go from realistic, haunting, and a real battle of faith, to again citing lines and feeling like a Christian delivered movie that feel out of place and forced.-And the story holds so many good elements, but again, fades to very bloated moments that are side tracks and very gospel like, not flowing.-It all leads to the movie feeling like it still needs a little more tweaking and planning, and any potential sequels really going back to the roots, picking some stories, and making sure its character centric and spooky.-In doing so, this might just help get the Exorcism to be a success, rather than feeling like another cash grab.THE VERDICT:\nThe Exorcist Believer certainly has the modern feel in regards to the cinema level of craft, filming, and makeup. I found the most enjoyable parts to be the physical shooting and creation aspects that helped bring some really cool makeup effects to the genre. It's haunting with sound, fantastic with moving the camera, and really helping establish the true terror and soulless nature involving Hell. Sadly, the movie suffers on a lot of other things for me that take away from the film and sort of buffer what I think the movie was trying to accomplish. A cameo that is very limited is just the start as scares, thrills and cohesive film got lost in preachy dialog, too many stories, and what felt like a very crammed movie. The result is not the worst movie of the summer, but certainly a weaker film that lacks something the first movie (and some of the ones that followed) had. Given all this, I hate to say you optimize your money by waiting for this one at home, with Saw X still being my choice for horror/thriller movie.My scores are:Horror: 6.5-7.0\nMovie Overall: 5.5-6.0.",
    "95": "After going missing in the woods, a pair of girls are found alive several days later with no memory of what happened but the feeling that something is off about them, and when it becomes obvious that something evil has returned with the girls force their parents to turn to a personality to deal with them.There was almost nothing to like about this one. Its positive points extend almost exclusively to the technical qualities featured here which is the typical slick, glossy high-end studio product like this should be. It's not a surprise that this carries the type of sheen you'd expect in a film like this which extends to the gruesome make-up work on the possessed during the fateful exorcism scenes as well as the content within the exorcism scenes. While there's nothing new here in these moments, that there's some energy to the proceedings is a choice to be taken here which is a decidedly decent factor for this one and is the main part that holds this up for the most part. Beyond that, though, there's just nothing about this one that works. The main problem among the many is the lackluster and underwhelming story that never generates anything. The concept of the girls going missing and being found days later without any memory is a serviceable enough starting point, but it's never followed up on to make sure what's happening is obvious and the treatment of the girls is quite dull as a result. Having the parents argue with each other isn't a substitute and that causes things to feel rushed and simultaneously bland overall. On top of that, there's also the issue of how this one tends to come about building its' fateful showcase sequence. The random nature of how the priest is called upon to take up the case of exorcism is missing as if his presence wasn't important or impactful and was just in the right place at the right time. Worse off, nothing the girls do while building up to that point is all that terrifying as it amounts to the usual assortment of hushed threats, supposedly shocking superimposed faces popping up unexpectedly, or just out-of-behavior freak-outs that don't come close to being scary or interesting so the emotional resonance it tries to generate for the finale is flat and completely missing. The last issue here is a massively overwrought and unnecessary sense of fan service present here that doesn't need to be here. The most obvious is the presence of a returning character that has no importance on the plotline as there's barely a purpose before being unceremoniously discarded like there was no need for them to be there. The connection to the original outside of that is tenuous at best and regards the finale as something completely useless with it delving into a familiar pattern of tropes and exercises that play out in fine order. It's quite hard to overlook all of this after all the other issues here and combined make this one so underwhelming and barely worthwhile.Rated R: Graphic Language, Violence, and detailed discussions of teenage sexuality.",
    "96": "The Exorcist: Believer follows the iconic horror film that has stood the test of time. Released in 1973. The sequel tells the chilling story of a 2 young girls possessed by a demonic entity. The movie is as it predecessor known for its intense and terrifying scenes, as well as its exploration of faith and the battle between good and evil.The performances in The Exorcist are outstanding, particularly of the 2 possessed girls. The portrayal of the demonic possessions are both disturbing and captivating. The makeup and special effects used to bring the possessed to life are impressive.The Exorcist is not for the faint of heart. It's filled with shocking and unsettling moments that will leave you with goosebumps. The jump scares are a bit to predictable yet a few had me skip a heartbeat for a minute.If you enjoy supernatural horror and don't mind being scared out of your wits, The Exorcist is your type of movie. Just make sure you set the vibe right and dare to see it on the big screen.",
    "97": "Dear David Gordon Greene,Please stop taking horror franchises and trying to spin new trilogies out of them. Seriously.This movie is so wildly inconsistent with the movie it's supposed to be a sequel to. The tone doesn't match the original, the possession is no more special than the hundred other copy-and-paste \"demon possession\" movies we have out there. It's quite bloated, the acting is bland at best, the storyline falls completely flat, it relies solely on jump scares that don't land, overall it's just a boring movie. I don't remember the last time I sat and stared at the time on my phone in a movie theater as much as I did watching this.Ellen Burstyn is the only saving grace this movie has, and her talent was largely wasted in this one. She isn't given nearly enough screen time and, although she does a very good job delivering her material, she's working with a piece of garbage script that is completely inconsistent with her character in the original (and, since this is a sequel, it's fair to compare the two). This movie was a letdown from start to finish, in every department.The only good thing to happen in this nearly two-hour mess happens in the very end and, since I obviously can't spoil it, you're going to have to watch it for yourself, but the only thing in this movie that grabbed me happened at the very end, right before the credits rolled. It's the only positive I can talk about with other people when it comes to this movie, sadly.I wanted to love this movie so badly. But, given the fact that it's provided to us from the man responsible for the fan service-dependent Halloween trilogy that recently wrapped up, I guess I got exactly what I paid for. As a diehard fan of Friedkin's masterpiece, I was bitterly disappointed and I'm now a little ashamed to even say I watched it.",
    "98": "I grew up in the 80s and 90s so I remember seeing this movie at midnight shows in the early 80s. Not to mention the drive ins that used to show this movie back when there were drive ins on just about every corner. Kids today expect loud special effects and jump scares in their horror movies. Plus they think IT chapter 2 is an actual sequel because they never bothered to read the book it's based on. So when I heard about the bad press this movie got I was reluctant to give a few hours of my time to see it.I will say I enjoyed it as a direct sequel to the Linda Blair series. The original was loud and scary for its time. I'd say this movie is more so creepy than scary but effective in the sense of the horrific story it tells. Could a man who lost his faith in God over the death of his pregnant wife be the key to saving the day? Or Will survivors guilt ruin him forever.I found the story to work because I can remember seeing the original movie in theaters and the mood of the storyline is similar.Practical make up effects still rule the day in this sequel which I will say I enjoyed. I think this movie is more suited to crowd of folks from my generation who grew up in the 80s and 90s.",
    "99": "Whatever your opinion of David Gordon Green's Halloween trilogy its hard to deny he took a big swing at it and The Exorcist: Believer has a lot in common with the director's 2018 revitalisation of that franchise. Like Halloween 2018 this film ignores every previous sequel and is a direct follow up to the original Exorcist. Like Halloween 2018 this film sticks pretty closely to beats of the original but with heightened stakes (more kills for Halloween, twice the number of possessed kids here). Unlike Halloween 2018 this film isn't a complete success.Not that The Exorcist: Believer is a write off by any means. Having two friends be possessed is a nice way of distinguishing proceedings from the sea of other possession films we have seen over the last few years and adds an extra layer to dealing with the situation, not only does the worried father need to deal with what is happening to his daughter but also with another family and their beliefs on what should be done. The possessed kids are suitably creepy and the film has an interesting take on the notion of an exorcism and faith. Rather than the strictly Christian depiction of the 70's original, Believer references the fact that some sort of demonic possession is present in many belief systems and the faith required to battle such things isn't tied to any particular religion, hinting at interesting directions the series could take going forward. The film's biggest selling point is an outstanding performance from Leslie Odom Jr. As single father Victor. His emotion and believability really sell proceedings and leave the viewer hoping things work out for him and his daughter.Unfortunately, Believer drops the ball in two crucial areas. Firstly, the pacing of the movie leading up to the exorcism is too slow. There is a section where the two girls are missing that is dragged out to the point it feels the film is going to be a missing person drama. This falls flat as there are zero stakes, we know the girls are going to turn up. Later in the film a legacy character turns up what could have been a cool cameo but ends up turning the film into a sideshow. The other problem it has is in portraying the events of the Exorcism itself. Things are tense but it's unclear the procedure is actually progressing. Are all the things they are trying failing or are the setbacks just part of every exorcism? Is this a particularly hard to expel demon or is everything going as planned? It's harder to buy into the drama without having any idea how close success or failure is.So what the film does well is mostly undermined, leaving it with only its famous name to really distinguish it from all the other possession flicks out there. Still, if you're a fan of the genre you'll probably find yourself entertained.6 people saved from 10 \"you can save your daughter or your wife\" situations.",
    "100": "The Exorcist: Believer is a sequel to the original The Exorcist film from 1973. This sequel ignores the other sequels and tries to start a new storyline. The film is directed, partly written and produced by David Gordon Green. He has also done the same with the Halloween film series, with which he also started a new storyline in 2018.Single father Victor Fielding (Leslie Odorn Jr.) has been independently caring for his thirteen-year-old daughter Angela (Lidya Jewett) since the loss of his wife. When Angela and her friend Katherine (Olivia O'Neill) suddenly disappear without a trace, Victor and Katherine's parents do everything they can to find their daughter.When the daughters are found again three days later, they do not know what happened to them or where they were. During several investigations, no one can explain what exactly happened to the girls. Yet the parents learn that something is wrong with their daughters, who begin to behave increasingly strangely. When the parents learn that their daughter is demonically possessed by a dark force, Victor enlists the help of Chris MacNeil (Ellen Burstyn), who experienced a similar situation with her own daughter fifty years ago.With this sequel to the classic Exorcist film, David Gordon Green and the rest of the writer and production crew don't seem to have had a clear idea. In contrast to what they did with their first Halloween sequel, because here they already seem insecure with their first film. This film quickly comes across as unclear due to the lack of details and further explanation. Furthermore, they simply try to imitate many things from the original film in slightly varied, but still very copied ways. For example, how exactly the two girls became possessed, or what happened to them when they disappeared, is not clearly explained in this film.Of the two possessed girls, as a viewer you only get the backstory of one of the two about how she grew up alone with her father after the death of her mother. You don't get enough information about the second girl and her family to really care about them as a viewer. This missing information may emerge in another film. David Gordon Green and the production crew had the same idea. Just like they did with their Halloween films, to make this a trilogy as well. After the inferior quality of this first film, you just hope that there will not be two more films.The film also tries to come across as more of a modern film compared to the fifty year old original film. In these fifty years, how people view religion and things like exorcism has changed and adapted somewhat. Various people try to apply their own way of faith and rituals to save the girls from the dark force that has possessed them. The characters sometimes do this at the same time, which only makes it more difficult to follow the film properly. After all these messy and unclear aspects, the final film no longer really comes across as scary or exciting and it ends up being more long-winded.Leslie Odorn Jr. Does his best to carry the film as the only truly developed character, but the further, unclear aspects of the film sometimes make this quite difficult. Lidya Jewett and Olivia O'Neill give credible performances as the possessed girls. Unfortunately, due to the amount of films about possessed people, it doesn't seem all that special. The same also applies to the makeup effects used for their demonic forms. Other visual effects do not always appear so believable.As the only returning character from the original Exorcist film, Ellen Burstyn unfortunately does not provide much special besides some explanation, which makes the film much better. She had rejected returning to the film series several times, but finally agreed. She received a double salary for this, but donated this money to acting studios so that they can help more people find and develop a career in the acting world.",
    "101": "Considering how badly, basically with malice, fans of horror movies have been treated during the last 15 years, this was no surprise. Yet another reimagined and rebooted subject, basically a cash grab, but this hurt as it spits on the original Exorcist movies while still riding their coattails. No matter how bad the later original Exorcist movies were perceived to be, they never came close to the levels of incomprehension of the subject and incompetence of creation on display here.This latest installment in the sorry and sordid line of David whatshisface Green's films is refreshing as it also remembers to be preachy, besides showing contempt for the original material in every form. What was the point of dragging Ellen Burstyn into this mess when the story this drivel of a film only resembles the original on a very superficial level? Yes, friends and neighbors, just plain embarrassingly bad writing by no less than three different hacks and third rate direction as in the sorry Halloween movies was not enough for the Exorcist franchise, this had to be destroyed with more cruelty, and for a longer time.I am not at all surprised to see that this absolute talent and visionary, the brolegend that is David G Green is already engaged for something called The Exorcist: Deceiver. This must be a direct result of the wonderful, just wonderful, overall performance of Halloween Kills and Halloween Ends, and now, with an explosive blockbuster like The Exorcist : Believer, who could deny him the chance?This is what the everyone is special and everyone is a winner mentality gets us. We deserve to be punished for basically being morons with no ability for critical thinking and too much loose cash to go around. Why is it so hard to realize mistakes and to just move on without the source of the trouble? I mean, Jordan Peele is at long last only up for an \"Untitled Fourth Film Directed By Jordan Peele\", and that is where he should, and will, stay.",
    "102": "The Exorcist: Believer is a non-sensical, boring, unimaginative, and a not so-scary movie that doesn't warrant The Exorcist title.Director and writer David Gordon Green tries to craft ANOTHER requel, a reimagined sequel to an iconic horror film that ignores everything after the original. This idea worked to a certain extent with Halloween but here Chris McNeal's return was laughably bad. She had no baring on the possessions that were transpiring, she got in the way and provided no help whatsoever.The idea of having 2 girls being connected in a possession could've been interesting but the film fails to develop any sympathy for all the characters. One family is more prominent than the other so it left me wondering what was even the point of having 2 possessions?On top of that the girls appeared more abnormal than possessed for a majority of the runtime and when they were clearly possessed it felt like a cheap imitation of what has already been done in not just the original but the genre as well. The possessed children spoke creepily, puked a few times, and one of them levitates but the context of it all is far from fear-inducing.Rarely ever does a film make me want to leave early but The Exorcist: Believer managed to make me checkout as early as the halfway point. Its uninspired story was both boring and uneventful. David Gordon Green should not be given the reigns to anymore more classic horror franchises after this one because The Exorcist: Believer is unbelievably terrible.",
    "103": "Exorcist The Believer\nRating 2.7/5\nHorror, ThrillerThey completely missed the essence of the original 1973 film, The Exorcist.Most of the people in the theater were elderly. Maybe they were excited because it had a sequel, but it mostly ended up being disappointing. It was cheesy watching the two kids being exorcised. There was no thrill. It felt like being on a roller coaster that only goes straight without any ups or downs.Though the cinematography was decent, it helped in preventing the movie from being boring. The acting was okay but nothing special. There were some jump scares due to loud sound effects. But overall, it lacked the thrill and terror you expect from a horror movie. That's why people watch horror films, to be scared. At least it wasn't as ridiculous as The Nun, where the monster gained powers in the end. 😅",
    "104": "Literally every single disturbing scene in the movie is in the trailer.I don't know what they were thinking when making this movie.The 1973 version is much better than this one.There was nothing new or entertaining.This movie wasn't scary.I don't know what more to say.The movie was incredibly long, yet there is no material worthy enough to fill it.The movie stinks.The movie is poo poo.I am trying to fill in the required characters for this review, and I am having difficulty...\nBut seriously, everything in the movie is in the trailer.Will directors ever create a scary movie ever again?",
    "105": "I don't hate David Gordon Green.With Halloween he took a low rent slasher film and turned it into a prestige horror by telling the story of Laurie Strode ostracized by her community through trauma being reclaimed by the same community as they work together to rid Haddonfield of a demented old man; Michael Myers.With Exorcist he took the granddaddy of prestige horror and also entered to importance of community in exorcizing demons from two girls. The community works until it doesn't when a choice is eventually made that severed the community, yet again. I anticipate the severance of community by the film's conclusion and its eventual reclamation is the thesis statement of the intended trilogy.This is not a James Wan conjurverse with Warren Avengers. It is asking a very bold question that criticism against the film underlines. How can a multicultural and diverse New society take down evil? I like the question.",
    "106": "To be honest guys... there isn't all too much to even say about this one. It is the day after viewing and I'm sitting here thinking \"well... what even was the story\" because there wasn't much of one to be had. This wasn't a BAD movie by any means, but I have to ask myself what was the point if you're not providing anything new, interesting, innovative or particularly scary. When the foundation of your spook factor is almost soley reliant on startling jump scares... I think that says something in and of itself.I thought that the beginning was solid and I was pleasantly surprised by the acting. The pacing was pretty slow throughout the entirety of the movie. It was also almost jarringly dramatic throughout, with over the top reactions and dialogue. The script was odd with lots of strange monologues that were meant to be poignant but ended up sounding... silly. Also, this is literally The Exorcist... and the exorcism is in the last 4th of the movie and that's it. It just felt like there were a lot of missed opportunities all around.Also, I know that the entire basis of this story revolves around religion and that's the whole point... and I've seen lots of exorcism plots in the past... but there was something about this one that felt particularly preachy which was kind of deterring.Again, this wasn't unentertaining per se, but because of certain variables such as lagging pacing, lack of story and not quite enough spook... this landed a bit under average for me. 4.5 rounding down to a 4. As far as recommendation goes, I'm indifferent.",
    "107": "I recently caught The Exorcist: Believer (2023) at the theater. The story follows two young girls who seek to communicate with the other side, with one of them longing to connect with their deceased mother. In the process, they inadvertently unleash something sinister on the other side. Their desperate parents are willing to go to great lengths to free their daughters from whatever malevolent force has taken control.Directed by David Gordon Green (Halloween Ends) and featuring a cast that includes Leslie Odom Jr. (One Night in Miami), Jennifer Nettles (Harriet), Ann Dowd (Hereditary), Ellen Burstyn (The Exorcist), Olivia O'Neill and Lidya Jewett (Hidden Figures).There's much to appreciate about this film. Personally, I'm always rooting for a single dad in a storyline, and this movie excels in setting up its characters and relationships. The sequences depicting possession and the mysteries surrounding them are well executed. I thoroughly enjoyed the entire setup of the film, and the possession scenes are top-notch, sprinkled with some worthwhile jump scares. While Ann Dowd's presence felt a bit excessive, and the concept of the ending was questionable, its execution was excellent. The special effects, particularly those involving demons/ghosts, flashbacks, and possession scenes, were nothing short of remarkable, earning a solid 10/10. The makeup, sets, props, and costumes were also impeccably done.In conclusion, The Exorcist: Believer serves as a commendable relaunch of the Exorcist franchise. With well-executed possession scenes and a compelling storyline, it's only a few minor hiccups away from being a gem. I would rate this a 7/10 and highly recommend it.",
    "108": "This was laughably bad.Like I was laughing out loud while watching this.It was beyond stupid.I am a huge fan of the original movie. It's a genuine masterpiece of cinema. The sequel was horrible and Exorcist 3 was a very surprising entry in the series that honestly never should've even been.The two shots at doing a prequel were a giant swing and a miss. So when I saw that the same hack who did those Halloween movies was making another soft reboot of an even more serious movie series, it was a big eye roll.The only redeeming thing I can say about this movie is I think the two girls actually did a good job at acting possessed. That's where the 1 star goes. Literally everything else was idiotic, nonsensical, over the top and convoluted.It's hard to imagine that there's going to be 2 more of these turds coming in the future lol.",
    "109": "\"God played a trick on you.\" Possessed Angela (Lidya Jewett)Exorcist: Believer, is directed by David Gordon Green, is a high-class production from its screenplay to its makeup to its thematic heft, with a story that skirts reality just a bit. And for us former Catholics, it verifies what we felt was true: The Devil is real and occasionally manifests by possessing vulnerable humans.Hence the need to exorcize Satan and have a horror flick at least half as persuasive as 1973's The Exorcist. Green relies minimally on tropes like jump scares and clueless parents to make a case for two 13-year-old girls who become possessed by the monster during a walk in the woods, setting parents and police on a frenetic hunt only to find them in a barn strangely detached and potty-mouthed. Beats me how they could tell the difference from regular teens anyway.Most striking is the relatively low-key delivery that allows the audience time to reflect on if they believe the possessions. Given how many bad guys now steer the world, believing in demonic possession should not be difficult.It's disappointing the filmmakers let a nurse perform the exorcism rather than a licensed religious exterminator. Such is the evolution from the iconic original where the Catholic Church was in charge (The Church wouldn't allow priests for the current possession, so what are parents to do but face down the devil on their own?).As well, when pregnant mom goes to Haiti and connects with a voodoo ritual over her unborn child, taking the Church out of the demonic equation seems disloyal to the original and plain stupid as a plot point. However, Exorcist: Believer is nothing if not measured and respectful of the faith necessary to combat evil.While the script doesn't deal with the religious and philosophical like the conflict between good and evil as the original did, it is successful horror cinema with enough of the formula intact and some surprising character development. In other words, it's an enjoyable evening of suspense and frights.",
    "110": "I am not going to say anything. Those who remember the impact of the Original, \"The Exorcist,\" and were disappointed in the sequels and prequels, are going to think this film isn't complete and may be disappointed until they realize this a first film in a Trilogy. Those who watch this with the expectations for the Trilogy, will think it's excellent. .This has to be understood as the first film in a Trilogy.Some people might by repelled because it tackles more than just shallow storytelling, it's more of a real wake-up call about the centrality of Religious belief and faith and the reality of suffering.On a deep level, it is a mirror of parental and marital hardships in everyone's world and the reality of good and evil.I really hope the negative reviewers take another look. Encourage the Trilogy. Viewers need to know there is a Trilogy on the way.Honestly, I too expected just another disappointing sequel. Boy, was I wrong!I should add, See it in IMAX if possible. It was mindblowing.",
    "111": "If you were expecting this to not be as good as the original, or if you were expecting it to try and lean heavy on the horror aspect, you'll think it failed. I viewed it (like most movies) with only the expectations of how well it is based on what it tried to accomplish. It wasn't as horrific as you might expect, but doesn't feel like it tried to be.There's a point in the movie that felt jarring as the possession goes from 0-100 in a very short period of time. Instead of seeing the possession slowly take hold, we get to know characters. Leslie Odom JR does a fine job of underplaying his role while being an interesting character to follow. Bringing back Chris MacNeil feels natural. Whether it's on purpose or not, restraining in the horror and having a lack of urgency, does prevent a higher rating, but it also elevates it above average mostly for coming off as seemingly not just trying to make a quick buck.As a stand-alone film, it's good. It would be tough to be anywhere close to as good as the original and I give it props for trying to do something slightly different. Depending on the upcoming sequel(s) this gets, it could be appreciated more as the first part of a series of films rather than its singularity scary-light offering. Don't expect the perfect original. Don't expect to scared. Do go with the flow of a movie about believing in something and finding a true faith in the decisions we make.",
    "112": "Every movie, especially, horror movies must have a good exposition to keep the audience on the edge of their seats in order to capture the scariest moment of the film at the right timing.However, \"The Exorcist\" overdoes it to the point where I get confused whether it is a horror movie or a religious documentary. It starts off by introducing the main characters in detail until it throws an obscure amount of information about christianity, exorcism, and rituals.I understand the movie tries its best to explain the cause of two cursed girls, but it becomes dull due to too many insignificant characters taking over the 1/3 of the screen time with religious talks.The two girls show a great performance through wicked body languages and distorted facial expressions along with added visual effects to fully demonize them, which gets overshadowed and delayed by the lack of visuals and slow tempo.It gets 6 out of 10 because of the stellar acting from the young actresses and the decent, but short climax. Such a wasted opportunity to impress the horror-movie fans for a 2-hour film during the Halloween period.",
    "113": "I went into the cinema with no expectations, as I've come to learn having expectations and said expectations not being delivered upon leads to disappointment. Whilst this sequel will never live up to the original it genuinely does have moments that are truly amazing. The first part of the film does a good job of setting up the backstory for the girls, whereas the latter half is where the scares and chaos begins. Whilst I had hoped for more scares, the film did a good job at leaving me creeped out. The film brings into question how far will one's beliefs take them? How far is a family member willing to go to get back the person that they love the most? It brings an element of surprise as the traditional way of performing an exorcism is not the only one used. Bringing back Ellen Burstyn whilst nostalgic felt like a cheap move that was done with the intention of having it replicate the likes of Halloween and Scream (both of which managed to replicate it immensely well). In conclusion the film was good, it had really amazing moments that could've been bettered (jump scares and a few more creepy moments) however it lingered a tad bit too long on moments that did not need this opportunity.",
    "114": "The endless wave of sequels, prequels, pre-sequels, remakes and reboots keeps hitting us with full force, and guess what...it still sucks.That certain film companies don't care about film anymore has been abundantly clear. For years now mainstream cinema is feeding off the creativity of franchises from 20, 30, 40 or even 90 damn years ago. It's a sad process and certainly one we should stop supporting with our money and time. It's just not worth it.When was the last time a remake or reboot did well? Alexandre Ajas \"The Hills Have Eyes\" from 2006? I certainly can't think of any other that actually added something to a franchise instead of just turning something great into something creatively bankrupt, bland and tasteless.I hope these movies keep failing but I've been hoping so for years now...\nUntil we don't demand originality we'll get the same kind of grey sludge over and over again.",
    "115": "As a HUGE horror fan, I went into this movie with an open mind hoping he would bring justice to this remake. Unfortunately it fell flat...face first. The first 30 minutes setup the movie great to be honest, it got me quite excited for the film to unfold, but when it did it just left me feeling irritated and borderline insulted. The acting by the two girls was good, and possibly great, but was completely drowned out by an absolutely terrible second and third act with really bad lines. Moreover, the connection between the kids and viewer was really lacking. By the time they were possessed and in full swing, I found myself not caring about them. That is an error on the writers and directors part.Ellen Burstyn should have never appeared in this film. No offense to her, but her acting felt really forced and completely ingenuine. It felt fake and robotic. It completely takes you out of the film.Part of the reason the original was so effective, was it didn't go for jump scares and allowed the viewer to connect the dots on their own while providing genuinely shocking imagery. For this film the shocking images were not shocking. They just felt unbelievably unoriginal and repetitive. They also feel the need to spell things out for the viewer as if we aren't smart enough to connect the dots on our own. Maybe that was intentional and this movie was meant for little kids, but it is absolutely not a movie for horror fans or adults.This movie felt like a full blown drama film and not even a good one at that. The \"horror scenes\" had so little tension building up to them it just felt so sudden and misplaced. Analogous to having 20 different directors who switched off between each cut scene to direct the next. Very odd pacing.The original exorcist allowed us to connect with both the mother and the daughter on a real level and it felt completely natural. Nothing in the original felt forced, while every scene in this remake felt like they were trying to force a false connection down our throats. The original did not focus on the religious aspect to such a strong degree while this one felt like a film that was trying to influence everyone to become a believer.. pun intended.My review is all over the place, just like this movie.",
    "116": "The Exorcist: Believer is a hugely frustrating film.Firstly, there is absolutely zero reason for this to be a 'The Exorcist' film. The links to the original are utterly pointless, and do nothing but bloat the runtime of the film with a feeble attempt at fan service that just ends up being fan disservice. Instead it should have been a completely independent and original exorcism film, giving it a bit more freedom to develop its own story.Secondly, even without the pointless links to the original, it doesn't really stand up as an exciting or engaging film. All of the familiar tropes are there, the usual story beats. There isn't really anything original to get stuck into here. This is a shame as I thought the cast was strong, and there was a good vibe and atmosphere to the film, as well as some creepy makeup and effects, but none of this was capitalised on to create a good film.The result is a bog standard exorcism film that at it's best is mildly entertaining, and at its worst is pretty boring.",
    "117": "No pun intended - the original Exorcist is 50 years old now - I know I can't believe it myself (wait another pun you say?). And yet it has not aged - the sheer amount of terror, the acting, the directing! It set new standards when it comes to horror - things that are hinted on here ... which you may like or find appalling I reckon (though would the latter be a bad thing?).David Gordon Green who had resurrected (sorry not sorry) the Halloween franchise (for some he ... ended it - again not sorry) got his fingers deep into this one. Another trilogy is planned - at least that is what I have heard. On the other hand the (mostly) negative reception of the movie might impact its box office which may lead to ... well no more movies! At least not in the foreseeable future! Exorcist will always be there looming - maybe a reboot? This being a sort of sequel to it.I noticed the very famous original score halfway through the movie. It might have been hidden or hinted at before - but when it kicks in ... everyone who knows the original will get goosebumps ... Which may lead most to remember how amazing it was and therefor not really liking the decent (imho) effort this is providing.There are some good scares in it, the special effects are good and we get double the possessions - in a matter of speaking but also literally. Callbacks to the first movie are there - sound wise as I have mentioned but also iconic moments (see my summary line) ... I have to re-watch the first one, but I remembered the actors from it, that also appear here.Pray for your soul - or whatever your belief system tells you to do in a situation like this. Enlightened is what I would call this (no pun intended once again) and not \"woke\" - which those using it would mean in a .. mean way. Not eye gouging, but not floating aimlessly either ... the kids are acting really good. Still most will be underwhelmed by the whole thing, especially if they have lost their faith ...",
    "118": "Set in Percy, Georgia, Victor Fielding (Leslie Odom Jr.) is a photographer and single father raising his 13 year old daughter Angela (Lidya Jewett) after having lost her mother in childbirth during their trip to Haiti during an earthquake. Angel and her friend Katherine West (Olivia Marcum) both disappear after having been last seen going into the woods with Victor and Katherine's parents Tony (Norbert Leo Butz) and Miranda (Jennifer Nettles) both enlisting the help of local authorities and the community to find them. Three days later the two reappear with no memory of the 72 hour timeframe and while initially thankful, the parents soon notice odd behaviors and personality changes in the girls that may be an indicator of an evil presence.The Exorcist: Believer is the fifth (or sixth if you count the two versions of Exorcist: The Beginning and Dominion as separate films) in the franchise that began with the original 1973 William Friedkin film written by William Peter Blatty based on his book of the same name. Development on the film began with current rights holders Morgan Creek who have taken to mining Ips from their archives. The rights to the series were eventually picked up by Universal for $400 million with the intention being to assign David Gordon Green and Danny McBride of the recent Halloween trilogy to produce a new trilogy. Given the spotty history of Exorcist follow-ups (with some decent entries like Exorcist III and the Shrader cut of Dominion and a surprisingly decent TV series) many have called attention to the exorbitant price tag attributed to the purchase which when taken into consideration with the saturation of exorcism films (including this year's The Pope's Exorcist) leaving many to question the wisdom in this decision. While I've become familiar enough with the tropes of exorcist films to come at them with a somewhat jaded outlook, I was cautiously optimistic as I did like Halloween 2018 and thought Halloween Ends took some bold (if not all that successful jumps). While Believer starts off reasonably strong, it quickly devolves into mediocrity and silliness that culminates in an ultimately bad film that's only marginally better than Exorcist: The Beginning.When the movie begins with the setup of Leslie Odom Jr.'s Victor Flemming and his daughter Angela played by Lidya Jewett, I honestly was intrigued by the setup enjoying the Haiti set prologue and this setup of Odom as a loving single father with both him and Jewett showcasing good chemistry. The opening act where we see the parents' and town's reaction to the girls' disappearance I thought was quite well done and the tension that comes to a head with the parents each backhandedly blaming each other I thought had a lot of thematic and dramatic weight. Once we get to the more overt sequences of demonic possession (including a church scene that tries to be shocking but ends up unintentionally funny) we begin to see cracks form in the foundation. Things only get more convoluted as the movie feels overstuffed with characters including former nun turned Nurse Ann Brooks (Ann Dowd) who has a history with Victor and Angela that isn't adequately explained and we also have priest Father Maddox (E. J. Bonilla) who has only slightly more characterization than the infamous Father Morning from Exorcist III. Outside of the crowded field of characters, the movie goes through the exact same motions you know of from every other exorcism movie you've forgotten about complete with the swearing, the bleeding, and every other tired trope of this subgenre with barely any twist on them (aside from there being two possessed girls now). But easily the biggest misstep comes from the movie's stance on women's reproduction which intentional or not says the mother's life is irrelevant in the case of a pregnancy and sees a tasteless element of backstory given to a character which is then thrown at that character during the climax.People have their problems with Exorcist II: The Heretic, but regardless of the outcome that ultimately was that film, at least it tried something different and was made watchable by John Boorman's ambitious if misguided take on the material. The Exorcist: Believer isn't an incomprehensible mess like Exorcist: The Beginning was making it marginally better, but where The Beginning was merely stupid, Believer was more offensive to me both in terms of its lacking entertainment value and it's commentary on issues it has no business commenting on.",
    "119": "The Exorcist Believer surprised me in a good way.Being a fan of Friedkin's film, The Exorcist III and the Fox series, I went to the cinema with low expectations due to the number of negative reviews floating around the internet; but I must admit that I had several pleasant surprises in terms of the unexpected plot twists and the number of winks and references that inevitably refer to the Exorcist by W. F.Of course it has its weak points, such as the way in which the director seeks the connection with part of the original plot.My advice: do not compare both films, they are totally different contexts and times (which Gordon captures quite well). This film should be seen for what it is: a small sample of our current society that remains eclectic and with the intention of opening up to new horizons.",
    "120": "The Exorcist: Believer: As in the original the opening scenes of Believer involves dogs fighting. There are no immediate hints on Demons on a Haiti beach in 2010 but heavily pregnant Sorenne (Tracey Graves) who is on her honeymoon is blessed by a Voodoo priestess. Shortly afterwards Sorenne is seriously injured in an earthquake and her husband Victor (Leslie Odom Jr.) must make a choice. 2023, Victor is living with his daughter Angela (Lidya Jewett) in Georgia. Angela along with her friend Katherine (Olivia Marcum) go into the woods to practice a ceremony to contact the long dead Sorenne. The girls disappear and after a frantic search they are found three days later, hiding in a barn. They think only three hours have passed. The girls start acting strangely and it is soon obvious to their ex-Nun, nurse neighbor Ann (Ann Dowd) that they are possessed. Eventually Chris MacNeill (Ellen Burstyn) the mother of Reagan from The Exorcist is contacted, she has become a world wide authority on exorcisms.The possession scenes here are quite convincing with burns and scars appearing on the girls' flesh, strange voices, the Demon having knowledge about others, levitation, vomiting, poltergeist effects. We've seen all of this before but it's skillfully presented here and doesn't seem jaded. The Exorcism team this time around has an exotic composition. The two girls put in tremendous performances. But nevertheless the familiarity of the whole thing perhaps prevents this from being a classic. As Chris MacNeill says when speaking to the Demon in one of the girls: We've met before. Maybe too many screenwriters were involved. Still, it's well, worth watching and even has a couple of jump scares, plot twists and surprises. Directed by David Gordon Green, who co-wrote the screenplay with Peter Sattler from a story by Scott Teems, Danny McBride, and Green. 7.5/10.",
    "121": "I went into this film expecting nothing, I mean just ponder all the possession films that the original inspired: none quite as unsettling as the original 1973 horror classic. This movie had much potential but .....expectation in check--- I still wanted something more compelling -- from this Religious horror film genre piece . I was holding on to some hope because director David Gordon Green Halloween Kills (2021) was really well done (lots of gore and dread) . What the director does do well is make a good film about missing girls. Its first hour has the right tone. I do think anyone interested in this movie should see and make their own analysis because I almost did not go to the cinema when I saw the first reviews come in . I do not think you boys will hate The Exorcist : Believer it does have a few good elements.Now I have read a few reviews from the general populous there are quite a few how really enjoyed the Exorcist: Believer. I will say that the acting was quite good but still even with Ellen Burstyn: Reprising her role as Chris MacNeil, Regan's mother she was totally under utilized in her role a real missed opportunity. Now there is a welcome cameo at near the end of the film , so there is that but I would liked to have seen more. Hopefully as there are two more Exorcist films in the pipeline we will see more of the original cast !But to many characters and not enough development I did not really have an emotional connection to any of them.Now the religious aspect was all over the map. We have African Americans who mix Christianity with Vodoo, \"born-again or evangelical Christians\" , Protestants. The writers clearly don't like Catholicism. The first official rite of exorcism was sanctioned by the Catholic Church. Exorcisms have an ancient history and the film losses its profundity down playing the Catholic aspect of the film IMO.Look I am probably being to hard on this movie because it really does not sink; it is just missing the soul of the original. The Exorcist used practical special effects created by William Friedkin and his team. They used low-tech methods to create the effects without the help of CGI. 1973 version has some of the best make-up and sound effects ever created in a religious horror film . The Special Effects in The Exorcist Were Amazing . That is not the case here 2023 \"Believer\" is nowhere near as intense and deeply felt as William Friedkin's genre-defining horror. 6/10.I saw a social media post today stating that Burstyn's character states that she thinks that she wasn't allowed to witness her daughter's exorcism in the original movie was because of the patriarchy.Yes, and that line delivered in the new film rubbed me the wrong way too. It was added as the writers clear dislike of Catholics. I takes away from the new film and is detrimental to one of the greatest horror films and one of the greatest American films in cinema history The Exorcist 1973 . If you are a horror aficionado like many on this forum little things like this are noticeable for sure . I did not appraise this dialogue and I do not think this was William Peter Blatty intent either. The intense evil that Pazuzu possesses and Father Lankester Merrin priest in The Exorcist. He is an Irish Catholic priest and exorcist who has many encounters with the demon Pazuzu . He knows the evil and wanted to shield Burstyn's character from witnessing the evil atrocities during the 1973 film depiction of The Exorcist .The film's greatest injustice, though, is its misuse of Burstyn's Chris, who is brought on to help Victor make sense of what is happening to Angela. Burstyn tries her best with the crapshoot that is the script, whose greatest sacrilegious offence comes when Victor asks Chris about the particulars of exorcism. Chris says she didn't really witness Regan's exorcism, that she wasn't \"allowed\" into the room because she \"wasn't a part of the patriarchy\" - a statement so categorically false and not at all the mic drop the film thinks it is.I wonder whether any of this film's creators even watched Friedkin's film; whether they realized that the first two acts of The Exorcist depict Chris doing everything in her power to help her beloved daughter, who increasingly becomes lost to a grotesque and horrific entity. For much of the film, Chris painstakingly cares for Regan, even as the demon Pazuzu hurls vitriol and violence her way.In the book, Father Karras tells Chris to keep away from Regan as often as she can: \"The more you're exposed to her present behaviour, the greater the chance of some permanent damage being done to your feelings about her. Stay clear.\" Chris tries to help Father Merrin and Father Karras during the exorcism many times and is frequently physically present in the room. But the demon assails her with wretched accusations and the horrifying contortions of her daughter's body. Chris repeatedly says she can't witness anymore, but knows she must so that Regan might be safe. Because of the confines of film, it is understandable, through no stretch of logic, that Blatty might have glossed over certain aspects of these scenes.Nevertheless, in The Exorcist, Burstyn is still spellbinding as she runs to Regan with her face wrenched with pain, love and fear, even as Regan hits her and repeatedly pushes her away. Chris has spent so much time with Regan by the point of the exorcism that the moments she gets to herself when Father Merrin shows up seem a near grace allowed to her by Friedkin and Blatty - evidenced by the tired smile that hangs on her lips after she asks Father Merrin whether he wants some brandy in his coffee, and he accepts.For Believer, all this seems much too complex to fathom. That the film has the gall to say that \"patriarchy\" kept Chris from witnessing the exorcism illustrates its deep misunderstanding not just of the source material, but also of what it means to be human, to love, to want to care for a child even as the child lashes out against you.It's sadly appropriate for a film that knows it will make a lot of money for the simple fact that it can claim lineage to one of the greatest horror films ever made. It's not surprising that Green perfunctorily stamps flashy, trending words throughout the film's hollow, soulless script - the IP mined to hell and back. The film seems written with the dictum to \"girlboss-ify exorcisms,\" something that last year's Prey for the Devil attempted with at least a modicum of ingenuity, honesty and originality. Believer, in contrast, is truly decrepit.",
    "122": "The Exorcist: Believer is an exhausting affair, an unrelenting film that attempts to cover up its lack of shock and suspense with a kind of cinematic bludgeoning: a battering delivered via smash cuts, jump scares, overlapping sound design and chaotic camerawork. Far too much of this movie is a replay of scenes and plot elements that Friedkin's film did better, and without CGI. The anticipated head-spinning and pea-soup vomit were far more effective with practical effects.Far from converting viewers, this merely cashes in on their backward-looking nostalgia, without moving forward to anything better, or even half as good. Unlike Green's Halloween trilogy, which served up diminishing returns with each new installment, Believer condenses that downward trajectory into the first chapter. The acting of all the cast felt cringe, except both the kids, who actually did a good job. The dialogues were boring and there were less to no jump scares.My Rating : 4/10.",
    "123": "Rumors around this movie implied that it would be a worthy and equally terrifying sequel, or even revival of the iconic first movie. Well, it's definitely not. The only things that link it to the first Exorcist are Ellen Burstyn, who has a rather ungrateful and short-lived part, and Linda Blair who shows her face for one nano-second in the epilogue scene of the movie. For the rest it's just like the other by now zillion exorcism-movies, that for some reason keep popping up every year around (titled unoriginally \"The exorcism of...\" and then you can fill in some name). It's like a demonic curse in itself!Almost everything in this exorcism flick is cliché and has been done a thousand times before (and better!). Only the prologue is well done and seriously intense, but after that the pace totally sags, taking like an hour of preliminary building-up of the tension before the real action kicks in, with endless talking (especially in exulted religious ways). The possessed girls sure have a scary appearance, but besides drooling black sludge, and some grunted swearing and foul-mouthing, they do hardly any horrifying stuff. The pivotal exorcism itself is chaotic, and so low on serious scares and events that it even became tedious.As in every exorcism-movie the end is as can be expected, with in this case a tiny cynical edge, but this is quickly compensated by the afore mentioned appearance of Regan (Linda Blair) as some bonus God's miracle. Speaking of God, that's what in this movie is abundantly the case: God as the ultimate savior is so much mentioned, that it made me wonder if there might be a missionary agenda with this production.In short: a disappointing superfluous exorcism-clone.",
    "124": "When it was announced that David Gordon Green and Blumhouse were going to do a sequel to The Exorcist I was cautiously optimistic. After all, Green had done a good job reviving the Halloween franchise. Halloween 2018 was a solid sequel to Halloween and I liked Halloween Kills. Halloween Ends is another story. The Exorcist is the greatest horror film ever made in my opinion. It's greatness lies in that even though it's in the horror slgebre it was very much an intense drama with mother witnessing the horrific possession and exorcism of her daughter. It was a film about the loss and regaining of faith. Yes, it did have intense horror elements that gave now turned into tropes that horror films gave copied now for decades, but it stands as a horror masterpiece. The sequels to The Exorcists had been mostly pathetic. The only one that is solid is The Exorcist III. But the rest, especially Exorcist III: The Heretic which is one of the worst films ever let alone a bad sequel. It would not take a lot fir The Exorcist: Believer to improve on the other sequels. Even though this new film is not the embarrassment that The Heretic is, it's very mediocre. It is really only a sequel in name. And the connection to the original film feel tacked on and are not even necessary to this film.The film dies start off with a decent setup. It focuses on a widowed father and his relationship with his daughter. He lost his wife and was left to raise his daughter and is very protective of her. There is another girl who we barely get to know and her story is given much less attention. Her parents are protraid as living bit are not given much to do. The girls are friends. They go off to the woods to perform a ceremony because one of the girls wants to contact her dead mother. The girls disappear. The scenes where the girls are missing and their parents look fir them are done fairly well but the performances are not as involving as they should be. Victor, the father of Angela is played by Leslie Odom Jr. In a performance that is not a bad one but I never felt for him. The parents are also given hardly anything to do. They are church going people, but the film doesn't flesh them out at all. Again, u didn't care fir these characters.The worst part of this film is the blatant tacking on of a character from the original film to connect these events to the ones in first film. Ellen Burstyn comes back as Chris MacNeil. The mother of the girl Regan that was possessed decades earlier. The trailer fir this film made it seems like Chris was going to be a bigger part of this film be she's not. It's really just a cameo that is completely unnecessary to this new film. Ellen Burstyn looks uncomfortable in her role, like she didn't even want to be there. There are other ancillary characters that just seem to be there to pad running time. We don't really care fir any of them.When we finally get to the exorcism of the girls it the film gets even worse. I get that horror films have done this so many times that it would be almost impossible to create anything original or disturbing but this film's exorcism scene ranges from average to actually unintentionally funny. There is a sort of religious rage team element that is just terrible. The original film took the situation seriously, that is whyy it worked and was so harrowing. This film doesn't, it is just an excuse for loud voices and special effects. No impact whatsoever. The whole film feels like it's just another one of the countless copies of the film that this is a sequel to. And there is a short moment in this film so unearned and tacked on that I was angry about it.The story could have been interesting if the script would have been more interested in having us care about the characters than just being a setup for an exorcism that has no tension or sense of dread or intensity. The film is technically well made and shot but has not even an ounce of the feeling of the original. This film is no better as the countless other films that incessantly copied the original and didn't come close to being even in the same league.A really bad film.Grade: F.",
    "125": "Deplorable acting, deplorable storyline. Predictable jump scares and ridiculous commentary. You can easily tell what is going to come next because we've all seen it before in horror films from the past 20 years.I don't know why they decided to reboot this franchise. It really is just trying to make some money off the good name from the original. This has got to be, without doubt, one of the worst reboots of a franchise that you could ever come across.The story is of two possessed children, and one of them makes it out of the possession. Then, all of a sudden we are taken to a time when Reagan is reunited with her mother Chris McNeil. And thats it.I don't know how this past Hollywood directors control, because every single scene is a close-up and we're left trying to observe what's going on in the background. Deplorable.",
    "126": "A lot of bad critique is levtitating (pun intended) around this film: bad script, bad acting, too many unfolded subplots, too few scary scenes etc etc.Well, if you compare it straight off with The Exorcist - 1973, you won't get any arguments from me. But doing that is just silly. It has been 50 years since the first one, that is half a century. The 1973 film was from another time with diffrent values, different world, different schools concerning directing, acting, actors were different. Things change and it is impossible to recreate something that was made 50 yeras ago.Some complain about the movie not bringing anything new, well, that's true for the film as a whole, but exorcist movies outside this franchise after 1990 does not bring anyhting new to the genre either. There are new, small bits and pieces in many of all the exorcist movies ever made up to date.However, one piece of critique is correct: the film fails to create tension and mysticsim. But, on the other hand, no one can argue that Fellowship of the ring: the two towers creates the same feelings as the first one did either, because you know from the first film what to expect from the second. But that trilogy is outstandig when it comes to quality filmmaking.The right question, which some reviewers ask, is: was this film necessary? Is a trilogy necessary? The answer is \"no\" and \"absolutely not\". Tons of exorcist movies have been made since 1973, as well as a tv series connected to the Exorcist franchise, so I do not think it is necessary to make a another sequel, even less a trilogy.I love the genre and this franchise nontheless, which is why I give it 7/10, but to be objective it lacks in mystery and horror. So I agree with the rating 5/10 (28 of October 2023), the film is just too flat. That being said, if the plan is/was to make 2 more films we must be more patient and forgiving. However, the film does not stand out in comparison to other horror films, but the production values are good, the movie is well made, but lacks depth and suspense.I'd say it is on par with Deliver us from evil (2014) and the Pope's exorcist (2023), less good than the Exorcism of Emily Rose (2005).Do watch the Exorcism of God (2021), a great film that went under the radar.",
    "127": "I saw The Exorcist: Believer the day it opened, and, as a longtime devotee of the original, I worried it would be disappointing but still hung onto some hope that it would be OK. Sadly, I was thoroughly disappointed. This movie felt like someone arguing frantically for two hours that \"movies are supposed to be entertainment\" as a way of drowning out their conscience telling them (accurately) that they have, in fact, made a crap movie. Obvious and pointless jump-scares, amateurishly written soliloquies about good v. Evil, uninspired and thus desperate-feeling callbacks to the original, attempts at pulling your heartstrings by hands that evidently don't know where the human heart is located in the body - yes, this film has it all, and it's all dumb.I do applaud David Gordon Green's decision to make a direct sequel instead of attempting a reboot (or, far worse, a \"reimagining\"), but in so doing he made a big mistake: he pandered. Movies like this feel for all the world as if the filmmakers - instead of you know, doing some actual writing and working hard on the story and script - gather everything they think you love about the original and modern horror in general and cram it all in at twice the volume and one-tenth the quality. That's pandering. It's like a barter-system version of someone pleading with you to please love them.My suggestion: skip the overpriced cinema ticket and just re-watch the original Exorcist, which is still terrifying 50+ years on, followed immediately by Exorcist III, which has somehow gotten worthier over the years.",
    "128": "Yes, I give it a passing grade, although I'm biased about another Exorcist movie, because I love the first one which I saw when I was a little kid, so of course I was going to love the cameos and even the the music, and I want more.This one is flawed, and here is why...\nOf course it's not even close to the original and trying to compare it's impossible. Specially when there's hundreds of rips offs since 1973. This one is no exception.I agree with the reviews that point out, how slow and boring could be at times... and yes, it drags to the point of wishing it was over sooner. Specially because the jump scares are so loud that triggered my migraines.I liked the fact that there are not obvious CGI effects and it feels generic. The creep factor is carbon copied from the first one, but it doesn't add anything new or daring.The girls are incredible and they deliver very well.There's no climax nor a punch at the end.It's not a spoiler, when, even in this page Linda Blair is listed as part of the cast. But honestly, I don't really care for a continuation, and there's going to be 3?...why?.",
    "129": "OMG this movie has nothing of the atmosphere of the original one, plus there's so much talk and uninspired music all the time, and disney-sh characters which of course must be all of different ethnicity, likewise there must be two girls, black and white obviously, and so on, you get the point. It would have been something you expect from a cheap Netflix production,definitely not for the big screen.All this rumor and marketing for such a mediocre film? Bah... Don't even bother.Watch the first one, or The Exorcism of Emily Rose if you feel like a good exorcism movie.Didn't walk out earlier as I was hoping in some interesting turn, but no... Boredom fest till the very end.Save your money and time.",
    "130": "Whoever you are and wherever you are, if you hold the rights to any known horror properties you must, for the sake of all humankind, lock away the keys and under no circumstances give them to David Gordon Green.Having unleashed a hellish parade of dwindling Halloween features that culminated in the disastrously bad 2022 effort Halloween Ends, Green has somehow managed to find himself leading another new entry into an iconic horror franchise with the Blumhouse backed The Exorcist: Believer, the first new instalment of Universal Pictures newly acquired Exorcist property that reportedly cost the company $400 million to secure.Making his three modern day Halloween films appear to be genre masterpieces, nothing could prepare one for just how terrible and irredeemably bad Believer is, a film that will turn even the most faith filled of horror/film fans into naysayers and make one wonder how on earth the man responsible for indie darlings such as Joe or Prince Avalanche as well as cult TV shows such as Righteous Gemstones, Vice Principals or Eastbound and Down could be capable of delivering such a frighteningly poor feature such as this.Easily one of the least scary or unnerving so called \"horrors\" you're ever likely to come across, Believer is a sad and sorry name-bearer of author William Peter Blatty's original source material and William Friedkin's 1973 classic film with audiences most likely to be left wondering if they are even watching the right film for the opening 30 - 40 minutes as Leslie Odom Jr's Victor Fielding's young daughter Angela and her friend Angela go missing, becoming the least of Victor's worries when the children return far unlike they were previously.Making little if any sense, failing to justify its logic in a narrative scope, unable to produce a single likeable or interesting character and genuinely finding itself incapable of gifting us anything in the way of suspense, thrills or chills, Believer is one of those truly rare products that fails to fire on every front, making it a film that is bereft of any redeemable qualities to suggest anyone should submit themselves to such a tortuous viewing experience.No one is shying away from the fact that in reality we've only ever had one unquestionably good Exorcist branded film, but Believer makes the likes of the oft-mocked and derided Exorcist: The Beginning from 2004 or 1977's Exorcist II: The Heretic seem like The Godfather's of the series with there not any so bad their good moments popping up in a tale that acts as one of the most glaringly obvious wastes of talent, time and money witnessed in some time.If there was one singular, horrifyingly shocking element to come from Believer making its way into the world its in the fact that this $30 million dollar budgeted film managed to scrape out over $100 million dollars of hard earned money from viewers worldwide, ensuring that Green has been signed to do it all again with the proposed 2025 The Exorcist: Deceiver, a prospect that will make one wish for the same unfortunate outcome and criminal use of screen legend Ellen Burstyn return here as the returning Chris MacNeil.Final Say -The Exorcist: Believer really is one of the worst feature films I've seen in the modern era. A terribly misguided and lifeless experience from a director who has previously shown so much more energy and creativity, this crime against cinema should be committed to the fiery pits of movie purgatory never to see the light of day again.0 sore necks out of 5.Jordan and Eddie (The Movie Guys)",
    "131": "While I don't really believe myself to have much or any sort of qualification to write a review for Exorcist as I am not a fan or have ever watched the films. I figured I'd still write something to share my thoughts on this recent addition to the Exorcist franchise.So I'll start by saying for the first time in my life I watched The Exorcist in fact I literally finished that movie one hour before my showing for Believer and though that movie didn't blow me away I knew to keep my expectations very low for this sequel, and I have to say I'm glad I did.Because of how low my expectations were I actually am surprised to say that this film was not as bad as I anticipated. Now I'm not saying this movie was good, far from it, but genuinely wasn't the trash that my friend and I were anticipating it to be.Being fully aware and familiar with David Greens work and the work of his fellow writers on the debacle and destruction of the recent Halloween trilogy, I knew exactly what to expect. But what caught my friend and I off guard was the surprisingly competent first act. The set up, and the establishing of these new characters was actually well done. I was so surprised I asked myself, \"Am I actually enjoying this right now?\" But alas that feeling was short-lived as it all went away in the second and third acts.Immediately as the second act started, we were treated to bad cuts, cringe to laughable dialogue, and even worse, the handling of a legacy character. Again, I am no fan of the Exorcist franchise, as I mentioned before, but I have seen the poor handling off legacy characters in beloved franchises enough to know how bad they handled Chris MacNeil in this film. There was literally no point in bringing her back to do what they did to her. They did to her as they did to Laurie Strode in Halloween Kills. If you've seen the film you know what I mean.The films conclusion was ok, I guess. It had an interesting revelation unfortunately, though, the outcome didn't carry any emotional weight because you don't care too much for the characters as any sort of character development was immediately dumped after the first act.Overall, though, while I can't consider myself to be disappointed, I genuinely believe and understand why Exorcist fans would be because it's a very rushed and poorly executed sequel. For me, however, because of that surprisingly competent first act, solid performances from the cast, and the fun from the sheer stupidity this film provided, I am slightly inclined to be generous with my score.PS. But in all seriousness, though, no one needs to see this mess, and if you are an Exorcist fan, I'm almost 100% sure you'd be disappointed.IMDb: 4/10\nLetterboxd: 2/5Watched in Theaters.",
    "132": "Well, here's strike number three for David Gordon Green. Stop handing him all these iconic horror franchises only to ruin their legacy. I don't necessarily think he's a bad filmmaker. He just needs to work with a better team of writers - no Scott Teems or Danny Mcbride, please. As a sequel, this just doesn't deliver. The original film is a pop-culture phenomenon, having tackled the story from crime, psychological, and spiritual angles. Here, we jump straight to the spiritual side of things, without much going for it.I'm guessing the major chunk of the film's $30 million budget went into the Haiti earthquake scenes, which was reasonably well-staged. However, the CG work in the actual exorcism scenes was pretty awful. The scares are all heavily edited (and intercut with horrendous imagery), and feature a mix of practical effects and CG, including the famous head-spin from the original. While I appreciate the makers bringing back Chris Macneil (Ellen Burstyn), she wasn't exactly a \"girlboss\" like Laurie Strode to begin with, and therefore, her presence doesn't add much from a storytelling standpoint.I think the greatest undoing for The Exorcist: Believer is the fact that way too many possession/exorcism flicks have come out in the last 50 years. There isn't much to make this one stand out, be it from the perspectives of plot, performance, or scares. Yeah, the performances here are strictly okay, and you'll forget them almost immediately once the credits start to roll. On the bright side, even if it was just for a few seconds, Regan (Linda Blair) showing up offered a wonderful moment. I'm not really looking forward to a sequel.Sorry, Mr. Friedkin!",
    "133": "I should have trusted the 22% on rotten tomatoes. I went in fully knowing this number but I ignored it because sometimes they get it right and sometimes they get it wrong. This time they were right. This movie was garbage.It was so bad I fell asleep.I went with my friend and he too thought it was trash.One main problem is that the writing was dumb. Nothing made sense.Don't know what else to write. There is a minimum of 600-characters to post a review. I wanted my voice to be heard. This was a terribly written and hugely disappointing movie, but I went in with very low expectations but this did not even meet my very low expectations.",
    "134": "To be honest, the trailer had a lot more to offer than the movie itself.Don't waste your time over this, it's totally not worth it.I couldn't find the acting realistic, the scares were too damn predictable.The movie started of nicely but that's only the first 15 min of the movie !Overacting by some of the characters was just too much too handle.Movies these days are still dependant on those all tactics of horror making, whereas there is a lot more to offer! Watch When evil lurks in instead! And you will thank me later!There are a lot more movies in 2023 who were far better than this one.",
    "135": "\"The Exorcist Believer\" attempts to capitalize on the legacy of the iconic original but ultimately succumbs to a myriad of shortcomings. One of the film's glaring issues lies in its feeble attempt at generating genuine horror. The scares felt formulaic and predictable, relying on clichéd tropes that failed to evoke the spine-chilling atmosphere that made the original a masterpiece.The acting, unfortunately, did little to salvage the film. Performances were lackluster and lacked the depth needed to make the characters compelling. It seemed as though the cast struggled to connect with the material, resulting in a disconnect that permeated throughout the entire movie. The absence of a strong emotional anchor left viewers indifferent to the characters' fates, a stark contrast to the emotional investment the original effortlessly achieved.Furthermore, the storyline appeared to be a weak imitation of the original's intricate and thought-provoking narrative. Instead of building on the psychological and theological complexities that defined \"The Exorcist,\" \"The Exorcist Believer\" opted for a simplistic approach that failed to engage or challenge the audience. The absence of a compelling narrative arc left the film feeling hollow and lacking the depth necessary for a horror movie to leave a lasting impact.Perhaps the most disheartening aspect of \"The Exorcist Believer\" is its status as a mockery to the original. The film not only failed to pay homage to its predecessor but also tarnished the legacy of one of the greatest horror films in cinematic history. The attempt to capitalize on the success of \"The Exorcist\" without bringing anything new or substantial to the table resulted in a lackluster production that pales in comparison to the original's groundbreaking achievements.",
    "136": "Just saw 'Exorcist: Beilever' at Village Cinema at Crown Casino,I watched the original film (The Version You've Never Seen) the night before as a refresher.I feel the movie could have been a lot worse and was better than expected.Likes:\nVisual callbacks to the original, this makes it feel part of the same universe, but unfortunately too much time has passed (it's been 50 years since the original!).Makeup and gore effects were amazing and very well doneSubtle Demon effects, I don't think it's the same entity from the original film but maybe part of the same family - a distant relative.The return of Ellen Burstyn is excellent and exactly what the series needs to get back on track, unfortunately her role is quite small and not used to her full potential, she is an awesome actress.The acting of the two possessed girls was incredible, the scene at the Church in particular was very well done - very eerie, scary and then turning 180 degrees during sad and tragic moments.Dislikes:\nI feel the writers have missed the point of the original and are just trying to make it a bigger and louder film about a possessed girl (instead of one girl possessed we have two girls being possessed).The original film is very tense, suspenseful and used subtleties to enhance the mood and overall feeling of dread, to the point where it is absolutely terrifying. You can have two characters just talking and it was terrifying because you knew something very scary was coming in the next scene.My main issue is that this movie tries to overly explain everything and release the tension too early. A mystery is much more frightening and keeps the tension.The trailers showed way too much and spoiled some of the major scenes and plot points - there wasn't much left to watch!Ellen Burstyn's role was too small and feels like a gimmick (I hope she was paid well for coming back into the role).Too much CGI in the final showdown, CGI is not scary and it takes you out of the experience very quickly, keep it practical and in camera for more realismIm not sure if I'll watch this movie again, but I will watch the next two films as I am curious where the story goes from here.",
    "137": "After one of the most shocking events in American history - last year's release of \"Halloween Ends\" - I had below rock bottom expectations for the David Gordon Green directed \"The Exorcist: Believer.\" Also directed by Green, as I sat down to watch this film with nary an alcoholic beverage to be seen, I found myself tempted to walk out and leave the theatre as soon as the movie started to save myself the agony I believed I would be subjected to. Alas, against my perhaps better judgement, I decided to stay and watch the film to its completion. And you know what? I'm glad I did. Because \"The Exorcist: Believer\" is actually a good time at the movies.\"The Exorcist: Believer\" is getting demolished by critics, and on one hand, I kind of understand why. Because, you see, exorcism movies, by nature, are cheesy and ridiculous - and this movie is no different. No matter your individual religious beliefs or lack thereof, almost every exorcism movie is filled with the exact same tropes and cliches; and \"The Exorcist: Believer\" has those tropes and cliches, and has them in full. From the supernatural perspective, there really isn't anything unique here except that - for some reason - the supernatural elements are miraculously downplayed to an almost astonishing degree. So what then, you may find yourself asking, does the film focus on? The answer is: the drama.Where this movie differs from other supernatural horror films is that it decides to first and foremost focus on the horror of what happens when children go missing, and on the horror of what happens when they return. It's an interesting spin on an exorcism movie, as the first 45 minutes or so are decidedly not supernatural. More \"Prisoners\" than \"The Exorcist,\" I found myself enthralled in the all too relatable struggle of a parent feeling helpless in the wake of their child's disappearance. That scenario is scary in and of itself - but when the kids finally return is when the true horror begins, and I'll be honest - this movie scared me.As I get older, I find myself becoming more afraid of horror films, so keep that in mind as I continue my review; that said, I do have to say that \"The Exorcist: Believer\" had some absolutely immaculate jump scares that had me recoiling and covering my face in terror - and the last movie to do that to me was one of the \"Insidious\" sequels. As I mentioned, this movie doesn't really have anything that you haven't seen before, but that didn't stop me from getting immersed in the fear that the film is trying to convey. I'm not sure why, but it worked for me, as subdued and restrained as it was when compared to other movies in this same genre. And plus, I really think the ending of this swayed my opinion more to the positive side, as the ending shocked me in the best way possible.I always say that the best horror films are dramas, and \"The Exorcist: Believer\" is a drama first and a horror second, and it's all the better for it. I'm not going to lie and tell you this is the scariest movie of the year, and in fact, the person who I saw this movie with didn't like it at all, but I still found a lot to enjoy here, and was pleasantly surprised that David Gordon Green was able to restrain himself and offer a film that is more of a serious dramatic piece and less of a cheesy horror picture.",
    "138": "This is one of those movies that showed glimmers of promise at the beginning, but lacked the courage and the energy to realize its own potential. It was as if a good movie became possessed about halfway through by a bad one, and just got buried beneath a mountain of boring tropes.The set up is fairly strong: two children vanish after wandering into the woods after school. After a multi-day manhunt they are found with zero concept of how long they've been gone, and as the usual signs of creepy kid syndrome start to possess the both of them, it becomes clear that their retrograde amnesia during the missing days involves the supernatural. Enter Chris Macneill, played again by Ellen Burstyn, and now a self-taught expert on exorcism following the events of the first film, who is sought out to investigate.Unfortunately, at that point it becomes abruptly apparent that the movie doesn't know what to do with its intriguing set-up. The movie chooses not to explore or explain the missing days further, leaving it to the audience to infer from context what likely happened, and unbelievably Chris Macneill contributes nothing to the plot outside of a wink at the audience.The second half of the movie spirals into cliched incomprehension, so disconnected from the first half that you get the sense of two separate scripts, leagues apart in quality, having been mashed together. The single stand out quality are the child actresses, who show a unique boldness in their performances deserving of a much better movie.The filmmakers to their credit attempt to explore the themes of exorcism across a multitude of faiths (hence the subtitle \"Believer\"), how fear itself can lead to evil acts and the consequences of that, and try to inject some originally into the second half by switching up the methods of exorcism. Sadly, exploration of these themes are not properly balanced or explored, and the audience is instead left with a jumbled mess that shows only hints of the much richer movie it could have been.The movie is five stars, the performance of the children gets a star, for a total of six.",
    "139": "The Exorcist: Believer is a sequel only because of Ellen Burstyn. Without Chris McNeil's character having a small role in the film, it is just another film about possession with an exorcism at the end. The film does not explore demonic possession further or offer contemporary societal views on possession or even capture the suffering and fear of the superior original. Producers are masters of finding cash cow opportunities.Believer is mild and watered down compared to its predecessor. The process of possession is almost instantaneous. The 13-year old's go missing in the woods, they return, they behave abnormally in one or two scenes, and then they're thoroughly possessed.Much the same as the two family's response to their children's metamorphosis. I thought the parents grieving and terror was very one dimensional, both in the way of acting and the script. One parent declared quite early that she thought her daughter was possessed of an \"unclean spirit\", I think were the exact words. Alrighty then, better find Chris McNeil, some random Priest, along with a few other spiritual healers, and move straight on to the exorcism scene. There was very little in the way of any medical or psychiatric intervention.The film would have been a decent film on its own without being part of the Exorcist franchise. Other than Burstyn and the surprise, was anyone else involved from the original movie to justify this movie being part of The Exorcist universe?Fear Factor: I jumped once. I was not in suspense often. The violence was mild. I didn't get the impression many of the characters felt fear or sadness. It felt more like they had a problem to solve and there wasn't time to grieve or feel much distress.Had this film been a movie in its own right- without borrowing from one of horror history's greatest, the creators would have earned more of my respect. The opening sequence was solid and provides an apt little twist during the exorcism scene. The girls acting was believable. The initial medical response and police involvement was appropriate. All of these elements are fine for a movie that's not a sequel to The Exorcist. Make the process of possession more nuanced and longer - with more suspense and family development - skip over Chris McNeil, develop an actual character to be the Preist rather than a paper-thin cardboard cutout, and tac on that exorcism scene to finish of the film - done. You'll have a pretty solid film without the criticism and comparison to the original.There are some crafty offerings from the director and novel pockets of fun to make this film okay, but instead it attaches itself to an all-time classic for a big payday. I think Green has done better work here than with Halloween. They were complete trash.",
    "140": "It's not half as bad as what some people would want you to believe.The pacing is fine, it builds the story up however it is one of those films that avoid putting the demon and titular exorcist/exorcism up front and centre like the original film. Instead it builds on the other characters in the movie, leaving an exorcism that doesn't take long and isn't that interesting other than visually.The actors were all great, and as everyone by now knows, they brought back Ellen Burstyn to play Chris MacNeil. She was and wasn't a pointless addition, ultimately the story for her goes nowhere so in that case, pointless, but she's brought back in for a good reason and wants to help the parents exorcise their kids demons, fleshing out more what her character is now like years later after her own child was possessed.The direction and editing, spot on.Except they included some pointless scenes such as when one person dies, them being dragged to hell.It does also include stupidity, like a nurse trying to use defibrillators on someone already flatlined.Being a nurse, she should know that's not how they work.Either way, it was still a good start to a new trilogy. It's nowhere near as good as the first, the third and first season of the series but is much better than the second film or either of the prequels. I'd say it's on par with the second season of the series, good but not that good.Make up your own mind, don't listen to the naysayers nor the praisers. That's how I went in and thought yeah, not bad.",
    "141": "3 out of 5 stars.The Exorcist: Believer is a fair supernatural horror film that David Gordon Green decide to revive back by cancelling the several sequels and making this film a follow up to the original film like how he did with the Halloween films. The original is a masterpiece that provided the creepy and scare factor. The sequel however is entertaining. And a decent sequel that follows up to the original. Plus planning this as a start of a trilogy is questionable on were it can go.The plot is good. It focuses on two teen girls getting possessed which the parents will do whatever it takes to save them. While relying on there faith in good.The cast ensemble is good. Also bringing back an original actress from the first film was a bonus.The film is a slow burn thriller. It does take a while for a set up. It can be a little boring in the middle. And the film does lack the scares and creepiness. Horror fans may be a little disappointed.Overall, it is an okay film that tries to be promising. It lacks in areas which could have become a great horror film.",
    "142": "The Exorcist: Believer is set fifty years after the events of The Exorcist(1973). Two girls named Angela(Lidya Jewett) & Katherine(Olivia O'Neill), go missing in the woods. They come back home three days later but, they have no idea as to what happened to them. Angela's father Victor Fielding(Leslie Odom Jr), seeks the help of Chris MacNeil(Ellen Burstyn). Chris has forever changed after her daughter went through a horrifying experience, fifty years earlier.The Exorcist: Believer is a good movie. Director David Gordon Green has given us another worthy sequel to an iconic film, after Halloween(2018). However, Halloween(2018) is much better than this movie. The Exorcist: Believer is much better than Green's disastrous sequels to Halloween(2018), be it the disappointing Halloween Kills(2021) or the terrible Halloween Ends(2022). The film maintains its eerie atmosphere throughout. There are two or three well executed jump scares. The possession & exorcism scenes get quite repetitive, after a point. I'm not such a huge fan of The Exorcist(1973). I think it's overhyped & doesn't deserve its cult classic status. So for me, The Exorcist: Believer matches up to the 1973 original. The performances are the highlight of the movie. You really care about the characters & their fates, because of the actors' flawless portrayals. Leslie Odom Jr is spectacular as Victor Fielding. Lidya Jewett is outstanding as Angela. Olivia O'Neill is phenomenal as Katherine. Ann Dowd is superb as Ann. Jennifer Nettles is amazing as Miranda. Ellen Burstyn is fantastic as Chris MacNeil. The supporting cast is superb. The Exorcist: Believer is worth a watch for The Exorcist(1973) fans. Just watch it with low expectations & you just might find yourself genuinely spooked!",
    "143": "Ignores everything that made the original so unique and terrifying. Was'n needed either in my opinion. Makes 'The pope's exorcist' a true treasure that at the same time sets the baseline for movies dealing with a similar topic.Very predictable. During the final/showdown (if you can call it that), I wasn't even sure if the demon is still in charge/or present at all.Additionally 'dad' stole the show & it was difficult to focus on the girls, often other people were talking but the camera wasn't able to follow supporting characters.It wasn't scary or frightening at all.Finally, money makes it possible to lure even the ex-main protagonists in, maybe that explains the ridiculous budget.Not for me at all, straight to DVD or stream would have been a better choice (however it doesn't make the movie more watchable).Be careful what you wake from the past - especially if it's a masterpiece.",
    "144": "Watched this show yesterday evening at my local cinema. The movie is bad and greatly disappointing. It is nowhere even 1/5 of the standards of the original Exorcist 1973. The exorcism scene was badly done. An exorcism carried out by a motley crew and led by a woman who is not even an ordained nun. No exorcism should be carried out in the presence of such a big audience, even the victims parents was there. You will only have a qualified priest who is ably supported by a junior priest. The lady who led the exorcism has no aura, she is basically just chanting from the bible. The priest who withdrew from the start and later return looked more like a character from comedy film. The whole exorcism scene was a huge let down, saved only by a slight twist towards the end.Bringing in the characters of Chris and Reagan from 1973 show has no relevance to the plot in this current sequel. The director tried to make the link but it fails miserably.Very disappointing, as a sequel to the best horror of all time (Exorcist 1973 was the only horror movie till today that ever won a nomination for Best Picture at The Oscars), I seriously expected much more. I would have given it 2/10 but revised to rating of 3/10 because at least there was a twist to the end but it wasn't enough to save the movie. I'm horrified that this was to be part 1 of a planned trilogy.",
    "145": "When it was announced that David Gordon Green and company was going to do a sequel to The Exorcist I was kind of interested. They did a very good job with Halloween 2018 and I may be in the minority but I liked Halloween Kills. Halloween Ends was bad but overall Gordon Green did a good job with reviving Halloween. So the idea of The Exorcist reboot was kind of cool because it really isn't a successful franchise. The sequels have been awful except The Exorcist 3. So it would not take much fir this new film to be better than the previous sequels.To say that this new film is just another cynical cash grab. It is really only a \"sequel\" because of The Exorcist name and they brought back Ellen Burstyn as Chris MacNeil, the mother of Regan, the pissed girl from the first film. It's not a spoiler because the trailers featured her pretty prominently. Other than that The Exorcist: Believer is just another generic possession films that have been copying the original for 50 years. I do not expect this type of film to have an incredible amount of originality but the story and the execution is just generic.The story is about 2 girls that disappear fir a couple days and are found and it turns out that they are possessed. The problem is I didn't care at all due the characters. When the exorcism comes it is again been there seen that with a couple of variations on the trope are at times laughable. This film is so transparent in it's attempt to cash in on the reputation of the original film that it becomes annoying. The inclusion of a legacy character that has nothing to do with the actual story of the film proves it further.A completely cynical cash grab that doesn't even try to be scary, disturbing or much less interesting.Grade: F.",
    "146": "Making a film like The Exorcist is a quite enormous challenge and impossible to overcome due to the execution that that horror work had. Due to its success, they have tried to extend its story and replicate the success that the original classic had, but it was an impossible task to accomplish. That happened with the sequels and the prequel. Blumhouse decides to take on that challenge with this sequel directed by David Gordon Green and here he repeats the same formula that he used in his version of Halloween. In certain aspects, this installment replicates some elements of the original film, turning it into a fairly subtle homage. David decides to return again to the roots that started this franchise and offers a story that maintains certain characteristics of the original film. Using practical effects instead of digital effects was a success to make something much more in line with the original film. The possessed girls have Regan's characteristic air and manage to fit together in a successful way. The editing and some shots are reminiscent of the original film. Even so, this film still feels like the other installments, whether good or bad, were far from reaching the throne of the first film. Technically, William Friedkin had managed to create a film very well developed in technical details that have helped give it a terrifying and dramatic touch that has not aged in a long time and kept the identity of his film intact. These types of details could never be exactly replicated in any of the franchise's installments, although The Exorcist 3, Exorcist: The Beginning and this installment are the closest to the soul of The Exorcist. Furthermore, the terror of the first film is something unique to the franchise that, no matter how hard they tried, could not be replicated in the rest of the franchise. Believer may be considered a sequel, but at the moment it does not rule out the possibility that the events of the previous sequels have occurred. It is something very useful to take into account certain important elements that can be useful for this film. Believer possesses the crisis of faith that has been a very recurring theme in much of the franchise. The film also includes not only the exorcism rite of the Catholic religion, but also the ritual of ancient African customs that have already been seen in The Exorcist 2 and The Beginning. This adds up because it all started in Africa as the prequels and the second installment implied, but since the first film begins in Iraq, the question remains as to how the statue of Pazuzu ended up there. Another detail regarding demonic possession in this installment is that it offers another indication that Pazuzu has never worked alone as the protagonist entity of this film. The first film never revealed Pazuzu's name until the sequel, but one of the dialogues implied that he was not the only entity possessing Regan. The third film even corroborates that there were several evil spirits involved in the first film and all of them were under Pazuzu's control. In Believer it is not specified if it is Pazuzu who has returned, but the return of Chris and his first conversation with the possessed suggests that the evil entity that possesses them has been in the first film and that it could be one or perhaps some of the evil entities that were under Pazuzu's control when Regan was possessed and later possessed Father Karras. Previous sequels had tied up the loose ends that were Regan, the priests, and Lt. Kinderman involved in the first film. This sequel ties up another loose end that was not taken into account and that is Regan's mother, Chris. That was a good success to know that he was hers after the exorcism of her daughter. You could say that Believer is a sequel that serves to further expand The Exorcist universe and try to clarify what came after the first film just as the sequels did. The Exorcist: Believer in the end is a decent film that manages to be a tribute to the original film, but it only remains that without being able to be indifferent to the other installments that expanded a story that perhaps did not need to become a franchise. My final rating for this movie is an 8/10.",
    "147": "Have to say, given the reviews I was stealing myself to be disappointed by the new exorcist movie, expecting a so bad it's good experience. But it was actually pretty good. Not in same league as the original. And the chaotic multi denominational exorcism was, er, OK that happened. They also overdo the cgi in that scene.But, the two girls who got possessed were both pretty good. In fact the film could have done with an extra ten minutes to flesh them out a bit. Anne Dowd is always good, and it was great to have Ellen Burstyn in it. She's not in it for long, but she's very good.But Leslie Odom Jr really carries it as one of the girl's father. He's very believable the whole way through.Overall it was a pretty decent horror film. It'll probably make you feel uncomfortable, more than scared. It doesn't outstay it's welcome, and there are some nice nods to the original.It won't stay with you like the original. But nor will you come out, as per the Exorcist 2,thinking why did they make that?",
    "148": "TThe first Exorcist, made back in 1973, remains one of the best horror movies I have ever seen. I would still watch it anytime due to the exceptional work, from acting to direction to the story; it was beautifully executed.On the other hand, the second part leaned more towards the boring side. Now, the third part, which I had high expectations for, turned out to be a complete disaster compared to the original and the series.I anticipated more from the original cast reintroduced into the movie, but sadly, they had minimal impact. The casting was subpar, although Olivia O'Neill outperformed Lidya Jewett by a mile.The rest of the cast fell short. When bringing back the original cast, their impact should have been more pronounced than that of the new faces, who, unfortunately, seemed useless, much like the entire movie in the end.Despite the thrilling experience when the Exorcist theme started playing, the movie, unfortunately, turned out to be a disappointment.",
    "149": "Seriously this was a mess. Usually I have lots to say but there really isn't too much to say about this sorry immitative wannabe poltically correct farrago.The math of this portended problems. Two possessed girls. 3 religions. That is six somethings, and not good for clarity.Then there is almost 1:1 immitation of the first Exorcist's various cinematic \"tricks\". 50 years of technical progress and innovation and not a single scene of Believer equalled or bettered the original. The original always understated its points and there was a precise crescendo to its terrifying conclusion. This film has no such rhythm. One example is the subliminal image of the demon, this film used that but to hammer it home the director inserted brief images of the demon in magbe ten frames to make sure you got it.The film just wasn't scary. Honestly I don't think there was a single effective jump scare. The script is awful, just a waste of perfectly good actors who appear at times to adlib it.I won't spoil the ending but if this is the best Hollywood can do in terms of political correctness, we are in trouble."
}