[{"comment":"It was everything I hoped for. The combination of the Messenger and Christmas Story was flawless. Music was unbelievable"},{"comment":"Great movie and concert combined!"},{"comment":"I was crying! It was beautiful!!!"},{"comment":"Looked the movie and live the Chosen series."},{"comment":"All commercials and singing.  Very disappointed.  The series of The Chosen is completely different and so well done.  I do hope people who haven't seen the series don't base it off this movie that I paid for!"},{"comment":"Is not a Movie is a musical concert , with Clip they created 3 years ago :("},{"comment":"Dallas did a wonderful job linking the Shepherd and The Messengers together. Made a wonderful Christmas Story."},{"comment":"So good! I hadn't yet seen this and jumped at the opp to see in theatres, especially with extra music from Andrea Bocelli. It was a touching movie, thought-provoking, and holy smokes, that music. I loved it all."},{"comment":"Beautiful music and wonderful depiction of the story of the birth of Christ."},{"comment":"overall I loved it, although I did think the transition to the Mary Magdalene\/ Mother Mary scene was a little awkward, needed explanation for those with me that had not seen any of The Chosen...also I wished there had been more new music"},{"comment":"It was FABULOUS!!!!!  I loved every minute of it!!  I want to see it again!!!  Thank you Fandango, Tinseltown and whoever else helped this come to our theater!!!!"},{"comment":"Half the movie was singing artists!"},{"comment":"My family loved it. My adult kids liked the last song the most.  I enjoyed the Grateful song. Really there was maybe one song too many in the beginning IMO. The way the 2 films came together was brilliantly done."},{"comment":"It’s watching christian music videos for the first 30 minutes and people talking. Not sure if it ever got to a point as we left at that point."},{"comment":"Well with the time and money"},{"comment":"One of the most important films of our time. A must see for Christians and non Christians. Incredible historical Christian film mixed with great music. Don't miss it. 🥰😇"},{"comment":"Beautiful and amazing work of art."},{"comment":"Well worth the money to go see. The music is wonderful. The stories mesh together flawlessly. The monologues are insightful.  People must know"},{"comment":"Was an anything that I expected but more thank you"},{"comment":"The music was phenomenal and the story was heartwarming!! Loved every second!!!"},{"comment":"Wow! Amazing and historical. Kept me  glued to my seat"},{"comment":"Love love love!  Beautiful story, beautiful acting"},{"comment":"Just a celebration of songs accompanied by a wonderful story of Luke recapturing the birth of Jesus. Well done."},{"comment":"Wasnt expecting videos and narration but thought it was an amazing plus. Loved everything about the movie and the message of our Saviors birth."},{"comment":"Thus movie sucks it's just a bunch of songs, don't waste your money or time on it."},{"comment":"This is no plastic nativity tableau! Raw in its humanity and beautiful in its divine promise, this dramatization goes deep and yet uplifts. The music is well chosen (no pun intended) to punctuate the message. There is nothing like it!!"},{"comment":"I can’t even believe this was approved as a movie, ive honestly never seen such a poorly made movie. If I wanted to go to a concert, I would’ve. do NOT waste your money on this it SUCKS!!"},{"comment":"Loved the acting, cinematography, and the story telling. The music\/songs were a beautiful addition to the movie."},{"comment":"It was beautifully & lovingly made. So moving. I was crying from how sweet and emotive it was. Perfect reminder of what Christmas is all about! And, the Christmas was beautifully sung and perfectly placed. I was singing\/humming and tapping my feet :)"},{"comment":"LITERALLY was full of songs, the only actual “movie” part was like not even 30 minutes long dont waste your precious money on this."},{"comment":"Awesome movie and fantastic variety of music!\nMakes the birth of Jesus become a reality!"},{"comment":"Beautiful for Christmas"},{"comment":"I loved the music intro and the movie, so-so.  One comment I have is that the 3 wisemen were not nice people, unkind to Simon, and no star of Bethlehem was ever shown.  It  was off as far as Scripture goes.  For those reasons of mis-information and accuracy, it only deserves a 3-star from me.  We want to be very careful in this time of world turmoil that we do not falsify the true scripture."},{"comment":"Not even a movie. Commercials and music numbers. DO NOT waste your money."},{"comment":"Story line was great music was very good with Botecelli in it. Some of the songs were more contemporary than spiritual for me but I love the carols"},{"comment":"I was afraid at first that I paid for a concert and lecture.  It was very thought provoking though.  But when they finally got into the nativity story and the shepherds and the conversation between the two Marys, my heart was moved and Christmas found its way into my heart.  And then ended it in more music and the lecture on the Dead Sea was perfect.  Highly recommend this movie."},{"comment":"This movie was beautifully done. The acting is phenomenal, as expected from The Chosen."},{"comment":"Absolutely beautiful. It really helps get you in the Christmas spirit. Totally worth watching."},{"comment":"Bring your tissues and open your heart"},{"comment":"Best way to get in the Christmas spirit!! Love how both episodes from The Chosen app were melded into one!"},{"comment":"absolutely wonderful! love that they reference the scripture that they pulled it out of. heartbreaking reminder of what's to come in season 6 (crucifixion). the monologues were fresh and very relative"},{"comment":"Beautiful Christmas Movie.  Brought my 8 yr. old granddaughter.  We especially liked the segment with the shepherds.   And the moment with Mother Mary and Mary Magdalene.  So nice to watch a movie that didn't contain sex and\/or cursing."},{"comment":"About JESUS!  Great meshing two special episodes into one cohesive movie.  Beautiful music especially the finale Joy to the World!  Great monologues especially the one at the end of the movie about the dead sea!  Wonderful actors!  Something for myself and my friend individually and collectively!"},{"comment":"Excellent presentation of the birth of Jesus, well done."},{"comment":"bad, bad, bad... to much randomness, to much random music in the begining, to much random people talking in the begining... just all around bad.  Bad acting, especially the Mary Magdeline.  Bad acents by the actors, and actresses.  Bad."},{"comment":"Great movie!  Tells the story of the birth of Jesus very well and very heartfelt.  I love all The Chosen shows."}]